{"conference": "iclr", "VERSION": "v1", "DATE_OF_SUBMISSION": "19-Dec-2014", "title": "Embedding Word Similarity with Neural Machine Translation", "abstract": "Neural language models learn word representations, or embeddings, that capture rich linguistic and conceptual information. Here we investigate the embeddings learned by neural machine translation models, a recently-developed class of neural language model. We show that embeddings from translation models outperform those learned by monolingual models at tasks that require knowledge of both conceptual similarity and lexical-syntactic role. We further show that these effects hold when translating from both English to French and English to German, and argue that the desirable properties of translation embeddings should emerge largely independently of the source and target languages. Finally, we apply a new method for training neural translation models with very large vocabularies, and show that this vocabulary expansion algorithm results in minimal degradation of embedding quality. Our embedding spaces can be queried in an online demo and downloaded from our web page. Overall, our analyses indicate that translation-based embeddings should be used in applications that require concepts to be organised according to similarity and/or lexical function, while monolingual embeddings are better suited to modelling (nonspecific) inter-word relatedness.", "histories": [["v1", "Fri, 19 Dec 2014 17:22:03 GMT  (184kb,D)", "https://arxiv.org/abs/1412.6448v1", "arXiv admin note: text overlap witharXiv:1410.0718"], ["v2", "Fri, 27 Feb 2015 16:55:46 GMT  (56kb,D)", "http://arxiv.org/abs/1412.6448v2", "arXiv admin note: text overlap witharXiv:1410.0718"], ["v3", "Tue, 31 Mar 2015 18:30:44 GMT  (51kb,D)", "http://arxiv.org/abs/1412.6448v3", "arXiv admin note: text overlap witharXiv:1410.0718"], ["v4", "Fri, 3 Apr 2015 18:11:54 GMT  (210kb,D)", "http://arxiv.org/abs/1412.6448v4", "arXiv admin note: text overlap witharXiv:1410.0718"]], "COMMENTS": "arXiv admin note: text overlap witharXiv:1410.0718", "reviews": [], "SUBJECTS": "cs.CL", "authors": ["felix hill", "kyunghyun cho", "sebastien jean", "coline devin", "yoshua bengio"], "accepted": true, "id": "1412.6448"}
