{"conference": "iclr", "VERSION": "v1", "DATE_OF_SUBMISSION": "22-Dec-2014", "title": "Learning linearly separable features for speech recognition using convolutional neural networks", "abstract": "Automatic speech recognition systems usually rely on spectral-based features, such as MFCC of PLP. These features are extracted based on prior knowledge such as, speech perception or/and speech production. Recently, convolutional neural networks have been shown to be able to estimate phoneme conditional probabilities in a completely data-driven manner, i.e. using directly temporal raw speech signal as input. This system was shown to yield similar or better performance than HMM/ANN based system on phoneme recognition task and on large scale continuous speech recognition task, using less parameters. Motivated by these studies, we investigate the use of simple linear classifier in the CNN-based framework. Thus, the network learns linearly separable features from raw speech. We show that such system yields similar or better performance than MLP based system using cepstral-based features as input.", "histories": [["v1", "Mon, 22 Dec 2014 19:46:01 GMT  (215kb,D)", "http://arxiv.org/abs/1412.7110v1", "submitted for ICLR 2015 conference track"], ["v2", "Wed, 24 Dec 2014 13:46:10 GMT  (216kb,D)", "http://arxiv.org/abs/1412.7110v2", "Add references and correct typos. Submitted for ICLR 2015 conference track"], ["v3", "Fri, 23 Jan 2015 10:44:21 GMT  (217kb,D)", "http://arxiv.org/abs/1412.7110v3", "Revised Section 4.5. Add references and correct typos. Submitted for ICLR 2015 conference track"], ["v4", "Thu, 26 Feb 2015 19:51:35 GMT  (217kb,D)", "http://arxiv.org/abs/1412.7110v4", "Revisions according to reviews. Revised Section 4.5. Add references and correct typos. Submitted for ICLR 2015 conference track"], ["v5", "Fri, 27 Feb 2015 16:31:32 GMT  (218kb,D)", "http://arxiv.org/abs/1412.7110v5", "Revisions according to reviews. Revised Section 4.5. Add references and correct typos. Submitted for ICLR 2015 conference track"], ["v6", "Thu, 16 Apr 2015 08:29:14 GMT  (206kb,D)", "http://arxiv.org/abs/1412.7110v6", "Final version for ICLR 2015 Workshop; Revisions according to reviews. Revised Section 4.5. Add references and correct typos. Submitted for ICLR 2015 conference track"]], "COMMENTS": "submitted for ICLR 2015 conference track", "reviews": [], "SUBJECTS": "cs.LG cs.CL cs.NE", "authors": ["dimitri palaz", "mathew magimai doss", "ronan collobert"], "accepted": true, "id": "1412.7110"}
