{"conference": "ACL", "VERSION": "v1", "DATE_OF_SUBMISSION": "24-Apr-2015", "title": "Compositional Vector Space Models for Knowledge Base Completion", "abstract": "Knowledge base (KB) completion adds new facts to a KB by making inferences from existing facts, for example by inferring with high likelihood nationality(X,Y) from bornIn(X,Y). Most previous methods infer simple one-hop relational synonyms like this, or use as evidence a multi-hop relational path treated as an atomic feature, like bornIn(X,Z) -&gt; containedIn(Z,Y). This paper presents an approach that reasons about conjunctions of multi-hop relations non-atomically, composing the implications of a path using a recursive neural network (RNN) that takes as inputs vector embeddings of the binary relation in the path. Not only does this allow us to generalize to paths unseen at training time, but also, with a single high-capacity RNN, to predict new relation types not seen when the compositional model was trained (zero-shot learning). We assemble a new dataset of over 52M relational triples, and show that our method improves over a traditional classifier by 11%, and a method leveraging pre-trained embeddings by 7%.", "histories": [["v1", "Fri, 24 Apr 2015 23:06:10 GMT  (68kb,D)", "https://arxiv.org/abs/1504.06662v1", "The 53rd Annual Meeting of the Association for Computational Linguistics and The 7th International Joint Conference of the Asian Federation of Natural Language Processing, 2015"], ["v2", "Wed, 27 May 2015 21:23:45 GMT  (68kb,D)", "http://arxiv.org/abs/1504.06662v2", "The 53rd Annual Meeting of the Association for Computational Linguistics and The 7th International Joint Conference of the Asian Federation of Natural Language Processing, 2015"]], "COMMENTS": "The 53rd Annual Meeting of the Association for Computational Linguistics and The 7th International Joint Conference of the Asian Federation of Natural Language Processing, 2015", "reviews": [], "SUBJECTS": "cs.CL stat.ML", "authors": ["arvind neelakantan", "benjamin roth", "andrew mccallum"], "accepted": true, "id": "1504.06662"}
