{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "16-Aug-2015", "title": "Visual Affect Around the World: A Large-scale Multilingual Visual Sentiment Ontology", "abstract": "Every culture and language is unique. Our work expressly focuses on the uniqueness of culture and language in relation to human affect, specifically sentiment and emotion semantics, and how they manifest in social multimedia. We develop sets of sentiment- and emotion-polarized visual concepts by adapting semantic structures called adjective-noun pairs, originally introduced by Borth et al. (2013), but in a multilingual context. We propose a new language-dependent method for automatic discovery of these adjective-noun constructs. We show how this pipeline can be applied on a social multimedia platform for the creation of a large-scale multilingual visual sentiment concept ontology (MVSO). Unlike the flat structure in Borth et al. (2013), our unified ontology is organized hierarchically by multilingual clusters of visually detectable nouns and subclusters of emotionally biased versions of these nouns. In addition, we present an image-based prediction task to show how generalizable language-specific models are in a multilingual context. A new, publicly available dataset of &gt;15.6K sentiment-biased visual concepts across 12 languages with language-specific detector banks, &gt;7.36M images and their metadata is also released.", "histories": [["v1", "Sun, 16 Aug 2015 21:43:59 GMT  (8952kb,D)", "http://arxiv.org/abs/1508.03868v1", "11 pages, to appear at ACM MM'15"], ["v2", "Sat, 22 Aug 2015 16:33:13 GMT  (8952kb,D)", "http://arxiv.org/abs/1508.03868v2", "11 pages, to appear at ACM MM'15"], ["v3", "Wed, 7 Oct 2015 19:07:14 GMT  (8952kb,D)", "http://arxiv.org/abs/1508.03868v3", "11 pages, to appear at ACM MM'15"]], "COMMENTS": "11 pages, to appear at ACM MM'15", "reviews": [], "SUBJECTS": "cs.MM cs.CL cs.CV cs.IR", "authors": ["brendan jou", "tao chen", "nikolaos pappas", "miriam redi", "mercan topkara", "shih-fu chang"], "accepted": false, "id": "1508.03868"}
