{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "6-Dec-2015", "title": "SentiBench - a benchmark comparison of state-of-the-practice sentiment analysis methods", "abstract": "In the last few years thousands of scientific papers have explored sentiment analysis, several startups that measures opinions on real data have emerged, and a number of innovative products related to this theme have been developed. There are multiple methods for measuring sentiments, including lexical-based approaches and supervised machine learning methods. Despite the vast interest on the theme and wide popularity of some methods, it is unclear which method is better for identifying the polarity (i.e., positive or negative) of a message. Thus, there is a strong need to conduct a thorough apple-to-apple comparison of sentiment analysis methods, as they are used in practice, across multiple datasets originated from different data sources. Such a comparison is key for understanding the potential limitations, advantages, and disadvantages of popular methods. This study aims at filling this gap by presenting a benchmark comparison of twenty one popular sentiment analysis methods (which we call the state-of-the-practice methods). Our evaluation is based on a benchmark of twenty labeled datasets, covering messages posted on social networks, movie and product reviews, as well as opinions and comments in news articles. Our results highlight the extent to which the prediction performance of these methods varies widely across datasets. Aiming at boosting the development of this research area, we open the methods' codes and datasets used in this paper and we deploy a benchmark system, which provides an open API for accessing and comparing sentence-level sentiment analysis methods.", "histories": [["v1", "Sun, 6 Dec 2015 18:52:51 GMT  (233kb,D)", "http://arxiv.org/abs/1512.01818v1", null], ["v2", "Wed, 16 Dec 2015 00:32:23 GMT  (279kb,D)", "http://arxiv.org/abs/1512.01818v2", null], ["v3", "Mon, 1 Feb 2016 18:54:51 GMT  (171kb)", "http://arxiv.org/abs/1512.01818v3", null], ["v4", "Sat, 4 Jun 2016 16:52:29 GMT  (185kb)", "http://arxiv.org/abs/1512.01818v4", null], ["v5", "Thu, 14 Jul 2016 22:51:39 GMT  (181kb,D)", "http://arxiv.org/abs/1512.01818v5", null]], "reviews": [], "SUBJECTS": "cs.CL cs.SI", "authors": ["filipe nunes ribeiro", "matheus ara\\'ujo", "pollyanna gon\\c{c}alves", "fabr\\'icio benevenuto", "marcos", "r\\'e gon\\c{c}alves"], "accepted": false, "id": "1512.01818"}
