{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "26-Jan-2016", "title": "Sentiment Analysis of Twitter Data: A Survey of Techniques", "abstract": "With the advancement of web technology and its growth, there is a huge volume of data present in the web for internet users and a lot of data is generated too. Internet has become a platform for online learning, exchanging ideas and sharing opinions. Social networking sites like Twitter, Facebook, Google+ are rapidly gaining popularity as they allow people to share and express their views about topics,have discussion with different communities, or post messages across the world. There has been lot of work in the field of sentiment analysis of twitter data. This survey focuses mainly on sentiment analysis of twitter data which is helpful to analyze the information in the tweets where opinions are highly unstructured, heterogeneous and are either positive or negative, or neutral in some cases. In this paper, we provide a survey and a comparative analyses of existing techniques for opinion mining like machine learning and lexicon-based approaches, together with evaluation metrics. Using various machine learning algorithms like Naive Bayes, Max Entropy, and Support Vector Machine, we provide a research on twitter data streams. We have also discussed general challenges and applications of Sentiment Analysis on Twitter", "histories": [["v1", "Tue, 26 Jan 2016 10:44:30 GMT  (363kb)", "http://arxiv.org/abs/1601.06971v1", "7 figures, 10 tables"], ["v2", "Tue, 16 Feb 2016 04:53:56 GMT  (0kb,I)", "http://arxiv.org/abs/1601.06971v2", "This paper has been withdrawn by the author due to a crucial changes in results section. It had some inconsistency in results. It requires major changes and revisions in methods discussed. There are some major errors in effects of methods discussed"], ["v3", "Fri, 22 Apr 2016 09:43:11 GMT  (701kb)", "http://arxiv.org/abs/1601.06971v3", "7 figures, 10 tables"]], "COMMENTS": "7 figures, 10 tables", "reviews": [], "SUBJECTS": "cs.CL", "authors": ["vishal a kharde", "prof sheetal sonawane"], "accepted": false, "id": "1601.06971"}
