{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "22-Feb-2016", "title": "Improving Trajectory Modelling for DNN-based Speech Synthesis by using Stacked Bottleneck Features and Minimum Generation Error Training", "abstract": "We propose two novel techniques --- stacking bottleneck features and minimum trajectory error training criterion --- to improve the performance of deep neural network (DNN)-based speech synthesis. The techniques address the related issues of frame-by-frame independence and ignorance of the relationship between static and dynamic features, within current typical DNN-based synthesis frameworks. Stacking bottleneck features, which are an acoustically--informed linguistic representation, provides an efficient way to include more detailed linguistic context at the input. The proposed minimum trajectory error training criterion minimises overall output trajectory error across an utterance, rather than minimising the error per frame independently, and thus takes into account the interaction between static and dynamic features. The two techniques can be easily combined to further improve performance. We present both objective and subjective results that demonstrate the effectiveness of the proposed techniques. The subjective results show that combining the two techniques leads to significantly more natural synthetic speech than from conventional DNN or long short-term memory (LSTM) recurrent neural network (RNN) systems.", "histories": [["v1", "Mon, 22 Feb 2016 11:11:04 GMT  (192kb,D)", "https://arxiv.org/abs/1602.06727v1", "submitted to IEEE/ACM Transactions on Audio, Speech and Language Processing 2016 (Under second round review)"], ["v2", "Mon, 4 Apr 2016 11:18:07 GMT  (199kb,D)", "http://arxiv.org/abs/1602.06727v2", "submitted to IEEE/ACM Transactions on Audio, Speech and Language Processing 2016 (AQ)"], ["v3", "Tue, 5 Apr 2016 11:31:02 GMT  (199kb,D)", "http://arxiv.org/abs/1602.06727v3", "submitted to IEEE/ACM Transactions on Audio, Speech and Language Processing 2016 (AQ)"]], "COMMENTS": "submitted to IEEE/ACM Transactions on Audio, Speech and Language Processing 2016 (Under second round review)", "reviews": [], "SUBJECTS": "cs.SD cs.CL cs.NE", "authors": ["zhizheng wu", "simon king"], "accepted": false, "id": "1602.06727"}
