{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "26-Mar-2016", "title": "Measuring Book Impact Based on the Multi-granularity Online Review Mining", "abstract": "As with articles and journals, the customary methods for measuring books' academic impact mainly involve citations, which is easy but limited to interrogating traditional citation databases and scholarly book reviews, Researchers have attempted to use other metrics, such as Google Books, libcitation, and publisher prestige. However, these approaches lack content-level information and cannot determine the citation intentions of users. Meanwhile, the abundant online review resources concerning academic books can be used to mine deeper information and content utilizing altmetric perspectives. In this study, we measure the impacts of academic books by multi-granularity mining online reviews, and we identify factors that affect a book's impact. First, online reviews of a sample of academic books on Amazon.cn are crawled and processed. Then, multi-granularity review mining is conducted to identify review sentiment polarities and aspects' sentiment values. Lastly, the numbers of positive reviews and negative reviews, aspect sentiment values, star values, and information regarding helpfulness are integrated via the entropy method, and lead to the calculation of the final book impact scores. The results of a correlation analysis of book impact scores obtained via our method versus traditional book citations show that, although there are substantial differences between subject areas, online book reviews tend to reflect the academic impact. Thus, we infer that online reviews represent a promising source for mining book impact within the altmetric perspective and at the multi-granularity content level. Moreover, our proposed method might also be a means by which to measure other books besides academic publications.", "histories": [["v1", "Sat, 26 Mar 2016 09:25:16 GMT  (763kb)", "http://arxiv.org/abs/1603.08091v1", "21pages,3 figures, 12 tables"]], "COMMENTS": "21pages,3 figures, 12 tables", "reviews": [], "SUBJECTS": "cs.DL cs.CL", "authors": ["qingqing zhou", "chengzhi zhang", "star x zhao", "bikun chen"], "accepted": false, "id": "1603.08091"}
