{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "8-Mar-2016", "title": "Observing Trends in Automated Multilingual Media Analysis", "abstract": "Any large organisation, be it public or private, monitors the media for information to keep abreast of developments in their field of interest, and usually also to become aware of positive or negative opinions expressed towards them. At least for the written media, computer programs have become very efficient at helping the human analysts significantly in their monitoring task by gathering media reports, analysing them, detecting trends and - in some cases - even to issue early warnings or to make predictions of likely future developments. We present here trend recognition-related functionality of the Europe Media Monitor (EMM) system, which was developed by the European Commission's Joint Research Centre (JRC) for public administrations in the European Union (EU) and beyond. EMM performs large-scale media analysis in up to seventy languages and recognises various types of trends, some of them combining information from news articles written in different languages and from social media posts. EMM also lets users explore the huge amount of multilingual media data through interactive maps and graphs, allowing them to examine the data from various view points and according to multiple criteria. A lot of EMM's functionality is accessibly freely over the internet or via apps for hand-held devices.", "histories": [["v1", "Tue, 8 Mar 2016 17:43:48 GMT  (3059kb)", "http://arxiv.org/abs/1603.02604v1", "Proceedings of the Symposium on New Frontiers of Automated Content Analysis in the Social Sciences (ACA'2015), Z\\\"urich, Switzerland, 1-3 July 2015 (20 pages)"]], "COMMENTS": "Proceedings of the Symposium on New Frontiers of Automated Content Analysis in the Social Sciences (ACA'2015), Z\\\"urich, Switzerland, 1-3 July 2015 (20 pages)", "reviews": [], "SUBJECTS": "cs.CL", "authors": ["ralf steinberger", "aldo podavini", "alexandra balahur", "guillaume jacquet", "hristo tanev", "jens linge", "martin atkinson", "michele chinosi", "vanni zavarella", "yaniv steiner", "erik van der goot"], "accepted": false, "id": "1603.02604"}
