{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "24-Jun-2016", "title": "A Game-Theoretic Approach to Word Sense Disambiguation", "abstract": "This paper presents a new model for word sense disambiguation formulated in terms of evolutionary game theory, where each word to be disambiguated is represented as a node on a graph whose edges represent word relations and senses are represented as classes. The words simultaneously update their class membership preferences according to the senses that neighboring words are likely to choose. We use distributional information to weigh the influence that each word has on the decisions of the others and semantic similarity information to measure the strength of compatibility among the choices. With this information we can formulate the word sense disambiguation problem as a constraint satisfaction problem and solve it using tools derived from game theory, maintaining the textual coherence. The model is based on two ideas: similar words should be assigned to similar classes and the meaning of a word does not depend on all the words in a text but just on some of them. The paper provides an in-depth motivation of the idea of modeling the word sense disambiguation problem in terms of game theory, which is illustrated by an example. The conclusion presents an extensive analysis on the combination of similarity measures to use in the framework and a comparison with state-of-the-art systems. The results show that our model outperforms state-of-the-art algorithms and can be applied to different tasks and in different scenarios.", "histories": [["v1", "Fri, 24 Jun 2016 14:45:27 GMT  (1336kb,D)", "http://arxiv.org/abs/1606.07711v1", null], ["v2", "Tue, 28 Jun 2016 05:31:31 GMT  (1336kb,D)", "http://arxiv.org/abs/1606.07711v2", "To be published in Computational Linguistics either the 42-4 issue (December 2016) or the 43-1 issue (March 2017)"], ["v3", "Fri, 1 Jul 2016 12:19:13 GMT  (2756kb,D)", "http://arxiv.org/abs/1606.07711v3", "To be published in Computational Linguistics"], ["v4", "Mon, 4 Jul 2016 13:19:29 GMT  (1756kb,D)", "http://arxiv.org/abs/1606.07711v4", "To be published in Computational Linguistics"]], "reviews": [], "SUBJECTS": "cs.AI cs.CL cs.GT", "authors": ["rocco tripodi", "marcello pelillo"], "accepted": false, "id": "1606.07711"}
