{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "31-May-2016", "title": "Implementing a Reverse Dictionary, based on word definitions, using a Node-Graph Architecture", "abstract": "In this paper, we outline an approach to build graph based reverse dictionaries using word definitions. A reverse dictionary takes a phrase as an input and outputs a list of words semantically similar to that phrase, and is a solution to the Tip of the Tongue problem. We use a distance based similarity measure, computed on the graph, to assess the similarity between a word and the input phrase. We compare the performance of our approach with the Onelook Reverse Dictionary and a distributional semantics method based on word2vec, and show that our approach is much better than the distributional semantics method, and as good as Onelook's.", "histories": [["v1", "Tue, 31 May 2016 20:09:59 GMT  (277kb,D)", "https://arxiv.org/abs/1606.00025v1", "9 pages, 4 figures, 4 tables, submitted towards *SEM and EMNLP"], ["v2", "Fri, 15 Jul 2016 22:57:17 GMT  (562kb,D)", "http://arxiv.org/abs/1606.00025v2", "Added a new section titled 'Recommendations'. Polished multiple arguments. 10 pages, 4 figures, 4 tables, submitted at EMNLP and COLING"], ["v3", "Tue, 19 Jul 2016 08:55:35 GMT  (562kb,D)", "http://arxiv.org/abs/1606.00025v3", "Added a new section titled 'Recommendations'. Polished multiple arguments. 10 pages, 4 figures, 4 tables, submitted at EMNLP and COLING. Correction of abstract"], ["v4", "Mon, 26 Sep 2016 13:48:31 GMT  (294kb,D)", "http://arxiv.org/abs/1606.00025v4", "Accepted for publication at COLING, 2016. Minor changes. 10 pages, 4 figures, 4 tables"], ["v5", "Sat, 17 Dec 2016 22:36:15 GMT  (294kb,D)", "http://arxiv.org/abs/1606.00025v5", "Included publication information"]], "COMMENTS": "9 pages, 4 figures, 4 tables, submitted towards *SEM and EMNLP", "reviews": [], "SUBJECTS": "cs.CL", "authors": ["sushrut thorat", "varad choudhari"], "accepted": false, "id": "1606.00025"}
