{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "22-Feb-2017", "title": "Triaging Content Severity in Online Mental Health Forums", "abstract": "Mental health forums are online communities where people express their issues and seek help from moderators and other users. In such forums, there are often posts with severe content indicating that the user is in acute distress and there is a risk of attempted self-harm. Moderators need to respond to these severe posts in a timely manner to prevent potential self-harm. However, the large volume of daily posted content makes it difficult for the moderators to locate and respond to these critical posts. We present a framework for triaging user content into four severity categories which are defined based on indications of self-harm ideation. Our models are based on a feature-rich classification framework which includes lexical, psycholinguistic, contextual and topic modeling features. Our approaches improve the state of the art in triaging the content severity in mental health forums by large margins (up to 17% improvement over the F-1 scores). Using the proposed model, we analyze the mental state of users and we show that overall, long-term users of the forum demonstrate a decreased severity of risk over time. Our analysis on the interaction of the moderators with the users further indicates that without an automatic way to identify critical content, it is indeed challenging for the moderators to provide timely response to the users in need.", "histories": [["v1", "Wed, 22 Feb 2017 16:14:12 GMT  (84kb,D)", "http://arxiv.org/abs/1702.06875v1", "Accepted for publication in Journal of the Association for Information Science and Technology (2017)"]], "COMMENTS": "Accepted for publication in Journal of the Association for Information Science and Technology (2017)", "reviews": [], "SUBJECTS": "cs.CL cs.IR cs.SI", "authors": ["arman cohan", "sydney young", "rew yates", "nazli goharian"], "accepted": false, "id": "1702.06875"}
