{"conference": "EMNLP", "VERSION": "v1", "DATE_OF_SUBMISSION": "7-Feb-2017", "title": "Fast and Accurate Entity Recognition with Iterated Dilated Convolutions", "abstract": "Bi-directional LSTMs have emerged as a standard method for obtaining per-token vector representations serving as input to various token labeling tasks (whether followed by Viterbi prediction or independent classification). This paper proposes an alternative to Bi-LSTMs for this purpose: iterated dilated convolutional neural networks (ID-CNNs), which have better capacity than traditional CNNs for large context and structured prediction. We describe a distinct combination of network structure, parameter sharing and training procedures that is not only more accurate than Bi-LSTM-CRFs, but also 8x faster at test time on long sequences. Moreover, ID-CNNs with independent classification enable a dramatic 14x test-time speedup, while still attaining accuracy comparable to the Bi-LSTM-CRF. We further demonstrate the ability of ID-CNNs to combine evidence over long sequences by demonstrating their improved accuracy on whole-document (rather than per-sentence) inference. Unlike LSTMs whose sequential processing on sentences of length N requires O(N) time even in the face of parallelism, IDCNNs permit fixed-depth convolutions to run in parallel across entire documents. Today when many companies run basic NLP on the entire web and large-volume traffic, faster methods are paramount to saving time and energy costs.", "histories": [["v1", "Tue, 7 Feb 2017 16:58:18 GMT  (48kb,D)", "http://arxiv.org/abs/1702.02098v1", null], ["v2", "Wed, 8 Feb 2017 14:21:59 GMT  (48kb,D)", "http://arxiv.org/abs/1702.02098v2", null], ["v3", "Sat, 22 Jul 2017 04:04:30 GMT  (53kb,D)", "http://arxiv.org/abs/1702.02098v3", "In Conference on Empirical Methods in Natural Language Processing (EMNLP). Copenhagen, Denmark. September 2017"]], "reviews": [], "SUBJECTS": "cs.CL", "authors": ["emma strubell", "patrick verga", "david belanger", "andrew mccallum"], "accepted": true, "id": "1702.02098"}
