{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "11-Apr-2017", "title": "What we really want to find by Sentiment Analysis: The Relationship between Computational Models and Psychological State", "abstract": "As the first step to model emotional state of a person, we build sentiment analysis models with existing deep neural network algorithms and compare the models with psychological measurements to enlighten the relationship. In the experiments, we first examined psychological state of 64 participants and asked them to summarize the story of a book, Chronicle of a Death Foretold (Marquez, 1981). Secondly, we trained models using crawled 365,802 movie review data; then we evaluated participants' summaries using the pretrained model as a concept of transfer learning. With the background that emotion affects on memories, we investigated the relationship between the evaluation score of the summaries from computational models and the examined psychological measurements. The result shows that although CNN performed the best among other deep neural network algorithms (LSTM, GRU), its results are not related to the psychological state. Rather, GRU shows more explainable results depending on the psychological state. The contribution of this paper can be summarized as follows: (1) we enlighten the relationship between computational models and psychological measurements. (2) we suggest this framework as objective methods to evaluate the emotion; the real sentiment analysis of a person.", "histories": [["v1", "Tue, 11 Apr 2017 16:42:55 GMT  (570kb)", "http://arxiv.org/abs/1704.03407v1", "Rejected Paper in CogSci2017. I'm sure there is no place for integrated research. arXiv admin note: text overlap witharXiv:1607.03707"]], "COMMENTS": "Rejected Paper in CogSci2017. I'm sure there is no place for integrated research. arXiv admin note: text overlap witharXiv:1607.03707", "reviews": [], "SUBJECTS": "cs.CL cs.IR", "authors": ["hwiyeol jo", "soo-min kim", "jeong ryu"], "accepted": false, "id": "1704.03407"}
