{
  "name" : "1011.5188.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "La réduction de termes complexes dans les langues de spécialité",
    "authors" : [ "Yannis Haralambous", "Elisa Lavagnino" ],
    "emails" : [ "prnom.nom@telecom-bretagne.eu", "@ATALA." ],
    "sections" : [ {
      "heading" : null,
      "text" : "MOTS-CLÉS : Terminologie, langues de spécialité, extraction automatique de termes, termes complexes, réduction anaphorique, réduction lexicale.\nKEYWORDS: Terminology, specialty languages, automatic term extraction, multi-word lexical units, anaphoric reduction, lexical reduction.\nCet article a été publié dans la revue Traitement Automatique des Langues, Volume 52/1, 2011, @ATALA. La publication originale est disponible sur le site http://www.atala.org.\nar X\niv :1\n01 1."
    }, {
      "heading" : "1. Introduction",
      "text" : "En terminologie, nombreuses ont été les études portant sur les termes complexes [COL 00, JAC 03, POR 91], leurs variantes réduites [FRE 02, JAC 03, MØL 98], les textes et le discours spécialisés et le mécanisme de la réduction dans les langues de spécialité [JAC 96, LAV 11].\nPour justifier l’importance d’étudier le comportement des unités complexes dans le cadre des langues de spécialité, il suffit de dire qu’elles composent 80% des éléments constituant les textes de spécialité [JAC 03, p. 48]. Il est donc clair que leur rôle mérite d’être analysé et étudié dans tous ses aspects.\nNotre contribution s’inscrit dans le cadre théorique de la terminologie textuelle et computationnelle [BOU 99, CON 05a] appliquée aux discours spécialisés. Dans notre cas, le fait d’aborder les problèmes de la variation des termes complexes en terminologie, c’est prendre en compte au moins trois types de faits, à savoir :\n– les caractéristiques de la structure interne d’un terme complexe [POR 96, COL 00], son évolution [MØL 98] et les effets que cette évolution peut avoir sur la langue de spécialité [JAC 96] ;\n– les caractéristiques des environnements textuels étudiés [DES 06, ALE 05] l’usage et le comportement des termes dans le discours [JAC 00] et les effets sur la communication, les usagers et la langue de spécialité [LER 09, VEC 08] ;\n– le traitement automatique des terminologies [DAI 98] et la terminologie computationnelle [SAV 03].\nLa nature du terme et surtout son rôle dans le discours sont d’une importance fondamentale dans notre recherche. Ce n’est que récemment que l’intérêt pour la variation des termes a été l’objet de débats et d’analyses [SOG 02]. La fonction des termes n’est plus uniquement celle de dénommer une entité dans un système conceptuel figé ; l’évolution continue de la science et des techniques demande un renouvellement constant des terminologies et leur adaptation aux nécessités des usagers et des situations communicatives."
    }, {
      "heading" : "2. Autour de la définition du terme complexe",
      "text" : "Le terme complexe est une unité monoréférentielle (critère de monoréférentialité) qui appartient à une langue de spécialité (critère terminologique), et qui représente une notion univoque (critère notionnel) [COL 00]. La structure d’un terme complexe est binaire par définition (critère de binarité : tête/expansion, déterminant/déterminé, hyper-/hyponyme, cf. ci-dessous).\nParmi les critères structuraux définissant les termes complexes, la binarité occupe sans doute une place fondamentale puisque tous les termes complexes ont une struc-\nIl cambiamento climatico e il degrado ambientale sono suscettibili di provocare l’aumento della migrazione dall’Africa sub-sahariana, con effetti potenzialmente devastanti per le centinaia di milioni di persone, soprattutto povere, che lì vivono. [...] Oggi, il degrado è un problema serio per 32 Paesi dell’Africa, e oltre trecento milioni di persone che già affrontano la scarsità d’acqua. [...] Inoltre, in Senegal, le migrazioni interne e internazionali sono state provocate dai cambiamenti ambientali che hanno ridotto le opportunità di lavoro nell’agricoltura, la quale è diminuita con l’aumentare del degrado ambientale. [...] (http: //www.ecologiae.com/riscaldamento-globale-rifugiati-climatici-aumentare/14240/)\nI terreni vitati destinati alla produzione dei vini a Denominazione di Origine Controllata (D.O.C.) devono essere iscritti — su denuncia dei conduttori interessati tramite il Comune territorialmente competente che opera la verifica attraverso l’Ispettorato Provinciale dell’Agricoltura — in apposito Albo pubblico istituito presso ogni Camera di Commercio. [...] L’iscrizione all’Albo serve per poter effettuare la « denuncia delle uve » — da parte dei conduttori di terreni già iscritti - destinate alla produzione di vino a Denominazione di Origine Controllata, al Comune competente per territorio. Ciò al fine di commercializzare il prodotto con la rispettiva denominazione. [...] (http://www.cameradicommercio.ag.it/index.php?option=com_ content&task=view&id=47&Itemid=110)\nLa denominazione di origine controllata « Soave » e « Soave classico » è riservata ai vini « Soave » (anche con la specificazione della sottozona Colli Scaligeri), « Soave » spumante e « Soave classico », che rispondono alle condizioni ed ai requisiti stabiliti dal presente disciplinare di produzione. [...] Le condizioni ambientali e di coltura dei vigneti destinati alla produzione dei vini a denominazione controllata « Soave » e « Soave » Classico devono essere quelle tradizionali della zona e, comunque, atte a conferire alle uve e al vino derivato le specifiche caratteristiche. [...] (http://www.ilsoave.com/disciplinare.php)\nFigure 1 – Exemples de termes complexes dans leur contexte.\nture binaire1, composée par deux éléments qui peuvent être simples ou composés [COL 00].\nPar exemple (cf. fig. 1) :\n– [degrado] [ambientale] : le terme complexe est composé de deux constituants simples. Ce facteur influence le mécanisme de la réduction qui, dans la plupart des termes à deux composants, ne s’avère qu’en donnant lieu à des variantes anaphoriques, comme degrado, ci-dessus.\n– [denominazione] [di] [origine controllata] : le terme complexe est composé de deux constituants eux-mêmes composés. Cette structure permet la réalisation de deux typologies de réduction (variantes : denominazione et denominazione controllata, ou DOC). Rappelons ici le debat concernant la relation entre le mécanisme de la siglaison et la réduction qui reste toujours ouvert. Dans notre étude, nous avons traité les deux mécanismes comme non équivalents à cause de la motivation qui les justifie : la siglaison n’est pas un mécanisme spontané repondant à des exigences textuelles, mais plutôt un mécanisme émanant des experts d’un certain domaine. [ABR 92]\n1. La binarité, en tant que caractéristique du terme complexe, nous permet de considérer sa structure divisée en deux parties permettant une meilleure identification des rôles des éléments : la tête, responsable de la caractérisation syntaxique du TC et les constituants qui en définissent les changements au niveau sémantiques. Pour l’instant, nous n’avons pas considéré les relations hiérarchiques entre les éléments, qui pourraient nous permettre d’envisager les rapports reliant les différentes composantes du terme complexe [COL 00].\nLa binarité peut etre analysée selon les trois niveaux structuraux des termes complexes :\n– une structure syntagmatique : tête et composants ; – une structure sémantique : déterminant/déterminé ; – une structure onomasiologique : hyperonyme/hyponyme.\nAu niveau syntagmatique, le terme complexe est une unité composée linéaire qui est formée de composants considérés soit comme des éléments forts (noms, verbes, adjectifs et adverbes) ou bien lexicaux, soit comme des éléments faibles (prépositions, articles et conjonctions) ou bien grammaticaux [COL 00, DEL 04]. Ces éléments sont en relation d’interdépendance grammaticale entre eux. La structure syntagmatique du terme complexe peut être schématiquement représentée comme suit [COL 00] :\nterme complexe = (tête) + (composant1 + composant2 + composant3).\nLorsque nous nous situons au niveau sémantique, nous retrouvons la tête (déterminé) et les composants (déterminants). Les déterminants caractérisent au niveau sémantique le déterminé, qui donc change son référent notionnel.\nAu niveau onomasiologique, les composants sont étudiés selon la typologie des relations qui s’instaurent entre eux, par exemple l’analyse des rapports d’hyperonymie/hyponymie.\nPour représenter graphiquement cette relation, prenons l’exemple metodo di produzione biologica. Nous constatons que la tête metodo instaure une relation d’hyperonymie/hyponymie avec le terme complexe en forme pleine ; d’ailleurs nous distinguons plusieurs degrés de dépendance :\nmetodo dépendance−−−−−−→ di produzione\n↓ metodo di produzione\ndépendance−−−−−−→ biologica ↓\nmetodo di produzione biologica.\nLa binarité d’un terme complexe est à la base de son instabilité et des changements que sa linéarité peut subir aux trois niveaux structuraux. Ces modifications sont determinées par les déplacements des composants ou bien leur chute, comme dans le cas de la réduction.\nPour l’exemple « agricoltura biodinamica » nous avons :\n– plan syntagmatique : [agricoltura](tête) + [biodinamica](composant) ; – plan sémantique : [agricoltura](déterminé) + [biodinamica](déterminant) ; – plan onomasiologique : [agricoltura](hyperonyme)+[biodinamica](hyponyme).\nSi le composant biodinamica tombait, des changements seraient évidents à tous les niveaux. Il est donc fondamental de souligner que même si la réduction affecte\ntous les niveaux structuraux d’un terme complexe, les effets de ce mécanisme ne se reflètent pas sur la fonction dénominative du terme complexe plein."
    }, {
      "heading" : "3. Autour de la définition de la réduction",
      "text" : "Plusieurs études se sont intéressées à la question fondamentale suivante : « comment l’immersion dans un discours permet-elle d’omettre une partie a priori essentielle d’un terme complexe, c’est-à-dire formé par plusieurs mots, comme par exemple ‘contrôleur de carrefour’, ‘équipement de terrain’, ‘effort à la commande’, ‘réseau routier national’, etc. ? » [JAC 96].\nLa réduction est un mécanisme discursif qui, à travers l’élision d’au moins un constituant, transforme globalement un terme complexe en maintenant ses noyaux référentiel et notionnel [COL 97].\nSur la base des recherches de Guilbert [GUI 75] et Portelance [POR 89], on peut affirmer que la réduction coïncide avec la suppression d’une information non différentielle, c’est-à-dire l’élément ou les éléments non fondamentaux pour la catégorisation du terme. Toutefois, cette acception limite ce mécanisme aux seuls phénomènes sociolinguistiques, sans tenir compte du fait que la réduction peut répondre également des exigences contextuelles reliées au contexte et au cotexte [ALE 05] ; cette acception diminue, en outre, la valeur de la réduction et exclut la possibilité que ce mécanisme puisse former des alternatives au syntagme plein. La réduction représente en revanche, comme nous le verrons, un élément important de cohésion textuelle.\nDe manière générale, ce phénomène a été traité soit comme un simple mécanisme d’anaphore qui permet par exemple de reprendre le parc naturel par le/ce parc, soit comme un processus de lexicalisation qui, par exemple, a transformé voiture automobile en automobile ou téléphone portable en portable. Schématiquement, l’effacement de l’expansion du terme complexe resterait, en tant qu’anaphore, étroitement dépendant du contexte et du cotexte, tandis que l’effacement de sa tête produirait une nouvelle unité lexicale. Le discours instaure ainsi un jeu entre les phénomènes de réduction participant à sa propre cohésion et ceux participant à la construction de nouvelles unités lexicales d’un domaine.\nEn outre, la variation par réduction satisfait le besoin d’économie de la langue [TRA 08]. En effet, la répétition de la forme pleine du syntagme devient lourde et non économique, alors que l’emploi d’une variante réduite conserve le noyau notionnel et référentiel, tout en évitant l’ambiguïté. Collet [COL 04] ajoute que la réduction, en ce qu’elle est précisément due à la réitération du terme complexe, d’une part, et en ce qu’elle constitue une forme différente de sa source, d’autre part, est à ranger parmi les moyens de cohésion lexicale. La finalité de la réduction est donc double : sur le plan de l’encodage [JAC 03], elle permet une économie d’énergie, sur le plan du décodage [COL 00, p. 528–529], elle contribue à la cohésion textuelle en ce qu’elle constitue une forme de répétition d’un item lexical. Les caractéristiques de ces microstructures (ce que Collet appelle les « contextes réductionnels ») permettent la réduction et au-\ntorisent les locuteurs à se dispenser d’une partie a priori essentielle du terme. Ce mécanisme est donc en relation avec l’organisation plus globale du texte, témoignage de l’interaction entre le lexique et le discours.\n3.1. La réduction à la base du polymorphisme\nÀ travers le mécanisme de la réduction, une notion représentée par un terme complexe se trouve être dénommée par plusieurs unités qui partagent le même référent dans un domaine de spécialité. Dans les textes examinés, nous avons trouvé diverses formes du terme complexe comme dans l’exemple qui suit :\n– terme plein : mode de production biologique ; – variante 1 : mode ; – variante 2 : mode de production ; – variante 3 : production biologique .\nAinsi, certains termes complexes sont réalisés dans le même texte, sous trois formes différentes :\n– une forme que nous appellerons « pleine », par exemple mode de production biologique,\n– une forme réduite à la tête du terme, mode de production ou mode, – pour certains, une forme réduite à l’expansion du terme, e.g. production biolo-\ngique.\nLa polymorphie désigne la coexistence de plusieurs formes possibles d’expression pour certains termes complexes. S’il y a réduction, c’est parce qu’il y a adaptation du producteur du texte aux nécessités du discours. Certaines de ces réductions procurent un réel bénéfice sur le plan sémantique, en permettant de condenser certaines informations sur une seule occurrence. Par exemple le terme produit issu de l’agriculture biologique étant très long et peu économique, les usagers se sont tournés vers une forme abrégée qui puisse substituer le terme complexe dans le texte : produit biologique.\nTelle qu’illustrée ci-dessus, la coexistence de diverses formes d’un terme complexe — une forme pleine et une ou plusieurs formes réduites — suscite deux questions essentielles. La première concerne la compréhension des facteurs de réduction et du mécanisme à l’œuvre dans l’effacement des constituants majeurs d’un terme complexe ; il s’agit de comprendre pourquoi et comment, en un point donné du discours, l’auteur choisit plutôt une forme qu’une autre, et comprendre ce qui, dans le discours, l’autorise à user d’une forme dans laquelle toute l’information attachée au terme complexe n’est pas exprimée. Cela permet également d’expliquer ce qui rend possible et favorise l’effacement de constituants. La seconde question concerne les conséquences sémantiques de l’effacement de constituants. L’enjeu est de dégager les facteurs propres au discours qui permettent de mieux comprendre la polymorphie des termes complexes.\n3.2. La valeur des variantes réduites\nLe terme complexe et les variantes correspondantes donnent vie à des couples réductionnels. Les variantes peuvent avoir différents degrés d’autonomie référentielle, selon leur charge sémantique par rapport au terme complexe en forme pleine. La charge sémantique d’une composante représente sa valeur informative à l’intérieur du terme : plus une composante est fondamentale pour la transmission du sens du terme complexe, moins elle subira l’effet de la réduction. La valeur informative d’une composante ne constitue pas le seul facteur qui influence sa chute potentielle. L’usage et son figement à l’intérieur d’une terminologie représentent d’autres facteurs qui peuvent être cause de réduction. Comme déjà anticipé, même les exigences textuelles peuvent être un facteur causant la réduction.\nSelon Guilbert [GUI 75] et Portelance [POR 89], nous observons que la réduction est un mécanisme qui supprime l’information non-différentielle, c’est-à-dire l’élément ou les éléments qui ne caractérisent plus le terme complexe.\nLe mécanisme de la réduction peut également être justifié par des raisons pragmatiques : le facteur le plus incisif dans le cas de la réduction anaphorique est l’organisation du discours ; contrairement à cela, la réduction lexicale est influencée par des procédures lexicales qui donnent lieu a des unités terminologiques indépendantes.\nNous pouvons déjà en déduire qu’il existe des conditions internes et externes aux termes complexes, et que celles-ci peuvent influencer leur évolution. Les conditions internes sont plutôt reliées aux caractéristiques du terme complexe et à sa structure, tandis que les condition externes subissent l’influence de l’environnement textuel, des caractéristiques de la langue de spécialité considérée et du degré de figement des termes complexes.\nDans la section suivante, nous introduisons les deux types de réductions analysés dans notre étude.\n3.3. Les réductions anaphorique et lexicale\nEn général, nous pouvons identifier différents types de processus de réduction qui peuvent être classés sur un continuum. Celui-ci est organisé selon les relations qui s’instaurent parmi les termes complexes en forme pleine et les variantes réduites, les composantes qui chutent et la valeur de la variante qui se forme. De toute façon, dans toutes les études [COL 00, JAC 03, ADE 02, CAR 03] de ce mécanisme, ce sont les réductions anaphorique et lexicale qui retiennent l’attention de la plupart des auteurs.\nLa réduction anaphorique est un processus discursif et textuel, tandis que la réduction lexicale est générée par des conditions internes au syntagme plein (caractéristiques morphosyntaxiques, notionnelles, statut terminologique des constituants) ou par des conditions externes (niveau de spécialité du texte, typologie textuelle). Cette distinction est globalement acceptée, mais certains spécialistes utilisent des dénomina-\n[...] Au niveau européen, les règlements (CEE) no 2092/91 du 24 juin 1991 et (CE) no 1804/99 du 19 juillet 1999 définissent les règles du mode de production biologique et du contrôle des produits, le premier pour les végétaux et le second pour les produits animaux. Les organismes génétiquement modifiés (OGM) et produits dérivés sont exclus des modes de production biologique.\nFin 2004, les surfaces en production biologique (déjà certifiées ou en conversion) s’élèvent à 535 000 hectares, soit 1,9% de la surface agricole utilisée (SAU) française. [...] Ce mode de production touche environ 11 000 exploitations, ce qui correspond à la moitié des 25 000 exploitations et 1 million d’hectares visé par le plan pluriannuel de développement de l’agriculture biologique, présenté en décembre 1997 par le ministre en charge de l’Agriculture. [...] L’implantation de ce mode d’exploitation est faible dans les zones de grandes cultures intensives du Bassin parisien. (http: //www.stats.environnement.developpement-durable.gouv.fr/donnees-essentielles/ activites-humaines/agriculture-et-environnement/l-agriculture-biologique.html)\nLe vin bio c’est le sang de la terre, différent d’un terroir à l’autre, sain, authentique, sans artifices. C’est un nectar qui célèbre la vie, c’est l’invité incontournable des dîners festifs entre amis. Pour obtenir du vin, le viticulteur qu’il soit en mode conventionnel ou en mode biologique doit cultiver sa vigne avant de vinifier son raisin. Nous allons vous exposer la spécificité du travail du viticulteur en mode viticulture biologique. [...] (http://www.terroirselect.info/territoires/Provence/ cultiver-vigne-mode-bio.html)\n[...] Il metodo di produzione biologico è disciplinato a livello comunitario dai reg. CE 2092/91 (normativa base) e 1804/99 (disposizioni per le produzioni animali). L’Italia è il primo paese in Europa per numero di aziende che applicano il metodo di produzione biologico. [...] (http://www.coldiretti.it/ anagribios/agricoltura.htm)\n[...] L’agricoltura biologica è un metodo di produzione definito dal punto di vista legislativo a livello comunitario con un regolamento, il Regolamento CEE 2092/91, e a livello nazionale con il D.M. 220/95. [...] (http://www.aiab.it/index.php?option=com_content&view=article&id=112&Itemid=136)\n[...] Parla di dati incoraggianti anche il sottosegretario alle Politiche agricole alimentari e forestali, Stefano Boco, che « dimostrano una significativa attenzione degli agricoltori verso il metodo biologico ». [...] (http://www.aiol.it/last_node/articolo?page=863)\nFigure 2 – Exemples de réductions dans leur contexte.\ntions différentes pour les mêmes notions. Par exemple Aler-Dewolw [ALB 84] parle d’« ellipses contextuelle et néonymique », Kocourek [KOC 91] d’« ellipses contextuelle et lexicale », Jacques [JAC 96] définit les variantes comme « reprise anaphorique » et « terme réduit sans antécédents textuels ». Dans cet article (ainsi que dans [LAV 11]) nous avons choisi les termes de « réductions lexicale et anaphorique », qui nous semblent les plus transparents.\nAu niveau syntaxique phrastique et interphrastique, les variantes ont la même valeur. Nous détectons, par contre, une différence au niveau interne de la structure du terme complexe : une variante lexicale peut s’avérer sous la forme d’un changement non linéaire de la structure de terme complexe (par exemple : mode de production biologique et mode biologique), tandis que la réduction anaphorique entraîne un changement qui est toujours linéaire et qui détermine la chute des composants qui suivent la tête du terme complexe (par exemple degrado ambientale et degrado).\nAfin de différencier les deux formes de réduction, [JAC 00] affirme que :\n– la réduction lexicale n’est pas liée au milieu contextuel immédiat, qu’elle est durable, qu’elle crèe des variantes susceptibles de devenir des membres permanents de la terminologie du domaine, et qu’au niveau onomasiologique le syntagme plein est conservé même hors contexte ;\n– la réduction anaphorique a une valeur contextuelle, qu’elle se déroule au noyaumême du terme complexe, qu’elle a une valeur cohésive parmi les phrases d’un même texte et qu’au niveau onomasiologique, le syntagme plein est conservé uniquement en contexte.\nPour mieux expliquer notre propos, voici quelques exemples (cf. fig. 2) :\nExemple italien Exemple français Terme metodo di produzione biologica mode de production biologique\nSyntagme [metodo] subs. + [di] prép. + [mode] subs. + [de] prép. + nominal plein [produzione] subs. + [biologica] adj. [production] subs. + [biologique] adj.\nTête metodo mode Constituants di produzione biologica de production biologique\nRéduction metodo biologico mode biologique lexicale\nRéduction metodo di produzione mode de production anaphorique metodo mode\nDans l’exemple italien, la tête du terme complexe reste liée à ses constituants dans le cas de la réduction lexicale ; par contre pour la réduction anaphorique la variante a seulement une valeur de cohésion anaphorique, alors que la tête détient une charge sémantique supérieure.\nÀ travers ce type d’analyse, on définit un critère fonctionnel : la variante lexicalement réduite sert également comme connecteur textuel, mais elle ne se limite pas à cette fonction.\nDu point de vue onomasiologique, la différence entre les deux formes de réduction réside dans le sens transmis aux variantes : dans le cas de la réduction lexicale, la variante n’est pas un hyperonyme pur du terme complexe, mais elle en conserve la valeur onomasiologique ; au contraire, la variante anaphorique représente l’hyperonyme du terme complexe, donc sur le plan onomasiologique elle a moins d’intension et surtout est étroitement liée au contexte. Exemple :\nTerme logo comunitario di controllo CEE Syntagme [logo] subj. + [comunitario] adj. + [di] prép. +\nnominal plein [controllo] subj. + [CEE] acronyme/subst. Tête logo\nConstituants comunitario di controllo CEE Réduction logo di controllo CEE,\nlexicale ou logo CEE (relation non hyperonymique) Réduction logo (hyperonyme)\nanaphorique\nSur le plan formel, on peut dire que la réduction anaphorique permet seulement l’élision des constituants — par contre la réduction lexicale permet la suppression de la tête, des constituants, des éléments forts et faibles. Exemple :\nTerme agricoltura biologica Syntagme nominal plein [agricoltura] subst. + [biologica] adj.\nTête agricoltura Constituants biologica\nRéduction lexicale il biologico Réduction anaphorique agricoltura\nOn a donc enregistré une élision du constituant, dans le premier cas, et de la tête, dans le deuxième exemple. La variante lexicale, qui détient une charge sémantique supérieure par rapport à la variante anaphorique, peut substituer le terme complexe dans les textes, avec un risque très réduit d’ambiguïté\nSur le plan sémantique, il y a également des différences. La variante lexicale est caractérisée par une cohésion intérieure plus forte par rapport au syntagme plein.\nPar exemple, le syntagme audit environnemental se transforme en audit : il y a donc suppression de la cohésion interne du terme complexe. Mais, en cas de réduction lexicale, le comportement est à l’opposé : à cause de l’élimination des constituants, la variante a une cohésion interne réduite, voire parfois annulée.\nAinsi, par exemple, la variante lexicale metodo biologico du terme complexe metodo di produzione biologico a une cohésion interne plus forte, le signifié dans la forme réduite étant distribué parmi les constituants de la variante, qui sont donc plus cohésifs et ont plus de valeur. Le signifié de la forme pleine est distribué dans tous les éléments du syntagme.\nEn général, on peut affirmer qu’entre les variantes anaphoriques et les termes complexes, il s’instaure des relations de type hyperonymique, et entre les variantes lexicales et les termes complexes des relations synonymiques, bien que ces variantes ne soient pas de véritables synonymes.\n3.4. Réductions anaphorique et lexicale dans le discours\nSelon le domaine, le mécanisme de réduction peut se manifester de différentes manières. La réduction anaphorique ne subit pas l’influence du domaine, vu qu’il s’agit d’un phénomène intratextuel lié aux caractéristiques du texte. En revanche, la réduction lexicale est influencée par le domaine. Plus un domaine est technique et plus il sera caractérisé par une évolution rapide de la terminologie qui peut produire [DUR 10] :\n1) l’effacement de certains éléments n’ayant plus une fonction différentielle dans un terme complexe ;\n2) l’ajout d’éléments aux termes déjà existants ; 3) la disparition des termes.\nDans le premier cas, nous retrouvons le mécanisme de la réduction. Par contre, l’expansion des termes complexes peut, elle aussi, et dans un deuxième temps, déterminer la réduction, si la linéarité du terme complexe change pour des raisons d’économicité. Cette dernière affirmation est reliée au concept de série syntagmatique : pour chaque terme de la série qui enregistre un ajout d’information à travers l’expansion de sa structure, nous pouvons constater l’effacement d’un composant devenant implicite et d’apport non différentiel.\nCe mécanisme de réduction assez fréquent s’appuie sur le principe de redondance et s’apparente à l’apocope en langue parlée [POR 91, p. 103].\nEn plus, un domaine à haut degré de réduction est normalement caractérisé par des lexiques composés surtout par des termes complexes, et donc plus sensibles à subir des mécanismes comme la réduction qui sont enchaînés dans des séries. Dans ses travaux, Portelance [POR 89, POR 91, POR 96] décrit cette tendance des terminologies dans les domaines techniques, en justifiant la chute des éléments qui ont cessé d’être différentiels pour éviter leur redondance. Ce type de chute est à la base de la réduction lexicale dans le domaine technique. La réduction anaphorique dans les domaines techniques ne permet normalement pas l’évolution d’une langue de spécialité puisque les variantes anaphoriques ne sont pas indépendantes."
    }, {
      "heading" : "4. Autour de la définition des corpus",
      "text" : "4.1. Les langues de spécialité et les discours de spécialité\nSi la langue de spécialité est perçue comme une variété de la langue générale [PRA 06], la variation des langues de spécialité est soumise aux mêmes critères que la langue générale (variations diachroniques, diatopiques et diastratiques). Nous pouvons retrouver d’autres facteurs de variation qui influencent également la communication spécialisée, comme la situation de communication, les intentions et les buts de la communication. Ceux-ci conditionnent les ressources syntaxiques, morphologiques et textuelles utilisées dans les textes spécialisés (types de phrases, formes verbales, articulateurs du discours, etc.) [DES 01].\nQuand nous nous référons aux langues de spécialité, il est important de ne pas confondre le concept de discours avec celui de texte ou énoncé. Le discours se définit comme le produit des multiples pratiques discursives à l’œuvre dans la vie sociale [DES 01, p. 8]. Il ne peut pas être dissocié du contexte socio-culturel auquel il s’insère. L’énoncé représente sa manifestation ponctuelle, un objet concret et observable. Le texte enfin se réfère au modèle abstrait selon lequel s’organisent les énoncés.\nLes textes peuvent être classés selon des critères permettant d’identifier les niveaux suivants :\n1) niveau fonctionnel (fonctions textuelles) ;\n2) niveau situationnel (contexte social des activités communicatives, lieu, temps, nombre, rôle et relations entre les locuteurs) ;\n3) niveau du contenu sémantique (sujet d’un texte, différentes perspectives et développement thématique) ;\n4) niveau formel-grammatical (formes linguistiques et non linguistiques, aspects grammaticaux, ressources syntaxiques et lexicales) [DES 01].\nLes critères que nous venons de citer se distinguent en :\n– critères internes, qui concernent directement la structure du texte ; – critères externes, qui considèrent la contexte où se situe le texte.\nLe contexte est caractérisé par la situation communicative, l’émetteur, le destinataire et les typologies textuelles.\nUn autre concept important à définir est celui de domaine, seule façon de délimiter, de dénommer une structure cognitive, conceptuelle [BES 00, p. 187].\nNotre projet se base sur deux approches différentes des corpus : d’une part, l’analyse linguistique du phénomène de la réduction s’appuie sur une étude des corpus qui ont été constitués ad hoc, donc selon une approche corpus-based ; d’autre part, la validation expérimentale est basée sur des corpus ayant été constitués en vue, non pas de l’analyse de la réduction, mais de la validation des conclusions tirées de l’étude linguistique, donc selon une approche corpus-driven [CON 05b].\nEn parlant de corpus, nous désignons l’aspect normatif de la langue, notamment sa structure et son code. Le corpus regroupe un ensemble de textes ayant une visée commune. Les catégories des textes contenus dans un corpus peuvent être différentes, mais normalement elles partagent un objectif commun. Les critères que nous considérons comme les plus pertinents pour classer les textes dans un corpus sont : le sujet, la perspective d’énonciation, le niveau de spécialisation, les sources, la typologie textuelle, la langue.\n4.2. Les typologies textuelles\nLe mécanisme de réduction anaphorique dépend des caractéristiques du texte dans lequel le terme est inséré. En général, nous pouvons relier ce mécanisme au classement des typologies textuelles de Sabatini [SAB 99, LAV 11]. Plus un texte est contraignant et plus évidente sera la tendance de la terminologie à rester figée, comme nous le montrerons en section 5.\nCette classification est inspirée de celle de Desmet [DES 06] et vise à créer des typologies textuelles homogènes qui puissent être utilisées dans les mêmes situations communicatives. Celles-ci, étant ciblées en langue de spécialité, imposent des contraintes qui peuvent concerner le niveau situationnel influencé par les activités communicatives, lieu, temps, nombre, rôle des locuteurs et relations entre eux.\nDans notre cas, les textes ont été classés selon des contraintes prenant en compte le niveau situationnel de la communication mais aussi le contexte linguistique et le microcontexte (densité de termes, structure du texte).\nDans notre étude, nous avons traité les domaines indiqués dans le tableau 1. :\nDomaine Réduction lexicale Réduction anaphorique espaces naturels oui oui\nmédécine vétérinaire non oui cancer non oui\nemballages oui non philosophie oui non\nTableau 1 – Les domaines traités et les types de réduction étudiés.\nPour chaque domaine, nous avons créé des corpus de référence, à partir du contenu textuel de revues spécialisées du domaine.\nPour ce qui concerne la réduction anaphorique, nous avons basé notre étude contrastive sur des textes tirés du Web et subdivisés dans des catégories textuelles qui se basent sur la classification suivante :\n– catégorie 1 : discours de vulgarisation et de semivulgarisation scientifique ou technique. Par exemple, articles tirés des journaux généraux, brochures, sites Web non spécialisés ;\n– catégorie 2 : discours scientifique ou technique à des fins pédagogiques. Par exemples textes universitaires, textes destinés aux experts des domaines pour la veille technologique et scientifique ;\n– catégorie 3 : discours scientifique ou technique spécialisé et/ou officiel, discours législatif. Par exemple, lois qui règlent les domaines, articles scientifiques.\n4.3. Statistique descriptive du comportement des termes complexes\nPlusieurs auteurs se sont intéressés à l’extraction de termes complexes dans les langues de spécialité [DAI 96, FRA 98, JAC 01, SAN 02, NGO 08]. La réduction, en tant que cas particulier de la variation, a également été étudiée [JAC 99, DAI 03, NEN 04].\nEn marge de ces importants travaux, souvent liés à des développements d’outils d’extraction, il y a eu quelques études statistiques du comportement des termes, portant surtout sur la performance des outils [DAI 98, PAZ 05].\nDans cet article nous nous intéressons spécifiquement au phénomène de réduction des termes complexes, notamment, nous visons à contribuer, par une meilleure com-\npréhension du comportement des termes complexes, à l’optimisation des systèmes d’extraction de termes, de l’analyse sémantique et de la traduction automatique.\nNotamment, nous avons distingué :\n1) une phase concernant l’extraction automatique des termes complexes des textes de spécialité ;\n2) une phase concernant la validation expérimentale des hypothèses qui sont décrites dans le chapitre précédent.\nLes deux approches utilisent les mêmes protocoles qui visent des objectifs communs.\nPour ce qui concerne l’extraction automatique des termes, nous nous sommes servis du logiciel Acabit. Cette validation empirique ne pouvait s’appuyer que sur des corpus créés ad hoc, au risque de montrer les hypothèses de départ sans mettre en évidence d’éventuelles contre-hypothèses. Pour éviter cela, et afin de vérifier ultérieurement les axiomes de départ, nous avons également décidé d’élaborer d’autres corpus qui se référaient à d’autres langues de spécialité.\nDans le cas de la réduction anaphorique, nous avons constitué des corpus d’apprentissage d’où nous avons extrait les termes à travers Acabit. Après avoir obtenu les listes de termes complexes associés à leurs variantes éventuelles, nous avons lancé des requêtes sur Internet pour retrouver d’autres textes. À ce stade, nous avons contacté des experts afin de procéder à la validation des listes des termes complexes et des variantes. La collaboration avec les experts s’est avérée fondamentale pour arriver à des conclusions sur les cas ambigus où les variantes anaphoriques pouvaient être confondues avec des hyperonymes du terme complexe.\nEn outre, pendant que les experts se concentraient sur la désambiguïsion des variantes, nous avons créé un instrument pour la catégorisation des textes. Cette plateforme informatique présente les textes classés selon le terme complexe détecté par Acabit suivi d’une série de variantes éventuelles. Dans le cas de la réduction lexicale, le premier problème que nous avons rencontré concernait les typologies de termes complexes qu’il fallait traiter pour la validation des résultats. Nous avons décidé de traiter des termes complexes composés d’au moins 3 composants, considérés comme pertinents dans le cadre de notre étude.\nDans ce cas, les experts ont été contactés, en premier lieu, pour la confirmation des relations réductionnelles entre les termes complexes et les variantes détéctées, comme pour la réduction anaphorique. Ensuite, leur avis a été nécessaire pour une évaluation des composants qui subissaient le mécanisme de réduction. Cette deuxième problématique dérivait de l’analyse des langues de spécialité moins techniques, notamment par les composants adverbiaux. Leur effacement ne détermine pas de réduction, puisque la présence des adverbes détient une fonction de modulation de la valeur sémantique exprimée. Leur chute change l’inténsité du concept exprimé, par exemple dimensione propriamente etica et dimensione etica.\nConcernant le choix des experts des domaines, nous nous sommes adressés à des experts différents selon la spécialité. Pour ce qui concerne le domaine des espaces naturels, nous avons contacté des organismes de recherche responsables de la base de données multilingue concernant les réseaux naturels transalpins. Pour le domaine vétérinaire, nous nous sommes adressés aux organismes de contrôles des activités agricoles biologiques, notamment ceux qui évaluent les élevages. Ces organismes avaient déjà été consultés dans le cadre d’un projet concernant un glossaire multilingue sur les activités biologiques. Ils ont cumulé une expérience décennale dans l’évaluation des entreprises du domaine au niveau européen.\nPour ce qui concerne l’évaluation des termes appartenant au domaine de la philosophie, nous avons contacté des chercheurs universitaires qui participent activement à la recherche dans les domaines spécialisés en philosophie et sciences humaines.\nEnfin, dans le cadre de la médicine, nous avons collaboré avec les associations de divulgation de l’information en médicine citées dans les sources consultées pour la création de nos corpus. D’autre part, dans le cas des emballages, nous avons contacté les entreprises citées dans les revues prises en considération dans nos corpus pour avoir leur avis sur la terminologie utilisée."
    }, {
      "heading" : "5. La réduction anaphorique",
      "text" : ""
    }, {
      "heading" : "5.1. Hypothèses",
      "text" : "Les hypothèses que nous avons décidé de valider au niveau informatique sont le résultat de réflexions concernant les facteurs qui nous venons de décrire au niveau linguistique. Ainsi, nous formulons les hypothèses suivantes :\n(1) La réduction anaphorique est corrélée avec le type de discours, selon la classification donnée ci-dessus. En particulier, elle est plus présente dans les textes de catégorie 1, moins présente dans ceux de catégorie 2, quasi-absente dans ceux de catégorie 3.\n(2) La propriété (1) est indépendante du domaine et de la langue. (3) S’agissant d’un phénomène anaphorique, dans un document les formes pleines\nont tendance à apparaître avant les formes réduites (qui se réfèrent à elles).\n5.2. Validation expérimentale\n5.2.1. Protocole utilisé\nLa première hypothèse est liée à des propriétés internes au texte. Pour la valider nous avons étudié les occurrences d’un certain nombre de termes complexes et de leurs réductions anaphoriques dans un corpus composé de documents tirés du Web.\nVoici les cinq étapes du protocole utilisé (cf. fig. 3) :\n1) choix de termes complexes dans un domaine précis de langue de spécialité (cf. §5.2.2) ;\n2) récupération des documents contenant la forme pleine de chaque terme (cf. §5.2.3) ;\n3) extraction des formes pleines ainsi que réduites (potentielles) des termes dans ces documents ;\n4) validation par un expert de l’appartenance de chaque document au domaine, et balisage des formes réduites relevant de la réduction anaphorique ;\n5) calculs.\nLes experts ont été sélectionnés selon les domaines de spécialité. Leur contribution a été assistée par des terminologues qui pouvaient resourdre les problèmes au niveau épistémologique.\n5.2.2. Choix des termes complexes\nPour obtenir une liste pertinente de termes complexes dans des domaines donnés (point 1 du protocole), nous avons choisi comme point de départ le contenu textuel de\nquatre revues spécialisées2, cf. tableau 2. Comme on peut le voir sur la fig. 3, l’extrac-\nCorpus Langue Années Taille en Mo Bulletin du cancer français 1997–2010 43,02 Mo Journal vétérinaire vet.journal italien 2003–2010 11,41 Mo Espaces naturels français 2003–2009 5,49 Mo Parchi italien 1990–2009 18 Mo\nTableau 2 – Les revues spécialisées utilisées comme point de départ pour obtenir des listes de termes complexes pour chaque domaine.\ntion de termes complexes a été faite par le logiciel Acabit [DAI 96] après balisage POS par TreeTagger et lemmatisation par Flemm (pour le français uniquement). Ces deux logiciels ne fournissant pas l’information du genre des noms, nous avons complété la chaîne de traitement en nous servant de ressources lexicales3 pour introduire cette information, qui améliore l’extraction de termes complexes en permettant la vérification de l’accord en genre.\n5.2.3. Récupération des documents Web contenant les termes\nLe moteur de recherche Google n’autorisant pas la récupération de plus de 64 URL par requête, nous nous sommes tournés vers la plate-forme Yahoo BOSS, qui ne pose pas de limite sur le nombre de requêtes. Pour chaque requête Web, Yahoo retourne les mille premières URL, par ordre de pertinence. Nous avons récupéré tous les documents proposés par Yahoo, qui étaient récupérables et de format HTML, PDF ou texte brut, cf. tableau 3. Dans les chiffres ci-dessus, nous entendons par « taille\nDomaine Langue Nb doc., dont : HTML PDF TXT Taille totale Vétérinaire italien 14 183 10 420 3 743 20 387 Mo Cancer français 20 790 13 627 7 124 39 647 Mo Parcs nationaux italien 38 502 28 253 10 226 23 1,15 Go Parcs nationaux français 18 200 13 840 4 328 32 849 Mo\nTableau 3 – Les documents récupérés sur le Web.\ntotale » celle des contenus textuels bruts obtenus après conversion et/ou nettoyage.\n2. Bulletin du cancer http://www.john-libbey-eurotext.fr/fr/revues/medecine/ bdc/sommaire.md, ISSN 1769-6917 ; Vet.journal http://www.evsrl.it/vet.journal/, sans ISSN ; Espaces naturels http://www.espaces-naturels.fr/a_la_une/la_revue_ espaces_naturels, ISSN 1637-9896 ; Parchi http://www.parks.it/federparchi/ rivista/, sans ISSN. 3. Lexique 3 pour le français (http://www.lexique.org/), Morph-it ! pour l’italien (http: //dev.sslmit.unibo.it/linguistics/morph-it.php).\n5.3. Extraction des termes et validation par un expert\nPar le biais d’une interface Web spéciale, reliée à une base MySQL, des experts ont pu (a) valider l’appartenance effective de chaque document au domaine donné, (b) indiquer le type du document (1 = vulgarisation, 2 = pédagogique, 3 = spécialisé) (c) vérifier les conditions de forme pleine ou de forme réduite anaphorique de chaque terme complexe observé.\n5.3.1. Arbre anaphorique d’un terme complexe\nSoit T = (c∗) un texte (où c∗ sont des caractères), t∗ les occurrences de la forme pleine d’un terme complexe dans T , et r∗ celles des différentes formes réduites du même terme. L’ordre linéaire des caractères du texte induit un ordre des t∗ et des r∗.\nNotons ri,1, . . . , ri,ni les formes réduites placées entre les formes pleines ti et ti+1 (ou entre ti et la fin du document). Dans le cas où il n’y a pas de tel r∗, on dira que ni = 0. Soit pos : T → N la fonction qui associe à chaque mot sa « position » dans le texte (on compte le nombre de caractères depuis le début du fichier).\nDans T il peut y avoir également des formes réduites r′∗ placées avant la première forme pleine (c’est-à-dire telles que pos(r′∗) < pos(t1)). Celles-ci sont appelées réductions cataphoriques et on notera r′j la j-ème réduction cataphorique de la forme pleine t1 (pour les autres ti on considère, dans ce modèle4, que l’on n’a que des réductions anaphoriques).\nLes occurrences t∗, r∗,∗ et r′∗ forment une structure d’arbre ordonné et pondéré par la fonction pos (cf. fig. 4), que nous appelons arbre anaphorique du terme t.\nPour étudier cette structure et en tirer des renseignements sur le comportement des réductions anaphoriques de T , nous allons nous intéresser à deux types de quantités :\n1) des quantités relatives à la structure de l’arbre :\na) dm, le degré moyen des nœuds ti, b) d−, le nombre de réductions cataphoriques, c) f , la moyenne des fi = #{tj , tj+1, . . . , tk | d(tj−1) > 0, d(t`) =\n0 pour i ≤ ` < k et d(tk) > 0} (où d est le degré), c’est-à-dire le nombre de formes pleines consécutives entre deux formes réduites ;\n2) des quantités relatives à la pondération de l’arbre :\na) δ, la moyenne des δi = pos(ri,1)−pos(ti), c’est-à-dire la distance moyenne entre une forme pleine et sa première réduction anaphorique,\n4. On peut imaginer d’autres modélisations de ce phénomène. Ainsi, par exemple, on pourrait « attacher » chaque réduction à la forme pleine la plus proche, que ce soit avant ou après elle. On aurait alors des réductions anaphoriques et cataphoriques dans tout le document. Dans cet article, nous avons choisi de n’avoir de réduction cataphorique qu’avant la première forme pleine. Cf. aussi § 7, point 4.\nb) ∆, la moyenne des ∆i = pos(ri,ni) − pos(ti), c’est-à-dire la distance moyenne entre une forme pleine et la dernière réduction anaphorique avant la prochaine forme pleine ou avant la fin du fichier,\nc) δ− = pos(t1)−pos(r′m), c’est-à-dire la distance entre la dernière réduction cataphorique et la première forme pleine,\nd) ∆− = pos(t1) − pos(r′1), c’est-à-dire la distance la première réduction cataphorique et la première forme pleine ;\nLe scénario suivant fournit une interprétation possible de ces quantités : après avoir écrit (en moyenne) f formes pleines, l’auteur se sert (en moyenne) de dm formes réduites, dont la première arrive (en moyenne) à δ caractères après la dernière forme pleine. Éloigné de ∆ caractères (en moyenne) de la forme pleine, il considère que l’ambiguïté est devenue trop forte, il revient à la forme pleine, et le cycle reprend.\nDe même, pour le cas cataphorique, l’auteur écrit en moyenne d− formes réduites cataphoriques avant la première forme pleine, qui est à une distance de ∆− caractères de la première et de δ− caractères de la dernière forme cataphorique."
    }, {
      "heading" : "5.3.2. Première et deuxième hypothèses",
      "text" : "Notre première hypothèse stipule que la quantité et le comportement des réductions anaphoriques et cataphoriques dépendent de la typologie de texte. Nous avons classé les documents en trois catégories (vulgarisation / pédagogique / spécialisé). Le lecteur trouvera dans le tableau 4 les moyennes δ̄, ∆̄, d̄m, δ̄−, ∆̄−, d̄−, f̄ de δ, ∆, dm, δ−, ∆−, d− et f pour chacun des quatre corpus, ventilés par typologie de texte.\nVétérinaire (italien) Cancer (français) vulg. pédag. spécial. vulg. pédag. spécial.\nFP 3.20 4.09 5.16 4.97 10.96 11.66 ANA/FP 0.8 0.56 0.06 0.79 0.7 0.25\nCATA/FP 0.13 0.01 0.00 0.12 0.02 0.00 δ̄ 3297.16 2074.05 3762.68 1917.76 2158.51 8118.12 ∆̄ 6579.31 6797.56 4673.45 4485.39 10484.02 22292.91 d̄m 2.58 2.89 1.57 2.23 3.17 5.85 δ̄− 2129.82 688.67 NA 3043.83 1022.45 NA ∆̄− 2805.29 688.67 NA 6673.67 4907.64 NA d̄− 1.75 1.00 NA 1.50 1.73 NA f̄ 1.75 2.42 3.39 1.72 1.99 7.38\nParcs (italien) Parcs (français) vulg. pédag. spécial. vulg. pédag. spécial.\nFP 4.58 10.62 12.04 17.89 35.75 52.81 ANA/FP 0.73 0.55 0.19 1.03 0.50 0.17\nCATA/FP 1.05 0.34 0.04 3.56 0.98 0.13 δ̄ 5233.06 2293.71 849.67 1773.01 972.44 993.31 ∆̄ 7499.35 2832.36 10789.33 5964.44 1553.90 3817.10 d̄m 2.42 1.93 3.33 3.78 1.24 2.33 δ̄− 1896.54 9931.29 2433.00 3340.20 NA NA ∆̄− 5216.58 13449.50 4811.00 13454.80 NA NA d̄− 3.46 1.71 3.00 5.40 NA NA f̄ 2.41 3.81 3.17 3.35 3.47 7.25\nTableau 4 – Résultats de l’analyse des documents récupérés sur le Web. FP, ANA et CATA sont les nombres moyens de formes pleines (resp. anaphoriques, cataphoriques) par 100 ko de texte, et ANA/FP et CATA/FP les ratios entre formes anaphoriques (resp. cataphoriques) et formes pleines. NA signifie que la donnée n’est pas calculable, faute de cas attestés dans les corpus.\nDe ces tableaux nous tirons les conclusions suivantes :\n1) comme le montre la ligne FP, la densité de formes pleines est croissante lorsque le niveau de contrainte augmente (en allant de la vulgarisation au texte scientifique spécialisé). En effet, un texte scientifique évitera l’ambiguïté en favorisant les formes pleines, au détriment de l’économie ;\n2) les lignes ANA/FP et CATA/FP montrent clairement que le nombre de réductions baisse lorsque l’on passe de la catégorie 1 aux catégories 2 et 3. C’est ainsi qu’est démontrée la première hypothèse ;\n3) ce comportement est similaire dans les quatre corpus, appartenant à des domaines et à des langues différents, ce qui confirme la deuxième hypothèse ;\n4) en ce qui concerne les autres paramètres, on ne peut en tirer aucune conclusion, puisqu’on ne constate aucune régularité significative.\nDans la suite, nous allons raisonner au niveau des documents.\nLa fig. 5 montre la distribution des documents selon le rapport formes réduites / formes pleines. Les courbes tracées sont des régressions polynomiales des points, selon l’algorithme LOWESS [CLE 81]. Elles confirment le fait que l’on a plus de réductions anaphoriques en catégorie 1 (vulgarisation) qu’en catégorie 2 (scient. pédag.) que 3 (scient. spécialisé).\nNous constatons également une différence entre les textes français et italiens. Dans le premier cas on remarque un meilleur regroupement : il y a moins de dispersion pour les cat. 1 et 2 et la cat. 3 se trouve plutôt sous la courbe de la cat. 1. Dans le cas italien, il y a beaucoup plus de dispersion et aucun regroupement n’est possible. On peut en déduire que la langue italienne est terminologiquement moins stable que la langue française : les termes italiens sont moins figés et leur comportement est plus chaotique, l’alternance entre forme complète et forme réduite a tendance à ne pas suivre un schéma régulier. En français, par contre, on trouve que les termes sont plus réguliers."
    }, {
      "heading" : "5.3.3. Troisième hypothèse",
      "text" : "Notre troisième hypothèse peut être reformulée de la manière suivante : il existe moins de documents avec au moins une réduction cataphorique que de documents avec au moins une réduction anaphorique mais sans aucune réduction cataphorique.\nCette version de l’hypothèse se vérifie aisément à partir de nos données (toutes catégories de texte confondues), cf. tableau 5.\nDomaine Langue RA RCA Vétérinaire italien 37,47% 7,00% Cancer français 11,9% 1,49% Parcs italien 48,48% 4,71% Parcs français 40,95% 4,76%\nTableau 5 – Présence de réductions anaphoriques et cataphoriques dans les documents. La colonne RA (resp. RCA) représente les pourcentages de documents avec au moins une réduction anaphorique (resp. cataphorique)."
    }, {
      "heading" : "6. La réduction lexicale",
      "text" : ""
    }, {
      "heading" : "6.1. Hypothèses",
      "text" : "Nous formulons les hypothèses suivantes :\n(1) La réduction lexicale dépend du domaine, et est plus fréquente dans les domaines techniques à évolution rapide.\n(2) Elle résulte de l’inutilité progressive d’un composant et peut aboutir à une lexicalisation à part entière de la forme réduite. Dans ce cas, on peut observer un « cycle de vie » de la forme réduite : naissance, mise en concurrence avec la forme pleine, remplacement de la forme pleine.\nPour le point (2), nous nous sommes inspirés des articles de Dury & Drouin sur la nécrologie des termes [DUR 10] et de Møller [MØL 98] sur la terminochronie.\nDans cette section, nous appelerons « termes 3-complexes », les termes dont les composants sont formés de plus de deux mots.\n6.2. Validation expérimentale\nContrairement à la réduction anaphorique qui est interne au texte, la réduction lexicale est un mécanisme discursif. Il est donc important d’utiliser des corpus thématiquement stables pour l’étudier. D’ailleurs, la confirmation ou infirmation de la deuxième hypothèse nécessite une datation précise des données textuelles. Ainsi, plutôt que de récupérer des documents arbitraires du Web contenant la forme pleine et\nRevue Domaine Langue Années Volume Klēsis philosophie français 2006–2010 7,25 Mo\nDialegesthai philosophie italien 1999–2010 19,43 Mo Emballages Magazine emballages français 2002–2009 1,16 Mo\nItalia Imballaggio emballages italien 2002–2007 14,05 Mo Espaces naturels parcs français 2003–2009 5,49 Mo\nParchi parcs italien 1990–2009 18 Mo\nTableau 6 – Liste comparative des revues utilisées pour l’étude de la réduction lexicale.\ndes éventuelles formes réduites, nous avons choisi de travailler sur des corpus plus « conventionnels » : nous avons étudié le contenu textuel des six revues spécialisées, dans les domaines suivants : les techniques d’emballage, les parcs nationaux et la philosophie (qui nous servira de contre-exemple puisqu’elle est l’antithèse-même d’un domaine « technique à évolution rapide »).\nLe lecteur trouvera dans le tableau 6 la liste comparative des revues5 considérées. Voici les étapes du protocole utilisé :\n1) extraction des termes 3-complexes à l’aide du logiciel Acabit (cf. § 5.2.2) ; 2) obtention des formes réduites lexicales potentielles par transformation des formes pleines (A B C→ A C, A B C D→ A B D, A B C D→ A C D, etc.) ; 3) analyse de la distribution des occurrences des formes pleines du (1) et des formes réduites lexicales du (2) dans le corpus, en tenant compte de leur datation et de leurs positions dans les documents.\n6.2.1. Extraction des termes 3-complexes\nLe nombre de termes 3-complexes varie énormément d’un corpus à l’autre. Nous n’avons pas tenu compte des termes complexes de la forme « nom adverbe adjectif(s) ». Ceux-ci ne sont pas pertinents pour notre étude puisque l’adverbe en modifie le sens. Ainsi, la variation qui consiste à omettre l’adverbe ne constitue pas une forme réduite lexicale du terme, puisque elle ne renvoie pas au même concept.\nLe nombre de termes 3-complexes ainsi obtenus, trié par corpus, est donné dans le tableau 7. Nous constatons dans le tableau 7 que le nombre de formes pleines et réduites n’est pas directement corrélé avec le nombre d’occurrences de celles-ci dans le corpus : ainsi, dans Parchi, on a 24 953 occurrences des 52 formes réduites attes-\n5. Klēsis http://www.revue-klesis.org/, ISSN 1954-3050 ; Dialegesthai http:// mondodomani.org/dialegesthai/, ISSN 1128-5478 ; Espaces naturels http://www. espaces-naturels.fr/a_la_une/la_revue_espaces_naturels, ISSN 1637-9896 ; Parchi http://www.parks.it/federparchi/rivista/, sans ISSN ; Emballages Magazine http://www.industrie.com/emballage/, ISSN 0013-6573 ; Italia Imballaggio http: //www.italiaimballaggio.it/italiaimballaggio/05_00/index.html, ISSN 2037- 2183.\nRevue t r Occurrences t Occurrences r Klēsis 2 3 3 72\nDialegesthai 6 6 12 293 Emballages Magazine 33 15 93 111\nItalia Imballaggio 127 96 218 2 015 Espaces naturels 51 45 209 1 576\nParchi 88 52 1 829 24 953\nTableau 7 – Termes 3-complexes obtenus selon le corpus. t, r dénotent, resp., le nombre de termes complexes distincts obtenus (étape 1) et celui de formes réduites (étape 2) attestées dans le corpus. D’autre part « Occurrences t » (resp. « Occurrences r ») dénotent le nombre d’occurrences de formes pleines (resp. réduites) dans le corpus.\ntées, alors que dans Italia Imballaggio on a presque deux fois plus de formes réduites attestées (96), avec douze fois moins d’occurrences (2 015).\nSur la fig. 6 on présente la densité des formes pleines (courbe bleue pointillée) et réduites (courbe continue) en fonction du temps. On voit que les formes réduites sont bien plus nombreuses que les formes pleines, phénomène dû à leur économicité. D’ailleurs dans les cas de Espaces naturels et Parchi on assiste à une croissance quasi-\nconstante de la densité de formes réduites et à une décroissance du nombre de formes pleines, au fil du temps.\nCes exemples montrent que la réduction lexicale est corrélée à la technicité du domaine, ce qui prouve la première hypothèse.\n6.2.2. Deuxième hypothèse, cycle de vie de terme\nSelon [DUR 10] et [MØL 98], les termes complexes ont un cycle de vie lié à celui de l’objet qu’ils dénomment. Lorsque l’objet est encore peu connu, la forme pleine est indispensable pour le dénommer. Mais dans les cas où, progressivement, l’objet se répand, les réductions lexicales deviennent possibles, puisque le risque d’ambiguïté est moindre. Enfin, dans les cas où certains constituants de la forme pleine n’ont aucune charge sémantique réelle, la réduction lexicale finit par remplacer complètement la forme pleine.\nPour déceler des traces du phénomène de « cycle de vie de terme », il a d’abord fallu « unifier » les mesures de datation et de position dans le texte. Pour cela, nous avons suivi l’approche suivante :\n1) nous définissons un corpus C comme étant une suite de N documents (Di)1≤i≤N datés. La datation est une fonction strictement croissante T : C → QN où T (Di) = année(Di) + mois(Di)−1 12 ;\n2) en considérant un document Di comme une suite de caractères (ci,j) nous définissons la fonction de datation généralisée T ∗ comme la fonction linéaire par morceaux qui étend T de au niveau des caractères :\n(D∗) T //\nπ\nQN\n(c∗,∗)\nT∗ <<zzzzzzzz\noù π est la projection qui envoie le document Di sur son premier caractère ci,1. Autrement dit, si le document D5 date du 1er mai 2005 et D6 du 1er juin de la même année, alors T (D5) = 2005 + 5−112 = 2005, 333, T (D6) = 2005, 417 ; si une occurrence de terme se trouve à la position 37 238 de Di (dont la taille est, par exemple, de 57 642 caractères) alors sa valeur de datation généralisée sera T ∗(ti) = T (D5)+ 37 238 57 642 ·(T (D6)−T (D5)) = 2 005, 3873. Ainsi toute occurrence a une valeur de datation unique, compatible avec la datation des fichiers et avec l’ordre linéaire du texte6 ;\n6. Suite à la remarque d’un relecteur de l’article, notons que cette fonction convient à des corpus figés. En effet, dans le cas d’un corpus dynamique, l’ajout de documents supplémentaires changerait les valeurs obtenues pour les anciens documents.\n3) la fonction de datation généralisée nous permet de définir une distance temporelle dT entre les occurrences de termes dans le corpus tout entier : dT (ti, tj) = T ∗(tj)− T ∗(ti) ;\n4) ainsi, pour un terme donné, les occurrences de formes pleines p∗ et de formes réduites r∗ deviennent des ensembles ordonnés de points de la droite temporelle.\nLa modélisation étant faite, posons-nous le problème de représentation du phénomène de « cycle de vie de terme ». On ne peut prendre simplement les premières occurrences de formes pleine et réduite, puisque celles-ci peuvent très bien être des outliers. Prendre la moyenne arithmétique des valeurs temporelles de toutes les formes pleines (resp. réduites) ne serait pas une solution non plus, puisqu’on s’intéresse aux débuts de l’apparition d’une forme et non pas à son historique complet. Il convient de traiter séparément les cas où le nombre d’occurrences prend de l’ampleur et ceux où il reste limité. Dans le premier cas, on limitera le nombre d’occurrences à considérer, dans le deuxième cas on prendra la totalité des occurrences.\nComme nous voulons éviter l’aberration causée par des éventuels outliers, tout en gardant un maximum d’information pour le cas où le nombre d’occurrences est très limité, nous avons choisi de considérer la moyenne géométrique des N premières occurrences. En effet, la moyenne géométrique est mieux indiquée pour diminuer l’impact des outliers que la moyenne arithmétique. Dans les résultats présentés cidessous, on a pris N = 100.\nNous allons donc calculer, pour chaque terme de chaque corpus, la quantité ξ = r̄ − t̄, où r̄ et t̄ sont les moyennes géométriques des 100 premières occurrences des formes réduites (resp. de la forme pleine) du terme. La fig. 7 représente la densité de ξ. On constate que la médiane de cette densité est positive dans tous les corpus, ce qui valide notre deuxième hypothèse."
    }, {
      "heading" : "7. Conclusions et perspectives",
      "text" : "En traitant des corpus dans divers domaines et dans les deux langues (français et italien) nous avons validé expérimentalement nos hypothèses : que la réduction anaphorique dépend du type de discours, mais ne dépend pas du domaine ou de la langue ; que les formes réduites anaphoriques ont tendance à suivre les formes pleines, plutôt que de les précéder ; que la réduction lexicale dépend du domaine, et est plus fréquente dans les domaines techniques à évolution rapide ; et que les formes pleines suivent un cycle de vie et sont souvent remplacées par des formes réduites lexicales.\nLes logiciels de type Acabit [DAI 96] ou TerMine [FRA 98] extraient efficacement des termes complexes à partir de données textuelles en langue de spécialité, mais ne nous fournissent aucune indication sur les éventuelles relations sémantiques entre eux. Et pourtant, dans les langues de spécialité les relations d’hyponymie/hypéronymie entre les termes sont d’une importance capitale.\nDans ce travail nous avons essayé de fournir quelques indications sur la probabilité d’avoir, dans certains cas que nous nous proposons de décrire, des relations (quasi)synonymiques.\nUn terme complexe peut être décrit en tant que tc1 . . . cn où t est la tête et ci les composants. Prenons, par exemple, n = 3. En réduisant le terme tc1c2c3 nous obtenons le treillis suivant (où les flèches sont des réductions purement formelles, sans aucune hypothèse sur les relations semantiques entre les termes) :\ntc1c2c3\n1zzvvv vv\nvv vv\n2\n3\n$$H HH\nHH HH\nHH\ntc1c2\n4\n5\n$$H HH\nHH HH\nHH tc1c3\n6zzvv vv\nvv vv\nv 7\n$$H HH\nHH HH\nHH tc2c3\n8zzvv vv\nvv vv v 9\ntc1\n10\n$$\ntc2\n11\ntc3\n12 zz\nt\nSelon les définitions données dans la première partie de cet article, si réduction anaphorique (ou cataphorique) il y a, elle correspond forcément aux flèches 1, 4 et 10, c’est-à-dire le bord gauche du treillis. Les autres flèches du treillis peuvent, par contre, être des réductions lexicales.\nLes hypothèses que nous avons démontré experimentalement nous ont conduit à formuler les règles suivantes :\n1) si une réduction est du type tc1 . . . cn → tc1 . . . cn−1, si la forme pleine tc1 . . . cn apparaît avant la forme réduite tc1 . . . cn−1, et si le texte est de catégorie 1 (vulgarisation), alors il y a des fortes chances que la réduction soit anaphorique.\nDans ce cas, s’agissant d’une anaphore, les mécanismes habituels de résolution d’anaphore peuvent être utilisés pour contribuer à la confirmation ou infirmation de l’hypothèse de réduction anaphorique ;\n2) pour le même type de réduction, si la forme pleine apparaît après la forme réduite et/ou si le texte est de catégorie 3 (discours scientifique spécialisé ou texte législatif), alors il y a peu de chances que ce soit une réduction anaphorique ;\n3) pour tout autre type de réduction dans le treillis ci-dessus, si le texte appartient à un domaine technique à évolution rapide, la possibilité d’une réduction lexicale (due à l’inutilité progressive d’un composant) existe. Pour la confirmer ou l’infirmer, il faudra utiliser des méthodes sémantiques. On pourra, par exemple, former des vecteurs de concepts environnant les deux termes, dont les coefficients seraient pondérés par la fréquence d’occurrences au niveau du corpus. En comparant les vecteurs (par exemple, en calculant leur cosinus), on aurait une indication plus forte sur une éventuelle synonymie.\nPartant de là, nombreuses sont les pistes qui peuvent être suivies :\n1) en se basant sur notre corpus annoté, se poser la question de la pertinence de l’application des algorithmes traditionnels de résolution d’anaphore pour confirmer ou infirmer la réduction anaphorique ;\n2) idem, pour les mesures de similarité sémantique et la réduction lexicale. Notons que si la résolution d’anaphore et la mesure de similarité s’avèrent pertinentes dans ce domaine, celles-ci étant des techniques lourdes, notre approche peut fournir des critères pour évaluer la pertinence de leur utilisation dans un texte ;\n3) étendre notre étude à d’autres langues comme l’anglais (dont les mécanismes de réduction lexicale sont bien différents), l’allemand (qui fourmille de mots composés), les langues idéographiques (où le caractère est porteur de sens et où on assiste à un triangle terme - caractère - concept), etc. ;\n4) étudier l’interaction des réductions lexicales et anaphoriques : en effet, nous avons constaté (sans en tenir compte dans nos calculs) le phénomène suivant : une forme pleine (avec arbre anaphorique) était suivie d’une réduction lexicale possédant son propre arbre anaphorique mais dont les feuilles représentaient les mêmes formes que celles des feuilles de l’arbre de la forme pleine. Autrement dit, on peut qu’une forme réduite anaphorique se réfère à une forme pleine ou à une réduction lexicale de\ncelle-ci. Cela nous incite à fusionner les deux arbres (ceux des formes pleine et réduite lexicale) en un seul graphe qui puisse modéliser les deux types de réduction ;\n5) étudier la correlation des différentes quantités définies dans cet article avec la C-valeur de Frantzi-Ananiadou-Tsujii [FRA 98] ;\n6) détecter les éventuels marqueurs anaphoriques dans le voisinage des formes réduites anaphoriques et se servir d’algorithmes de résolution d’anaphore pour obtenir un modèle plus riche de l’arbre anaphorique, dans lequel les arêtes représenteront, dans la mesure du possible, le lien entre anaphore et antécédent ;\n7) si l’« indice de réductibilité » est la probabilité qu’un terme complexe soit la réduction (lexicale ou anaphorique) d’un autre terme complexe, développer un algorithme qui calcule cet indice en se basant sur différents facteurs (type de texte, domaine, position dans le texte, etc.). Cette information serait d’une grande utilité pour l’analyse sémantique, l’indexation ou la traduction automatique."
    }, {
      "heading" : "8. Bibliographie",
      "text" : "[ABR 92] ABREU-GARCIA J.-M., « Une enquête terminologique en espagnol dans le domaine des nouvelles technologies de l’information et de la communication », PhD thesis, Institut Télécom-Télécom Bretagne, 1992.\n[ADE 02] ADELSTEIN A., « Condiciones de reductibilidad léxica de los sintagmas terminológicos », Estudios de Lingüística del Español, vol. 16, 2002.\n[ALB 84] ALBER-DEWOLF R., « Étude sur la création néonymique, analyse comparée des procédés morphologiques et morphosyntaxiques de formation des termes du domaine de la spectroscopie en anglais, en allemand, en français et en russe », PhD thesis, Université Laval, Québec, 1984.\n[ALE 05] ALEXANDRU C., GAUDIN F., « Les contextes : à la source du terme », Mots, termes et contextes. Préactes des VIIes journées scientifiques AUF-LTT, 2005.\n[BES 00] DE BESSÉ B., « Le domaine », BÉJOINT H., THOIRON P., Eds., Le sens en terminologie, Presses universitaires de Lyon, 2000.\n[BOU 99] BOURIGAULT D., SLODZIAN M., « Pour une terminologie textuelle », Terminologies nouvelles, vol. 19, 1999, p. 29–32.\n[CAR 03] CARDERO GARCÍA A. M., « En torno a la frecuencia de algunas estructuras sintácticas en terminología », Terminología e Industrias da Lingua. Actas do VII Simpósio Ibero Americano de Terminología, ILTEC, 2003.\n[CLE 81] CLEVELAND W., « LOWESS : A program for smoothing scatterplots by robust locally weighted regression », The American Statistician, vol. 35, 1981, page 54.\n[COL 97] COLLET T., « La réduction des unités terminologiques complexes de type syntagmatique », Méta : journal des traducteurs, vol. 42, no 1, 1997, p. 193–206.\n[COL 00] COLLET T., « La réduction des unités terminologiques complexes de type syntagmatique », PhD thesis, Université de Montréal, 2000.\n[COL 04] COLLET T., « Esquisse d’une nouvelle microstructure de dictionnaire spécialisé reflétant la variation en discours du terme syntagmatique », Méta : journal des traducteurs, vol. 49, no 2, 2004, p. 247–263.\n[CON 05a] CONCEIÇÃO M. C., « Terminologie textuelle : reformulations et accès aux concepts », De la mesure dans le termes, Presses Universitaires de Lyon, 2005, p. 269–305.\n[CON 05b] CONDAMINES A., Linguistique de corpus et terminologie, CNRS, Équipe de Recherche en Syntaxe et Sémantique, Toulouse, 2005.\n[DAI 96] DAILLE B., « ACABIT : une maquette d’aide à la construction automatique de banques terminologiques monolingues ou bilingues », CLAS A., THOIRON P., BÉJOINT H., Eds., Lexicomatique et Dictionnairiques, FMA, Beyrouth, 1996, p. 123–136.\n[DAI 98] DAILLE B., GAUSSIER É., LANGÉ J.-M., « An Evaluation of Statistical Scores for Word Association », GINZBURG J., KHASIDASHVILI Z., VOGEL C., LEVY J.-J., VALLDUVI E., Eds., The Tbilisi Symposium on Logic, Language and Computation : Selected Papers, CSLI Publications, 1998, p. 177–188.\n[DAI 03] DAILLE B., « Conceptual structuring through term variation », Proceedings ACL 2003 Workshop on Multiword Expressions : Analysis, Acquisition and Treatment, 2003, p. 9–16.\n[DEL 04] DELMONTE R., « Strutture sintattiche dall’analisi computazionale di corpora di italiano », Intorno all’italiano contemporaneo. Tra linguistica e didattica, Franco Angeli, 2004.\n[DES 01] DESMET, « Terminologie, culture et société. Éléments pour une théorie variationniste de la terminologie et des langues de spécialité », Cahiers du Rifal, vol. 26, 2001.\n[DES 06] DESMET I., « Variabilité et variation en terminologie et langues spécialisées : discours, textes et contextes », Septièmes journées scientifiques du Réseau « Lexicologie, Terminologie, Traduction » de l’Agence Universitaire de la Francophonie : Mots, termes et contextes, Bruxelles, 2006, p. 235–247.\n[DUR 10] DURY P., DROUIN P., « L’obsolescence des termes en langues de spécialité : une étude semi-automatique de la « nécrologie » en corpus informatisés, appliquée au domaine de l’écologie », Online proceedings of the XVII European LSP Symposium 2009, 2010, p. 1-11.\n[FRA 98] FRANTZI K. T., ANANIADOU S., TSUJII J., « The C-value/NC-value method of Automatic Recognition for Multi-Word Terms », Springer LNCS, vol. 1513, 1998, p. 585– 604.\n[FRE 02] FREIXA A. J., « La variació terminològica : anàlisi de la variació denominativa en textos de diferent grau d’especialització de l’àrea de medi ambient », PhD thesis, Université Pompeu Fabra de Barcelone, 2002.\n[GUI 75] GUILBERT L., La créativité lexicale, Larousse, 1975.\n[JAC 96] JACQUES M.-P., « L’emploi de termes réduits comme révélateur de la centralité dans le domaine », Septièmes journées scientifiques du Réseau « Lexicologie, Terminologie, Traduction » de l’Agence Universitaire de la Francophonie : Mots, termes et contextes, Bruxelles, 1996, p. 299–308.\n[JAC 99] JACQUEMIN C., « Syntagmatic and Paradigmatic Representations of Term Variation », ACL ’99 Proceedings of the 37th annual meeting of the Association for Computational Linguistics on Computational Linguistics, 1999, p. 341–348.\n[JAC 00] JACQUES M.-P., « La réduction du syntagme terminologique au fil du discours », Cahiers de grammaire, vol. 25, 2000, p. 93–114.\n[JAC 01] JACQUEMIN C., Spotting and Discovering Terms Through Natural Language Processing, The MIT Press, 2001.\n[JAC 03] JACQUES M.-P., « Approche en discours de la réduction des termes complexes dans les textes spécialisés », PhD thesis, Université de Toulouse, 2003.\n[KOC 91] KOCOUREK R., La langue française de la technique et de la science, Oskar Brandstetter, 1991.\n[LAV 11] LAVAGNINO E., « Terminologie et variations discursives : la réduction des termes complexes à l’épreuve de la linguistique de corpus », PhD thesis, Université de Gènes, 2011.\n[LER 09] LERAT P., « La combinatoire des termes. Exemple : nectar de fruits », Journal of Language and Communication Studies, vol. 42, 2009, p. 211-232.\n[MØL 98] MØLLER B., « À la recherche d’une terminochronie », Méta : journal des traducteurs, vol. 43, no 3, 1998, p. 426–438.\n[NEN 04] NENADIĆ G., ANANIADOU S., MCNAUGHT J., « Enhancing automatic term recognition through recognition of variation », COLING ’04 : Proceedings of the 20th international conference on Computational Linguistics, 2004.\n[NGO 08] NGONGA NGOMO A.-C., « SIGNUM : A Graph Algorithm for Terminology Extraction », Springer LNCS, vol. 4919, 2008, p. 85–95.\n[PAZ 05] PAZIENZA M. T., PENNACCHIOTTI M., ZANZOTTO F. M., « Terminology extraction : an analysis of linguistic and statistical approaches », Studies in Fuzziness and Soft Computing, vol. 185, no 255–280, 2005.\n[POR 89] PORTELANCE C., « Syntagmes et paradigmes », Méta : journal des traducteurs, vol. 34, no 3, 1989, p. 398–404.\n[POR 91] PORTELANCE C., « Fondements linguistiques de la terminologie », Méta : journal des traducteurs, vol. 36, no 1, 1991, p. 64–70.\n[POR 96] PORTELANCE C., « De la nomination : catégorisation et syntagmatique », Applied Semiotics/Sémiotique appliquée, vol. 1, 1996, p. 55–63.\n[PRA 06] PRANDI, Le regole e le scelte. Introduzione alla grammatica italiana, UTET, 2006.\n[SAB 99] SABATINI F., « “Rigidità-esplicitezza” vs. “elasticità-implicitezza” : possibili parametri massimi per una tipologia dei testi », SKYTTE G., SABATINI F., Eds., Linguistica testuale comparativa, Museum Tusculanum Press, 1999, p. 142–172.\n[SAN 02] SANJUAN E., IBEKWE-SANJUAN F., « Terminologie et classification automatique des textes », Actes 6èmes Journées internationales d’Analyse statistique des données textuelles (JADT’2002), 2002, p. 13–15.\n[SAV 03] SAVARY A., JACQUEMIN C., « Reducing Information Variation in Text », Springer Lecture Notes in Artificial Intelligence, vol. 2705, 2003, p. 145–181.\n[SOG 02] SOGLIA S., « Origine, sviluppo e tendenze della terminologia moderna », MAGRIS M. et al., Eds., Manuale di terminologia, Hoepli, 2002.\n[TRA 08] TRAN T. M., TRANCART M., SERVENT D., « Littéracie, SMS et troubles spécifiques du langage écrit », DURAND J., HABERT B., LAKS B., Eds., Congrès mondial de linguistique française, Institut de Linguistique Française, 2008.\n[VEC 08] DE VECCHI D., ESTACHY L., « Pragmaterminologie : les verbes et les actions dans les métiers », Actes de la conférence TOTh 2008, 2008."
    } ],
    "references" : [ {
      "title" : " Une enquête terminologique en espagnol dans le domaine des nouvelles technologies de l’information et de la communication ",
      "author" : [ "ABREU-GARCIA J.-M." ],
      "venue" : "PhD thesis, Institut Télécom-Télécom Bretagne,",
      "citeRegEx" : "ABR 92",
      "shortCiteRegEx" : null,
      "year" : 1992
    }, {
      "title" : " Condiciones de reductibilidad léxica de los sintagmas terminológicos ",
      "author" : [ "A. ADELSTEIN" ],
      "venue" : "Estudios de Lingüística del Español, vol. 16,",
      "citeRegEx" : "ADE 02",
      "shortCiteRegEx" : null,
      "year" : 2002
    }, {
      "title" : " Étude sur la création néonymique",
      "author" : [ "R. ALBER-DEWOLF" ],
      "venue" : "analyse comparée des procédés morphologiques et morphosyntaxiques de formation des termes du domaine de la spectroscopie en anglais, en allemand, en français et en russe », PhD thesis, Université Laval, Québec,",
      "citeRegEx" : "ALB 84",
      "shortCiteRegEx" : null,
      "year" : 1984
    }, {
      "title" : " Les contextes : à la source du terme ",
      "author" : [ "C. ALEXANDRU", "F. GAUDIN" ],
      "venue" : "Mots, termes et contextes. Préactes des VIIes journées scientifiques AUF-LTT,",
      "citeRegEx" : "ALE 05",
      "shortCiteRegEx" : null,
      "year" : 2005
    }, {
      "title" : " Le domaine ",
      "author" : [ "B. DE BESSÉ" ],
      "venue" : "BÉJOINT H., THOIRON P., Eds., Le sens en terminologie, Presses universitaires de Lyon,",
      "citeRegEx" : "BES 00",
      "shortCiteRegEx" : null,
      "year" : 2000
    }, {
      "title" : "Pour une terminologie textuelle ",
      "author" : [ "D. BOURIGAULT", "M. SLODZIAN" ],
      "venue" : "Terminologies nouvelles,",
      "citeRegEx" : "BOURIGAULT and SLODZIAN,? \\Q1999\\E",
      "shortCiteRegEx" : "BOURIGAULT and SLODZIAN",
      "year" : 1999
    }, {
      "title" : " En torno a la frecuencia de algunas estructuras sintácticas en terminología ",
      "author" : [ "M. CARDERO GARCÍA A." ],
      "venue" : "Terminología e Industrias da Lingua. Actas do VII Simpósio Ibero Americano de Terminología, ILTEC,",
      "citeRegEx" : "CAR 03",
      "shortCiteRegEx" : null,
      "year" : 2003
    }, {
      "title" : "LOWESS : A program for smoothing scatterplots by robust locally weighted regression ",
      "author" : [ "W. CLEVELAND" ],
      "venue" : "The American Statistician,",
      "citeRegEx" : "CLEVELAND,? \\Q1981\\E",
      "shortCiteRegEx" : "CLEVELAND",
      "year" : 1981
    }, {
      "title" : "La réduction des unités terminologiques complexes de type syntagmatique ",
      "author" : [ "T. COLLET" ],
      "venue" : "Méta : journal des traducteurs,",
      "citeRegEx" : "COLLET,? \\Q1997\\E",
      "shortCiteRegEx" : "COLLET",
      "year" : 1997
    }, {
      "title" : " La réduction des unités terminologiques complexes de type syntagmatique ",
      "author" : [ "T. COLLET" ],
      "venue" : "PhD thesis, Université de Montréal,",
      "citeRegEx" : "COL 00",
      "shortCiteRegEx" : null,
      "year" : 2000
    }, {
      "title" : "Esquisse d’une nouvelle microstructure de dictionnaire spécialisé reflétant la variation en discours du terme syntagmatique ",
      "author" : [ "T. COLLET" ],
      "venue" : "Méta : journal des traducteurs,",
      "citeRegEx" : "COLLET,? \\Q2004\\E",
      "shortCiteRegEx" : "COLLET",
      "year" : 2004
    }, {
      "title" : "Terminologie textuelle : reformulations et accès aux concepts ",
      "author" : [ "C. CON 05a] CONCEIÇÃO M" ],
      "venue" : "De la mesure dans le termes, Presses Universitaires de Lyon,",
      "citeRegEx" : "M.,? \\Q2005\\E",
      "shortCiteRegEx" : "M.",
      "year" : 2005
    }, {
      "title" : "Équipe de Recherche en Syntaxe et Sémantique",
      "author" : [ "CONDAMINES A.", "Linguistique de corpus et terminologie", "CNRS" ],
      "venue" : "Toulouse,",
      "citeRegEx" : "CON 05b",
      "shortCiteRegEx" : null,
      "year" : 2005
    }, {
      "title" : "ACABIT : une maquette d’aide à la construction automatique de banques terminologiques monolingues ou bilingues ",
      "author" : [ "B. DAILLE" ],
      "venue" : "CLAS A.,",
      "citeRegEx" : "DAILLE,? \\Q1996\\E",
      "shortCiteRegEx" : "DAILLE",
      "year" : 1996
    }, {
      "title" : "An Evaluation of Statistical Scores for Word Association ",
      "author" : [ "B. DAILLE", "É. GAUSSIER", "J.-M. LANGÉ" ],
      "venue" : "The Tbilisi Symposium on Logic, Language and Computation : Selected Papers, CSLI Publications,",
      "citeRegEx" : "DAILLE et al\\.,? \\Q1998\\E",
      "shortCiteRegEx" : "DAILLE et al\\.",
      "year" : 1998
    }, {
      "title" : " Strutture sintattiche dall’analisi computazionale di corpora di italiano ",
      "author" : [ "R. DELMONTE" ],
      "venue" : "Intorno all’italiano contemporaneo. Tra linguistica e didattica, Franco Angeli,",
      "citeRegEx" : "DEL 04",
      "shortCiteRegEx" : null,
      "year" : 2004
    }, {
      "title" : " Terminologie",
      "author" : [ "DESMET" ],
      "venue" : "culture et société. Éléments pour une théorie variationniste de la terminologie et des langues de spécialité », Cahiers du Rifal, vol. 26,",
      "citeRegEx" : "DES 01",
      "shortCiteRegEx" : null,
      "year" : 2001
    }, {
      "title" : "Variabilité et variation en terminologie et langues spécialisées : discours, textes et contextes », Septièmes journées scientifiques du Réseau « Lexicologie, Terminologie",
      "author" : [ "I. DESMET" ],
      "venue" : "Traduction » de l’Agence Universitaire de la Francophonie : Mots, termes et contextes,",
      "citeRegEx" : "DESMET,? \\Q2006\\E",
      "shortCiteRegEx" : "DESMET",
      "year" : 2006
    }, {
      "title" : "L’obsolescence des termes en langues de spécialité : une étude semi-automatique de la « nécrologie » en corpus informatisés, appliquée au domaine de l’écologie ",
      "author" : [ "P. DURY", "P. DROUIN" ],
      "venue" : "Online proceedings of the XVII European LSP Symposium 2009,",
      "citeRegEx" : "DURY and DROUIN,? \\Q2010\\E",
      "shortCiteRegEx" : "DURY and DROUIN",
      "year" : 2010
    }, {
      "title" : "The C-value/NC-value method of Automatic Recognition for Multi-Word Terms ",
      "author" : [ "T. FRA 98] FRANTZI K", "S. ANANIADOU", "J. TSUJII" ],
      "venue" : null,
      "citeRegEx" : "K. et al\\.,? \\Q1998\\E",
      "shortCiteRegEx" : "K. et al\\.",
      "year" : 1998
    }, {
      "title" : " La variació terminològica : anàlisi de la variació denominativa en textos de diferent grau d’especialització de l’àrea de medi ambient ",
      "author" : [ "J. FREIXA A." ],
      "venue" : "PhD thesis, Université Pompeu Fabra de Barcelone,",
      "citeRegEx" : "FRE 02",
      "shortCiteRegEx" : null,
      "year" : 2002
    }, {
      "title" : "La créativité lexicale",
      "author" : [ "L. GUILBERT" ],
      "venue" : "Larousse,",
      "citeRegEx" : "GUI 75",
      "shortCiteRegEx" : null,
      "year" : 1975
    }, {
      "title" : "L’emploi de termes réduits comme révélateur de la centralité dans le domaine », Septièmes journées scientifiques du Réseau « Lexicologie, Terminologie",
      "author" : [ "JACQUES M.-P" ],
      "venue" : "Traduction » de l’Agence Universitaire de la Francophonie : Mots, termes et contextes,",
      "citeRegEx" : "M..P.,? \\Q1996\\E",
      "shortCiteRegEx" : "M..P.",
      "year" : 1996
    }, {
      "title" : "Syntagmatic and Paradigmatic Representations of Term Variation ",
      "author" : [ "C. JACQUEMIN" ],
      "venue" : "ACL ’99 Proceedings of the 37th annual meeting of the Association for Computational Linguistics on Computational Linguistics,",
      "citeRegEx" : "JACQUEMIN,? \\Q1999\\E",
      "shortCiteRegEx" : "JACQUEMIN",
      "year" : 1999
    }, {
      "title" : "Spotting and Discovering Terms Through Natural Language Processing",
      "author" : [ "C. JACQUEMIN" ],
      "venue" : "The MIT Press,",
      "citeRegEx" : "JAC 01",
      "shortCiteRegEx" : null,
      "year" : 2001
    }, {
      "title" : " Approche en discours de la réduction des termes complexes dans les textes spécialisés ",
      "author" : [ "JACQUES M.-P." ],
      "venue" : "PhD thesis, Université de Toulouse,",
      "citeRegEx" : "JAC 03",
      "shortCiteRegEx" : null,
      "year" : 2003
    }, {
      "title" : "La langue française de la technique et de la science",
      "author" : [ "R. KOCOUREK" ],
      "venue" : "Oskar Brandstetter,",
      "citeRegEx" : "KOC 91",
      "shortCiteRegEx" : null,
      "year" : 1991
    }, {
      "title" : " Terminologie et variations discursives : la réduction des termes complexes à l’épreuve de la linguistique de corpus ",
      "author" : [ "E. LAVAGNINO" ],
      "venue" : "PhD thesis, Université de Gènes,",
      "citeRegEx" : "LAV 11",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : " Enhancing automatic term recognition through recognition of variation ",
      "author" : [ "G. NENADIĆ", "S. ANANIADOU", "J. MCNAUGHT" ],
      "venue" : "COLING ’04 : Proceedings of the 20th international conference on Computational Linguistics,",
      "citeRegEx" : "NEN 04",
      "shortCiteRegEx" : null,
      "year" : 2004
    }, {
      "title" : " Terminology extraction : an analysis of linguistic and statistical approaches ",
      "author" : [ "T. PAZIENZA M.", "M. PENNACCHIOTTI", "M. ZANZOTTO F." ],
      "venue" : "Studies in Fuzziness and Soft Computing, vol. 185, n 255–280,",
      "citeRegEx" : "PAZ 05",
      "shortCiteRegEx" : null,
      "year" : 2005
    }, {
      "title" : "Introduzione alla grammatica italiana",
      "author" : [ "PRANDI", "Le regole e le scelte" ],
      "venue" : "UTET,",
      "citeRegEx" : "PRA 06",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Rigidità-esplicitezza” vs. “elasticità-implicitezza” : possibili parametri massimi per una tipologia dei testi ",
      "author" : [ "F. SABATINI" ],
      "venue" : "Linguistica testuale comparativa, Museum Tusculanum Press,",
      "citeRegEx" : "SABATINI,? \\Q1999\\E",
      "shortCiteRegEx" : "SABATINI",
      "year" : 1999
    }, {
      "title" : "Terminologie et classification automatique des textes ",
      "author" : [ "E. SAN 02] SANJUAN", "F. IBEKWE-SANJUAN" ],
      "venue" : "Actes 6èmes Journées internationales d’Analyse statistique des données textuelles (JADT’2002),",
      "citeRegEx" : "SANJUAN and IBEKWE.SANJUAN,? \\Q2002\\E",
      "shortCiteRegEx" : "SANJUAN and IBEKWE.SANJUAN",
      "year" : 2002
    }, {
      "title" : "Reducing Information Variation in Text ",
      "author" : [ "A. SAV 03] SAVARY", "C. JACQUEMIN" ],
      "venue" : "Springer Lecture Notes in Artificial Intelligence,",
      "citeRegEx" : "SAVARY and JACQUEMIN,? \\Q2003\\E",
      "shortCiteRegEx" : "SAVARY and JACQUEMIN",
      "year" : 2003
    }, {
      "title" : " Origine",
      "author" : [ "S. SOGLIA" ],
      "venue" : "sviluppo e tendenze della terminologia moderna », MAGRIS M. et al., Eds., Manuale di terminologia, Hoepli,",
      "citeRegEx" : "SOG 02",
      "shortCiteRegEx" : null,
      "year" : 2002
    }, {
      "title" : " Littéracie",
      "author" : [ "M. TRAN T.", "M. TRANCART", "D. SERVENT" ],
      "venue" : "SMS et troubles spécifiques du langage écrit », DURAND J., HABERT B., LAKS B., Eds., Congrès mondial de linguistique française, Institut de Linguistique Française,",
      "citeRegEx" : "TRA 08",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : " Pragmaterminologie : les verbes et les actions dans les métiers ",
      "author" : [ "D. DE VECCHI", "L. ESTACHY" ],
      "venue" : "Actes de la conférence TOTh 2008,",
      "citeRegEx" : "VEC 08",
      "shortCiteRegEx" : null,
      "year" : 2008
    } ],
    "referenceMentions" : [ {
      "referenceID" : 34,
      "context" : "Ce n’est que récemment que l’intérêt pour la variation des termes a été l’objet de débats et d’analyses [SOG 02].",
      "startOffset" : 104,
      "endOffset" : 112
    }, {
      "referenceID" : 9,
      "context" : "Le terme complexe est une unité monoréférentielle (critère de monoréférentialité) qui appartient à une langue de spécialité (critère terminologique), et qui représente une notion univoque (critère notionnel) [COL 00].",
      "startOffset" : 208,
      "endOffset" : 216
    }, {
      "referenceID" : 9,
      "context" : "ture binaire1, composée par deux éléments qui peuvent être simples ou composés [COL 00].",
      "startOffset" : 79,
      "endOffset" : 87
    }, {
      "referenceID" : 0,
      "context" : "[ABR 92]",
      "startOffset" : 0,
      "endOffset" : 8
    }, {
      "referenceID" : 9,
      "context" : "Pour l’instant, nous n’avons pas considéré les relations hiérarchiques entre les éléments, qui pourraient nous permettre d’envisager les rapports reliant les différentes composantes du terme complexe [COL 00].",
      "startOffset" : 200,
      "endOffset" : 208
    }, {
      "referenceID" : 9,
      "context" : "La structure syntagmatique du terme complexe peut être schématiquement représentée comme suit [COL 00] :",
      "startOffset" : 94,
      "endOffset" : 102
    }, {
      "referenceID" : 21,
      "context" : "Sur la base des recherches de Guilbert [GUI 75] et Portelance [POR 89], on peut affirmer que la réduction coïncide avec la suppression d’une information non différentielle, c’est-à-dire l’élément ou les éléments non fondamentaux pour la catégorisation du terme.",
      "startOffset" : 39,
      "endOffset" : 47
    }, {
      "referenceID" : 3,
      "context" : "Toutefois, cette acception limite ce mécanisme aux seuls phénomènes sociolinguistiques, sans tenir compte du fait que la réduction peut répondre également des exigences contextuelles reliées au contexte et au cotexte [ALE 05] ; cette acception diminue, en outre, la valeur de la réduction et exclut la possibilité que ce mécanisme puisse former des alternatives au syntagme plein.",
      "startOffset" : 217,
      "endOffset" : 225
    }, {
      "referenceID" : 35,
      "context" : "En outre, la variation par réduction satisfait le besoin d’économie de la langue [TRA 08].",
      "startOffset" : 81,
      "endOffset" : 89
    }, {
      "referenceID" : 25,
      "context" : "La finalité de la réduction est donc double : sur le plan de l’encodage [JAC 03], elle permet une économie d’énergie, sur le plan du décodage [COL 00, p.",
      "startOffset" : 72,
      "endOffset" : 80
    }, {
      "referenceID" : 21,
      "context" : "Selon Guilbert [GUI 75] et Portelance [POR 89], nous observons que la réduction est un mécanisme qui supprime l’information non-différentielle, c’est-à-dire l’élément ou les éléments qui ne caractérisent plus le terme complexe.",
      "startOffset" : 15,
      "endOffset" : 23
    }, {
      "referenceID" : 2,
      "context" : "Par exemple Aler-Dewolw [ALB 84] parle d’« ellipses contextuelle et néonymique », Kocourek [KOC 91] d’« ellipses contextuelle et lexicale », Jacques [JAC 96] définit les variantes comme « reprise anaphorique » et « terme réduit sans antécédents textuels ».",
      "startOffset" : 24,
      "endOffset" : 32
    }, {
      "referenceID" : 26,
      "context" : "Par exemple Aler-Dewolw [ALB 84] parle d’« ellipses contextuelle et néonymique », Kocourek [KOC 91] d’« ellipses contextuelle et lexicale », Jacques [JAC 96] définit les variantes comme « reprise anaphorique » et « terme réduit sans antécédents textuels ».",
      "startOffset" : 91,
      "endOffset" : 99
    }, {
      "referenceID" : 27,
      "context" : "Dans cet article (ainsi que dans [LAV 11]) nous avons choisi les termes de « réductions lexicale et anaphorique », qui nous semblent les plus transparents.",
      "startOffset" : 33,
      "endOffset" : 41
    }, {
      "referenceID" : 30,
      "context" : "Si la langue de spécialité est perçue comme une variété de la langue générale [PRA 06], la variation des langues de spécialité est soumise aux mêmes critères que la langue générale (variations diachroniques, diatopiques et diastratiques).",
      "startOffset" : 78,
      "endOffset" : 86
    }, {
      "referenceID" : 16,
      "context" : ") [DES 01].",
      "startOffset" : 2,
      "endOffset" : 10
    }, {
      "referenceID" : 16,
      "context" : "2) niveau situationnel (contexte social des activités communicatives, lieu, temps, nombre, rôle et relations entre les locuteurs) ; 3) niveau du contenu sémantique (sujet d’un texte, différentes perspectives et développement thématique) ; 4) niveau formel-grammatical (formes linguistiques et non linguistiques, aspects grammaticaux, ressources syntaxiques et lexicales) [DES 01].",
      "startOffset" : 371,
      "endOffset" : 379
    }, {
      "referenceID" : 12,
      "context" : "Notre projet se base sur deux approches différentes des corpus : d’une part, l’analyse linguistique du phénomène de la réduction s’appuie sur une étude des corpus qui ont été constitués ad hoc, donc selon une approche corpus-based ; d’autre part, la validation expérimentale est basée sur des corpus ayant été constitués en vue, non pas de l’analyse de la réduction, mais de la validation des conclusions tirées de l’étude linguistique, donc selon une approche corpus-driven [CON 05b].",
      "startOffset" : 475,
      "endOffset" : 484
    } ],
    "year" : 2011,
    "abstractText" : "RÉSUMÉ. Nous étudions, par des méthodes statistiques sur des corpus français et italiens, le phénomène de réduction des termes complexes dans les langues de spécialité. Il existe deux types de réductions : anaphorique et lexicale. Nous montrons que la réduction anaphorique dépend du type de discours (de vulgarisation, pédagogique, spécialisé) mais ne dépend ni du domaine, ni de la langue, alors que la réduction lexicale dépend du domaine et est plus fréquente dans les domaines techniques à évolution rapide. D’autre part, nous montrons que la réduction anaphorique a tendance à suivre la forme pleine du terme, nous définissons une notion d’arbre anaphorique de terme et nous étudions ses propriétés. Concernant la réduction lexicale, nous tentons de démontrer statistiquement qu’il existe une notion de cycle de vie de terme, où la forme pleine est progressivement remplacée par une réduction lexicale.",
    "creator" : "LaTeX with hyperref package"
  }
}