{
  "name" : "1106.5308.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Clasificarea distribuită a mesajelor de e-mail",
    "authors" : [ "Florin Pop", "Diana Petrescu", "Ştefan Trauşan-Matu" ],
    "emails" : [ "florinpop@cs.pub.ro", "diana.petrescu@gmail.com", "trausan@racai.ro" ],
    "sections" : [ {
      "heading" : null,
      "text" : "Clasificarea distribuită a mesajelor de e-mail\nFlorin Pop florinpop@cs.pub.ro\nDiana Petrescu diana.petrescu@gmail.com\nŞtefan Trauşan-Matu trausan@racai.ro\nFacultatea de Automatica şi Calculatoare, Universitatea “Politehnica” din Bucureşti Splaiul Independenţei, nr.313, Bucureşti, Sector 6, 060042 România"
    }, {
      "heading" : "REZUMAT",
      "text" : "O componentă de bază în cadrul aplicaţiilor internet o constituie\npoşta electronică şi diversele sale implicaţii. Lucrarea propune\nun mecanism de clasificare automată a mesajelor de poşta\nelectronică şi de creare dinamică a categoriilor la care aparţin\naceste mesaje. Mecanismele propuse vor avea la bază tehnici de\nprelucrarea limbajului natural şi vor fi proiectate pentru a uşura\ninteracţiunea om-maşina în aceasta direcţie."
    }, {
      "heading" : "Categorii şi descriptori ai subiectelor",
      "text" : "I.7 Document and text processing."
    }, {
      "heading" : "Termeni generali",
      "text" : ""
    }, {
      "heading" : "Algorithms, Documentation, Experimentation, Human Factors.",
      "text" : ""
    }, {
      "heading" : "Cuvinte-cheie",
      "text" : "Poşta electronică, clasificare, prelucrarea limbajului natural, calcul distribuit."
    }, {
      "heading" : "1. INTRODUCERE",
      "text" : "Una dintre acţiunile cotidiene pentru orice persoană, din orice domeniu este citirea poştei electronice (e-mail). Mesajele trimise pot fi extrem de numeroase şi de mai multe feluri, fiind necesar un mecanism de clasificare a acestora pe categorii. Clienţii actuali de (programele care furnizează accesul la) e-mail au posibilitatea de a crea directoare şi reguli speciale care se transpun în mecanisme de filtrare a mesajelor primite. Prelucrarea automata şi clasificarea făcută pe baza unei astfel de prelucrări poate duce la o organizare adecvată a mesajelor. Ne propunem descrierea unui mecanism de clasificare automată a mesajelor primite prin poşta electronica şi de creare a categoriilor cărora pot aparţine aceste mesaje. Am imaginat o arhitectura bazată pe grafuri bipartite în care o mulţime reţine şi modelează mesajele de e-mail, iar cealaltă mulţime conţine categoriile de mesaje. Un mesaj poate aparţine mai multor domenii în această arhitectură. Mecanismul trebuie să conţină un algoritm de decizie care este baza mecanismului de clasificare.\nInteracţiunea dintre utilizator şi un client de e-mail dotat cu acest mecanism va fi eficientă deoarece lucrul pe diferite domenii va fi concentrat, având la dispoziţie toate mesajele ce ţin de domeniul respectiv, dar care ar putea fi utile şi unui alt domeniu. Ne propunem de asemenea şi analiza performanţei sistemului şi posibilitatea includerii acestuia în clienţii de e-mail existenţi. În secţiunea următoare se face o prezentare a principalilor clienţi de mail si a facilităţilor acestora. În secţiunea a 3-a este propus mecanismul de analiză, de prelucrare şi de stocare a mesajelor de e-mail."
    }, {
      "heading" : "2. CLIENŢI DE E-MAIL EXISTENŢI",
      "text" : "Poşta electronica, sau pe scurt, e-mail, reprezintă o metodă de a compune, trimite şi primi mesaje pe cale electronică [1]. Termenul de e-mail se foloseşte atât cu referinţă la sistemul de e-mail prin Internet, bazat pe protocolul SMTP (Simple Mail Transport Protocol), cât şi la cel bazat pe comunicaţia prin Intranet. E-mail-ul datează încă din 1965, precedând astfel reţeaua Internet. Sistemul de e-mail s-a extins rapid, permiţând utilizatorilor să transfere mesaje între calculatoare. Printre primele sisteme care au avut aceasta facilitate se număra AUTODIN (1966) şi SAGE [1]. Clienţii de e-mail reprezintă programe de calculator utilizate pentru citirea şi scrierea de mesaje e-mail. Iniţial, aceste programe s-au dorit a fi simple facilităţi pentru citirea mesajelor şi salvarea lor, dar, o data cu dezvoltarea reţelei Internet, clienţii de mail au evoluat ajungând azi sa ofere numeroase facilitaţi precum: crearea de filtre personalizate, administrarea mai multor conturi simultan, administrarea de grupuri, signaturi personalizate, etc. Asemenea protocoalelor de comunicaţie cu serverul de mail, cei mai mulţi clienţi de e-mail respectă protocoalele POP3 (Post Office Protocol version 3) şi IMAP (Internet Message Access Protocol). IMAP este folosit în special pentru stocarea e-mail-urilor pe server, în timp ce POP3 este folosit pentru descărcarea mesajelor la client. Protocolul pentru trimiterea mesajelor este SMTP. Un alt standard important care este suportat de marea majoritate a clienţilor de e-mail este MIME (Multiporpose\nInternet Mail Extension) folosit pentru trimiterea fişierelor ataşate mesajului propriu-zis. In prezent exista o larga varietate de clienţi de mail:\n- clienţi cu interfaţa grafică: Microsoft Outlook Express, Microsoft Outlook, Mozilla Thunderbird, Mozilla Mail & Newsgroups, Netscape, Opera M2, Lotus Notes, Appel Mail, etc.\n- clienţi în mod text: Elmo, Gnus, Pine, etc. - clienţi de e-mail pentru Web: Cidadel, WebPine,\nSquirrelMail, Zimbra, etc. Mulţi dintre aceşti clienţi de e-mail au filtre statice extrem de performante. Aceste filtre se folosesc atât pentru identificarea mesajelor tip „spam” (mesaje nedorite) cat şi pentru organizarea emailurilor pe directoare în funcţie de anumite categorii. Având în vedere faptul ca aceste filtre sunt automate, uneori apar erori, de exemplu mesaje care nu sunt spam sunt marcate ca spam. Rata erorilor este însă foarte scăzuta. Nici un filtru automat nu este perfect [2].\nFigura 1: Un exemplu de organizare a mesajelor\nÎn Figura 1 este prezentat un exemplu de organizare a mesajelor cu ajutorul filtrelor statice. Au fost create categorii pe trei nivele. Există categorii principale şi subcategorii ale acestora. Anumiţi clienţi de e-mail folosesc o metodă de filtrare numită filtrare Bayesiană [8] Aceste filtre sunt capabile să înveţe ca urmare a acţiunilor utilizatorului. Ele pornesc de la un set de reguli iniţiale, iar pe măsură ce utilizatorul identifică erori în rezultatul filtrării, îşi actualizează setul de reguli. Filtrele Bayesiene se folosesc în special pentru filtrarea mesajelor de tip spam, rata erorii fiind mică datorită faptului că învaţă pe măsură ce utilizatorul marchează mesajele ca spam. Nu toţi clienţii de e-mail beneficiază de aceasta facilitate. Pentru cei care nu o au, există tehnologia SpamSieve, care creează aceste filtre Bayesiene în clientul de e-mail.\nIn continuare vom prezenta câţiva clienţi de e-mail existenţi, posibilităţile şi limitările lor în ceea ce priveşte filtrarea automata a mesajelor."
    }, {
      "heading" : "2.1 Mozilla Thunderbird",
      "text" : "Mozilla Thunderbird este un client de e-mail care rulează pe sistemele de operare Windows, Mac OS X, Linux, BSD şi Unix. Suportă protocoale de comunicaţie POP3, IMAP4, SMTP, NNTP şi SMTP/Auth. Thunerbird poate administra mai multe conturi de e-mail şi de ştiri. De asemenea, pune la dispoziţie facilităţi precum: căutarea rapida a unui mesaj după diferite categorii – subiectul mesajului, cel care la trimis, destinatarul principal şi cei secundari, etc., salvarea mesajelor în diferite directoare virtuale, filtrare de mesaje şi etichetarea mesajelor. Pentru filtrarea mesajelor se foloseşte un filtru bayesian, în combinaţie cu o listă de adrese permise. Utilizatorul îşi poate crea propriile filtre pentru fiecare cont de mail. Pentru crearea unui filtru este necesar ca utilizatorul să stabilească regulile după care se face filtrarea – numele celui care trimite mesajul sau subiectul acestuia, spre exemplu, şi să decidă ce acţiune se va efectua asupra mesajului – va fi mutat într-un director anume, va fi şters, etc. Aceste acţiuni se fac manual, iar programul nu este capabil sa înveţe din corecţiile utilizatorului [3]."
    }, {
      "heading" : "2.2 Outlook Express",
      "text" : "Acest client rulează numai pe sistemul de operare Windows. Este unul dintre cei mai populari clienţi de email deoarece se distribuie împreună cu sistemul de operare Windows, însă este recunoscut şi ca unul dintre cei mai vulnerabil clienţi în faţa virusurilor şi a “viermilor” [1]. Respectă protocoale de comunicaţie precum POP3, SMTP, IMAP4. Outlook Express poate administra mai multe conturi de email şi de ştiri şi permite crearea de filtre pentru fiecare cont în parte. Similar ca şi la Thunderbird, utilizatorul trebuie să îşi creeze propriile reguli şi acţiuni pentru mesajele pe care le doreşte filtrate. O deficienţă majoră a acestui client este lipsa unui filtru de spam eficient. Alternativa o reprezintă blocarea adresei celui care trimite e-mail-ul identificat de utilizator ca fiind spam [4]."
    }, {
      "heading" : "2.3 Eudora 6",
      "text" : "Eudora rulează pe sistemele de operare Windows şi Mac OS X. Respectă protocoalele POP3, SMTP şi IMAP. Clientul de e-mail Eudora are un filtru bayesian încorporat. Pentru a fi eficient, utilizatorul marchează mesajele spam, iar pe baza acestui marcaj, Eudora îşi construieşte regulile pe baza cărora se decide dacă mesajele sunt tratate ca spam sau nu.\nEudora permite organizarea mesajelor în directoare şi crearea unor interogări complexe pentru identificarea rapidă a unui anumit mesaj. Un dezavantaj al acestui client este faptul ca nu permite stocarea mesajelor trimise şi pe server (aşa cum ar trebui conform IMAP). Astfel, mesajele trimise nu pot fi accesate decât de pe calculatorul pe care au fost primite [5]."
    }, {
      "heading" : "2.3 Pine",
      "text" : "Pine este un client de e-mail folosit pe sistemele de operare Windows, Mac OS X şi Unix. Versiunea pentru Unix este tip linie de comandă. – Pine este un client de email mod text. Pine acceptă protocoalele de comunicaţie POP3, SMTP, IMAP4, NNTP (Network News Transfer Protocol) şi LDAP (Lightweight Directory Access Protocol). Acest client este capabil sa administreze mai multe conturi de e-mail şi permite utilizatorului să îşi definească reguli de filtrare pe mesaje. Aceste reguli se scriu într-un fişier de configuraţie. Întrucât este un client mod text, editarea regulilor este relativ dificilă pentru un utilizator neexperimentat [6]."
    }, {
      "heading" : "2.4 SquirrelMail",
      "text" : "SquirrelMail este un client de e-mail pentru browsere Web. Avantajul sau este dat de faptul ca poate fi instalat pe orice server Web care are PHP4 şi are acces la un server IMAP şi SMTP. Acest client permite utilizatorului să îşi citească mesajele de pe orice calculator prin intermediul unui browser Web uşor de folosit. Mesajele pot fi organizate în directoare, se pot crea filtre pentru sortarea automata a mesajelor. În ceea ce priveşte filtrele pentru spam, acestea se bazează pe o listă neagra de adrese – mesajele de la aceste adrese fiind considerate spam. Un dezavantaj al acestui client este faptul că nu păstrează conexiunile IMAP. Acesta provine din faptul ca este realizat în PHP [7]. Aceste aspecte privitoare la metodele de prelucrare a mesajelor de poştă electronică duc la o direcţie în cadrul interacţiunii om-maşina, direcţie în care se pot dezvolta diverse funcţionalităţi în funcţie de utilizatori. Un exemplu care trebuie menţionat ar fi acela al folosirii acestui serviciu de poştă electronică de către persoanele cu dizabilităţi de vedere. Pentru aceştia, categoriile de mesaje şi crearea lor automată ar însemna un proces de auto-organizare menit să înlesnească accesul la informaţia primită."
    }, {
      "heading" : "3. MODELUL ARHITECTURAL PROPUS",
      "text" : "Din analiza clienţilor de e-mail şi mai ales a funcţionalităţii acestora, propunem un model ce poate fi integrat într-un astfel de client şi care poate fi configurat\nde către utilizatori. Vom prezenta un model al metodei de analiză şi un model funcţional."
    }, {
      "heading" : "3.1 Modelul intern",
      "text" : "Modelul ce corespunde cu descrierea făcută în introducere este acela al unui graf bipartit (vezi Figura 2). Cele două mulţimi ale acestui graf descriu cele două entităţi: mesajul de poştă electronică şi categoriile.\nFigura 2. Modelul intern\nPrima mulţime, cea a mesajelor de e-mail, poate fi considerată în primă formă chiar mulţimea mesajelor în formă brută venite de la serverul de e-mail. Se poate adăuga un rezumat al acestuia şi un număr de cuvinte cheie care pot descrie cât mai bine conţinutul mesajelor. Pe baza acestora se poate construi mecanismul de clasificare. Ca rezultat, vom avea legăturile descrise în figura 2. Tehnicile de analiză şi prelucrare a conţinutului mesajelor pot fi diverse metode specifice prelucrării limbajului natural. O categorie care poate fi luată în seamă este cea a metodelor de minerit de date şi de prelucrare statistică.\nFigura 3. Analiza în detaliu: sub-categorii\nMulţimea categoriilor este rezultatul procesului de clasificare. Iniţial putem avea o mulţime vidă a categoriilor sau o mulţime creată de utilizator. În funcţie de rezultatele mecanismului de clasificare se pot crea noi categorii. Fiecare mesaj va trebui să aparţină uneia sau mai multor categorii. Fiecare categorie va conţine cel puţin un mesaj. Pentru fiecare categorie în parte se poate crea un mecanism specific de clasificare, ce va avea ca rezultat crearea de sub-categorii (vezi figura 3). Rolul acestor sub-categorii este de a oferi o rezoluţie cât mai bună asupra informaţiilor dintr-o categorii.\nMecanismul de clasificare poate fi conceput ca un mecanism distribuit în care pe mai multe maşini pot exista mai mult servere de e-mail ce pot stoca mesajele primite de un utilizator (de exemplu un utilizator cu mai multe adrese de e-mail stocate pe servere diferite). Utilizatorul va percepe şi va avea acces la informaţia conţinută de mesaje din orice locaţie cu ajutorul clientului de e-mail care îi poate oferi această facilitate. Componenta distribuită a mecanismului va conduce la stocarea mesajelor doar pe server, categoriile conţinând descrierea şi locaţia unui mesaj."
    }, {
      "heading" : "3.2 Mecanismul de comunicaţie",
      "text" : "Accesul la mesajele de mail care sunt stocate pe server poate fi făcut prin intermediul protocoalelor cunoscute1. Mecanismul de comunicaţie este descris în Figura 4.\nFigura 4. Mecanismul de comunicaţie\nInteracţiunea om-calculator este evidenţiată în acest model de comunicaţie doar la nivelul clientului. Este astfel pus la dispoziţie un mecanism ergonomic care nu necesită cunoştinţe avansate de protocoale de comunicaţie sau de calcul distribuit. Folosind mecanismele de calcul distribuit şi implementând mecanismul la nivel de client, putem identifica o componentă centralizată, la nivel de client (în care toate categoriile trebuie sa fie vizibile) susţinută de partea de calcul distribuit in procesul clasificării.\n1 Nu considerăm necesară modificarea acestor protocoale (cum\nar fi SMTP, POP3 sau alte protocoale), toate acţiunile care se vor face în procesul de clasificare fiind implementate la nivelul clienţilor de mail.\nÎntreg procesul de comunicaţie din Figura 4 se suprapune peste protocoale existente. Utilizatorul va avea la dispoziţie toate mesajele corespunzătoare unei categorii. Se pot, de asemenea imagina diverse posibilităţi de configurare a categoriilor şi de stocare a informaţiilor corespunzătoare (baze de date, fişiere XML, etc.)."
    }, {
      "heading" : "4. CONCLUZII",
      "text" : "Am pornit de la analiza clienţilor de e-mail care sunt aplicaţii cu diverse implicaţii în domeniul interacţiunii om-maşină, analizând funcţionalităţile acestora. Bazândune pe acestea, am descris un model de clasificare a mesajelor de e-mail lăsând ca dezvoltări ulterioare implementarea şi testarea sistemului, precum şi compararea acestuia cu diverse sisteme existente. Se va elabora un model de evaluare care va ţine cont de diversele specificaţii ale utilizatorilor. Implementarea mecanismelor poate aduce componente noi clienţilor de e-mail fără modificarea funcţionalităţii acestora. Analiza mesajelor poate conduce la folosirea de noi tehnici de semantică web şi de prelucrare a informaţiilor, toate acestea aducând un element de noutate în interacţiunea om-calculator pe partea de poştă electronică.\n5. REFERINŢE [1] ***, Situl Wikipedia,\nhttp://en.wikipedia.org/wiki/Email [2] ***, Situl Open Door Networks,\nhttp://www.opendoor.com/afn/AFNSpamClientFilter. html\n[3] ***, Situl Mozilla Thunderbird, www.mozilla.com/thunderbird\n[4] ***, Situl Microsoft Outlook Express, http://www.microsoft.com/windows/oe\n[5] ***, Situl Eudora, http://www.eudora.com [6] ***, Situl Pine, http://www.washington.edu/pine [7] ***, Situl SquirrelMail, http://www.squirrelmail.org [8] ”A plan for spam”, Jonathan Zdziarski's, August\n2002"
    } ],
    "references" : [ ],
    "referenceMentions" : [ ],
    "year" : 2006,
    "abstractText" : "Una dintre acţiunile cotidiene pentru orice persoană, din orice domeniu este citirea poştei electronice (e-mail). Mesajele trimise pot fi extrem de numeroase şi de mai multe feluri, fiind necesar un mecanism de clasificare a acestora pe categorii. Clienţii actuali de (programele care furnizează accesul la) e-mail au posibilitatea de a crea directoare şi reguli speciale care se transpun în mecanisme de filtrare a mesajelor primite. Prelucrarea automata şi clasificarea făcută pe baza unei astfel de prelucrări poate duce la o organizare adecvată a mesajelor.",
    "creator" : "PScript5.dll Version 5.2"
  }
}