{
  "name" : "1302.4619.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : null,
    "authors" : [ ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : null,
      "text" : "Compactified Horizontal Visibility Graph for the Language Network\nD.V. Lande1,2, A.A.Snarskii1,2\n1Institute for information recording, NAS Ukraine, Kiev, Ukraine 2National Technical University “Kiev Polytechnic Institute”, Kiev, Ukraine\nA compactified horizontal visibility graph for the language network is proposed."
    }, {
      "heading" : "It was found that the networks constructed in such way are scale free, and have a",
      "text" : "property that among the nodes with largest degrees there are words that determine\nnot only a text structure communication, but also its informational structure.\nKey words: language network, complex network, scale-free network, visibility\ngraph.\nConstruction of networks with text elements, words, phrases or fragments of\nnatural language as nodes in some cases allows to detect the structural elements of the text critical for its connected structure and find informationally significant elements, as well as words that are secondary for understanding of the text. Such networks may also be used to identify unconventional text components, such as collocations, supra-phrasal units [1], as well as for finding similar fragments in different texts [2].\nThere is a multitude of approaches to constructing networks from the texts\n(so-called language networks) and different ways of interpreting nodes and links, which causes, accordingly, different representation of such networks. Nodes are connected if corresponding words are either adjacent in the text [3, 4], or are in a single sentence [5], or are syntactically [6, 7] or semantically [8, 9] connected.\nAt the intersection of digital signal processing (DSP) theory and complex\nnetwork theory there are several ways of constructing networks from the time series, among those are visibility graph construction methods (see survey [10]), namely the horizontal visibility graph (HVG) [11,12]. Based on these approaches, networks can also be constructed from texts in which numeric values are assigned in some manner to each word or phrase. The examples of functions assigning a number to a word are: ordinal number of a unique word in a text, length of the word, “weight” of the word in a text, e.g., generally accepted TFIDF metric (canonically, a product of the term frequency in a text fragment and a\nbinary logarithm of the inverse number of text fragments containing this word – inverse document frequency) or its modifications [13, 14] and other word weight estimates.\nIn this paper, the standard deviation estimate of word weight is used for\nconstructing word networks [15]. If all the words in the text of N words are numbered in succession (let 1,...n N= be the ordinal number of the word in a text,\nthe word position), layout of a certain word A can be designated as ( )kA n , where 1,2,...,k K= denotes the number of occurrence of this word in a text, and n is a\nposition of this word in a text. For example, ( )3 50A means that the third occurrence of the word A has position 50 in the text.\nThe distance between successive occurrences of the word in these terms\nwould be ( ) ( )1k k kA A m A n m n+∆ = − = − , where m and n are the positions of the 1k + - th k -th occurrences of the word A in the text, respectively.\nStandard deviation estimate proposed in [15] is calculated as follows:\n22\nA\nA A\nA σ\n∆ − ∆ =\n∆ , (1)\nwhere A∆ is a mean value of the sequence 1 2, ,..., KA A A∆ ∆ ∆ , 2A∆ is a mean value\nof 2 2 21 2, ,..., KA A A∆ ∆ ∆ , and K is a number of occurrences of the word A in the text.\nAs opposed to other series examined in DSP theory, the series of numerical\nvalues assigned to words are transformed into horizontal visibility graphs (HVG), where each node not only has a corresponding numerical value, but also the corresponding word itself.\nThe process of constructing the language network using HVG consists of two\nstages. At the first stage, the traditional HVG is constructed [16]. To do that a series of nodes is put on the horizontal axis, where each node corresponds to a word in order of occurrence in the text, and standard deviation estimates are put on the vertical axis (visually a histogram, see fig. 1). There is a connection between nodes if they are in “line of sight” with each other, i.e., if they can be connected by a horizontal line that does not cross any other histogram bar. This\n(geometric) criterion can be written down as follows, according to [10,11]: the two nodes (words), e.g., ( )3B n and ( )7 5C m n= + , are connected if (see fig. 1)\n,n m pσ σ σ> , for all n p m< < . (2)\nThe process of constructing can be algorithmized. For example, in figure 1\nthe word node ( )1 2A n + is considered incident (and is connected with edges) to the words ( )3B n and ( )1 5C n + , ( )3B n being the closest word to the left of ( )1 2A n + with\na standard deviation estimate n Bσ = σ greater than that of the word А: 2n A+σ = σ , and ( )7 5C m n= + being the closest word to the right of ( )1 2A n + , for which m Aσ > σ .\nAt the second stage, the derived network is compactified. All the nodes\ncorresponding to a single word, e.g., the word A , are combined into a single node (naturally, occurrence numbers and positions of the words are lost). The connections of theses nodes are also combined. Note that there is no more than one edge left between any pair of nodes, multiple connections are removed (see fig. 2).\nThis means, in particular, that the degree (number of connections) of the\nnode A does not exceed the sum of degrees ( )k k A n∑ . As a result, the new network of words – compactified horizontal visibility graph (CHVG) – is constructed (fig. 2).\nTexts used for CHVG construction were the novels “The Master and\nMargarita” (original version) by Mikhail Bulgakov and “Moby-Dick; or, The Whale” by Herman Melville, as well as arrays of news information from the Web.\nFor all CHVG networks of words described here, the degree distribution is\nclose to power law (fig. 3), i.e., these networks are scale free.\nFor comparison, was studied for the simplest language networks, where\nduring the first stage of the network construction adjacent words were connected, and, at the second stage, the network was compactified. It is obvious that the weight of a node in such network corresponds to the word frequency, and the distribution of these weights follows the Zipf law [18]. The most connected are the nodes corresponding to the most frequently occurring words – conjunctions, prepositions, etc., which are very important for the text coherence, but are of little interest for the aspect of informational structure.\nAmong the nodes with largest degrees, alongside with personal pronouns\nand other function words (particles, prepositions, conjunctions, etc.), are the words, which determine the informational structure of the text [16, 17].\nLet Ψ be a set of N different words (in our case N = 100) corresponding to the\nlargest-weight nodes of the aforementioned simple language network, and let Λbe a set of words corresponding to the largest-weight nodes of the CHVG. Then the set \\Ω = Λ Ψwill contain informational words, which are also important for the text coherence. Appendix gives juxtaposition of the top 100 largest-weight nodes for the two types of language networks constructed from the novels “The Master and Margarita” by Michael Bulgakov and “Moby-Dick; or, The Whale” by Herman Melville.\nIn particular, the Ω set of the CHVG built from “Мастер и Маргарита”\ncontains such words as Иван, Мастер, Варенуха, Берлиоз, Бегемот, Римский, профессор, Левий, Иешуа.\nThe following results were obtained from studying the language networks:\n1. An algorithm compactified horizontal visibility graph (CHVG) was\nproposed.\n2. Language networks were built from different texts based on series of\nstandard deviation estimates and CHVG.\n3. In CHVG obtained from literary works, among the largest-degree nodes\nthere are words responsible not only for the coherence of the text, but also for its informational structure. They reflect the meaning of the mentioned texts.\nReferences\n1. Dijk van T.A. Text and Context: Explorations in the Semantics and Pragmatics of Discourse. – London: Longman. –357 p. (1977). 2. Broder A. Identifying and Filtering Near-Duplicate Documents, COM’00 // Proceedings of the 11th Annual Symposium on Combinatorial Pattern Matching. – P. 1-10 (2000). 3. Ferrer-i-Cancho R., Sole R. V. The small world of human language // Proc. R. Soc. Lond. – B 268, 2261 (2001). 4. Dorogovtsev S.N., Mendes J. F. F. Language as an evolving word web // Proc. R. Soc. Lond. – B 268, 2603 (2001). 5. Caldeira S. M. G., Petit Lobao T. C., Andrade R. F. S., Neme A., Miranda J. G. V. The network of concepts in written texts // Preprint physics/0508066 (2005). 6. Ferrer-i-Cancho R., Sole R.V., Kohler R. Patterns in syntactic dependency networks // Phys. Rev. E 69, 051915 (2004). 7. Ferrer-i-Cancho R. The variation of Zipf's law in human language. // Phys. Rev. E 70, 056135 (2005). 8. Motter A. E., de Moura A. P. S., Lai Y.-C., Dasgupta P. Topology of the conceptual network of language // Phys. Rev. E 65, 065102(R) (2002). 9. Sigman M., Cecchi G. A. Global Properties of the Wordnet Lexicon // Proc. Nat. Acad. Sci. USA, 99, 1742 (2002). 10. Nunez A. M., Lacasa L., Gomez J. P., Luque B. Visibility algorithms: A short review // New Frontiers in Graph Theory, Y. G. Zhang, Ed. Intech Press, ch. 6. – P. 119 – 152 ( 2012). 11. Luque В., Lacasa L., Ballesteros F., Luque J. Horizontal visibility graphs: Exact results for random time series // Physical Review E,– P. 046103-1–046103- 11 (2009). 12. Gutin G., Mansour T., Severini S. A characterization of horizontal visibility graphs and combinatoris on words // Physica A, – 390 – P. 2421-2428 (2011).\n13. Jones K.S. A statistical interpretation of term specificity and its application in retrieval // Journal of Documentation. – 28 (1). – P. 11–21 (1972). 14. Salton G., McGill M. J. Introduction to Modern Information Retrieval. – New York: McGraw-Hill. – 448 p. (1983). 15. Ortuño M., Carpena P., Bernaola P., Muñoz E., Somoza A.M. Keyword detection in natural languages and DNA // Europhys. Lett, – 57(5). – P. 759-764 (2002). 16. Dijk van T.A. Issues in Functional Discourse Analysis / In H. Pinkster (Ed.), Liber Amicorum for Simon Dik . – Dordrecht: Foris. – P. 27-46. (1990). 17. Giora R. Segmentation and Segment Cohesion: On the Thematic Organization of the Text // Text. An Interdisciplinary Journal for the Study of Discourse Amsterdam. – 3. – № 2. – P. 155-181 (1983). 18. Zipf G.K. Human Behavior and the Principle of Least Effort. – Cambridge, MA: Addison-Wesley Press. – 573 p. (1949).\nAppendix"
    } ],
    "references" : [ {
      "title" : "Explorations in the Semantics and Pragmatics of Discourse",
      "author" : [ "Dijk van T.A. Text", "Context" ],
      "venue" : "– London: Longman. –357 p.",
      "citeRegEx" : "1",
      "shortCiteRegEx" : null,
      "year" : 1977
    }, {
      "title" : "Identifying and Filtering Near-Duplicate Documents, COM’00",
      "author" : [ "A. Broder" ],
      "venue" : "Proceedings of the 11th Annual Symposium on Combinatorial Pattern Matching. – P",
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 2000
    }, {
      "title" : "The small world of human language",
      "author" : [ "R. Ferrer-i-Cancho", "V. Sole R" ],
      "venue" : "Proc. R. Soc. Lond. – B 268,",
      "citeRegEx" : "3",
      "shortCiteRegEx" : "3",
      "year" : 2001
    }, {
      "title" : "Language as an evolving word web",
      "author" : [ "S.N. Dorogovtsev", "F. Mendes J. F" ],
      "venue" : "Proc. R. Soc. Lond. – B",
      "citeRegEx" : "4",
      "shortCiteRegEx" : "4",
      "year" : 2001
    }, {
      "title" : "The network of concepts in written texts",
      "author" : [ "G. Caldeira S. M", "C. Petit Lobao T", "S. Andrade R. F", "A. Neme", "V. Miranda J. G" ],
      "venue" : null,
      "citeRegEx" : "5",
      "shortCiteRegEx" : "5",
      "year" : 2005
    }, {
      "title" : "Patterns in syntactic dependency networks",
      "author" : [ "R. Ferrer-i-Cancho", "R.V. Sole", "R. Kohler" ],
      "venue" : "Phys. Rev. E",
      "citeRegEx" : "6",
      "shortCiteRegEx" : "6",
      "year" : 2004
    }, {
      "title" : "The variation of Zipf's law in human language",
      "author" : [ "R. Ferrer-i-Cancho" ],
      "venue" : "Phys. Rev. E 70,",
      "citeRegEx" : "7",
      "shortCiteRegEx" : "7",
      "year" : 2005
    }, {
      "title" : "Topology of the conceptual network of language",
      "author" : [ "E. Motter A", "S. de Moura A. P", "Y.-C. Lai", "P. Dasgupta" ],
      "venue" : "Phys. Rev. E 65,",
      "citeRegEx" : "8",
      "shortCiteRegEx" : "8",
      "year" : 2002
    }, {
      "title" : "Global Properties of the Wordnet Lexicon",
      "author" : [ "M. Sigman", "A. Cecchi G" ],
      "venue" : "Proc. Nat. Acad. Sci. USA,",
      "citeRegEx" : "9",
      "shortCiteRegEx" : "9",
      "year" : 2002
    }, {
      "title" : "A short review // New Frontiers in Graph Theory, Y",
      "author" : [ "M. Nunez A.", "L. Lacasa", "P. Gomez J.", "algorithms Luque B. Visibility" ],
      "venue" : "G. Zhang, Ed. Intech Press, ch. 6. – P. 119 – 152",
      "citeRegEx" : "10",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Exact results for random time series // Physical Review E,– P",
      "author" : [ "В. Luque", "L. Lacasa", "F. Ballesteros", "graphs Luque J. Horizontal visibility" ],
      "venue" : "046103-1–04610311",
      "citeRegEx" : "11",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "A characterization of horizontal visibility graphs and combinatoris on words",
      "author" : [ "G. Gutin", "T. Mansour", "S. Severini" ],
      "venue" : "Physica A, –",
      "citeRegEx" : "12",
      "shortCiteRegEx" : "12",
      "year" : 2011
    }, {
      "title" : "A statistical interpretation of term specificity and its application in retrieval",
      "author" : [ "K.S. Jones" ],
      "venue" : "Journal of Documentation. –",
      "citeRegEx" : "13",
      "shortCiteRegEx" : "13",
      "year" : 1972
    }, {
      "title" : "McGraw-Hill",
      "author" : [ "Salton G.", "McGill M.J. Introduction to Modern Information Retrieval. – New York" ],
      "venue" : "– 448 p.",
      "citeRegEx" : "14",
      "shortCiteRegEx" : null,
      "year" : 1983
    }, {
      "title" : "Keyword detection in natural languages and DNA // Europhys",
      "author" : [ "M. Ortuño", "P. Carpena", "P. Bernaola", "E. Muñoz", "A.M. Somoza" ],
      "venue" : null,
      "citeRegEx" : "15",
      "shortCiteRegEx" : "15",
      "year" : 2002
    }, {
      "title" : "Foris",
      "author" : [ "Dijk van T.A. Issues in Functional Discourse Analysis / In H. Pinkster (Ed.)", "Liber Amicorum for Simon Dik . – Dordrecht" ],
      "venue" : "– P. 27-46.",
      "citeRegEx" : "16",
      "shortCiteRegEx" : null,
      "year" : 1990
    }, {
      "title" : "On the Thematic Organization of the Text // Text",
      "author" : [ "Giora R. Segmentation", "Segment Cohesion" ],
      "venue" : "An Interdisciplinary Journal for the Study of Discourse Amsterdam. – 3. – No 2. – P. 155-181",
      "citeRegEx" : "17",
      "shortCiteRegEx" : null,
      "year" : 1983
    }, {
      "title" : "Addison-Wesley Press",
      "author" : [ "Zipf G.K. Human Behavior", "MA the Principle of Least Effort. – Cambridge" ],
      "venue" : "– 573 p.",
      "citeRegEx" : "18",
      "shortCiteRegEx" : null,
      "year" : 1949
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "Such networks may also be used to identify unconventional text components, such as collocations, supra-phrasal units [1], as well as for finding similar fragments in different texts [2].",
      "startOffset" : 117,
      "endOffset" : 120
    }, {
      "referenceID" : 1,
      "context" : "Such networks may also be used to identify unconventional text components, such as collocations, supra-phrasal units [1], as well as for finding similar fragments in different texts [2].",
      "startOffset" : 182,
      "endOffset" : 185
    }, {
      "referenceID" : 2,
      "context" : "Nodes are connected if corresponding words are either adjacent in the text [3, 4], or are in a single sentence [5], or are syntactically [6, 7] or semantically [8, 9] connected.",
      "startOffset" : 75,
      "endOffset" : 81
    }, {
      "referenceID" : 3,
      "context" : "Nodes are connected if corresponding words are either adjacent in the text [3, 4], or are in a single sentence [5], or are syntactically [6, 7] or semantically [8, 9] connected.",
      "startOffset" : 75,
      "endOffset" : 81
    }, {
      "referenceID" : 4,
      "context" : "Nodes are connected if corresponding words are either adjacent in the text [3, 4], or are in a single sentence [5], or are syntactically [6, 7] or semantically [8, 9] connected.",
      "startOffset" : 111,
      "endOffset" : 114
    }, {
      "referenceID" : 5,
      "context" : "Nodes are connected if corresponding words are either adjacent in the text [3, 4], or are in a single sentence [5], or are syntactically [6, 7] or semantically [8, 9] connected.",
      "startOffset" : 137,
      "endOffset" : 143
    }, {
      "referenceID" : 6,
      "context" : "Nodes are connected if corresponding words are either adjacent in the text [3, 4], or are in a single sentence [5], or are syntactically [6, 7] or semantically [8, 9] connected.",
      "startOffset" : 137,
      "endOffset" : 143
    }, {
      "referenceID" : 7,
      "context" : "Nodes are connected if corresponding words are either adjacent in the text [3, 4], or are in a single sentence [5], or are syntactically [6, 7] or semantically [8, 9] connected.",
      "startOffset" : 160,
      "endOffset" : 166
    }, {
      "referenceID" : 8,
      "context" : "Nodes are connected if corresponding words are either adjacent in the text [3, 4], or are in a single sentence [5], or are syntactically [6, 7] or semantically [8, 9] connected.",
      "startOffset" : 160,
      "endOffset" : 166
    }, {
      "referenceID" : 9,
      "context" : "At the intersection of digital signal processing (DSP) theory and complex network theory there are several ways of constructing networks from the time series, among those are visibility graph construction methods (see survey [10]), namely the horizontal visibility graph (HVG) [11,12].",
      "startOffset" : 225,
      "endOffset" : 229
    }, {
      "referenceID" : 10,
      "context" : "At the intersection of digital signal processing (DSP) theory and complex network theory there are several ways of constructing networks from the time series, among those are visibility graph construction methods (see survey [10]), namely the horizontal visibility graph (HVG) [11,12].",
      "startOffset" : 277,
      "endOffset" : 284
    }, {
      "referenceID" : 11,
      "context" : "At the intersection of digital signal processing (DSP) theory and complex network theory there are several ways of constructing networks from the time series, among those are visibility graph construction methods (see survey [10]), namely the horizontal visibility graph (HVG) [11,12].",
      "startOffset" : 277,
      "endOffset" : 284
    }, {
      "referenceID" : 12,
      "context" : "2 binary logarithm of the inverse number of text fragments containing this word – inverse document frequency) or its modifications [13, 14] and other word weight estimates.",
      "startOffset" : 131,
      "endOffset" : 139
    }, {
      "referenceID" : 13,
      "context" : "2 binary logarithm of the inverse number of text fragments containing this word – inverse document frequency) or its modifications [13, 14] and other word weight estimates.",
      "startOffset" : 131,
      "endOffset" : 139
    }, {
      "referenceID" : 14,
      "context" : "In this paper, the standard deviation estimate of word weight is used for constructing word networks [15].",
      "startOffset" : 101,
      "endOffset" : 105
    }, {
      "referenceID" : 14,
      "context" : "Standard deviation estimate proposed in [15] is calculated as follows:",
      "startOffset" : 40,
      "endOffset" : 44
    }, {
      "referenceID" : 15,
      "context" : "At the first stage, the traditional HVG is constructed [16].",
      "startOffset" : 55,
      "endOffset" : 59
    }, {
      "referenceID" : 9,
      "context" : "3 (geometric) criterion can be written down as follows, according to [10,11]: the two",
      "startOffset" : 69,
      "endOffset" : 76
    }, {
      "referenceID" : 10,
      "context" : "3 (geometric) criterion can be written down as follows, according to [10,11]: the two",
      "startOffset" : 69,
      "endOffset" : 76
    }, {
      "referenceID" : 17,
      "context" : "It is obvious that the weight of a node in such network corresponds to the word frequency, and the distribution of these weights follows the Zipf law [18].",
      "startOffset" : 150,
      "endOffset" : 154
    }, {
      "referenceID" : 15,
      "context" : "), are the words, which determine the informational structure of the text [16, 17].",
      "startOffset" : 74,
      "endOffset" : 82
    }, {
      "referenceID" : 16,
      "context" : "), are the words, which determine the informational structure of the text [16, 17].",
      "startOffset" : 74,
      "endOffset" : 82
    } ],
    "year" : 2013,
    "abstractText" : null,
    "creator" : "PDFCreator Version 0.9.0"
  }
}