{
  "name" : "1303.0445.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Detecting and resolving spatial ambiguity in text using named entity extraction and self learning fuzzy logic techniques",
    "authors" : [ "-V. R. Kanagavalli", "K. Raja" ],
    "emails" : [ "kanagavalli.teacher@gmail.com", "raja_koth@yahoo.co.in" ],
    "sections" : [ {
      "heading" : null,
      "text" : "Information extraction identifies useful and relevant text in a document and converts unstructured text into a form that can be loaded into a database table. Named entity extraction is a main task in the process of information extraction and is a classification problem in which words are assigned to one or more semantic classes or to a default non-entity class. A word which can belong to one or more classes and which has a level of uncertainty in it can be best handled by a self learning Fuzzy Logic Technique. This paper proposes a method for detecting the presence of spatial uncertainty in the text and dealing with spatial ambiguity using named entity extraction techniques coupled with self learning fuzzy logic techniques.\nKeywords:\nInformation Retrieval Techniques, Named Entity Extraction, Fuzzy Logic, Adaptive heuristic critic, Reinforcement, Fuzzy Membership functions\nI. Introduction\nIn today‟s globalized and much\nconnected world there is a lot of importance associated with the spatial awareness and reasoning. Spatial information is abundantly found in various texts. The main issue with handling spatial information is a degree of imprecision that is always associated with it. Natural language has a remarkable feature of describing spatial relation information without using numbers and they also offer a variety of lexical terms for describing spatial location of entities. The main issue in the use of natural language for spatial descriptions is that there is no unique way of doing it and the statement context often plays a significant role in the spatial reasoning.\nIn domains such as medical texts and\nin robotics imprecision has to be dealt with even for relationships that are well defined in a mathematical sense, such as distances. Modelling qualitative spatial relations depends on properties such as the asymmetry of some expressions, the non-bijective relation between language and spatial concepts, the interaction between distances and orientation etc. Fuzzy logic is naturally oriented to handle imprecision and is hence very much suitable for handling the spatial ambiguity or uncertainty. Combined with self learning techniques it is a natural choice for handling spatial uncertainty and spatial queries in natural language that are inherently vague in nature. This paper proposes the use of fuzzy\nlogic to identify spatial ambiguity from text during the process of named entity extraction.\nII. Information Extraction\nAn information extraction system generally converts unstructured text into a form that can be loaded into a database table. Useful information such as the names of people, places, or organization mentioned in the text is extracted without a deep understanding of the text. While information retrieval deals with the problem of finding relevant documents in a collection, information extraction identifies useful and relevant text in a document.\nMethods to find the names of\norganizations or people from unstructured text will have some errors that are then propagated in the database; this makes the task of consistently extracting accurate semantic information from all types of text difficult and cumbersome [23].\nThe authors in [3] categorize the text\ninto various types, namely, instructional (text books, manuals, etc.,), imaginative (advertisements, simple texts, etc.,) and informative (e.g., literary papers, patent documents)."
    }, {
      "heading" : "III. Named Entity Extraction",
      "text" : "The term “Named Entity”, was coined\nfor the Sixth Message Understanding Conference (MUC-6)[5]. Named Entity Recognition and Classification (NERC) was\nrecognized as one of the most important subtasks of Information extraction and included the recognition of information units like names, including person, organization and location names, and numeric expressions including time, date, money and percent expressions from unstructured text, such as newspaper articles.\nIn [4] the authors present an\nexhaustive collection of the works done in the field of Named Entity Recognition. The impact of textual genre (journalistic, scientific, informal, etc.) and domain (gardening, sports, business, etc.) has been rather neglected in the NERC literature. Few studies are specifically devoted to diverse genres and domains.\nThe most studied types are three\nspecializations of “proper names”: names of “persons”, “locations” and “organizations”, collectively known as “enamex” since the MUC-6 competition. The type “location” can in turn be divided into multiple subtypes of “fine grained locations”: city, state, country, etc. ([6], [7]).\nThe authors in [8] [9] relax the types\nto be extracted and hence it is called as “open domain” NERC. In this line of research, [16] defined a named entity hierarchy which includes many fine grained subcategories, such as museum, river or airport, and adds a wide range of categories, such as product and event, as well as substance, animal, religion or colour."
    }, {
      "heading" : "IV. Existing Techniques of Named Entity Extraction",
      "text" : "The named extraction methods can be broadly classified into two categories namely rule based models and machine learning methods [1].\nThe advantage of Rule-based\napproaches is that it could effectively exploit human knowledge and can be tuned conveniently. On the other hand, machine learning approaches, such as maximum entropy or support vector machine, is more independent from languages and simple to implement. Rule-based approaches slightly outperform machine learning ones in MUC-7 tests [1].\nThe current dominant technique for\naddressing the NERC problem is supervised learning. SL techniques include Hidden Markov Models (HMM), Decision Trees,\nMaximum Entropy Models (ME), Support Vector Machines (SVM) and Conditional Random Fields (CRF). These are all variants of the SL approach that typically consist of a system that reads a large annotated corpus, memorizes lists of entities, and creates disambiguation rules based on discriminative features. The main technique for Semi Supervised Learning is called “bootstrapping” and involves a small degree of supervision, such as a set of seeds, for starting the learning process. The typical approach in unsupervised learning is clustering. For example, one can try to gather named entities from clustered groups based on the similarity of context. There are other unsupervised methods too. Basically, the techniques rely on lexical resources (e.g., WordNet), on lexical patterns and on statistics computed on a large unannotated corpus.\nFor some application, the constraint\nof exact match is unnecessarily stringent. For instance, in some bioinformatics work, the goal is to determine whether or not a particular sentence mentions a specific gene and its function. Exact NE boundaries are not required: all is needed is to determine if the sentence does refer to the gene [19].\nThe efficiency of the Named Entity\nRecognition technique is measured by a final score called Entity Detection and Recognition Value (EDR)."
    }, {
      "heading" : "V. Spatial Uncertainty",
      "text" : "Obtaining spatial awareness from raw\ninput text has been a primary research area in the field of situation awareness. The main issues faced by researches in this area are modelling/ representation, even extraction and disambiguation, querying, reasoning and visualization [20]. Spatial descriptions found in free text are mostly based on human perceptions and perceptions are intrinsically imprecise.\nThe qualitative approach to the\nrepresentation of spatial knowledge is heavily inspired by the way spatial information is expressed verbally. The spatial propositions might correspond to several different spatial relations depending on the context in which they are used. This leads to a degree of spatial uncertainty. One of the sources of uncertainty is the need to express a certain relationship independently of the context in which it occurs [21]."
    }, {
      "heading" : "VI. Fuzzy Logic",
      "text" : "Fuzzy logic was first developed by\nLotfi Zadeh [10] for solving decision making problems with “IF-THEN‟ rules, later, it was used to deal with uncertainly and imprecise data management. For several years fuzzy logic has been applied in different filed, such as automated control ,consumer products, [11] industrial systems, automotives, decision analysis, medicine, geology, controlling aircraft flight, chemical reactor and processes, and applications of artificial intelligence such as expert systems, pattern recognition and robotics. The generality of fuzzy logic is needed to deal with complex problems in the realms of search. Fuzzy logic provides a foundation for the development of new tools for dealing with natural languages and knowledge representation, such as precipitated natural language, theory of hierarchical definability, and unified theory of uncertainty [12]. Fuzzy logic is an easy way to reach definitive conclusions based on vague, and ambiguous and imprecise and noise, therefore, it makes sense to control the individual to take a quick decision [13], [14].\nThe semantics of natural languages and information analysis is best handled by the epistemic facet of Fuzzy Logic. In the epistemic Facet, natural language is viewed as a system for describing perceptions and an important branch of the same is possibility theory and computational theory of perceptions [15]."
    }, {
      "heading" : "VII. Named Entity Extraction and Fuzzy logic",
      "text" : "The recognition of genuine names is\nbasically a fuzzy decision problem to computers. There is no exact right or wrong answer for a string to be a name. The only problem is how likely it is. Fuzzy values represent strings‟ likelihood or properness to be a name. Names are composed of several characters. There are several ways to transform the member characters‟ fuzzy value to the string‟s fuzzy value. The authors in [2] propose a fuzzy logic method to identify isolated Arabic characters from a document. To simplify data collecting and training, unigram models are adopted in their work. Additionally, some supplementary information such as positional feature is exploited to support statistical models.\nSeveral models are used to estimate the\nfuzzy value of a string from the statistic data based on characters. These models include Markov models, bi-gram models, unigram\nmodels, etc. Depending on the amounts of features of different types of named entities are varied, the type of the model to be used is decided.\nAlso, Fuzzy logic is used for Named Entity Extraction Look up operation. Second, candidate words can be “fuzzy-matched” against the reference list using some kind of threshold edit-distance [17] or Jaro-Winkler [18]. This allows capturing small lexical variations in words that are not necessarily derivational or inflectional. For instance, Frederick could match Frederik because the edit-distance between the two words is very small (suppression of just one character, the „c‟). Jaro-Winkler‟s metric was specifically designed to match proper names following the observation that the first letters tend to be correct while name ending often varies."
    }, {
      "heading" : "VIII. Proposed Method",
      "text" : "This paper proposes the idea of using\nneuro-fuzzy reinforcement learning for classifying the spatial descriptors and expressions from free text documents. The basic idea behind fuzzy reinforcement learning is to apply a fuzzy partitioning scheme to the continuous state space and to introduce linguistic interpretation. The method proposed is the use of Adaptive Heuristic Critic (AHC) that typically consists of an action (or control) module and of a critic (or evaluation) module. There are two representative neuro-fuzzy reinforcement learning modules: GARIC (Generalized Approximate Reasoning for Intelligent Control) and RNN-FLCS (Reinforcement Neural –Network-based Fuzzy Logic Control System) [22].\nThe Named Entity Extraction\ntechnique can be used to extract the spatial components and also spatial descriptors from the unstructured text. The uncertain spatial description, which has a level of ambiguity in it, are treated as input to the self learning fuzzy system. The system has the ability to disambiguate the spatial descriptions and assign a fuzzy membership value to the spatial locations identified without ambiguity.\nThe basic idea proposed is to use the\nfuzzy predictor to predict the nature of the spatial descriptions used in the text to disambiguate the spatial uncertainty.\nFig.1 explains the overall working of\na Neuro-Fuzzy AHC Model. Internal reinforcement is used to teach the system about the validity of the classification using the fuzzy membership functions. The action module consists of the fuzzy controller which classifies the ambiguous spatial descriptions."
    }, {
      "heading" : "IX. Conclusion and Future Works",
      "text" : "Though there are automated tools for\nextraction of spatial information from text there are still lot of errors and extraction ambiguities that creep in to the output. This paper proposes a self learning fuzzy system that would learn to identify the ambiguities and to resolve them. The so occurred spatial locations can then be further processed using fuzzy logic techniques for efficient and effective spatial querying in a large database setup."
    } ],
    "references" : [ {
      "title" : "Fuzzy Logic approach to Recognition of Isolated Arabic Characters",
      "author" : [ "Majida Ali Abed", "Hamid Ali Abed AL-Asadi", "Zainab Sabah Baha Al-Deen", "Ahmad Naser Ismail" ],
      "venue" : "International Journal of Computer Theory and Engineering,",
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 2010
    }, {
      "title" : "Terminology and knowledge acquisition: A text based approach",
      "author" : [ "Ahmad", "khurshid" ],
      "venue" : "Third international congress on terminology and knowledge engineering",
      "citeRegEx" : "3",
      "shortCiteRegEx" : "3",
      "year" : 1993
    }, {
      "title" : "Message Understanding Conference - 6: A Brief History",
      "author" : [ "Ralph Grishman", "B. Sundheim" ],
      "venue" : "In Proc. International Conference on Computational Linguistics",
      "citeRegEx" : "5",
      "shortCiteRegEx" : "5",
      "year" : 1996
    }, {
      "title" : "Automated Subcategorization of Named Entities",
      "author" : [ "Fleischman", "Michael" ],
      "venue" : "In Proc. Conference of the European Chapter of Association for Computational Linguistic",
      "citeRegEx" : "6",
      "shortCiteRegEx" : "6",
      "year" : 2001
    }, {
      "title" : "Heuristic Methods for Reducing Errors of Geographic Named  Entities Learned by Bootstrapping",
      "author" : [ "Seungwoo Lee", "G. Geunbae Lee" ],
      "venue" : "In Proc. International Joint Conference on Natural Language Processing",
      "citeRegEx" : "7",
      "shortCiteRegEx" : "7",
      "year" : 2005
    }, {
      "title" : "An Unsupervised Method for General Named Entity Recognition and Automated Concept Discovery",
      "author" : [ "Enrique Alfonseca", "S. Manandhar" ],
      "venue" : "In Proc. International Conference on General WordNet",
      "citeRegEx" : "8",
      "shortCiteRegEx" : "8",
      "year" : 2002
    }, {
      "title" : "A Framework for Named Entity Recognition in the Open Domain",
      "author" : [ "Evans", "Richard" ],
      "venue" : "In Proc. Recent Advances in Natural Language Processing",
      "citeRegEx" : "9",
      "shortCiteRegEx" : "9",
      "year" : 2003
    }, {
      "title" : "”Fuzzy logics systems: origin concepts ,and trends",
      "author" : [ "Zadeh", "Lotfi A" ],
      "venue" : null,
      "citeRegEx" : "11",
      "shortCiteRegEx" : "11",
      "year" : 2004
    }, {
      "title" : "Introduction to fuzzy sets, fuzzy logic, and fuzzy control systems",
      "author" : [ "G. Chen", "Pham T" ],
      "venue" : null,
      "citeRegEx" : "12",
      "shortCiteRegEx" : "12",
      "year" : 2001
    }, {
      "title" : "Introduction to Fuzzy set theory basic concepts And structures",
      "author" : [ "E. Ruspini" ],
      "venue" : null,
      "citeRegEx" : "13",
      "shortCiteRegEx" : "13",
      "year" : 1992
    }, {
      "title" : "Is there a need for fuzzy logic",
      "author" : [ "Lotfi. A. Zadeh" ],
      "venue" : "Journal of information",
      "citeRegEx" : "15",
      "shortCiteRegEx" : "15",
      "year" : 2008
    }, {
      "title" : "Definition, Dictionaries and Tagger for Extended Named Entity Hierarchy",
      "author" : [ "Satoshi Sekine", "C. Nobata" ],
      "venue" : "In Proc. Conference on Language Resources and Evaluation",
      "citeRegEx" : "16",
      "shortCiteRegEx" : "16",
      "year" : 2004
    }, {
      "title" : "Boosting Precision and Recall of Dictionary-Based Protein Name Recognition",
      "author" : [ "Yoshimasa Tsuruoka", "J. Tsujii" ],
      "venue" : "In Proc. Conference of Association for Computational Linguistics Natural Language Processing in Biomedicine",
      "citeRegEx" : "17",
      "shortCiteRegEx" : "17",
      "year" : 2003
    }, {
      "title" : "Exploiting Dictionaries in Named Entity Extraction: Combining Semi-Markov Extraction Processes and Data Integration Methods",
      "author" : [ "William W. Cohen", "S. Sarawagi" ],
      "venue" : "In Proc. Conference on Knowledge Discovery in Data",
      "citeRegEx" : "18",
      "shortCiteRegEx" : "18",
      "year" : 2004
    }, {
      "title" : "Various Criteria in the Evaluation of Biomedical Named Entity Recognition",
      "author" : [ "Richard Tzong-Han Tsai", "Wu S.-H", "W.-C. Chou", "Y.-C. Lin", "D. He", "J. Hsiang", "T.-Y. Sung", "W.-L. Hsu" ],
      "venue" : "BMC Bioinformatics 7:92,",
      "citeRegEx" : "19",
      "shortCiteRegEx" : "19",
      "year" : 2006
    }, {
      "title" : "SAT: Spatial awareness from textual input",
      "author" : [ "Dimitri. V. Kalshinakov" ],
      "venue" : "International conference on Extending Database Technology,",
      "citeRegEx" : "20",
      "shortCiteRegEx" : "20",
      "year" : 2006
    }, {
      "title" : "Qualitative representation of positional information",
      "author" : [ "Eliseo Climenteni" ],
      "venue" : "Journal of Artificial Intelligence",
      "citeRegEx" : "21",
      "shortCiteRegEx" : "21",
      "year" : 1997
    } ],
    "referenceMentions" : [ {
      "referenceID" : 1,
      "context" : "The authors in [3] categorize the text into various types, namely, instructional (text books, manuals, etc.",
      "startOffset" : 15,
      "endOffset" : 18
    }, {
      "referenceID" : 2,
      "context" : "The term “Named Entity”, was coined for the Sixth Message Understanding Conference (MUC-6)[5].",
      "startOffset" : 90,
      "endOffset" : 93
    }, {
      "referenceID" : 3,
      "context" : "([6], [7]).",
      "startOffset" : 1,
      "endOffset" : 4
    }, {
      "referenceID" : 4,
      "context" : "([6], [7]).",
      "startOffset" : 6,
      "endOffset" : 9
    }, {
      "referenceID" : 5,
      "context" : "The authors in [8] [9] relax the types to be extracted and hence it is called as “open domain” NERC.",
      "startOffset" : 15,
      "endOffset" : 18
    }, {
      "referenceID" : 6,
      "context" : "The authors in [8] [9] relax the types to be extracted and hence it is called as “open domain” NERC.",
      "startOffset" : 19,
      "endOffset" : 22
    }, {
      "referenceID" : 11,
      "context" : "In this line of research, [16] defined a named entity hierarchy which includes many fine grained subcategories, such as museum, river or airport, and adds a wide range of categories, such as product and event, as well as substance, animal, religion or colour.",
      "startOffset" : 26,
      "endOffset" : 30
    }, {
      "referenceID" : 14,
      "context" : "Exact NE boundaries are not required: all is needed is to determine if the sentence does refer to the gene [19].",
      "startOffset" : 107,
      "endOffset" : 111
    }, {
      "referenceID" : 15,
      "context" : "The main issues faced by researches in this area are modelling/ representation, even extraction and disambiguation, querying, reasoning and visualization [20].",
      "startOffset" : 154,
      "endOffset" : 158
    }, {
      "referenceID" : 16,
      "context" : "One of the sources of uncertainty is the need to express a certain relationship independently of the context in which it occurs [21].",
      "startOffset" : 128,
      "endOffset" : 132
    }, {
      "referenceID" : 7,
      "context" : "For several years fuzzy logic has been applied in different filed, such as automated control ,consumer products, [11] industrial systems, automotives, decision analysis, medicine, geology, controlling aircraft flight, chemical reactor and processes, and applications of artificial intelligence such as expert systems, pattern recognition and robotics.",
      "startOffset" : 113,
      "endOffset" : 117
    }, {
      "referenceID" : 8,
      "context" : "Fuzzy logic provides a foundation for the development of new tools for dealing with natural languages and knowledge representation, such as precipitated natural language, theory of hierarchical definability, and unified theory of uncertainty [12].",
      "startOffset" : 242,
      "endOffset" : 246
    }, {
      "referenceID" : 9,
      "context" : "Fuzzy logic is an easy way to reach definitive conclusions based on vague, and ambiguous and imprecise and noise, therefore, it makes sense to control the individual to take a quick decision [13], [14].",
      "startOffset" : 191,
      "endOffset" : 195
    }, {
      "referenceID" : 10,
      "context" : "In the epistemic Facet, natural language is viewed as a system for describing perceptions and an important branch of the same is possibility theory and computational theory of perceptions [15].",
      "startOffset" : 188,
      "endOffset" : 192
    }, {
      "referenceID" : 0,
      "context" : "The authors in [2] propose a fuzzy logic method to identify isolated Arabic characters from a document.",
      "startOffset" : 15,
      "endOffset" : 18
    }, {
      "referenceID" : 12,
      "context" : "Second, candidate words can be “fuzzy-matched” against the reference list using some kind of threshold edit-distance [17] or Jaro-Winkler [18].",
      "startOffset" : 117,
      "endOffset" : 121
    }, {
      "referenceID" : 13,
      "context" : "Second, candidate words can be “fuzzy-matched” against the reference list using some kind of threshold edit-distance [17] or Jaro-Winkler [18].",
      "startOffset" : 138,
      "endOffset" : 142
    } ],
    "year" : 2013,
    "abstractText" : "Information extraction identifies useful and relevant text in a document and converts unstructured text into a form that can be loaded into a database table. Named entity extraction is a main task in the process of information extraction and is a classification problem in which words are assigned to one or more semantic classes or to a default non-entity class. A word which can belong to one or more classes and which has a level of uncertainty in it can be best handled by a self learning Fuzzy Logic Technique. This paper proposes a method for detecting the presence of spatial uncertainty in the text and dealing with spatial ambiguity using named entity extraction techniques coupled with self learning fuzzy logic techniques.",
    "creator" : "Microsoft® Office Word 2007"
  }
}