{
  "name" : "1306.2499.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Using Arabic Wordnet for semantic indexation in information retrieval system",
    "authors" : [ "Mohammed Alaeddine Abderrahim", "Mohammed El Amine Abderrahim", "Mohammed Amine Chikh", "Abou Bekr Belkaid" ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : "1. Introduction",
      "text" : "The ontologies are known as tools able to manipulate the knowledge behind the concepts. We can used them in several fields such as informations search, the automatic translation..,. The ontologies can be used at different levels in the IRS. The orjectives of our study is to see the effects of the ontologies in process of indexing documents and queries, we are talking about the semantic indexing. In the literature, there are many definitions of the semantic indexing. The semantic indexation (indexation by the sense of words) aims to correct the problems of the lexical matching by using the semantic indexes rather than the simple keywords. The semantic indexation method aims to retrieve the correct sense of the word in the text from different possibility senses word as defined in dictionaries, ontologies and other language resources [1]. It is based on algorithms of the word sense disambiguation (WSD). Among the disambiguation methods : those combining the disambiguated word with words taken from the context of a document witch help to determine their appropriate sense, more advanced\napproaches of disambiguation are using hierarchical representation to calculate the semantic distance or the semantic similarity between the compared words[1]. According to Sanderson [2] the successful of disambiguation improves the performance of the IRS, particularly in the case of the short queries (title only). Within the context of using the ontologies for the indexation, we found several works for English language cited in [3], the idea is to built an structure representing the document (respectively query) by using the semantic of the ontologies, this structure is called a semantic core of document (respectively query). Therefore, This is the first work of the semantic indexation of the documents (respectively query) with arabic texts. In this paper we have implemented the method of semantic indexing of the documents and query for the information retrieval where are use Arabic Wordnet as a semantic resource to exploring the impact of passage from an indexation based on single words to an indexation based on concepts. This paper is organized as follows. First, we describe the architecture with a discription of the operating process of our system. Then we present the experimentation with a discussion of results achieved and we have finished with a conclusion and prospects."
    }, {
      "heading" : "2. Architecture of our System",
      "text" : "In this section, we describe the semantic indexing method based on Arabic Wordnet. This approach start with extracting the concepts of wordnet from the documents (respectively query). Then we retrieve the senses of those concepts from the synsets of arabic wordnet and with the\nmethod of disambiguation 1 based on calculation of the semantic distances between those senses, we identify the appropriate sense (having only one sense) for every concept from proposed senses. For terms that don’t belong to the vocabulary of WordNet, the system extracts their basic form before passing by the semantic indexing method described above. For example, the arabic wordnet does not contain the concept \"بابسأ\", but it contains their basic form \"ببس\". Formally, let consider: D a document of collection composed of n words. D= {w1, w2,…, wn} The result of the concept detection process will be a document Dc. It corresponds to: Dc= {C1, C2,…, Cm, W'1, W'2,…, W'm'}. Where C1, C2,…, Cm are the concepts extracted from the document and identified like wordnet entries. If they are terms that do not belong to the WordNet vocabulary, they are not replaced like the case of words W'1, W '2, ..., W'm'. However, they will be added to complete the representation of the information expressed by the document in order to be used at the search stage.\n2.1 Details of Our Approach with Example\nLet consider the following text of document : لكشب تءاج وأ ،مئاد وأ تقؤم لكشب ةركاذلا نادقف ةلاح تناك ءاوس \" مدقت ةیلمع نإ .ةركاذلا نادقف ثودح بابسأ يلع دمتعی كلذف ءطبب وأ ئجافم صخشلا يلع ةثیدحلا ءایشلأا كاردإ وأ ملعت يف ةبوعص اھنع جتنی دق رمعلا نسملا صخشلا لبق نم لوطأ تقو قارغتسا يف ببستت نأ نكمی وأ يف ببس نوكی لا رمعلا يف مدقتلا نكلو) ھیلع ةثیدحلا ءایشلأا ءاعدتسا وأ ركذت يف دعاس نیعم ضرمب ًابوحصم مدقتلا اذھ ناك اذإ لاإ ةركاذلا نادقف يف (ةلاحلا هذھ ثودح. \" Table 1 presents the terms to be indexed after the elimination of the stop words. As well as the segmentation process that is used to link the terms that distinguished only with inflectional mark. Finally, the text is represented by an index of lemmatized words:\nAfter omit the stop words, for example: {ءاوس ,ضعب}. The process of extracting concepts recognized all the terms of the documents that belong to the Arabic Wordnet. Then,\n1 this method choose the appropriate sense (concept) from the proposed senses witch has most linked with other concepts of the same document, the similarity is calculated between senses that belongs to the different sets (synsets).\nthe method of the searching synonyms retrieved all senses of the concepts extracted, and the disambiguation method is used to select the right sense for every concept. The terms that do not belong to the vocabulary of the Arabic Wordnet, they are passed by the module of racine extraction in order to restart the search of the senses with the root. Or else, the words of text will be added to the final index for complete the representation of the information contained in the documents. Table 2 gives an example of selecting indexes to some concepts identified in the text:\nFor search step, the user queries are expanded with the same method as the documents using the synonyms of those terms to retrieve more relevant results and reduce the silence. Table 3 shows examples of queries before and after semantic indexing method.\nThe detailed of our system are discribed with figure 1:\nIn the following, we have described our experimentation and discussion the results obtained."
    }, {
      "heading" : "3. Description of the experimentations",
      "text" : "For our experimentation we have used a corpora of over 22,000 arabic documents (approximately 180 MB) in different areas (health, sport, politic, science, religion, ...). This corpora has approximately 17 millions words with 612,650 are differents word. A set of 70 keywords queries in various fields are chosen for evaluation. Arabic Wordnet is a lexical database free available for standard arabic. This database follows the conception and methodology of Princeton Wordnet for English and EuroWordNet for European languages. Its structure is like a thesaurus, it is organized around the structure of synsets, that is to say, sets of synonyms and pointers describing relations to other synsets. Each word can belong to one or more synsets, and one or more categories of discourse. These categories are organized in four classes: noun, verb, adjective and adverb. Arabic WordNet is a lexical network whose nodes are synsets and relations between synsets are the arcs. it currently counts 11,269 synsets (7,960 names, 2,538 verbs, adjectives, 110 adverbs 661), and 23,481 words [4], [5], [6], [7]. To evaluate the semantic indexing method we have segmented our experimentation to four search types and we will study them individually in order to estimate the augmentation of each type to improving the search performance. The types of search are cited below:  Simple search or research before semantic indexing\n(R0): we have used a list of 70 simple queries like keywords with a simple indexation of documents.\n Total Semantic Search (R1): we have indexed\nsemantically a list of 70 queries and the collection of documents used for search.\n Expansion of query (R2): we have indexed\nsemantically only a list of 70 queries and we have used a single word to index the documents.\n Semantic representation of the documents (R3): we\nhave indexed semantically only the database of the documents and we have used a list of 70 simple queries like keywords.\nThe tables above describe search results:  The number of documents found.  The number of relevant documents found.  The precision at 5 documents (P @ 5).  The precision at 10 documents (P @ 10).  The precision at 20 documents (P @ 20).  The precision at 100 documents (P @ 100).  The precision at 1000 documents (P @ 1000).  The median average precision. Table 4 presents : the number of documents found and the number of relevant documents found."
    }, {
      "heading" : "1 405 164 11588 6287 518 329 8937 6092",
      "text" : ""
    }, {
      "heading" : "2 674 272 9332 5071 2579 1630 1914 1265",
      "text" : "A simple comparison of the results obtained before and after using the semantic indexation method to representing the documents and queries, enables us to deduce that this method (for any types) improves in most cases the number of documents and the number of relevant documents returned. In other words, semantic indexing can improve the recall. Concretely:  NDTB = The number of documents found before the semantic indexing method.  NDTA = The number of documents found after the semantic indexing method.  D = NDTA - NDTB (1)  NDTPB = The number of Relevant Documents\nfound before the semantic indexing method.\n NDTPA = The number of Relevant Documents found after the semantic indexing method.\n DP = NDTPA - NDTPB (2)  If (D> 0 or DP> 0) then we can say that semantic\nindexation improves the performance of IRS in terms of recall.\n In contrast, if (D = 0 or DP = 0), in other words we\nhave the same number of documents returned after the semantic indexing. So, we can say that there are no improvements in the quality of IRS of a recall viewpoint.\nCounting The number of queries in terms of D and DP enabled us to establish the results (see table 5):\nAs shown on table 5, we notice that increasing the number of documents and the relevant documents found covers pratically all queries in R1. Moreover, R2 and R3 are the less appropriate methods for semantic indexing (D <0) and (DP <0) because the use of semantic indexation method modify the vocabulary in documents only (R3) or the queries only (R2). For Example: the term « مثإ » it replaced in the semantic index of corpora by « ةئیطخ » and if we search by using this term query « مثإ », the result will be negative. Based on Table 4, we have established a comparison between the three search types (R1, R2 and R3) in order to identify the best method of semantic indexing of a viewpoint the documents found and the relevant documents found. Table 6 presents the results of this comparaison.\nThe results described in Table 6 preferred the system R1 so we can say that the semantic indexing of documents and queries together present the best system of search of a viewpoint the number of documents found and number of relevant documents found. This result affirms first consequent which was given in the table (5). Table 7 describes the different values of precision obtained in both systems before and after the use of the semantic indexing method.\nIndexation\nIndexation\nThe comparison of three experimentations using the following graphic (see Figure 2) showed us that the semantic indexing method of documents and queries together (R1) give the best rate of precisions in all the measures taken into accounts (P@5, P@10, P@20, P@100, P@1000) as well as the median average precision. whereas, the semantic indexing of documents and queries separately (R2, R3) give inappropriate results for all the measures considered."
    }, {
      "heading" : "4. Discussions",
      "text" : "In these experimentation we were interested by testing the semantic indexing strategy to represent the documents and the queries, the implementation of our system is organized as follows: we have started with indexing semantically the collection of documents which is considered as a preparation step for search, by using a semantic resource (as Arabic Wordnet). Then, we have tested different methods of searches started with (R1) which is based on the semantic indexing of documents and queries together. Another way to search, is to index semantically the queries (R2) or choosen to index semantically the collection of documents and use a simple query for search (R3). The objective behind the study of all these methods (R1, R2, R3) is to determine at what level in the IRS, the use of the semantic (in indexation of documents or queries, or together) produces best results. From the viewpoint documents found and relevant documents found we can say that the use of semantic indexing method to represent both documents and queries together improves the performance of IRS. From the precision viewpoint, (R1) has good values for all the measures considered, consequently, it can be chosen as a method to represent (indexing) information in IRS. If we must classified the other methods (R2) and (R3), we can said that R2 has the advantage to be more precise for 5 and 10 and 20 and 1000 firsts documents, and the\nmedian average precision. Contrary, it presents low values for 100 firsts documents as compared to R3. The evaluation of the contribution of the arabic ontologies to IRS deduced by this experiment confirms the following characteristics:  Reducing the silence in response of user queries.  reduce the noise from responses of queries.  facilitate the expression of query (assistance in the reformulation of query).  Increasing the recall and precision. In this context, we must emphasize that using concepts in the place of terms allows of:  Provide a good representation of document collections by exploiting the semantics of concepts.  Facilitating the reformulation of the user query.  Provide a real support for matching process query/\ndocuments by exploiting the semantic distance existing between the concepts."
    }, {
      "heading" : "5. Conclusion",
      "text" : "In this paper we have developed an approach that have been proved its force for the English language. The idea of this article is to exploit a lexical resource (Arabic Wordnet) to index the documents as well as the user query in order to improve the retrieval results. Our experiments based on a medium corpus of Arabic language, we have proved that semantic resources (in our case: Arabic Wordnet) improves the quality of IRS and achieving our aims fixed at the beginning. We have remarked that the use of semantic indexing method to represent the documents and the queries together gives better results than using separately. The contribution of the ontologies in information retrieval system with arabic language is very interesting but it requires complete lexical resources witch are not available at present. It therefore remains many things to do in the future, and the the most imminent extension of our research is to built a semantic core to represent the documents using Arabic Wordnet, as well as the study of the effect of every semantic relationship used in this process like (synonymy, hyponymy,…)."
    } ],
    "references" : [ {
      "title" : "Semantic Indexing using WordNet Senses",
      "author" : [ "R. Mihalcea", "D.I. Moldovan" ],
      "venue" : "Proceedings of ACL Workshop on IR & NLP; Hong Kong",
      "citeRegEx" : "1",
      "shortCiteRegEx" : null,
      "year" : 2000
    }, {
      "title" : "Word Sense Disambiguation and Information Retrieval",
      "author" : [ "M. Sanderson" ],
      "venue" : "PhD Thesis, Technical Report ",
      "citeRegEx" : "2",
      "shortCiteRegEx" : null,
      "year" : 1997
    }, {
      "title" : "Indexation conceptuelle guidée par ontologie pour la recherche d’information",
      "author" : [ "M Baziz" ],
      "venue" : "Thèse de doctorat, université Paul Sabatier;",
      "citeRegEx" : "3",
      "shortCiteRegEx" : "3",
      "year" : 2005
    }, {
      "title" : "C",
      "author" : [ "S. Elkateb", "W. Black", "H. Rodríguez", "M. Alkhalifa", "P. Vossen", "A. Pease" ],
      "venue" : "Fellbaum: Building a WordNet for Arabic, in Proceedings of The fifth international conference on Language Resources and Evaluation; Genoa-Italy",
      "citeRegEx" : "4",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Arabic WordNet and the Challenges of Arabic. The Challenge of Arabic for NLP/MT",
      "author" : [ "S. Elkateb", "W. Black", "P. Vossen", "D. Farwell", "A. Pease", "C. Fellbaum" ],
      "venue" : "International conference at the British Computer Society,",
      "citeRegEx" : "5",
      "shortCiteRegEx" : "5",
      "year" : 2006
    }, {
      "title" : "C",
      "author" : [ "W. Black", "S. Elkateb", "H. Rodriguez", "M. Alkhalifa", "P. Vossen", "A. Pease" ],
      "venue" : "Fellbaum: Introducing the Arabic WordNet project, in Proceedings of the 3rd Global Wordnet Conference, Jeju Island, Korea",
      "citeRegEx" : "6",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Sabri",
      "author" : [ "W. Black" ],
      "venue" : "El-Kateb, A Prototype English-Arabic Dictionary Based on WordNet, proceedings of the Second International WordNet Conference, Brno, Czech Republic",
      "citeRegEx" : "7",
      "shortCiteRegEx" : null,
      "year" : 2004
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "The semantic indexation method aims to retrieve the correct sense of the word in the text from different possibility senses word as defined in dictionaries, ontologies and other language resources [1].",
      "startOffset" : 197,
      "endOffset" : 200
    }, {
      "referenceID" : 0,
      "context" : "Among the disambiguation methods : those combining the disambiguated word with words taken from the context of a document witch help to determine their appropriate sense, more advanced approaches of disambiguation are using hierarchical representation to calculate the semantic distance or the semantic similarity between the compared words[1].",
      "startOffset" : 340,
      "endOffset" : 343
    }, {
      "referenceID" : 1,
      "context" : "According to Sanderson [2] the successful of disambiguation improves the performance of the IRS, particularly in the case of the short queries (title only).",
      "startOffset" : 23,
      "endOffset" : 26
    }, {
      "referenceID" : 2,
      "context" : "Within the context of using the ontologies for the indexation, we found several works for English language cited in [3], the idea is to built an structure representing the document (respectively query) by using the semantic of the ontologies, this structure is called a semantic core of document (respectively query).",
      "startOffset" : 116,
      "endOffset" : 119
    }, {
      "referenceID" : 3,
      "context" : "it currently counts 11,269 synsets (7,960 names, 2,538 verbs, adjectives, 110 adverbs 661), and 23,481 words [4], [5], [6], [7].",
      "startOffset" : 109,
      "endOffset" : 112
    }, {
      "referenceID" : 4,
      "context" : "it currently counts 11,269 synsets (7,960 names, 2,538 verbs, adjectives, 110 adverbs 661), and 23,481 words [4], [5], [6], [7].",
      "startOffset" : 114,
      "endOffset" : 117
    }, {
      "referenceID" : 5,
      "context" : "it currently counts 11,269 synsets (7,960 names, 2,538 verbs, adjectives, 110 adverbs 661), and 23,481 words [4], [5], [6], [7].",
      "startOffset" : 119,
      "endOffset" : 122
    }, {
      "referenceID" : 6,
      "context" : "it currently counts 11,269 synsets (7,960 names, 2,538 verbs, adjectives, 110 adverbs 661), and 23,481 words [4], [5], [6], [7].",
      "startOffset" : 124,
      "endOffset" : 127
    } ],
    "year" : 2013,
    "abstractText" : "In the context of arabic Information Retrieval Systems (IRS) guided by arabic ontology and to enable those systems to better respond to user requirements, this paper aims to representing documents and queries by the best concepts extracted from Arabic Wordnet. Identified concepts belonging to Arabic WordNet synsets are extracted from documents and queries, and those having a single sense are expanded. The expanded query is then used by the IRS to retrieve the relevant documents searched. Our experiments are based primarily on a medium size corpus of arabic text. The results obtained shown us that there are a global improvement in the performance of the arabic IRS.",
    "creator" : "þÿ"
  }
}