{
  "name" : "1307.3489.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : null,
    "authors" : [ "ARABIC PART", "SPEECH TAGGING", "Bilel Ben Ali", "Fethi Jarray" ],
    "emails" : [ "bilel_benali@yahoo.fr", "Fethi_jarray@yahoo.fr" ],
    "sections" : [ {
      "heading" : null,
      "text" : "DOI : 10.5121/ijnlc.2013.2301 01\nWith the growing number of textual resources available, the ability to understand them becomes critical. An essential first step in understanding these sources is the ability to identify the parts-of-speech in each sentence. Arabic is a morphologically rich language, which presents a challenge for part of speech tagging. In this paper, our goal is to propose, improve, and implement a part-of-speech tagger based on a genetic algorithm. The accuracy obtained with this method is comparable to that of other probabilistic approaches.\nKEYWORDS\nPart-of-Speech Tagging, Genetic algorithm, Natural Language Processing, Part-of-Speech tagger, Tagset, Training tables & corpus."
    }, {
      "heading" : "1. INTRODUCTION",
      "text" : "Arabic is garnering attention in the Natural Language Processing (NLP) community due to its socio-political importance and its linguistic differences from Indo-European languages. These linguistic characteristics, especially dialect differences and complex morphology present interesting challenges for NLP researchers.\nPart-Of-Speech Tagging(POST) also known as POS-tagging, word classes, morphological classes, lexical tags or just Tagging is one of the basic tools and components necessary for any robust Natural Language Processing (NLP) infrastructure of a given language. Examples of partsof-speech are noun, verb, pronoun, preposition, adverb, adjective or other tags. In analyzing the syntactic structure of sentences in a text it is necessary to group words into classes or categories. Part-of-Speech Tagging is a linguistic procedure which attaches word category information to the words in a text.\nMore formally, given a sentence S, which can be defined as a string of words w0,w1,...,wi,...,wn (n=length of S). Part- of-speech tagging is the process of assigning each word wi of S a corresponding tag from the set of tags.\nThe result of a part-of-speech tagging maybe in itself is not so interesting, but there are many applications in language technology where this information is useful. For example, POST is considered as one of the basic tools needed in speech recognition, natural language parsing, information retrieval, information extraction, Question Answering, Speech Recognition, Text-tospeech conversion, Machine Translation, Grammar Correction and many more. It is also one of the main tools needed to develop any language corpus.\nThe genetic algorithm (GA) is a probabilistic search method based on the principles of natural selection. GA is a stochastic search method that has been successfully applied in many real applications of high complexity. A GA is an iterative technique that applies stochastic operators on a pool of individuals (tentative solutions). An evaluation function associates a value to every individual indicating its suitability to the problem. So far, GA has efficiently been used for the solution of combinatorial optimization problems. In this sense, it has been quite successful in many natural language applications for many languages (parsers, part of speech tagger ...). We aim to construct an Arabic Part-Of-Speech tagger with Genetic approach that assigns POS tags to an input text.\nThe remainder of this paper is organized as follows: The next section is allocated to present a survey of the current approaches in part of speech taggers. In section 3, we explain the benefits of Genetic Algorithms. In section 4, we develop a genetic approach on Arabic Part-of-Speech Tagging Problem. In the last section, we present and discuss numerical results."
    }, {
      "heading" : "2. TAGGING TECHNIQUES",
      "text" : "Several approaches have been used for building POS taggers such as Linguistic, Statistical, Hybrid, Memory and Transformation Based Learning Approach explained below."
    }, {
      "heading" : "2.1. Rule-Based Approach",
      "text" : "This system is based on finding and correcting errors. During the training period and from a manually tagged training corpus, the system recognizes its own weaknesses and corrects them by constructing a rule base [1] [2]. Two types of rules are used in the tagger Eric Brill [3]:\n• Lexical rules: define the label of the word based on its lexical properties. • Contextual rules: refine the labeling, that is to say to return to previously assigned labels\nand correct by examining the local context.\nBoth types of rules have the form:\n- If a word is labeled A is in a context C, then change it to B (contextual rule). - If a word has lexical property P, then assign the label A (lexical rule). The limitations of this approach are that the rule-based taggers are non-automatic, costly and time-consuming."
    }, {
      "heading" : "2.2. Probabilistic/Statistical Approach",
      "text" : "After 1980’s Statistical approach [4] [5] [6] came into existence and gained more popularity, this approach requires much less human effort, successful model during the last years Hidden Markov Models and related techniques have focused on building probabilistic models of tag transition sequences in sentence. Results produced by statistical taggers are giving about 95%-97% of correctly tagged words. However, these statistical part of speech taggers have several potential drawbacks: they are inflexible (use the same strategy for determining the tag of every word), tagging process use only a small amount of information (the bigram method use information of the preceding word) [8]."
    }, {
      "heading" : "2.3. Hybrid Approach",
      "text" : "A combination of both statistical and rule-based methods has also been used to develop hybrid taggers [9] [10]. These seem to produce a higher rate of accuracy. An accuracy of 98% has been reported by Tapanainen and Voultilainen (1994) [11] [12]."
    }, {
      "heading" : "2.4. Transformation-Based Learning",
      "text" : "Transformation-Based Learning (TBL) often also called Brill tagging [13], was introduced by Eric Brill in 1994 and achieved an accuracy of 97.2% [14] [15] in same corpus outperforming HMM tagger. The learning algorithm starts by building a lexicon that combines the benefits of both rule-based and probabilistic parts-of-speech tagging. Usually the tagger first assigns to every word the most likely part-of-speech. This will introduce several errors. The next step is to correct as many errors as possible by applying transformation rules that the tagger has learned."
    }, {
      "heading" : "2.5. Memory-Based Learning",
      "text" : "Memory-Based Learning (MBL) [16] [17] [18] is a simple learning method where examples are massively retained in memory. The similarity between memory examples and new examples is used to predict the outcome of a new example. MBL contains two components:\n• A learning component which is memory storage. • A performance component that does similarity-based classification."
    }, {
      "heading" : "3. BENIFITS OF GENETIC ALGORITHMS",
      "text" : "The search of an optimal solution in GA is heuristic by its nature; heuristic is a rule of thumb that probably leads to a solution. It plays a major role in search strategies because of exponential nature of the most problems. Heuristics help to reduce the number of alternatives from an exponential number to a polynomial number. Possible solutions are suggested and fitness values obtained for the solutions. Then GA, through generations of evolution, provides the possible optimal solutions. In this way, the time complexity of O(pn) is reduced to O(P*f(n)). The function f(n) [19] gives a dependency between the number of possible selections and the generations needed to provide an optimal solution [20]. The integer n is the number of entities in the solution (it is equal to the number of genes in the chromosome). For a sentence of 10 words each with 4 possible tags, in GA, the computation effort will be 10* 20*100 = 20.000, given a population size of 20 and 100 generations. This compares very favorably to 410 times of computations in an exhaustive approach.\nGAs search for an optimal solution is very much longer that those of Hidden Markov Model (HMM) and Recurrent Neural Net (RNN). In later cases, the time consuming part is the training step. After training, they normally provide the optimal solution in few times. Typically, a HMM tagger tags more than 100 sentences in one second [21]. Thus it takes least times than the GA tagging process. However, we have to consider the long training time for HMM and RNN. Sometimes, it takes several days and nights to train a RNN. In GA, after obtaining the necessary parameters (training tables, possible tags of each word), it is ready to provide the solution. GA is therefore readily adaptable to the changing inputs whereas, in RNN, it is more difficult to make them adaptable to the change of inputs. HMM can sometimes be as fast, but it is not as flexible as GA in including rules and functions into its computations."
    }, {
      "heading" : "4. APPLICATION OF GENETIC ALGORITHM IN TAGGING PROBLEM",
      "text" : "Genetic algorithm (GA) is the most popular evolutionary algorithm used successfully in difficult optimization and search problems. It consists of a population of trials, a fitness function to map the genotype trials to real numbered phenotypes, and a set of genetic operators to create new trials."
    }, {
      "heading" : "4.1. Preliminary Data Setup",
      "text" : "Preparing data for a given tool is an important phase to achieve the goal into consideration. That is why we spent some time on the construction of these data (Hand-Tagged corpora, Tagset and Training Tables).\nFor the training corpus we are obliged to construct our own corpus because of its non availability for free for Arabic language. We took the EASC corpus [22] that contains many articles talking about the ten following ”categories”: Art and Music, religion, education, science and technology, environment, sports, finance, tourism, health, politics. To enrich our work and to cover as much as possible frequent words in Arabic we decide to tag some articles from each domain in the watan corpora [23]. Our tagged corpus is constructed as follows: we tag some articles manually, then we execute our tagger taking an article not tagged as an input, then we do the verification manually, we add it to our corpus and so on.\nThe set of tags contain 22 tags (without punctuation marks) that identify the main tokens in Arabic Language. The choice of these tags was obtained from an adaptation of the tag set English into Arabic during the creation of our corpus. The tag set of this corpus is not too large, what favors the accuracy of the system. Moreover, this tag set has been reduced by grouping some related tags under a unique name tag, what improves statistics.\nTraining tables are extracted from the corpus, stored into a file, sorted and counted. These tables are extracted as follows: we took to the training corpus and we compute the occurrence of each tag occurred in our training corpus in a gived context. The contexts corresponding to the position at the beginning and the end of the sentences lack tags on the left-hand side and on the right-hand side respectively, this is managed by introducing a special tag, NULL, to complete the context. These tables have the following structure:\nLClLC ... LC2 LC1 T RC1 RC2 ... RClRC\nWhere lLC the size of left context and lRC the size of right context of the current tag T. For example, if lLC = lRC = 2, the structure of the training the table could have the following form:"
    }, {
      "heading" : "CN Prep Res Res CN 6",
      "text" : ""
    }, {
      "heading" : "PN CN Prep Res Res 1 Null PN CN Prep Res 4 Null Null PN CN Prep 135",
      "text" : ""
    }, {
      "heading" : "CN Prep V Null Null 105 ...",
      "text" : "We have also constructed a table that records all possible tags of each word occurred in the training corpus. This table stored in a file is useful in the initialization of the first population and\nin the mutation step, each tag is replaced with a valid tag corresponding to the word that we focus on and this information is extracted from this table."
    }, {
      "heading" : "4.2. Individual Representation",
      "text" : "Each gene represents a tag. This representation consists of as many genes as words there are in our sentence, and its values will be integer numbers. The chromosome will indicate the tag of each word. This type of coding has an interest to make it possible to create operators of simple crossing and mutation."
    }, {
      "heading" : "4.3. Initial Population",
      "text" : "For a given sentence of the test corpora, the chromosomes forming the initial population are created by selecting from our training corpus one of the valid tags for each word that appear most frequently in that given context. Words not appearing in the training corpus are assigned the tag which appears more often with that given context in the Hand-Tagged Corpora. Each gene corresponds to each word in the sentence to be tagged. The figure 1 shows some individual examples."
    }, {
      "heading" : "4.4. Fitness Function",
      "text" : "This function is related to the total probability of the sequence of tags of an individual. The raw data to obtain this probability are extracted from the training table. The fitness of an individual is defined as the sum of the fitness of its genes (∑i f( gi )). The fitness of a gene is defined as:\n(1)\nWhere (P(T|LC, RC)) is the probability that the tag of gene g is T, given that its context is formed by the sequence of tags LC to the Left Context and the sequence RC to the right. This probability is estimated from the training table as:\n(2)\nWhere occ(LC, T, RC) is the number of occurrences of the list of tags LC, T, RC in the training table, and T” is the set of all tags.\nA particular sequence LC, T, RC may not be listed in the training table, because there is insufficient statistics. In these cases we proceed by successively reducing the size of the context, alternatively ignoring the rightmost and then the leftmost tag of the remaining sequence (skipping the corresponding step whenever either RC or LC are empty) until one of these shorter sequences matches at least one of the training table entries or until we are left simply with T. In this latter case we take as fitness the logarithm of the frequency with which T appears in the corpus.\n∑ ∈ ≈ ''' ),',(\n),,( RC)LC,|P(T\nTT RCTLCocc\nRCTLCocc\n)),(log()( RCLCTPgf =\nFor example if we are evaluating the second individual of Figure 1 and we are considering contexts composed of one tag on the left and one tag on the right of the position evaluated, we have the following formula:\n(3)\n(4)\nFor the others genes with the same manner, where occ represents the number of occurrences of the context and T’ the set of all possible tags."
    }, {
      "heading" : "5. GENETIC OPERATORS",
      "text" : ""
    }, {
      "heading" : "5.1. Operator of Selection",
      "text" : "This operator is responsible for defining what are the individuals in the population P that will be duplicated in the new population P’ and will serve as parents (applying the crossover operator). There are several methods of selection. We use roulette-wheel selection of Goldberg (1989) [24] [20]. With this method each individual has a chance of being selected proportional to its performance, so more individuals are adapted to the problem, the more likely they are to be selected."
    }, {
      "heading" : "5.2. Operator of Crossing",
      "text" : "The purpose of the crossing is to enrich diversity of the population by handling the structure of the chromosomes. Classically, the crossings are considered with two parents and generate two children. Initially, to apply uniform crossover, two individuals are selected with a probability proportional to their fitness, crossover is applied with a probability given by the crossover rate. Then a binary array called mask crossover is filled with random values. This mask is intended to know for each locus, of which parent the first child should inherit the gene therein; if faced with the mask has a locus a 0, the child inherit the gene therein of parent 1, if it has a 1 he will inherit a parent’s 2. The creation of child 2 is symmetrically, thus dividing both individuals in two parts which produce two children C1 and C2 (see Figure 2).\n) )NULLT'ProperNoun( )NULLVerbProperNoun( log()( 1 occ occ gf =\n) )VerbT'nPrepositio( )VerbProperNounnPrepositio( log()( 2 occ occ gf ="
    }, {
      "heading" : "5.3. Operator of mutation",
      "text" : "The operator of mutation brings to the genetic algorithms the property of ergodicity of course of space. This property indicates that the genetic algorithm will be likely to reach all the points of the space of state, without to traverse them all in the process of resolution. Mutation is then applied to every gene of the individuals resulting from the crossover operation with a probability given by the mutation rate. The number of individuals that remain unchanged in one generation depends on the crossover and mutation rates.\nFinally the tag of the mutation point is replaced by another of the valid tags of the corresponding word."
    }, {
      "heading" : "6. TAGGING EXPERIMENTS",
      "text" : "In this section, we will explain our experimental results on part-of-speech tagging. Direct comparison of performance between researchers is difficult, compounded by variance in corpora, tagset and grading criteria. To calculate Tagging Accuracy Rate (TAR) we use the following formula:\n(5)\nWe will measure the impact of many parameters related to our implemented tagger.\n6.1. Influence of the size of training corpus:\nFigure 3 shows Tagger accuracy rate as a function of training corpus size. This curve was generated by training on successive portions of our training corpus. The curve indicates that performance benefit can be obtained by increasing training set size. The Figure 3 illustrates the performance when using different sizes of corpus and it concludes that with the increase in the size of the corpus, the performance of the tagger also increases.\nIf we train the tagger on large amount of data we get accurate tagging results, where the reason behind this is that when we increase the corpus size we get more combination of tags, which leads to a variety of contexts in training tables that cover various aspects of multiple tags. Thus it concludes that results are dependent on fraction of training data used to train the Tagger. Therefore considering the sizes of corpus used for the experiments, our tagger achieved remarkable accuracy with a limited corpus.\nfilereferenceofsegmentsallofNumber\ncorrectly taggedsegmentsofNumber=TAR\n6.2. Influence of Context Size:\nThe context information has a big influence on the performance of our tagger. The way in which this information is used can increase or decrease the TAR. This information can be varied and have different sizes. Usually two or three preceding words and one or two succeeding words is sufficient. For us we use context size 1-1, 2-2 and 3-2.\nThe figure 4 shows that the small context size 1- 1 gives best results, and we can explain this by that there are many entries of training tables with larger contexts are not significants. It may be noted also that large context requires more time due to the growing of the size of training tables.\n6.3. Influence of population size:\nThe TAR increase with the increasing of population size but we found that population with small size are enough to obtain high accuracy. This can be explained by: the sentences are tagged one by one and so in general a small population is enough to represent the variety of possible\ntaggings. So we are not obliged to start our tagger with a very big population size that does minimize the time of convergence. If population size is too large the GA will take too long time to converge.\n6.2. Influence of mutation rate\nTo prevent to evolve into a local maximum the mutation rate of a Genetic Algorithm is very influential. Many mutation settings have been tried, but only four were eventually reported. The other values do not show a completely different way in the evolutionary process.\nDuring the testing of these variables the same training sets were used. As can be seen in Figure 6, the 5% mutation rate is most constant over the generations. The results clearly show that a rate of about 0.05 is the best probability to let an individual mutate. This will create enough diversity and prevents the algorithm to grow to a local maximum. This is most desirable because sudden changes in the algorithm could offset it in a wrong way.\n6.3. Influence of crossover parameter\nWe found on the figure 7 the effectiveness of uniform crossover face one point crossover. In 1- point crossover, the crossover site is randomly selected and in uniform crossover the crossover mask is generated randomly. Uniform crossover is more disruptive in general, it also has a capacity of combining more schemata than 1-point crossover , and this explains results shown in the figure 7."
    }, {
      "heading" : "7. CONCLUSIONS",
      "text" : "We have presented a Genetic approach for Arabic POS tagging that does not suppose segmentation, which would be unrealistic for Arabic language. The approach is competitive although it uses a reduced POS tagset wich allows to obtain interesting results. However, we cannot make direct comparisons with another approach due to the unavailability of standardization of the division of data set into training and test data. The results of our experiments suggest that the Genetic algorithm is a robust enough approach for tagging texts of natural language, obtaining accuracies comparable to other statistical systems. The tests indicate that the length of the contexts surrounding each word extracted for the training and the size of training corpora are determining factors for the results, also our tagger is based on the genetic algorithm which is susceptible to local maximum. Crossover, mutation, together with fitness proportionate selection, serves as a global strategy which can redirect the genetic algorithm to other areas of the search space and grow to the global maximum.\nOther possible future works can be reached with genetic approach such as parsing and many other different Natural Language Processing (NLP) tasks."
    } ],
    "references" : [ {
      "title" : "A rule-based approach for tagging non-vocalized arabic words",
      "author" : [ "A. Al-taani", "S.A. Al-rub" ],
      "venue" : "2008.",
      "citeRegEx" : "1",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "Parts of speech tagging for indian languages: A literature survey",
      "author" : [ "J D.S.K.P. Antony P" ],
      "venue" : "International Journal of Computer Applications, vol. 34, no. 8, February 2011.",
      "citeRegEx" : "2",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "A simple rule-based part of speech tagger",
      "author" : [ "E. Brill" ],
      "venue" : "1992.",
      "citeRegEx" : "3",
      "shortCiteRegEx" : null,
      "year" : 1992
    }, {
      "title" : "Outils gnriques pour l’tiquetage morphosyntaxique de la langue arabe : segmentation et corpus d’entranement",
      "author" : [ "G. DHAOU" ],
      "venue" : "UFR Sciences du Langage, vol. 98, no. 33-36, 2010-2011.",
      "citeRegEx" : "4",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "Probabilistic part-of-speech tagging using decision trees",
      "author" : [ "H. Schmid" ],
      "venue" : "1994.",
      "citeRegEx" : "5",
      "shortCiteRegEx" : null,
      "year" : 1994
    }, {
      "title" : "Statistical part-of-speech tagging for classical chinese",
      "author" : [ "L. Huang", "Y. Peng", "H. Wang", "Z. Wu" ],
      "venue" : "Proceedings of the 5th International Conference on Text, Speech and Dialogue, ser. TSD ’02. London, UK, UK: Springer-Verlag, 2002, pp. 115–122. [Online]. Available: http://dl.acm.org/citation.cfmid=647240.718633",
      "citeRegEx" : "6",
      "shortCiteRegEx" : null,
      "year" : 2002
    }, {
      "title" : "Tagging by combining rules-based method and memory-based learning",
      "author" : [ "T.-G. Yamina" ],
      "venue" : "World Academy of Science, Engineering and Technology, vol. 5, June 2005.",
      "citeRegEx" : "7",
      "shortCiteRegEx" : null,
      "year" : 2005
    }, {
      "title" : "A survey on statistical approaches to natural language processing",
      "author" : [ "Z.B. Wu", "L.S. Hsu", "C.L. Tan" ],
      "venue" : "Tech. Rep., 1992.",
      "citeRegEx" : "8",
      "shortCiteRegEx" : null,
      "year" : 1992
    }, {
      "title" : "Pos tagging of dialectal arabic: A minimally supervised approach",
      "author" : [ "T. Nakagawa", "“A hybrid approach to word segmentation", "pos tagging.” [10 T. Nakagawa", "K. Uchimoto", "“A hybrid approach to word segmentation", "pos tagging", "” in Proceedings of the 45th Annual Meeting of the ACL on Interactive Poster", "Demonstration Sessions", "PA ser. ACL ’07. Stroudsburg", "USA: Association for Computational Linguistics", "2007", "pp. 217–220. [Online]. Available: http://dl.acm.org/citation.cfmid=1557769.1557832 [11] S. KHOJA", "“Apt: Arabic part-of-speech tagger", "” Computing Department", "UK Lancaster University Lancaster LA1 4YR", "vol. 6. [12] Y. Tlili-Guiassa", "“Hybrid method for tagging arabic text", "” 2006. [13] E. Brill", "“Transformation-based error-driven learning", "natural language processing: A case study in part-of-speech tagging", "” Computational Linguistics", "vol. 21", "pp. 543–565", "1995. [14] U.I.B. Fareena Naz", "Waqas Anwar", "E.U. Munir", "“Urdu part of speech tagging using transformation based error driven learning", "” Department of Computer Science", "COMSATS Institute of Information Technology", "Abbottabad", "Pakistan Department of Computer Science", "COMSATS Institute of Information Technology", "Wah Cantt", "Pakistan", "vol. 12", "no. 437-448", "2012. [15] W.B. Shabib AlGahtani", "J. McNaught", "“Arabic part-of-speech tagging using transformationbased learning", "” in Proceedings of the Second International Conference on Arabic Language Resources", "Tools", "K. Choukri", "B. Maegaard", "Eds. Cairo", "Egypt: The MEDAR Consortium", "April 2009.  International Journal on Natural Language Computing (IJNLC) Vol. 2", "No.3", "June 2013 12 [16] W. Daelemans", "J. Zavrel", "P. Berck", "S. Gillis", "“Mbt: A memory-based part of speech tagger generator", "” in PROC. OF FOURTH WORKSHOP ON VERY LARGE CORPORA. ACL SIGDAT", "1996", "pp. 14–27. [17] E. Marsi", "A. van den Bosch", "“Memory-based morphological analysis generation", "part-ofspeech tagging of arabic", "” 2005. [18] J. Zavrel", "W. Daelemans", "“Recent advances in memory-based part-of-speech tagging", "” in In VI Simposio Internacional de Comunicacion Social", "1999", "pp. 590–597. [19] K.T. Lua", "“Part of speech tagging of chinese sentences using genetic algorithm", "” Conference on Chinese Computing", "Institute of System Sciences", "National University of Singapore", "vol. 8", "1996. [20] L. Araujo", "“Part-of-speech tagging with evolutionary algorithms", "” in Proceedings of the Third International Conference on Computational Linguistics", "Intelligent Text Processing", "UK ser. CICLing ’02. London", "UK: Springer-Verlag", "2002", "pp. 230–239. [Online]. Available: http://dl.acm.org/citation.cfmid=647344.724009 [21] D.J. . J.H.Martin", "“Speech", "language processing: An introduction to natural language processing", "computational linguistics", "speech recognition", "” vol. 57", "February 2006. [22] M. El-Haj", "“Easc corpus.” [Online]. Available: http://privatewww.essex.ac.uk/ melhaj/form.htm [23] Watan", "“Watan 2004 corpus", "” 2004. [Online]. Available: http://sourceforge.net/projects/arabiccorpus/files/watan-2004corpus/ [24] K. Duh", "K. Kirchhoff" ],
      "venue" : "Department of Electrical Engineering University of Washington, Seattle, WA, 98195, vol. 8. Authors Bilel Ben Ali: Phd student, LOGIQ Resarch Unit, University of Sfax, Tunisia. Fethi Jarray: Higher Institute of computer science-Medenine, University of Gabes, Tunisia.  Photo",
      "citeRegEx" : "9",
      "shortCiteRegEx" : null,
      "year" : 0
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "During the training period and from a manually tagged training corpus, the system recognizes its own weaknesses and corrects them by constructing a rule base [1] [2].",
      "startOffset" : 158,
      "endOffset" : 161
    }, {
      "referenceID" : 1,
      "context" : "During the training period and from a manually tagged training corpus, the system recognizes its own weaknesses and corrects them by constructing a rule base [1] [2].",
      "startOffset" : 162,
      "endOffset" : 165
    }, {
      "referenceID" : 2,
      "context" : "Two types of rules are used in the tagger Eric Brill [3]: • Lexical rules: define the label of the word based on its lexical properties.",
      "startOffset" : 53,
      "endOffset" : 56
    }, {
      "referenceID" : 3,
      "context" : "Probabilistic/Statistical Approach After 1980’s Statistical approach [4] [5] [6] came into existence and gained more popularity, this approach requires much less human effort, successful model during the last years Hidden Markov Models and related techniques have focused on building probabilistic models of tag transition sequences in sentence.",
      "startOffset" : 69,
      "endOffset" : 72
    }, {
      "referenceID" : 4,
      "context" : "Probabilistic/Statistical Approach After 1980’s Statistical approach [4] [5] [6] came into existence and gained more popularity, this approach requires much less human effort, successful model during the last years Hidden Markov Models and related techniques have focused on building probabilistic models of tag transition sequences in sentence.",
      "startOffset" : 73,
      "endOffset" : 76
    }, {
      "referenceID" : 5,
      "context" : "Probabilistic/Statistical Approach After 1980’s Statistical approach [4] [5] [6] came into existence and gained more popularity, this approach requires much less human effort, successful model during the last years Hidden Markov Models and related techniques have focused on building probabilistic models of tag transition sequences in sentence.",
      "startOffset" : 77,
      "endOffset" : 80
    }, {
      "referenceID" : 7,
      "context" : "However, these statistical part of speech taggers have several potential drawbacks: they are inflexible (use the same strategy for determining the tag of every word), tagging process use only a small amount of information (the bigram method use information of the preceding word) [8].",
      "startOffset" : 280,
      "endOffset" : 283
    }, {
      "referenceID" : 8,
      "context" : "A combination of both statistical and rule-based methods has also been used to develop hybrid taggers [9] [10].",
      "startOffset" : 102,
      "endOffset" : 105
    } ],
    "year" : 2013,
    "abstractText" : "With the growing number of textual resources available, the ability to understand them becomes critical. An essential first step in understanding these sources is the ability to identify the parts-of-speech in each sentence. Arabic is a morphologically rich language, which presents a challenge for part of speech tagging. In this paper, our goal is to propose, improve, and implement a part-of-speech tagger based on a genetic algorithm. The accuracy obtained with this method is comparable to that of other probabilistic approaches.",
    "creator" : "Microsoft Office Word"
  }
}