{
  "name" : "1309.5391.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Even the Abstract have Colour: Consensus in Word–Colour Associations",
    "authors" : [ "Saif M. Mohammad" ],
    "emails" : [ "saif.mohammad@nrc-cnrc.gc.ca" ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "Colour is a vital component in the successful delivery of information, whether it is in marketing a commercial product (Sable and Akcay, 2010), in web design (Meier, 1988; Pribadi et al., 1990), or in information visualization (Christ, 1975; Card et al., 1999). Since real-world concepts have associations with certain colour categories (for example, danger with red, and softness with pink), complementing linguistic and non-linguistic information with appropriate colours has a number of benefits, including: (1) strengthening the message (improving semantic coherence), (2) easing cognitive load on the receiver, (3) conveying the message quickly, and (4) evoking\nthe desired emotional response. Consider, for example, the use of red in stop signs. Drivers are able to recognize the sign faster, and it evokes a subliminal emotion pertaining to possible danger, which is entirely appropriate in the context. The use of red to show areas of high crime rate in a visualization is another example of good use of colour to draw emotional response. On the other hand, improper use of colour can be more detrimental to understanding than using no colour (Marcus, 1982; Meier, 1988).\nA word has strong association with a colour when the colour is a salient feature of the concept the word refers to, or because the word is related to a such a concept. Many concept–colour associations, such as swan with white and vegetables with green, involve physical entities. However, even abstract notions and emotions may have colour associations (honesty–white, danger–red, joy–yellow, anger–red). Further, many associations are culturespecific (Gage, 1969; Chen, 2005). For example, prosperity is associated with red in much of Asia.\nUnfortunately, there exists no lexicon with any significant coverage that captures these concept– colour associations, and a number of questions remain unanswered, such as, the extent to which humans agree with each other on these associations, and whether physical concepts are more likely to have a colour association than abstract ones.\nIn this paper, we describe how we created a large word–colour lexicon by crowdsourcing with effective quality control measures (Section 3), as well as experiments and analyses to show that:\n• More than 30% of the terms have a strong colour association (Sections 4).\nar X\niv :1\n30 9.\n53 91\nv1 [\ncs .C\nL ]\n2 0\nSe p\n• About 33% of thesaurus categories have strong colour associations (Section 5). • Abstract terms have colour associations almost as often as physical entities do (Section 6). • There is a strong association between different emotions and colours (Section 7).\nThus, using the right colours can not only improve semantic coherence, but also inspire the desired emotional response."
    }, {
      "heading" : "2 Related Work",
      "text" : "The relation between language and cognition has received considerable attention over the years, mainly on answering whether language impacts thought, and if so, to what extent. Experiments with colour categories have been used both to show that language has an effect on thought (Brown and Lenneberg, 1954; Ratner, 1989) and that it does not (Bornstein, 1985). However, that line of work does not explicitly deal with word–colour associations. In fact, we did not find any other academic work that gathered large word–colour associations. There is, however, a commercial endeavor—Cymbolism1.\nChild et al. (1968), Ou et al. (2011), and others show that people of different ages and genders have different colour preferences. (See also the online study by Joe Hallock2.) In this work, we are interested in identifying words that have a strong association with a colour due to their meaning; associations that are not affected by age and gender preferences.\nThere is substantial work on inferring the emotions evoked by colour (Luscher, 1969; Kaya, 2004). Strapparava and Ozbal (2010) compute corpusbased semantic similarity between emotions and colours. We combine a word–colour and a word– emotion lexicon to determine the association between emotion words and colours.\nBerlin and Kay (1969), and later Kay and Maffi (1999), showed that often colour terms appeared in languages in certain groups. If a language has only two colour terms, then they are white and black. If a language has three colour terms, then they tend to be white, black, and red. Such groupings are seen for up to eleven colours, and based on these groupings, colours can be ranked as follows:\n1http://www.cymbolism.com/about 2http://www.joehallock.com/edu/COM498/preferences.html\n1. white, 2. black, 3. red, 4. green, 5. yellow, 6. blue, 7. brown, 8. pink, 9. purple, 10. orange, 11. grey (1)\nThere are hundreds of different words for colours.3 To make our task feasible, we chose to use the eleven basic colour words of Berlin and Kay (1969).\nThe MRC Psycholinguistic Database (Coltheart, 1981) has, among other information, the imageability ratings for 9240 words.4 The imageability rating is a score given by human judges that reflects how easy it is to visualize the concept. It is a scale from 100 (very hard to visualize) to 700 (very easy to visualize). We use the ratings in our experiments to determine whether there is a correlation between imageability and strength of colour association."
    }, {
      "heading" : "3 Crowdsourcing",
      "text" : "We used the Macquarie Thesaurus (Bernard, 1986) as the source for terms to be annotated by people on Mechanical Turk.5 Thesauri, such as the Roget’s and Macquarie, group related words into categories. These categories can be thought of as coarse senses (Yarowsky, 1992; Mohammad and Hirst, 2006). If a word is ambiguous, then it is listed in more than one category. Since we were additionally interested in determining colour signatures for emotions (Section 7), we chose to annotate all of the 10,170 word– sense pairs that Mohammad and Turney (2010) used to create their word–emotion lexicon. Below is an example questionnaire:\nQ1. Which word is closest in meaning to sleep? • car • tree • nap • olive\nQ2. What colour is associated with sleep? • black • blue • brown • green • grey • orange • purple • pink • red • white • yellow\nQ1 is a word choice question generated automatically by taking a near-synonym from the thesaurus and random distractors. If an annotator answers this question incorrectly, then we discard information from both Q1 and Q2. The near-synonym also guides the annotator to the desired sense of the word. Further, it encourages the annotator to think clearly\n3See http://en.wikipedia.org/wiki/List of colors 4http://www.psy.uwa.edu.au/mrcdatabase/uwa mrc.htm 5Mechanical Turk: www.mturk.com\nabout the target word’s meaning; we believe this improves the quality of the annotations in Q2.\nThe colour options in Q2 were presented in random order. We do not provide a “not associated with any colour” option to encourage colour selection even if the association is weak. If there is no association between a word and a colour, then we expect low agreement for that term. We requested annotations from five different people for each term.\nThe annotators on Mechanical Turk, by design, are anonymous. However, we requested annotations from US residents only."
    }, {
      "heading" : "4 Word–Colour Association",
      "text" : "About 10% of the annotations had an incorrect answer to Q1. Since, for these instances, the annotator did not know the meaning of the target word, we discarded the corresponding colour association response. Terms with less than three valid annotations were discarded from further analysis. Each of the remaining terms has, on average, 4.45 distinct annotations. The information from multiple annotators was combined by taking the majority vote, resulting in a lexicon with 8,813 entries. Each entry contains a unique word–synonym pair, majority voted colour(s), and a confidence score—number of votes for the colour / number of total votes. (For the analyses in Sections 5, 6, and 7, ties were broken by picking one colour at random.) A separate version of the lexicon that includes entries for all of the valid annotations by each of the annotators is also available.6\nThe first row in Table 1 shows the percentage of times different colours were associated with the target term. The second row shows percentages after taking a majority vote of the annotators. Even though the colour options were presented in random order, the order of the most frequently associated colours is identical to the Berlin and Kay order (Section 2:(1)).\nThe number of ambiguous words annotated was 2924. 1654 (57%) of these words had senses that\n6Please contact the author to obtain a copy of the lexicon.\nwere associated with at least two different colours. Table 4 gives a few examples.\nTable 4 shows how often the majority class in colour associations is 1, 2, 3, 4, and 5, respectively. If we assume independence, then the chance that none of the 5 annotators agrees with each other (majority class size of 1) is 1× 10/11× 9/11× 8/11× 7/11 = 0.344. Thus, if there was no correlation among any of the terms and colours, then 34.4% of the time none of the annotators would have agreed with each other. However, this happens only 15.1% of the time. A large number of terms have a majority class size ≥ 2 (84.9%), and thus have more than chance association with a colour. One can argue that terms with a majority class size ≥ 3 (32%) have strong colour associations.\nBelow are some reasons why agreement values are much lower than certain other tasks, for example, part of speech tagging:\n• The annotators were not given a “not associated with any colour” option. Low agreement for certain instances is an indicator that these words have weak, if any, colour association. Therefore, inter-annotator agreement does not correlate with quality of annotation.\n• Words are associated with colours to different degrees. Some words may be associated with more than one colour by comparable degrees, and there might be higher disagreement. • The target word–sense pair is presented out of context. We expect higher agreement if we provided words in context, but words can occur in innumerable contexts, and annotating too many instances of the same word is costly.\nNonetheless, the lexicon is useful for downstream applications because any of the following strategies may be employed: (1) choosing colour associations from only those instances with high agreement, (2) assuming low-agreement terms have no colour association, (3) determining colour association of a category through information from many words, as described in the next section."
    }, {
      "heading" : "5 Category–Colour Association",
      "text" : "Different words within a thesaurus category may not be strongly associated with any colour, or they may be associated with many different colours. We now determine whether there exist categories where the semantic coherence carries over to a strong common association with one colour.\nWe determine the strength of colour association of a category by first determining the colour c most associated with the terms in it, and then calculating the ratio of the number of times a word from the category is associated with c to the number of words in the category associated with any colour. Only cate-\ngories that had at least four words that also appear in the word–colour lexicon were considered; 535 of the 812 categories from Macquarie Thesaurus met this condition. If a category has exactly four words that appear in the colour lexicon, and if all four words are associated with different colours, then the category has the lowest possible strength of colour association—0.25 (1/4). 19 categories had a score of 0.25. No category had a score less than 0.25. Any score above 0.25 shows more than random chance association with a colour. There were 516 such categories (96.5%). 177 categories (33.1%) had a score 0.5 or above, that is, half or more of the words in these categories are associated with one colour. We consider these to be strong associations."
    }, {
      "heading" : "6 Imageability",
      "text" : "It is natural for physical entities of a certain colour to be associated with that colour. However, abstract concepts such as danger and excitability are also associated with colours—red and orange, respectively. Figure 1 displays an experiment to determine whether there is a correlation between imageability and association with colour.\nWe define imageability of a thesaurus category to be the average of the imageability ratings of words in it. We calculated imageability for the 535 categories described in the previous section using only the words that appear in the colour lexicon. Figure 1 shows the scatter plot of these categories on the imageability and strength of colour association axes. If\nhigher imageability correlated with greater tendency to have a colour association, then we would see most of the points along the diagonal moving up from left to right. Instead, we observe that the strongly associated categories are spread all across the imageability axis, implying that there is only weak, if any, correlation. Imageability and colour association have a Pearson’s product moment correlation of 0.116, and a Spearman’s rank order correlation of 0.102."
    }, {
      "heading" : "7 The Colour of Emotion Words",
      "text" : "Emotions such as joy, sadness, and anger are abstract concepts dealing with one’s psychological state. As pointed out in Section 2, there is prior work on emotions evoked by colours. In contrast, here we investigate the colours associated with emotion words. We combine the word–emotion association lexicon compiled by Mohammad and Turney (2010; 2011) and our word–colour lexicon to determine the colour signature of emotions—the rows in Table 4. Notably, we see that all of the emotions have strong associations with certain colours. Observe that anger is associated most with red. Other negative emotions—disgust, fear, sadness—go strongest with black. Among the positive emotions: anticipation is most frequently associated with white and green; joy with white, green, and yellow; and trust with white, blue, and green. Table 4 shows the colour signature for terms marked positive and negative (these include terms that may not be associated with the eight basic emotions). Observe that the neg-\native terms are strongly associated with black and red, whereas the positive terms are strongly associated with white and green. Thus, colour can add to the potency of emotional concepts, yielding even more effective visualizations."
    }, {
      "heading" : "8 Conclusions and Future Work",
      "text" : "We created a large word–colour association lexicon by crowdsourcing. A word-choice question was used to guide the annotator to the desired sense of the target word, and to ensure data quality. We observed that abstract concepts, emotions in particular, have strong colour associations. Thus, using the right colours in tasks such as information visualization, product marketing, and web development, can not only improve semantic coherence, but also inspire the desired psychological response. Interestingly, we found that frequencies of colour choice in associations follow the same order in which colour terms occur in language (Berlin and Kay, 1969). Future work includes developing automatic corpusbased methods to determine the strength of word– colour association, and the extent to which strong word–colour associations manifest themselves as more-than-random chance co-occurrence in text."
    }, {
      "heading" : "Acknowledgments",
      "text" : "This research was funded by the National Research Council Canada (NRC). Grateful thanks to Peter Turney, Tara Small, Bridget McInnes, and the reviewers for many wonderful ideas. Thanks to the more than 2000 people who answered the colour survey with diligence and care."
    } ],
    "references" : [ {
      "title" : "Bernard",
      "author" : [ "J.R.L" ],
      "venue" : "editor.",
      "citeRegEx" : "Bernard1986",
      "shortCiteRegEx" : null,
      "year" : 1986
    }, {
      "title" : "A study in language",
      "author" : [ "Eric H. Lenneberg" ],
      "venue" : null,
      "citeRegEx" : "Lenneberg.,? \\Q1954\\E",
      "shortCiteRegEx" : "Lenneberg.",
      "year" : 1954
    }, {
      "title" : "Comparative studies",
      "author" : [ "Wei-bin Chen" ],
      "venue" : null,
      "citeRegEx" : "Chen.,? \\Q2005\\E",
      "shortCiteRegEx" : "Chen.",
      "year" : 2005
    }, {
      "title" : "Age and sex",
      "author" : [ "Frederick W. Hornbeck" ],
      "venue" : null,
      "citeRegEx" : "Hornbeck.,? \\Q1968\\E",
      "shortCiteRegEx" : "Hornbeck.",
      "year" : 1968
    }, {
      "title" : "Color and Culture: Prac",
      "author" : [ "John Gage" ],
      "venue" : null,
      "citeRegEx" : "Gage.,? \\Q1969\\E",
      "shortCiteRegEx" : "Gage.",
      "year" : 1969
    }, {
      "title" : "Relationship between color",
      "author" : [ "Naz Kaya" ],
      "venue" : null,
      "citeRegEx" : "Kaya.,? \\Q2004\\E",
      "shortCiteRegEx" : "Kaya.",
      "year" : 2004
    }, {
      "title" : "Color: a tool",
      "author" : [ "Aaron Marcus" ],
      "venue" : null,
      "citeRegEx" : "Marcus.,? \\Q1982\\E",
      "shortCiteRegEx" : "Marcus.",
      "year" : 1982
    }, {
      "title" : "Ace: a color expert",
      "author" : [ "Barbara J. Meier" ],
      "venue" : null,
      "citeRegEx" : "Meier.,? \\Q1988\\E",
      "shortCiteRegEx" : "Meier.",
      "year" : 1988
    }, {
      "title" : "Distributional measures of concept-distance: A task-oriented evaluation",
      "author" : [ "Mohammad", "Hirst2006] Saif Mohammad", "Graeme Hirst" ],
      "venue" : "In Proceedings of the Conference on Empirical Methods in Natural Language Processing,",
      "citeRegEx" : "Mohammad et al\\.,? \\Q2006\\E",
      "shortCiteRegEx" : "Mohammad et al\\.",
      "year" : 2006
    }, {
      "title" : "Emotions evoked by common words and phrases: Using mechanical turk to create an emotion lexicon",
      "author" : [ "Mohammad", "Turney2010] Saif Mohammad", "Peter Turney" ],
      "venue" : "In Proceedings of the NAACL-HLT 2010 Workshop on Computational Approaches",
      "citeRegEx" : "Mohammad et al\\.,? \\Q2010\\E",
      "shortCiteRegEx" : "Mohammad et al\\.",
      "year" : 2010
    }, {
      "title" : "Mohammad and Peter D",
      "author" : [ "M Saif" ],
      "venue" : "Turney.",
      "citeRegEx" : "Mohammad and Turney2011",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Neng-Chung Hu",
      "author" : [ "Li-Chen Ou", "M. Ronnier Luo", "Pei-Li Sun" ],
      "venue" : "and Hung-Shing Chen.",
      "citeRegEx" : "Ou et al.2011",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Wadlow",
      "author" : [ "Norma S. Pribadi", "Maria G" ],
      "venue" : "and Daniel Boyarski.",
      "citeRegEx" : "Pribadi et al.1990",
      "shortCiteRegEx" : null,
      "year" : 1990
    }, {
      "title" : "A sociohistorical critique of naturalistic theories of color perception",
      "author" : [ "Carl Ratner" ],
      "venue" : "Journal of Mind and Behavior,",
      "citeRegEx" : "Ratner.,? \\Q1989\\E",
      "shortCiteRegEx" : "Ratner.",
      "year" : 1989
    }, {
      "title" : "Color: Cross cultural marketing perspectves as to what governs our response",
      "author" : [ "Sable", "Akcay2010] Paul Sable", "Okan Akcay" ],
      "venue" : null,
      "citeRegEx" : "Sable et al\\.,? \\Q2010\\E",
      "shortCiteRegEx" : "Sable et al\\.",
      "year" : 2010
    }, {
      "title" : "Word-sense disambiguation using statistical models of Roget’s categories trained on large corpora",
      "author" : [ "David Yarowsky" ],
      "venue" : "In Proceedings of the 14th International Conference on Computational Linguistics",
      "citeRegEx" : "Yarowsky.,? \\Q1992\\E",
      "shortCiteRegEx" : "Yarowsky.",
      "year" : 1992
    } ],
    "referenceMentions" : [ ],
    "year" : 2013,
    "abstractText" : "Colour is a key component in the successful dissemination of information. Since many real-world concepts are associated with colour, for example danger with red, linguistic information is often complemented with the use of appropriate colours in information visualization and product marketing. Yet, there is no comprehensive resource that captures concept–colour associations. We present a method to create a large word–colour association lexicon by crowdsourcing. A wordchoice question was used to obtain sense-level annotations and to ensure data quality. We focus especially on abstract concepts and emotions to show that even they tend to have strong colour associations. Thus, using the right colours can not only improve semantic coherence, but also inspire the desired emotional response.",
    "creator" : "LaTeX with hyperref package"
  }
}