{
  "name" : "1311.6421.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Synchronous Context-Free Grammars and Optimal Linear Parsing Strategies",
    "authors" : [ "Pierluigi Crescenzi", "Daniel Gildea", "Andrea Marino", "Gianluca Rossi", "Giorgio Satta" ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : null,
      "text" : "ar X\niv :1\n31 1.\n64 21\nv1 [\ncs .F\nL ]\n2 5\nSynchronous Context-Free Grammars (SCFGs), also known as syntax-directed translation schemata [AU69, AU72], are unlike context-free grammars in that they do not have a binary normal form. In general, parsing with SCFGs takes space and time polynomial in the length of the input strings, but with the degree of the polynomial depending on the permutations of the SCFG rules. We consider linear parsing strategies, which add one nonterminal at a time. We show that for a given input permutation, the problems of finding the linear parsing strategy with the minimum space and time complexity are both NP-hard."
    }, {
      "heading" : "1 Introduction",
      "text" : "SynchronousContext-FreeGrammars (SCFGs) are widely used tomodel translational equivalence between strings in both the area of compilers for programming languages and, more recently, in the area of machine translation of natural languages. The formalism was first introduced by Lewis and Stearns [LS68] under the name of syntax-directed transduction grammars, and was later called syntax-directed translation schemata by Aho and Ullman [AU69, AU72]. The name SCFG, which we use in this article, was later introduced in the literature on computational linguistics, where the term “synchronous” refers to rewriting systems that generate strings in both a source and target language simultaneously [SS90, SS94, Chi04]. In fact, SCFGs can be seen as a natural extension of the well-known rewriting formalism of Context-Free Grammars (CFGs). More precisely, while a CFG generates a set of strings, a SCFG generates a set of string pairs using essentially the same context-free rewriting mechanism, along with some special synchronization between the two derivations, as discussed below.\n∗Dipartimento di Sistemi e Informatica, Università di Firenze, Viale Morgagni, 65, 50134 Firenze, Italy. †Computer Science Department, University of Rochester, Rochester, NY 14627. ‡Dipartimento di Informatica, Università di Milano, Via Festa del Perdono 7, 20122 Milano, Italy. §Dipartimento di Matematica, Università di Roma Tor Vergata, Via Ricerca Scientifica 1, 00133 Roma, Italy. ¶Department of Information Engineering, University of Padua, Via Gradenigo 6/A, 35131 Padova, Italy.\nA SCFG is a string rewriting system based on synchronous rules. Informally, a synchronous rule is composed of two CFG rules along with a bijective pairing between all the occurrences of the nonterminal symbols in the right-hand side of the first rule and all the occurrences of the nonterminal symbols in the right-hand side of the second rule. There is no restriction on the terminal symbols appearing in the right-hand sides of the two CFG rules. Two nonterminal occurrences that are associated by the above bijection are called linked nonterminals. Linked nonterminals are not necessarily occurrences of the same nonterminal symbol. In what follows, we will often view a synchronous rule as a permutation of the nonterminal occurrences in the two right-hand sides, combined with some renaming of these occurrences and with some insertion and deletion of terminal symbols.\nIn a SCFG rewriting is restricted in two ways: the two CFG rule components in a synchronous rule must be applied simultaneously, and rewriting must take place at linked nonterminals. Other than that, the application of a synchronous rule is independent of the context, similarly to the CFG case. As a result, a SCFG generates a pair of strings by means of two context-free parse trees that have the same skeleton but differ by some reordering and renaming of the nonterminal children at each internal node, and by the insertion and the deletion of the terminal children of that node. Moreover, the projection of the generated string pairs on both dimensions are still context-free languages. Thus, the added generative power of a SCFG lies in its ability to model long-distance movement of phrase constituents in the translation from the source to the target language, through simple permutations implemented at the internal nodes in the generated trees, something that is not possible with models based on finite-state transducers.\nRecently, SCFGs have received wide attention in the area of natural language processing, where several variants of SCFGs augmented with probabilities are currently used for translation between natural languages. This is due to the recent surge of interest in commercial systems for statistical machine translation working on large scale, real-world applications such as the translation of text documents from the world-wide web. However, from a theoretical perspective our knowledge of the parsing problem based on SCFGs and of several related tasks is quite limited, with many questions still left unanswered, as discussed below. This is rather surprising, in view of the fact that SCFGs are a very natural extension of the class of CFGs, for which the parsing problem has been extensively investigated and is well understood nowadays.\nIn the context of statistical machine translation, SCFGs are automatically induced from parallel corpora, that is, very large collections of source texts that come with target translations, and are usually enriched with annotations aligning source and target words [Chi07, GHKM04]. Alternative translation models are currently in use in machine translation, such as word-to-word translation models [BDDM93] or phrase-based translation models [KOM03], which are essentially finite-state models. However, it has been experimentally shown that the more powerful generative capacity of SCFGs achieves better accuracy than finite-state models in real-world machine translation applications [Chi07].\nThe recognition (or membership) problem for SCFGs is defined as follows. Given as input a SCFG G and strings w1 and w2, we have to decide whether the pair w1,w2 can be generated by G. The parsing problem for SCFGs (or synchronous parsing problem) is defined for the same input\nG, w1 and w2, and produces as output some suitable representation of the set of all parse trees in G that generate w1 and w2. Finally, the decoding (or translation) problem for SCFGs requires as input a SCFG G and a single string w1, and produces as output some suitable representation of the set of all parse trees in G that generate pairs of the form w1,w2, for some string w2. In this paper we investigate the synchronous parsing problem, which is strictly related to the other two problems, as will be discussed in more detail in Section 5.\nFrom the perspective of synchronous parsing, a crucial difference between CFGs and SCFGs is that SCFGs cannot always be binarized, that is, cast into a normal form with no more than two nonterminals on the right-hand side of each rule component in a synchronous rule. In fact, SCFGs form an infinite hierarchy, where grammars with at most r nonterminals on the right-hand side of a rule can generate sets of string pairs not achievable by grammars with the same quantity bounded by r− 1, for each r > 3 [AU72]. Binarization is crucial to standard algorithms for CFG parsing, whether explicitly as a preprocessing transformation on the grammar, as for instance in the case of the Cocke-Kasami-Younger algorithm [You67], or implicitly through the use of dotted rule symbols indicating which nonterminals have already been parsed, as in the case of Earley algorithm [Ear70]. Unfortunately these techniques cannot be applied to SCFGs, because of the above restrictions on binarization, and the parsing problem for SCFGs seems significantly more complex than the parsing problem for CFGs, from a computational perspective. While parsing for CFGs can be solved in polynomial space and time by the above mentioned algorithms, it has been shown in [SP05] that parsing for SCFGs is NP-hard, when the grammar is considered as part of the input.\nDespite this hardness result, when the SCFG is fixed, parsing can be performed in time polynomial in the length of the input strings using the bottom-up dynamic programming framework described in Section 2. The degree of the polynomial is determined by themaximum complexity of any rule in the grammar, because rules are parsed independently of one another. More precisely, the complexity of a given rule isO(nd(π,σ)), where n is the sentence length, and d is some function of π, the permutation associated with the rule, and σ, a parsing strategy for the rule. This leads us to consider the problem of finding the best strategy for a given rule, that is, finding the σ that minimizes d(π, σ). We investigate the problem of finding the best linear parsing strategy for a given synchronous rule, that is, the ways of collecting one after the other the linked nonterminals in a synchronous rule that result in the optimization of the space and time complexity for synchronous parsing. We show that this task is NP-hard. This solves an open problem that has been addressed in several previously published works; see for instance [GŠ07], [HZGK09], and [CGM+11].\nRelationwith previouswork The problem that we explore in this article is an instance of a grammar factorization problem. Factorization is the general method of breaking a grammar rule into a number of equivalent, smaller rules, usually for the purpose of finding efficient parsing algorithms. Our linear parsing strategies for SCFGs process two linked nonterminals from the original rule at each step. Each of these steps is equivalent to applying a binary rule in another rewriting system, which must be more general than SCFGs, since after all SCFGs cannot be binarized.\nThe general problem of grammar factorization has received a great deal of study recently in the\nfield of computational linguistics, with the rise of statistical systems for natural language translation, as well as systems for parsing with monolingual grammars that are more powerful than CFGs [HZGK09, GRKSW09, SS10, GRKS10]. Most work in this area addresses some subclasses of the very general rewriting framework known as Linear Context-Free Rewriting Systems (LCFRS) [VSWJ87], which is equivalent to Multiple Context-Free Grammars [SMFK91], and which subsumes SCFGs and many other formalisms. Many algorithms have been proposed for efficiently factorizing subclasses of LCFRS, in order to optimize parsing under various criteria. Our result in this article is a hardness result, showing that such algorithms cannot generalize to the widely used and theoretically important class of SCFGs. A related result has been presented by Crescenzi et al. [CGM+11], showing that optimal linear factorization for general LCFRS is NP-hard. Their reduction involves constructing LCFRS rules that are not valid as SCFG rules. Indeed, as already mentioned, SCFG rules can be viewed as permutations, and the special structure of these objects makes reductions less straightforward than in the case of LCFRS. This article therefore strengthens the result in [CGM+11], showing that even if we restrict ourselves to SCFGs, detection of optimal linear parsing strategies is still NP-hard."
    }, {
      "heading" : "2 Preliminaries",
      "text" : "In this section we formally introduce the class of synchronous context-free grammars, along with the computational problem that we investigate in this article. We assume the reader to be familiar with basic definitions from formal language theory, and we only briefly summarize here the adopted notation.\nFor any positive integer n, we write [n] to denote the set {1, . . . , n}, and for n = 0 we let [n] be\nthe empty set. We also write [n]0 to denote the set [n] ∪ {0}."
    }, {
      "heading" : "2.1 Synchronous Context-Free Grammars",
      "text" : "Let Σ be some finite alphabet. A string x over Σ is a finite ordered sequence of symbols from Σ. The length of x is written |x|; the empty string is denoted by ε and we have |ε| = 0. We write Σ∗ for the set of all strings over Σ, and Σ+ = Σ∗ \\ {ε}. For strings x, y ∈ Σ∗, x · y denotes the concatenation of x and y, which we abbreviate as xy.\nA context-free grammar (CFG for short) is a tuple G = (VN,VT, P, S), where VN is a finite set of nonterminals, VT is a finite set of terminals with VT ∩ VN = ∅, S ∈ VN is a special symbol called the start symbol, and P is a finite set of rules having the form A → α, with A ∈ VN and α ∈ (VT ∪VN) ∗. The size of a CFG G is defined as |G| = ∑(A→γ)∈P |Aγ|.\nThe derive relation associated with a CFG G is written ⇒G ; we also use the reflexive and transitive closure of ⇒G , written ⇒ ∗ G . The language (set of strings) derived in G is defined as L(G) = {w | S ⇒∗G w, w ∈ V ∗ T}.\nIn what follows we need to represent bijections between the occurrences of nonterminals in two strings over VN ∪ VT. This can be realized by annotating nonterminals with indices from an infinite set. In this article, we draw indices from the set of positive natural numbers N. We define\nI(VN) = {A t | A ∈ VN, t ∈ N} and VI = I(VN) ∪VT. For a string γ ∈ V ∗ I , we write index(γ) to denote the set of all indices that appear in symbols in γ.\nTwo strings γ1,γ2 ∈ V ∗ I are synchronous if each index from N occurs at most once in γ1 and\nat most once in γ2, and index(γ1) = index(γ2). Therefore γ1,γ2 have the general form\nγ1 = u1,0A t1 1,1u1,1A t2 1,2u1,2 · · · u1,r−1A tr 1,ru1,r γ2 = u2,0A tπ(1) 2,1 u2,1A tπ(2) 2,2 u2,2 · · · u2,r−1A tπ(r) 2,r u2,r\nwhere r ≥ 0, u1,i, u2,i ∈ V ∗ T for each i ∈ [r]0, A\nti 1,i , A tπ(i) 2,i ∈ I(VN) for each i ∈ [r], ti 6= tj for\ni 6= j, and π is a permutation of the set [r]. Note that, under the above convention, nonterminals A1,i, A2,π−1(i) appear with the same index ti, for each i ∈ [r]. In a pair of synchronous strings, two nonterminal occurrences with the same index are called linked nonterminals.\nA synchronous context-free grammar (SCFG) is a tuple G = (VN,VT, P, S), 1 where VN, VT and S are defined as for CFGs, and P is a finite set of synchronous rules. Each synchronous rule has the form [A1 → α1, A2 → α2], where A1, A2 ∈ VN and where α1, α2 ∈ V ∗ I are synchronous strings. We refer to A1 → α1 and A2 → α2, respectively, as the left and right components of the synchronous rule. Note that if we ignore the indices annotating the nonterminals in α1 and α2, then A1 → α1 and A2 → α2 are context-free rules.\nExample 1. The list of synchronous rules reported below implicitly defines a SCFG. Symbols si are rule labels, to be used as references in later examples.\ns1 : [S → A 1 B 2 , S → B 2 A 1 ] s2 : [A → aA 1 b, A → bA 1 a] s3 : [A → ab, A → ba] s4 : [B → cB 1 d, B → dB 1 c] s5 : [B → cd, B → dc]\nWe now define the notion of derivation associated with a SCFG. In a derivation we rewrite a pair of synchronous strings, always producing a new pair of synchronous strings. This is done in several steps, where, at each step, two linked nonterminals are rewritten by a synchronous rule. We use below the auxiliary notion of reindexing, which is an injective function f from N to N. We extend f to VI by letting f (A t ) = A f (t) for A t ∈ I(VN) and f (a) = a for a ∈ VT. We also extend f to strings in V∗I by letting f (ε) = ε and f (Xγ) = f (X) f (γ), for each X ∈ VI and γ ∈ V ∗ I .\nLet γ1,γ2 ∈ V ∗ I be two synchronous strings. The derive relation [γ1, γ2] ⇒G [δ1, δ2] holds whenever there exist an index t in index(γ1) = index(γ2), a synchronous rule s ∈ P of the form [A1 → α1, A2 → α2], and some reindexing f such that\n(i) index( f (α1)) ∩ (index(γ1) \\ {t}) = ∅;\n(ii) γ1 = γ ′ 1A t 1 γ ′′ 1 , γ2 = γ ′ 2A t 2 γ ′′ 2 ; and\n(iii) δ1 = γ ′ 1 f (α1)γ ′′ 1 , δ2 = γ ′ 2 f (α2)γ ′′ 2 .\n1We overload symbol G . It will always be clear from the context whether G refers to a CFG or to a SCFG.\nWe also write [γ1, γ2] ⇒ s G [δ1, δ2] to explicitly indicate that the derive relation holds through rule s.\nNote that δ1, δ2 above are guaranteed to be synchronous strings, because α1 and α2 are synchronous strings and because of condition (i) above. Note also that, for a given pair [γ1, γ2] of synchronous strings, an index t and a synchronous rule as above, there may be infinitely many choices of a reindexing f such that the above constraints are satisfied. However, all essential results about SCFGs are independent of the specific choice of reindexing, and therefore we will not further discuss this issue here.\nA derivation in G is a sequence σ = s1s2 · · · sd, d ≥ 0, of synchronous rules si ∈ P, i ∈ [d], with σ = ε for d = 0, satisfying the following property. For some pairs of synchronous strings [γ1,i, γ2,i], i ∈ [d]0, we have [γ1,i−1, γ2,i−1] ⇒ si G [γ1,i, γ2,i] for each i ∈ [d]. We always implicitly assume some canonical form for derivations in G, by demanding for instance that each step rewrites a pair of linked nonterminal occurrences of which the first is leftmost in the left component. Whenwewant to focus on the specific synchronous strings being derived, we also write derivations in the form [γ1,0, γ2,0] ⇒ σ G [γ1,d, γ2,d], and we write [γ1,0, γ2,0] ⇒ ∗ G [γ1,d, γ2,d] when σ is not further specified. The translation generated by a SCFG G is defined as\nT(G) = {[w1, w2] | [S 1 , S 1 ] ⇒∗G [w1, w2], w1,w2 ∈ V ∗ T} .\nExample 2. Consider the SCFG G from Example 1. The following is a (canonical) derivation in G\n[S 1 , S 1 ] ⇒s1G [A 1 B 2 , B 2 A 1 ]\n⇒s2G [aA 3 bB 2 , B 2 bA 3 a] ⇒s2G [aaA 4 bbB 2 , B 2 bbA 4 aa] ⇒s3G [aaabbbB 2 , B 2 bbbaaa] ⇒s4G [aaabbbcB 5 d, dB 5 cbbbaaa] ⇒s5G [aaabbbccdd, ddccbbbaaa]\nIt is not difficult to see that T(G) = {[apbpcqdq, dqcqbpap] | p, q ≥ 1}.\nWe conclude this section with a remark. Our definition of SCFG is essentially the same as the definition of the syntax-directed transduction grammars in [LS68] and the syntax-directed translation schemata in [AU69, AU72], as already mentioned in the introduction. The only difference is that in a synchronous rule [A1 → α1, A2 → α2] we allow A1, A2 to be different nonterminals, while in the above formalisms we always have A1 = A2. Although our generalization does not add to the weak generative power of the model, that is, the class of translations generated by the two models are the same, it does increase its strong generative capacity, that is, the parse tree mappings defined by syntax-directed translation schemata are a proper subset of the parse tree mappings defined by SCFGs. As a consequence of this fact, when the definitions of the two models are enrichedwith probabilities, SCFGs can define certain parse tree distributions that cannot be captured by syntax-directed translation schemata, as argued in [SP05]. The above generalization has been adopted in several translation models for natural language."
    }, {
      "heading" : "2.2 Parsing Strategies for SCFGs",
      "text" : "Recognition and parsing algorithms for SCFGs are commonly used in the area of statistical machine translation. Despite the fact that the underlying problems are NP-hard, it has been experimentally shown that the typology of synchronous rules that we encounter in real world applications can be processed efficiently, for the most of the cases, if we adopt the appropriate parsing strategy, as already discussed in Section 1. We are thus interested in the problem of finding optimal parsing strategies for synchronous rules, under some specific parsing framework.\nStandard parsing algorithms for SCFGs exploit dynamic programming techniques, and are derived as a generalization of the well-known Cocke-Kasami-Younger algorithm for word recognition based on CFGs [You67, HU79], which essentially uses a bottom-up strategy. All these algorithms are based on the representation described below. For a string w = a1 · · · an, n ≥ 1, and for integers i, j ∈ [n]0 with i < j, we write w[i, j] to denote the substring ai+1 · · · aj. Assume we are given the input pair [w1, w2]. To simplify the discussion, we focus on a sample synchronous rule containing only occurrences of nonterminal symbols\ns : [A1 → A 1 1,1A 2 1,2A 3 1,3A 4 1,4A 5 1,5A 6 1,6,\nA2 → A 6 2,1A 1 2,2A 4 2,3A 2 2,4A 5 2,5A 3 2,6], (1)\nSynchronous rule s can be associated with the permutation π of the set [6] identified by the sequence 614253, which is visualized in Figure 1a. Recall that, for each k ∈ [6], nonterminals A1,k, A2,π−1(k) are linked in rule s.\nAssume that, for each k ∈ [6], we have already parsed linked nonterminals A1,k, A2,π−1(k), re-\nalizing that [A 11,k, A 1 2,π−1(k) ] ⇒∗G [w1[i1,k, j1,k], w2[i2,π−1(k), j2,π−1(k)]], for integers i1,k, j1,k ∈ [|w1|]0 and i2,π−1(k), j2,π−1(k) ∈ [|w2|]0. Informally, we say that linked nonterminals A1,k, A2,π−1(k) span substrings w1[i1,k, j1,k] and w2[i2,π−1(k), j2,π−1(k)] of the input. In order to parse the left-hand side nonterminals A1, A2, we need to gather together all linked nonterminals A1,k, A2,π−1(k), and check whether the combination of the above derivations can provide a new derivation of the form [A 11 , A 1 2 ] ⇒ ∗ G [w1[i1,1, j1,6], w2[i2,1, j2,6]]. In other words, we want to know whether the combination of the derivations for linked nonterminals A1,k, A2,π−1(k) can span two (contiguous) substrings of the input.\nFor reasons of computational efficiency, it is advantageous to break the parsing of a synchronous rule into several steps, adding linked nonterminals one pair at each step, according to some fixed total ordering, which we call a linear parsing strategy. The result of the partial analyses obtained at each step is represented by means of a data structure which we call a state. To provide a concrete example, let us choose the linear parsing strategy σ of gathering all the A1k’s on the first component of rule s from left to right. At the first step we then collect linked nonterminals A1,1, A2,π−1(1) = A2,2 and construct the partial analysis represented by the state 〈(s, σ, 1), (i1,1, j1,1), (i2,2, j2,2)〉, meaning that A1,1 spans substring w1[i1,1, j1,1] and A2,2 spans substring w2[i2,2, j2,2]. The first element in the state, (s, σ, 1), indicates that this state is generated from synchronous rule s after the first combination step, assuming our current strategy σ. We refer to this first element as the type of the state.\nAssuming now that j1,1 = i1,2, at the second step we add to our partial analysis the linked nonterminals A1,2, A2,4, as shown in Figure 1b. We construct a new state 〈(s, σ, 2), (i1,1, j1,2), (i2,2, j2,2), (i2,4, j2,4)〉, meaning that A1,1, A1,2 together span w1[i1,1, j1,2], A2,2 spans w2[i2,2, j2,2] and A2,4 spans w2[i2,4, j2,4]. Note here that the specific value of j1,1 = i1,2 is dropped from the description of the state, since it will not be referenced by any further step based on the associated partial analysis. After adding the third pair of linked nonterminals A1,3, A2,6, and assuming j1,2 = i1,3, we create state 〈(s, σ, 3), (i1,1, j1,3), (i2,2, j2,2), (i2,4, j2,4), (i2,6, j2,6)〉, spanning four separate substrings of the input, as shown in Figure 1c. Assume now that j2,2 = i2,3 and j2,3 = i2,4. After adding the linked nonterminals A1,4, A2,3, we have that the span of A2,3 fills in the gap between the spans of the previously parsed nonterminals A2,2 and A2,4, as shown in Figure 1d. We can then collapse these three spans into a single string, obtaining a new state 〈(s, σ, 4), (i1,1, j1,4), (i2,2, j2,4), (i2,6, j2,6)〉which spans three separate substrings of the input. Finally, assuming that j2,1 = i2,2 and j2,4 = i2,5, at the next two steps states of type (s, σ, 5) and (s, σ, 6) can be constructed, each spanning two substrings only.\nWe refer below to the number of substrings spanned by a state as the fan-out of the state (this notion will be formally defined later). The above example shows that the fan-out of each state depends on the parsing strategy that we are adopting.\nBottom-up dynamic programming algorithms for the parsing problem for SCFGs are designed on the basis of the above state representation for partial analyses. These algorithms store in some appropriate data structure the states that have already been constructed, and then retrieve and combine states in order to construct new states. Let n be the maximum length between the input strings w1 and w2. Because a state with fan-out f may have O(n 2 f ) instantiations, fan-out provides a way of bounding the space complexity of our algorithm. When we use linear parsing strategies, fan-out is also relevant in assessing upper bounds on time complexity. Consider the basic step of adding the (k + 1)-th pair of linked nonterminals to a state of type (s, σ, k) having fan-out f . As before, we have O(n2 f ) instantiations for states of type (s, σ, k). We also have O(n4) possible instantiations for the span of the (k + 1)-th pair, since any pair of linked nonterminals spans exactly two substrings. However, the (k + 1)-th pair might share some of its boundaries with the boundaries of the state of type (s, σ, k), depending on the permutation associated with the synchronous rule s. If we define δ(s, σ, k) as the number of independent boundaries in the (k+ 1)-th pair, with 0 ≤ δ(s, σ, k) ≤ 4, we have that all executions of the above step can be carried out in time O(n2 f+δ(s,σ,k)).\nIf we want to optimize the space or the time complexity of a dynamic programming algorithm cast in the above framework, we need to search for a parsing strategy that minimizes the maximum fan-out of its states, or else a strategy that minimizes the maximum value of the sum of the fan-out and the δ() function. This needs to be done for each individual synchronous rule in the grammar. In our running example, the critical step is provided by state type (s, σ, 3) with fanout 4, leading to space complexity of O(n8). Furthermore, the combination of state type (s, σ, 2) (fan-out 3) with linked pair A1,3, A2,6 (δ(s, σ, 3) = 3) leads to time complexity of O(n 9). However, we can switch to a different strategy σ′, by collecting linked nonterminal pairs in s in the order given by the left components A1,4, A1,5, A1,2, A1,3, A1,1, A1,6. According to this new strategy, states\nof types (s, σ′, 2) and (s, σ′, 3) both have fan-out three, while every other state type has fan-out two. This leads to space complexity of O(n6) for rule s. It is not difficult to see that this strategy is also space optimal for rule s, on the basis of the observation that any grouping of two linked nonterminals A1,k, A2,π−1(k) and A1,k′ , A2,π−1(k′) with k, k ′ ∈ [6] and k 6= k′, has a fan-out of at least three. As for the time complexity, the critical step is the combination of state type (s, σ′ , 2) (fan-out 3) with linked pair A1,2, A2,4 (δ(s, σ ′ , 3) = 2), leading to time complexity of O(n8) for this strategy. It is not difficult to verify that σ′ is also a time optimal strategy."
    }, {
      "heading" : "2.3 Fan-out and Optimization of Parsing",
      "text" : "What we have informally shown in the previous section is that, under the outlined framework based on state representations for partial analyses, we can exploit the properties of the specific permutation of a given synchronous rule to reduce the maximum fan-out of states, and hence improve the space and time complexity of our parsing algorithms. In this section, we provide formal definitions of these concepts, and introduce the computational problem that is investigated in this article.\nLet s be a synchronous rule with r > 2 linked nonterminals, and let πs be the permutation representing s. A linear parsing strategy for s is defined as a permutation σs of the set [r]. The intended meaning of σs is that, when parsing the rule s, the pair of linked nonterminals A1,σ(k), A2,π−1(σ(k)) is collected at the k-th step, for each k ∈ [r], as shown in Figure 1.\nLet us consider state type (s, σs, k), k ∈ [r], defined as in Section 2.2. We define the count of\ninternal boundaries for (s, σs, k) as\nib(πs, σs, k) = ∣ ∣ ∣ { h : σ−1s (h) ≤ k ∧ σ −1 s (h+ 1) > k }∣ ∣ ∣ +\n∣ ∣ ∣ { h : σ−1s (h) > k ∧ σ −1 s (h+ 1) ≤ k }∣ ∣ ∣ + ∣ ∣ ∣ { h : σ−1s (π −1 s (h)) ≤ k ∧ σ −1 s (π −1 s (h+ 1)) > i } ∣ ∣ ∣ + ∣ ∣ ∣ { h : σ−1s (π −1 s (h)) > k ∧ σ −1 s (π −1 s (h+ 1)) ≤ k } ∣ ∣ ∣ . (2)\nIn the definition above, the term ∣ ∣ { h : σ−1s (j) ≤ i ∧ σ −1 s (h+ 1) > k }∣ ∣ counts the number of nonterminals A1,i that have already been collected at step k and such that nonterminal A1,i+1 has not yet been collected. Informally, this term counts the nonterminals in the right-hand side of the first CFG rule component of s that represent right internal boundaries of the span of a state of type (s, σs, k). The second term in the definition counts the number of nonterminals in the right-hand side of the same rule component that represent left internal boundaries. Similarly, the remaining two terms count right and left internal boundary nonterminals, respectively, in the right-hand side of the second CFG rule component of s.\nFor state type (s, σs, k), k ∈ [r], we also define the count of external boundaries as\neb(πs, σs, k) =I(σ −1 s (1) ≤ k) + I(σ −1 s (n) ≤ k)+\nI(σ−1s (π −1 s (1)) ≤ k) + I(σ −1 s (π −1 s (n)) ≤ k) . (3)\nThe indicator functions I() count the number of nonterminals that are placed at the left and right ends of the right-hand sides of the two rule components and that have already been collected at step k. Informally, the sum of these functions counts the nonterminals that represent external boundaries of the span of state type (s, σs, k).\nFinally, the fan-out of state type (s, σs, k) is defined as\nfo(πs, σs, k) = 1\n2 (ib(πs, σs, k) + eb(πs, σs, k)) . (4)\nDividing the total number of boundaries by two gives the number of substrings spanned by the state type (s, σs, k). Observe that the fan-out at step k is a function of both the permutation πs associated with the SCFG rule s, and the linear parsing strategy σs.\nAs discussed in Section 2.2, the fan-out at step k gives space and time bounds on the parsing algorithm relative to that step and parsing strategy σs. Thus the complexity of the parsing algorithm relative to synchronous rule s depends on the fan-out at the most complex step of σs. We wish to find, for an input synchronous rule s with associated permutation πs, the linear parsing strategy that minimizes quantity\nmin σ max k∈[r] fo(πs, σ, k) , (5)\nwhere σ ranges over all possible linear parsing strategies for s. Our main result in this article is that this minimization problem is NP-hard. This is shown by first proving that the optimization of the ib(πs, σs, k) component of the fan-out is NP-hard, in the next section, and then by extending the result to the whole fan-out in a successive section."
    }, {
      "heading" : "3 Permutation Multigraphs and Cutwidth",
      "text" : "With the goal of showing that the minimization problem in (5) is NP-hard, in this section we investigate the minimization problem for the ib(πs, σs, k) component of the fan-out, defined in (2). More precisely, given as input a synchronous rule s with r > 2 nonterminals and with associated permutation πs, we investigate a decision problem associated with the computation of the quantity\nmin σ max k∈[r] ib(πs, σ, k) , (6)\nwhere σ ranges over all possible linear parsing strategies for s. We do this by introducing a multigraph representation for the synchronous rule s, and by studying the so-called cutwidth problem for such a multigraph."
    }, {
      "heading" : "3.1 Permutation Multigraphs",
      "text" : "Our strategy for proving the NP-hardness of the optimization problem in (6) will be to reduce to the problem of finding the cutwidth of a certain class of multigraphs, which represent the relevant structure of the input synchronous rule. In this section we introduce this class of multigraphs, and discuss its relation with synchronous rules. We denote undirected multigraphs as pairs G = (V, E), with set of nodes V and multiset of edges E.\nA permutation multigraph is a multigraph G = (V, A ⊎ B) such that both PA = (V, A) and PB = (V, B) are Hamiltonian paths, and ⊎ is the merge operation defined for multisets. In the following, the edges in A will be called red, the edges in B will be called green.\nA permutation multigraph G = (V, A ⊎ B) can be thought of as encoding some permutation: if we identify nodes in V with integers in [|V|] according to their position on path A, the order of vertices along path B defines a permutation of set [|V|]. We can therefore use a permutation multigraph to encode the permutation associated with a given synchronous rule. More precisely, let s be a synchronous rule of the form\ns : [A1 → u1,0A 1 1,1u1,1 · · · u1,r−1A r 1,ru1,r,\nA2 → u2,0A πs(1) 2,1 u2,1 · · · u2,r−1B πs(r) 2,r u2,r] , (7)\nwhere r ≥ 2, u1,i, u2,i ∈ V ∗ T for each i ∈ [r]0 and πs is a permutation of the set [r]. We associate with s the permutation multigraph Gs = (Vs, Es,A ⊎ Es,B) defined as\n• Vs = {(A1,i, A2,π−1s (i)) : i ∈ [r]};\n• Es,A = {((A1,i, A2,π−1s (i)), (A1,j, A2,π−1s (j))) : i, j ∈ [r] ∧ |i− j| = 1};\n• Es,B = {((A1,πs(i), A2,i), (A1,πs(j), A2,j)) : i, j ∈ [r] ∧ |i− j| = 1}.\nTo see that Gs is a permutation multigraph, observe that Gs is the superposition of the following two Hamiltonian paths\n• 〈(A1,1, A2,π−1s (1)), ((A1,2, A2,π−1s (2)), . . . , (A1,r−1, A2,π−1s (r−1)), (A1,r, A2,π−1s (r))〉;\n• 〈(A1,πs(1), A2,1), (A1,πs(2), A2,2), . . . , (A1,πs(r−1), A2,r−1), (A1,πs(r), A2,r)〉.\nAn example permutation multigraph is shown in Figure 2, with one Hamiltonian path shown above and one below the vertices.\nWe shall now discuss a mathematical relation between internal boundary counts for states associated with linear parsing strategies for the synchronous rule s and width values for the permutation multigraph Gs. We first recall the definition of the width and cutwidth of a graph and a multigraph. Let G = (V, E) be an undirected (multi)graph such that |V| = n > 1. A linear arrangement of G is a bijective mapping ν from V to [n]. We call positions the integer values of\nν. For any i ∈ [n− 1], the width of G at i with respect to ν, denoted by wd(G, ν, i), is defined as |{(u, v) ∈ E : ν(u) ≤ i < ν(v)}|. In the case of a multigraph, the size of the previous set should be computed taking into account multiple occurrences. Informally, wd(G, ν, i) is the number of distinct edges crossing over the gap between positions i and i+ 1 in the linear arrangement ν. To simplify the notation below, we also let wd(G, ν, n) = 0. The cutwidth of G is then defined as\ncw(G) = min ν max i∈[n] wd(G, ν, i) ,\nwhere ν ranges over all possible linear arrangements of G. The cutwidth of the multigraph of Figure 2 is six, which is achieved between (A1,3, A2,6) and (A1,4, A2,3) in the linear arrangement shown.\nLet us now consider synchronous rule s in (7) and the associated permutation πs, and let σs be some linear parsing strategy defined for s. The linear arrangement associated with σs is the linear arrangement νs for permutation multigraph Gs = (Vs, Es) defined as follows. For each i ∈ [r], νs((A1,i, A2,π−1s (i))) = k if and only if σs(k) = (A1,i, A2,π−1s (i)). The following relation motivates our investigation of the cutwidth problem for permutation multigraphs in the remaining part of this section.\nLemma 1. Let s be a synchronous rule with r > 2 linked nonterminals, and let σs be a linear parsing strategy for s. Let πs and Gs be the permutation and the permutation multigraph, respectively, associated with s, and let νs be the linear arrangement for Gs associated with σs. For every i ∈ [r] we have\nwd(Gs, νs, i) = ib(πs, σs, i) .\nProof. The lemma follows from the definition of the internal boundary function in (2) and the definition of the permutation multigraph. The first two terms in (2) count edges from the set Es,A crossing the gap at position i in linear arrangement νs of Gs, while the second two terms in (2) count edges from the set Es,B.\nNote that Lemma 1 directly implies the relation cw(Gs) = minσ maxi∈[r] ib(πs, σ, k). In the rest of the present section we investigate the permutation multigraph cutwidth problem, or PMCW for short. An instance of PMCW consists of a permutationmultigraph G and an integer k, and we have to decide whether cw(G) ≤ k. We show that the PMCW problem is NP-complete. We reduce from the minimum bisection width problem, or MBW for short. The MBW problem consists of deciding whether, given a graph G and an integer k, there is a partition of the nodes of G into two equal size subsets V1 and V2, such that the number of edges with one endpoint in V1 and one endpoint in V2 is not greater than k. It is known that the MBW problem is NP-complete even when restricted to cubic graphs, that is, 3-regular graphs, with no multi-edges and no selfloops [BCLS87]. We use this variant of the MBW problem in our reduction. Our proof that the PMCW problem is NP-complete is a modification of the proof reported in [MPS85, Theorem 4.1, p. 434], showing that the problem of deciding whether an undirected graph has (modified) cutwidth not greater than a given integer is NP-complete for graphs with maximum vertex degree of three."
    }, {
      "heading" : "3.2 Construction of Permutation Multigraph G′",
      "text" : "Throughout the rest of this section, we let G = (V, E) be a cubic graph where V = {v1, . . . , vn} is the set of its vertices. Note that n > 1 must be even. We also let k be an arbitrary positive integer. We construct a permutation multigraph G′ and an integer k′ such that 〈G, k〉 is a positive instance of MBW if and only if 〈G′, k′〉 is a positive instance of PMCW (this statement will be shown in Sections 3.3 and 3.4).\nLet H and W be positive integers. We will make use of a grid gadget X = Γ[H,W] with H rows and W columns; for an example, see the left part of Figure 3. More precisely, for any h ∈ [H] and for any w ∈ [W], the grid X includes a node xh,w. Moreover, for any h ∈ [H] and for any w ∈ [W − 1], there is an edge ( xh,w, xh,w+1 ) , and, for any h ∈ [H − 1] and for any w ∈ [W], there is an edge ( xh,w, xh+1,w ) . It is known that, for any H andW greater than 2, cw(X) = min{H + 1,W + 1} [RSV95].\nFor positive integers Hl, Wl , Hm, and Wm with Hl > Hm, we will also exploit a composed grid Σ[Hl ,Wl ,Hm,Wm], which is formed by combining two grid gadgets L = Γ[Hl ,Wl ] and R = Γ[Hl ,Wl ] with a grid gadget M = Γ[Hm,Wm], as shown in the right part of Figure 3. The nodes of L, R, and M will be denoted as lh,w, rh,w, and mh,w, respectively. Besides the edges of the three grids L, R, and M, for any h ∈ [Hm], the composed grid Σ[Hl ,Wl ,Hm,Wm] also includes the edges (\nlh,Wl ,mh,1 ) and ( mh,Wm , rHl−Hm+h,1 ) .\nThe target graph G′ consists of several grid gadgets. More specifically, it has one grid Gi = Γ[2n4 + 1, 6n4], i ∈ [n], for each of the n nodes of the source cubic graph G. The nodes of Gi will be denoted as gh,wi . In addition, G ′ has a composed grid S = Σ[3n4 + 1, 12n4, 2n4 + 1, 8n4 + 1]. For each grid Gi, i ∈ [n], we add to G ′ a sheaf of 4n2 edges connecting distinct nodes in the first or in the last row of Gi to 4n 2 distinct nodes of the first row of M, as will be explained in detail below. In addition, for each edge (vi, vj) ∈ E with i < j, we add to G ′ two edges, each edge connecting a node in the first row of Gi with a node in the last row of Gj. The choice of all of the above connections will be done in a way that guarantees that G′ is a permutation multigraph.\nBefore providing a mathematical specification of G′, we informally summarize the organiza-\ntion of the edges of G′ connecting the M and Gi grids. When scanning the columns of M from left to right, we will have a first column that has no connection to any of the Gi components, followed by a first block of 4n2 columns with connections to the G1 component, followed by a second block of 4n2 columns with connections to G2, and so on up to the n-th block of 4n 2 columns with connections to Gn. The remaining columns of M do not have any connection with the Gi components.\nLooking at one of the grids Gi, the columns are organized into three blocks, when scanning\nfrom left to right.\n• Block 1 (left portion of Gi in Figure 4): The first column has two edges connecting to the\nM component, one from its top vertex and one from its bottom vertex, and the remaining columns in the block each have a single edge connecting to M from the column’s bottom vertex. This block extends from column with index 1 to column 4n2 − 4− 2d>i , where d > i denotes the number of edges of G of the form (vi, vj) with j > i, that is, the number of “forward” neighbors of i. The block therefore contains a total of 4n2 − 3− 2d>i edges connecting Gi to M.\n• Block 2 (Figure 5): This block represents the edges from the source graph G. For each edge\n(vi, vj) of G such that i < j, we have two columns each having a single edge connecting to M from the column’s bottom vertex, and a single edge connecting to the grid Gj from the column’s top vertex. This is followed by two columns for each edge (vi, vj) in G such that j < i, with each column having its bottom vertex connected to the grid Gj and no connection to M. Block 2 extends from column 4n2− 3− 2d>i to column 4n 2− 4+ 2d<i , where d < i denotes the number of edges of G of the form (vi, vj) with j < i, that is, the number of “backward”\nneighbors of i. The number of edges connecting Gi to M is 2d > i , and the number of edges connecting Gi to grids Gj with j 6= i is 2d > i + 2d < i = 6, where the equality follows from the fact that G is a cubic graph.\n• Block 3 (right portion of Gi in Figure 4): The first column has the top vertex connected to\nM. All remaining columns of Gi do not have connections with M, with the exception of the rightmost column, which has two edges connecting its top and bottom vertices to M. This block extends from column with index 4n2 − 3 + 2d<i to column with index 6n 4, and the block contains 3 edges connecting Gi to M.\nAltogether, the above blocks provide a total number of edges connecting Gi and M equal to (4n 2− 3− 2d>i ) + 2d > i + 3 = 4n 2, as anticipated.\nTo define the edges in each of these three blocks, we need to introduce some auxiliary notation. In what follows, for every i ∈ [n], we denote by N<i the set of “backward” neighbors of vi, that is, N<i = {j : (vi, vj) ∈ E ∧ j ∈ [i − 1]}. Similarly, the set of “forward” neighbors of vi is the set N>i = {j : (vi, vj) ∈ E ∧ j ∈ [n] \\ [i]}. We then have d < i = |N < i | and d > i = |N > i |. As already observed, we must have d>i + d < i = 3 since G is a cubic graph. For every i ∈ [n] and j ∈ [i] we also define d <,j i = |N < i ∩ [j− 1]|; in words, d <,j i is the number of backward neighbors of vi having index strictly smaller than j. Note that d<,ii = d < i for every i ∈ [n].\nFor every i ∈ [n] and h ∈ [d>i ], we denote by n h i the index of the h-th forward neighbor of vi\nfrom left-to-right: formally, nhi is the value j such that j ∈ N > i and |[j− 1] ∩ N > i | = h− 1. Finally, for every i ∈ [n+ 1], we define σi = 4n 2(i− 1) + 1. This quantity will be used in the construction of G′ below as an offset when locating the index of the next available column, from left to right, in the M component. For instance, we have σi = 1 since in M the first block with 4n 2 connections to G1 starts at column 2, as already anticipated.\nWe are now ready to specify precisely each of the three blocks of edges connecting each Gi to\nthe other grids.\nBlock 1 For any h ∈ [ 2n2 − 2− d>i ] , G′ includes the edges (see Figure 4)\n(\nm1,αi,h , g2n 4+1,2h−1\ni\n) , ( g2n 4+1,2h\ni ,m 1,αi,h+1\n)\n,\nwhere αi,h = σi + (2h− 1). In addition to the above edges, there is one edge connecting node g 1,1 i with M that is associated with Block 1. However, in order to simplify the presentation, it is more convenient to list such edge under Block 3 below.\nBlock 2 We now add to G′ the edges that are derived from the original graph G. For every i ∈ [n] and for every h ∈ [\nd>i ] , that is, for any forward edge (vi, vnhi ) in G, G′ includes the four edges (see\nFigure 5)\n(\nm1,βi,h , g 2n4+1,γi,h i\n)\n,\n(\ng 1,γi,h i , g 2n4+1,γ′i,h nhi\n)\n,\n(\ng 2n4+1,γ′i,h+1\nnhi , g\n1,γi,h+1 i\n)\n, ( g 2n4+1,γi,h+1 i ,m 1,βi,h+1 ) ,\nwhere βi,h = σi + 4n 2 − 4− 2d>i + (2h− 1), γi,h = 4n 2 − 4− 2d>i + (2h− 1), and γ ′ i,h = 4n 2 − 3+ 2d<,i nhi . Observe that βi,1 = αi,2n2−2−d>i + 1, so that the two runs of edges defined by Block 1 and Block 2, connecting grid Gi to grid M, are one next to the other. We have thus added to G ′, for any edge (vi, vj) of G, two edges connecting the two grids Gi and Gj, and two edges connecting grid Gi to grid M.\nCombining Block 1 and Block 2 together, we have added a total of 4n2 − 4 edges from grid Gi to grid M, for every i ∈ [n].\nBlock 3 Finally, G′ includes the four edges (see Figure 4)\n( m1,σi+1−3, g 1,4n2−3+2d<i i ) , ( g1,6n 4 i ,m 1,σi+1−2 ) , ( m1,σi+1−1, g1,1i ) , ( g2n 4+1,6n4 i ,m 1,σi+1 ) .\nCombining all three blocks, we have a total of 4n2 edges connecting Gi to M. We further note that each vertex of Gi has at most one edge connecting to vertices outside Gi; this property will play an important role later in our proofs.\nSo far we have specified G′ as if it were a (plain) graph; however, G′ is a permutation multigraph. The coloring of the edges of G′, that is, the definition of the two edge sets A and B, is specified below by describing the Hamiltonian path of red edges and the Hamiltonian path of green edges. Some of the edges specified above are included in both the red and green paths; these are double edges in the multigraph G′.\nRed path The red path is schematically represented in Figure 6. The path starts from l3n 4+1,1 (that is, the bottom left corner of L) and travels horizontally through the n4 bottom lines of L, alternating the left-to-right and the right-to-left directions and moving upward, until it reaches\nnode l2n 4+1,1 coming from previous node l2n 4+2,1. Then the path continues traveling horizontally through the three components L, M and R, once again alternating the horizontal directions. The path eventually reaches the node m1,1 coming from previous node l1,12n 4 , since 2n4 + 1 is always odd. At this point, the red path continues horizontally, from left to right, until it arrives at some node m1,σi+1−1, i ∈ [n]; let us call xi such a node. Observe that xi is the penultimate node in the first row of M, from left to right, that is connected with a node in the leftmost column of Gi (see Figure 4).\nNext, the path moves one step forward from xi to the leftmost column of Gi, reaching node g1,1i . Now, the path starts traveling horizontally from the first to the last row of Gi, alternating the left-to-right direction with the right-to-left direction, until it arrives at g2n 4+1,6n4\ni . Afterward, the\nred path returns to M by reaching the node to the right of xi. The path then continues horizontally from left to right, repeating the process of visiting the components Gi for i ∈ [n], as described above, eventually reaching node rn 4+1,1 from previous node m1,8n 4+1. The path can now visit the remaining nodes of R by traveling horizontally and alternating the left-to-right and the right-toleft directions, until it reaches node r1,12n 4 , where the path stops.\nGreen path The green path is schematically represented in Figure 7. The path starts from l1,1 (that is, the top left corner of L). It travels vertically, alternating the top-to-bottom direction with the bottom-to-top direction andmoving rightward, until it reaches node l1,12n 4 from previous node l2,12n 4 . The path thenmoves tom1,1, travels vertically down tom2n 4+1,1, moves one step to the right\nto node m2n 4+1,2 and again travels vertically up to m1,2. From now on, as soon as there is an edge exiting M and reaching some yet unvisited node in the last row of some grid Gi, the green path follows such an edge and travels vertically through the current column in Gi, until it reaches a node xi in the first row. We need to distinguish two cases for xi.\n• If xi has no edge exiting Gi, then the green path makes a step to the vertex to the right of xi.\nThis means that we are in Block 1 of Gi.\n• On the other hand, if xi has an edge exiting Gi, then the green path follows this edge thus\nreaching a node in the last row of a grid Gj, for some j > i (as in Figure 4). This means that we are visiting the first part of Block 2 of Gi, where edges (vi, vj) in the source graph G with j > i are encoded by our construction. The path then travels vertically through two columns in Gj, until it reaches the node in the bottom row of the second column, and, from there, it returns to Gi at the vertex to the right of xi.\nFrom the vertex to the right of xi, the green path continues vertically down in the current column of Gi. Upon reaching the bottom vertex of this column, the path exits Gi and comes back to some node in the top row of M. Such node is placed in the column of M adjacent at the right to the last column of M that the green path had visited before its exit to Gi. Then the green path\nproceeds downward, along the current column of M, it moves to the next column at the right, and alternates its direction to reach the node in the first row of M. The above process is then iterated, until all the columns in Block 1 and Block 2 of the current grid Gi have been visited.\nWhen the green path reaches node m1,σi+1−3, it exits M and reaches the top node in the column of Gi with index 4n 2 − 3 + 2d<i (see Figure 4), entering for the first time Block 3 of the current grid Gi. We remark that this step represents a switch in the construction of the green path, in the following sense. Block 1 and Block 2 of Gi are visited by the green path in such a way that oddindexed columns are visited bottom-to-top and even-indexed columns are visited top-to-bottom. On the other hand, when Block 3 of Gi is entered, we revert the previous pattern in such a way that odd-indexed columns are visited top-to-bottom and even-indexed columns are visited bottom-totop.\nOnce Block 3 of Gi is entered, the green path travels vertically through its columns, by alternating direction and moving rightward, never leaving Gi at its intermediate nodes. In this way the path eventually reaches the node g1,6n 4\ni , at which point it can return to M, reaching the topmost\nnode in the column with index σi+1 − 2 (see again Figure 4).\nAt this point the columns with indices σi+1 − 2, σi+1 − 1, and σi+1 are visited vertically, alternating the top-to-bottom direction with the bottom-to-top direction and moving rightward. After this step, the green path is located at the bottom of column σi+1 + 1, coming from the bottom of column σi+1, and it moves upward to the first line of M, where the path is ready to start visiting the next grid Gi+1. This is done by iterating all of the process described above.\nWhen all of the grids Gi have been visited, there are no more edges exiting M. The path then continues vertically, alternating the top-to-bottom direction with the bottom-to-top direction and moving rightward, until it reaches node m2n 4+1,8n4+1, since 8n4 + 1− σn+1 = 8n 4 + 1− 4n2 · n is always even. The path can nowmove one step to the right to node r3n 4+1,1, and visit the remaining nodes of R by traveling vertically and alternating the vertical direction. In the end, the green path ends at node r3n 4+1,12n4 .\nDouble Edges Some edges are included in both the red path and the green path. These are double edges in G′, and count double when computing the width function. Double edges occur on the first and the last columns of the various component grids Gi, L, M, and R, where the red path crosses from one row to the next, and on the upper and lower rows of these grids, where the green path crosses from one column to the next. There are no duplicate edges in the interior of any grid. There are also no duplicate edges between any two grids, with the only exceptions of the points where the green path connects L to M, and the point where the green path connects M to R.\nTo be used later, we need to establish exact values for the cutwidth of the multigraph grids Gi, L, M, and R. In order to do so, we define a multigraph grid Xm, which consists of the (regular) grid X = Γ[H,W] with the following double edges\n• from x1,i to x1,i+1, for any i odd in [W − 1]\n• from xH,i to xH,i+1, for any i even in [W − 1]\n• from xi,1 to xi+1,1, for any i odd in [H − 1]\n• from xi,W to xi+1,W , for any i even in [H − 1].\nThe set of edges of the grid X is contained in the set of edges of the multigraph grid Xm. Hence the cutwidth of Xm is at least min{H + 1,W + 1}, which is the cutwidth of X as reported at the beginning of Section 3.2. Without loss of generality, let us assume H ≤ W, and let us consider the linear arrangement ν of Xm such that, for any x i,j, ν(xi,j) = (j − 1)H + i if j is even, and (j− 1)H + H − i otherwise. It is easy to verify that ν induces a maximum width equal to H + 1. This proves that the cutwidth of the multigraph grid Xm is still min{H + 1,W + 1}.\nObserve that the multigraph grid R which we use in G′ has a set of edges which is a proper subset of the set of edges of Xm, for appropriate values of H and W. The subset relation follows from the fact that R does not have double edges at the portion of its leftmost column that connects with M. Similarly, the multigraph grid L has a set of edges which is a proper subset of the set of edges of an upside-down instance of Xm. Thus both L and R have cutwidth min{H + 1,W + 1}. Consider now grid M. The set of its edges is a proper subset of the edges of an upside-down instance of Xm. This follows from the fact that M does not have double edges at its leftmost and rightmost columns, where it connects with L and R, respectively. Furthermore, the green path through M sometimes leaves the first row of M to connect to some grid Gi, as depicted in Figure 7. Thus we can claim a cutwidth of min{H + 1,W + 1} for this grid as well. It is easy to verify that each of the green paths through grids L, M and R corresponds to a linear arrangement that realizes the maximum width of min{H + 1,W + 1} for these grids.\nFinally, each grid Gi can be split into two parts. The first part consists of what we have called blocks 1 and 2, and the second part consists of block 3. The first part is a grid with a proper subset of the edges of an upside-down instance of Xm, for appropriate values of H and W. This is so because the green path at block 2 repeatedly leaves Gi to connect to three other grids Gj, j 6= i, irrespective of whether these connections are backward or forward in the source graph G. The second part of Gi is an instance of Xm, for appropriate values of H and W. The difference between these two parts is due to the fact that, when moving from block 2 to block 3, the green path switches to a “reversed” pattern, as already observed in this section. An optimal linear arrangement for Gi can be defined by following the green path within each column of this grid, and moving from one column to the next in a left to right order. The maximum width in the first part of Gi, with the exception of the last column, is then min{H + 1,W + 1}, and this is also the maximum width in the second part, with the exception of the first column. It is not difficult to verify that, even for the positions corresponding to the two adjacent columns above, this arrangement induces a maximum width of min{H + 1,W + 1}. We have thus found that all of the grid components in G′ have cutwidth of min{H + 1,W + 1}.\nWe conclude our construction by setting k′ = 3n4 + 2n3 + 2k+ 2 in the target instance 〈G′, k′〉\nof the PMCW problem.\n3.3 MBW to PMCW\nWe show here that if G admits a partition of its nodes into two equal size subsets, inducing a cut of size at most k, then G′ admits a linear arrangement ν′ whose maximum width is at most k′.\nLemma 2. If 〈G, k〉 is a positive instance of MBW then 〈G′, k′〉 is a positive instance of PMCW.\nProof. We specify a linear arrangement of G′ having width no greater than k′ at each position. We arrange the vertices within each grid component Gi, as well as within grid components R, M, and L, to be contiguous to one another. Within each grid component, we arrange the vertices in column-major order proceeding through the columns from left to right; within each column, we place vertices in the order specified by the green path of G′. This is the same linear arrangement for each multigraph grid that has been presented in the paragraph “Double Edges”, at the end of Section 3.2. Disregarding edges that are not internal to the grid itself, this results in a maximal width of H + 1 for each individual grid, as already discussed.\nWe concatenate the linear arrangements for the grid components in a manner corresponding to a solution of the MBW problem given by 〈G, k〉. To this end, let V1 and V2 be the sets in a partition of the vertices in G such that |V1| = |V2| and at most k edges in G have one endpoint in V1 and the other endpoint in V2.\nOur linear arrangement begins with the grid components Gi for all i such that vi ∈ V1, in any order, then concatenates components L, M, and R, and finally adds Gi for all i such that vi ∈ V2, in any order. Each position in the linear arrangement within component L has at most 3n4 + 2 edges internal to L, since the height of L’s grid is 3n4 + 1. In addition, each position within L has 4n2 edges connecting M to each of the n2 components Gi to the left of L, for a total of 2n 3 edges. Finally, each position within L has at most 2k edges connecting components Gi and Gj for i, j such that vi ∈ V1, vj ∈ V2 and (vi, vj) ∈ E. Thus, the total width at each position within L is at most 3n4 + 2+ 2n3 + 2k = k′. The same analysis applies to each position within R.\nAt all other positions in the linear arrangement, we have smaller width. This is because, for\npositions within each Gi, we have at most 2n 4 + 2 edges from the grid Gi itself, at most 2n 3 edges from M to any Gj standing on the same side as Gi with respect to M, and no more than 3n edges from some Gj to some Gh, since the source graph G is cubic and each connection between two vertices in G corresponds to two arcs connecting the associated grids in G′. For positions within M, we have at most 2n4 + 2 edges internal to M, at most 4n3 edges from M to some Gi, and 2k < 3n edges from some Gi to some Gj. Finally, positions between grid components have at most 2n3 edges from M to some Gi, at most 3n edges from some Gi to some Gj, and, in the case of positions between M and either L or R, 2n4 + 1 edges connecting M to either L or R. Thus, all positions outside grids L and R have a width bound of 2n4 +O(n3).\nWe conclude that the maximum width of the linear arrangement is that of the L and R compo-\nnents, 3n4 + 2+ 2n3 + 2k = k′. Then 〈G′, k′〉 is a positive instance of PMCW.\n3.4 PMCW to MBW\nIn this sectionwe shall prove that if G′ admits a linear arrangement ν′ whosemaximumwidth is at most k′, then our source graph G admits a partition into two equal size subsets of nodes inducing\na cut of size at most k. To this aim, we need to develop several intermediate results. Informally, our strategy is to investigate the family of linear arrangements for G′ having maximum width bounded by k′ + n2. We show that, in these arrangements, two important properties hold for the grid components L,M, R and Gi, i ∈ [n], of G ′, described in what follows.\n• The first property states that, for each grid component, a subset of its nodes must appear\nall in a row in the linear arrangement. We call such a subset the kernel of the grid. In other words, nodes from different kernels cannot be intermixed, and each linear arrangement induces a total order among the kernels. In addition, the kernels of the grids L,M, R must appear one after the other in the total order, and the kernels of the grids Gi can only be placed to the left or to the right of the kernels of L,M, R. We therefore call L,M, R the middle grids.\n• We illustrate the second property bymeans of an example. Consider one of themiddle grids,\nsay L. Assume that, under our liner arrangement, there is a grid X with kernel to the left of L’s kernel and a grid Y with kernel to the right of L’s kernel. Assume also some edge e of G′, connecting a node x from X with a node y from Y. If x and y are in the kernels of their respective grids, edge e must cross over L’s kernel, contributing one unit to the width of G′ at each gap i within L’s kernel. If x and y are not in the kernels of their respective grids, it is possible to “misplace” one of these two nodes, say x, moving it to the opposite side with respect to L’s kernel, in such a way that e no longer contributes to the width at i. The second property states that, if we do this, we will bring new edges, internal to grid X, into the count of width at i. This means that, if our goal is the one of optimizing the width at i, we will have no gain in misplacing node x or node y.\nWith the two properties above, we can then show that exactly n2 of the Gi grids must be placed to the left of the middle grids L,M, R, and all of the remaining Gi grids must be placed to the right of the middle grids, which eventually leads to the fact that if 〈G′, k′〉 is a positive instance of PMCW then 〈G, k〉 is a positive instance of MBW.\nWe start with some preliminary results, needed to prove the first property above. Let V1 and V2 be sets of nodes from some graph with V1 ∩ V2 = ∅, and let E be the set of edges of the graph. We write δ (V1,V2) = |{(u, v) : (u, v) ∈ E ∧ u ∈ V1 ∧ v ∈ V2}|.\nLemma 3. For any grid X = Γ[H,W] with W ≥ 2H + 1 and for any partition of its nodes in two sets V1 and V2 with |V1| ≥ H 2 and |V2| ≥ H2, we have δ (V1,V2) ≥ H.\nProof. We distinguish the following three cases.\n(i) For each h with 1 ≤ h ≤ H there exist wh,1 and wh,2 with 1 ≤ wh,1,wh,2 ≤ W such that\nxh,wh,1 ∈ V1 and x h,wh,2 ∈ V2. This implies that, for each row of the grid, there exists at least one edge connecting one node in V1 to one node in V2. Hence, δ (V1,V2) ≥ H.\n(ii) There exists h with 1 ≤ h ≤ H such that, for any w with 1 ≤ w ≤ W, xh,w ∈ V1. In this case,\nfor each w with 1 ≤ w ≤ W, either there exists hw with 1 ≤ hw ≤ H such that xhw ,w ∈ V2 (and, hence, the w-th column of X contributes to δ (V1,V2) by at least one unit) or else, for all\nh with 1 ≤ h ≤ H, xh,w ∈ V1. This latter case can happen at most ⌊ |V1 | H ⌋ times: this implies that the former case happens at leastW − ⌊\n|V1| H\n⌋\n. Hence,\nδ (V1,V2) ≥ W −\n⌊\n|V1|\nH\n⌋\n≥ WH − |V1|\nH =\n|V2|\nH ≥ H,\nwhere the last inequality is due to the fact that |V2| ≥ H2.\n(iii) There exists h with 1 ≤ h ≤ H such that, for any w with 1 ≤ w ≤ W, xh,w ∈ V2. We can deal\nwith this case similarly to the previous one.\nThe lemma thus follows.\nCorollary 1. For any grid X = Γ[H,W] with W ≥ 2H + 1, for any linear arrangement ν of X, and for any i with H2 ≤ i ≤ HW − H2, wd(X, ν, i) ≥ H.\nProof. The result follows by observing that, for any i with H2 ≤ i ≤ HW − H2, we can define a partition of the nodes of the grid by including in V1 all the nodes x such that ν(x) ≤ i and by including in V2 all the other nodes. Since this partition satisfies the hypothesis of the previous lemma, we have that wd(X, ν, i) ≥ H.\nLet ν be an arbitrary linear arrangement for the nodes of G′. We denote by νi (respectively, νL, νM, and νR) the linear arrangement of Gi (respectively, L, M, and R) induced by ν. Moreover, for any node x of Gi (respectively, L, M, and R) and the associated position p = ν(x) under ν, we denote by pi = νi(x) (respectively, pL = νL(x), pM = νM(x), and pR = νR(x)) the corresponding position of x under νi (respectively, νL, νM, and νR).\nWe now introduce the notion of kernel, which plays a major role in the development of our proofs below. Consider any linear arrangement ν of G′ and any of the grids Gi. The kernel K (ν) i relative to ν and Gi is a set of positions p of the nodes of G ′ under ν such that ( 2n4 + 1 )2\n≤ pi ≤ (\n6n4 ) ( 2n4 + 1 ) − ( 2n4 + 1 )2 . Corollary 1 implies that for any p ∈ K (ν) i , wd(Gi, νi, pi) ≥ 2n 4 + 1.\nSimilarly, we define the kernel K (ν) L (respectively, K (ν) R ) as the set of positions p of the nodes of\nG′ under ν such that ( 3n4 + 1 )2 ≤ pL, pR ≤ ( 12n4 ) ( 3n4 + 1 ) − ( 3n4 + 1 )2 . Again, Corollary 1 implies that for any p ∈ K (ν) L (respectively, p ∈ K (ν) R ), we have wd(L, νL, pL) ≥ 3n 4 + 1 (respectively, wd(R, νR, pR) ≥ 3n 4 + 1). We define the kernel K (ν) M as the set of positions p of the nodes of G ′ under ν such that ( 2n4 + 1 )2 ≤ pM ≤ ( 2n4 + 1 ) ( 8n4 + 1 ) − ( 2n4 + 1 )2 . Corollary 1 implies that for any p ∈ K (ν) M we have wd(M, νM, pM) ≥ 2n 4 + 1.\nObserve that, for any i ∈ [n], we have |K (ν) i | = (2n 4 + 1)(6n4) − 2((2n4 + 1)2) + 1 ≥ 3n8\nfor n sufficiently large. Furthermore, for n sufficiently large, we have |K (ν) L | = |K (ν) R | = (3n 4 + 1)(12n4)− 2((3n4 + 1)2) + 1 ≥ 17n8, and |K (ν) M | = (2n 4 + 1)(8n4 + 1)− 2((2n4 + 1)2 + 8n4 + 1) + 1 ≥ 7n8.\nRecall that in our construction in Section 3.2 we have set k′ = 3n4 + 2n3 + 2k+ 2. From now on, we denote by ν′ any linear arrangement of G′ having maximum width at most k′ + n2. For any\ntwo sets of positive integers A and B, we will write A < B if each element of A is smaller than every element in B.\nLemma 4. Let ν′ be a linear arrangement of G′ having maximum width at most k′ + n2, and let K(ν ′) = {K (ν′) L ,K (ν′) M ,K (ν′) R } ∪ {K (ν′) i : i ∈ [n]}. For any pair of kernels K ′,K′′ ∈ K(ν ′) with K′ 6= K′′, either K′ < K′′ or K′′ < K′.\nProof. We first consider the kernels in {K (ν′) i : i ∈ [n]}. Let p, p ′ ∈ K (ν′) i be two positions such that pi = p ′ i − 1. Assume that there exists a position q ∈ K (ν′) j , j 6= i, such that p < q < p ′. We know (by Corollary 1 and definition of kernel) thatwd(Gi, ν ′ i , pi) ≥ 2n 4 + 1 andwd(Gj, ν ′ j , qj) ≥ 2n 4 + 1. Since Gi and Gj have disjoint edge sets, and since in between p and q there is no position associated with a node from Gi, we conclude that wd(G ′, ν′, q) ≥ 4n4 + 2 > k′ + n2, for n sufficiently large. This is in contrast with our assumption about the linear arrangement ν′.\nEssentially the same argument can be used when we consider all of the kernels in K(ν ′).\nIntuitively, the above lemma states that in any linear arrangement ν′ of G′ with maximum width at most k′ + n2, the kernels of the grid components of G′ cannot overlap one with the other. As a consequence, ν′ induces an ordering of the nodes of the source graph G which is determined by the positions of the corresponding kernels.\nLemma 5. Let ν′ be a linear arrangement of G′ having maximum width at most k′ + n2. Then either K (ν′) L < K (ν′) M < K (ν′) R or K (ν′) R < K (ν′) M < K (ν′) L .\nProof. Assuming K (ν′) L < K (ν′) R , we show below that, under ν ′, kernel K (ν′) R cannot be placed in between kernels K (ν′) L and K (ν′) M . Essentially the same argument can be used to show that kernel K (ν′) L cannot be placed in between kernels K (ν′) M and K (ν′) R .\nAssume that we have K (ν′) L < K (ν′) R < K (ν′) M . Since the number of nodes of L which lie to the\nleft of K (ν′) R is at least equal to 17n 8, and since at most n4(12n4) nodes of L can belong to its last n4 rows, we have that at least 5n8 nodes of the first 2n4 + 1 rows of L lie to the left of K (ν′) R . On the other hand, since at least 7n8 nodes of M belong to K (ν′) M , we have that at least 7n 8 nodes of M lie to the right of K (ν′) R .\nLet us now consider the grid X = Γ[2n4 + 1, 12n4 + 8n4 + 1] composed by the (2n4 + 1) upper rows of L and all of the rows of M. We apply Lemma 3 to X. If we define V1 (respectively, V2) as the set of nodes of X contained in K (ν′) L (respectively, K (ν′) M ), we have that both |V1| and |V2| are greater than (2n4 + 1)2. Then we have that at least 2n4 + 1 edges internal to X cross over all positions (gaps) of K (ν′) R . From the definition of kernels, there are at least 3n 4 + 1 edges internal to K (ν′) R crossing over each position of K (ν′) R . Adding these together, we have at least 5n 4 + 2 edges at each position of K (ν′) R , which is greater than k ′ + n2 (for n sufficiently large).\nThe case of K (ν′) R < K (ν′) L can be dealt with in a very similar way and the lemma thus follows.\nIn the following, without loss of generality, we will always assume that K (ν′) L < K (ν′) M < K (ν′) R . By applying essentially the same argument from the proof of Lemma 5, we can show that K (ν′) i cannot lie between K (ν′) L and K (ν′) M or between K (ν′) M and K (ν′) R , which implies the following result.\nLemma 6. Let ν′ be a linear arrangement of G′ having maximum width at most k′ + n2. For any i ∈ [n], either K (ν′) i < K (ν′) L or K (ν′) i > K (ν′) R .\nSo far we have seen that kernels always appear in some total order in the linear arrangements we are interested in, and with the kernels of grids L,M and R all in a row. We move on now with a second property of the family of linear arrangements we are looking at. As already described above, this property states that, if our goal is the one of optimizing the width at certain gaps, then misplacing nodes that are not in a kernel does not result in any gain. We first provide two results about general grids, and then come back to G′ and our linear arrangements.\nLemma 7. Let X = Γ[H,W] and let S be a set of nodes of X such that |S| ≤ W(H − e− 2) with e ≥ 0 and there exists w with 1 ≤ w ≤ W such that, for any h with 1 ≤ h ≤ H, xh,w ∈ S (in other words S contains an entire column of the grid). Then, δ(S, S) contains at least e+ 2 edges in distinct rows, where S denotes the set of nodes of the grid which do not belong to S.\nProof. For each h with 1 ≤ h ≤ H, either there exists w with 1 ≤ w < W such that (xh,w ∈ S∧ xh,w+1 ∈ S)∨ (xh,w ∈ S∧ xh,w+1 ∈ S) (in this case, the row contributes at least by one horizontal edge to δ(S, S)), or, for any w with 1 ≤ w ≤ W, xh,w ∈ S. This latter case, however, can happen at most ⌊\n|S| W\n⌋\ntimes. Since |S| ≤ W(H − e− 2), we have that the first case happens at least e+ 2\ntimes, thus proving the lemma.\nLemma 8. Let X = Γ[H,W] and let S be a set of nodes of X such that |S| ≤ W(H − |F| − 2), where F is a subset of the set of nodes of the first row or of the last row which belong to S. Then, δ(S, S) contains at least |F| edges not included in the first row or in the last row.\nProof. For each w with 1 ≤ w ≤ W such that x1,w ∈ F ∨ xH,w ∈ F, either there exists h with 1 ≤ h < H such that (xh,w ∈ S ∧ xh+1,w ∈ S) ∨ (xh,w ∈ S ∧ xh+1,w ∈ S) (in this case, the column contributes at least by one vertical edge to δ(S, S)), or, for any h with 1 ≤ h ≤ H, xh,w ∈ S (that is, S includes the entire w-th column). If this latter case happens at least once, then we can apply the previous lemma with e = |F|, thus obtaining that δ(S, S) contains at least |F|+ 2 horizontal edges on distinct rows, which implies that δ(S, S) contains at least |F| edges not included in the first row or in the last row. Otherwise, δ(S, S) contains at least |F| vertical edges: indeed, if x1,w ∈ S and xH,w 6∈ S or vice versa, then at least one vertical edge of the w-th column is in δ(S, S), otherwise at least two vertical edges of this column are in δ(S, S) (since, in this case, we have both to exit from S and to enter again in S).\nWe need to introduce some additional notation. From now on, we denote by l∗ the first gap\nfrom left to right occurring between two vertices of K (ν′) L , and we denote by r ∗ the first gap from left to right occurring between two vertices of K (ν′) R . For any i ∈ [n], we define the value αi as follows. If K (ν′) i > K (ν′) L , αi is the number of nodes of the first or of the last row of Gi whose\nposition under ν′ is smaller than l∗ and which are endpoints of an edge exiting Gi. Otherwise, αi is the number of nodes of the first or of the last row of Gi whose position is greater than l ∗ and which are endpoints of an edge exiting Gi. Similarly, we denote by αM the number of nodes of the first row of M whose position is smaller than l∗ and which are endpoints of an edge exiting M.\nLemma 9. For any linear arrangement ν′ of G′ having maximumwidth at most k′+ n2 and for any i ∈ [n], there exist at least αi distinct edges within Gi which cross over l ∗.\nProof. First observe that αi ≤ 4n 2 + 6 because there are 4n2 edges connecting Gi to M and 6 edges connecting Gi to other grids Gj. We only study the case in which K (ν′) i > K (ν′) L , since the other case can be proved in the same way.\nLet Vi be the vertex set of Gi. Let P(Gi) = {p : (ν ′)−1(p) ∈ Vi} and let Si = {p : (ν ′)−1(p) ∈\nVi ∧ p < l ∗} (clearly, |Si| ≥ αi). Since |P(Gi)| = 12n 8 + 6n4 ≤ 13n8 and |K (ν′) i | ≥ 3n 8, and since Si is a subset of P(Gi)− K (ν′) i , we are guaranteed that |Si| ≤ 10n 8. Because 10n8 ≤ (6n4)(2n4 + 1− αi − 2) (assuming n ≥ 4) we have the precondition |Si| ≤ (6n 4)(2n4 + 1− αi − 2) that we need in order to apply Lemma 8. Lemma 8 implies that there exist at least |αi| distinct edges connecting Si to Si (that is, edges within Gi): these edges clearly cross over l ∗.\nSimilarly, we can prove the following result.\nLemma 10. For any linear arrangement ν′ of G′ having maximum width at most k′ + n2, there exist at least αM distinct edges within M which cross over l ∗.\nFrom now on, let κ (ν′) l be the number of kernels K (ν′) i such that K (ν′) i < K (ν′) L and let κ (ν′) r be the\nnumber of kernels K (ν′) i such that K (ν′) i > K (ν′) R . Let also τ (ν′) denote the number of edges (vi, vj) in G such that K (ν′) i < K (ν′) L and K (ν′) j > K (ν′) L .\nLemma 11. Let ν′ be a linear arrangement of G′ having maximum width at most k′ + n2. There exist at least κ (ν′) l · (4n 2) + 2τ(ν ′) distinct edges which cross over l∗, not including edges internal to L or R.\nProof. We define I (ν′) L as the set of integers i ∈ [n] such that K (ν′) i < K (ν′) L . Thus we have |I (ν′) L | = κ (ν′) l . We also define J (ν′) L as the set of integers j ∈ [n] such that K (ν′) j > K (ν′) L and there exists i ∈ I (ν′) L with (vi, vj) ∈ E, where E is the set of edges of G.\nFor each i ∈ I (ν′) L , let us consider the 4n 2 distinct edges connecting Gi to M, along with each\npair of edges connecting Gi to each grid Gj such that K (ν′) j > K (ν′) L and (vi, vj) ∈ E. Let also E be the set of all these edges, for every i ∈ I (ν′) L . Thus we have |E | = κl · (4n 2) + 2τ(ν ′).\nConsider now an arbitrary edge e ∈ E . Let x be one of the two endpoints of e, and assume that x belongs to some grid X among the n+ 3 grid components of G′. We say that x is misplaced if, under ν′, the kernel of X is placed at some side with respect to l∗ and x is placed at the opposite side. From the definition of E , it is easy to see that if none of the endpoints of e are misplaced, or else if both of the endpoints of e are misplaced, then e must cross over l∗. On the other hand, if exactly one of the endpoints of e is misplaced, then e does not cross over l∗.\nConsider then the set of all the misplaced endpoints of some edge in E . By construction of G′, these endpoints are distinct and belong to the first row or to the last row of some grid component of G′. Furthermore, the edges in E are all single rather than multiple edges, as already observed in Section 3.2. By definition of αM and αi, i ∈ [n], we have that αM + ∑i∈(I(ν ′)\nL ∪J (ν′) L )\nαi is greater\nthan or equal to the number of all the misplaced endpoints of some edge in E , and from the above observations we have that the latter number is in turn greater than or equal to the number of edges in E which do not cross over l∗. By Lemmas 9 and 10, it follows that, among the edges within M and among the edges within the components Gi, i ∈ (I (ν′) L ∪ J (ν′) L ), there exist αM + ∑i∈(I(ν\n′) L ∪J (ν′) L )\nαi\ndistinct edges which cross over l∗. This quantity plus the number of edges in E which cross over l∗ gives us the desired result.\nWe are now ready to show the inverse relation of the statement in Lemma 2. In what follows we focus our attention on linear arrangements of G′ having maximum width at most k′. The reason why all of the previous lemmas in this section have been stated for linear arrangements with maximum width at most k′ + n2 is because in Section 4 we need to refer to this extended class.\nLemma 12. If 〈G′, k′〉 is a positive instance of PMCW then 〈G, k〉 is a positive instance of MBW.\nProof. Let ν′ be a linear arrangement of G′ having maximum width bounded by k′ = 3n4 + 2n3 + 2k+ 2, and consider quantity wd(G′, ν′, l∗). From Lemma 11 there are at least κ (ν′) l · (4n 2) + 2τ(ν ′) distinct edges which cross over l∗, not including edges internal to the grids L or R. In addition, recall that there are at least 3n4 + 1 edges internal to L that are crossing over l∗. This is because of Corollary 1 and because of the way we have defined kernels. If κ (ν′) l > n 2 , the number of edges contributing to wd(G′, ν′, l∗) would be at least 3n4 + 1+ ( n2 + 1) · 4n 2 = 3n4 + 2n3 + 4n2 + 1 > 3n4 + 2n3 + 2k + 2 = k′, for sufficiently large values of n, where the inequality follows from the fact that k is bounded by the number of edges in G, which is 3n2 . This is against our assumptions on ν′. Thus we must conclude that κ (ν′) l ≤ n 2 . Similarly, we can prove that κ (ν′) r cannot be greater than n2 . Hence, we have that κ (ν′) l = κ (ν′) r = n 2 .\nUsing the above fact in Lemma 11, we have that the number of edges external to L and R crossing over l∗ is at least 2n3 + 2τ(ν ′). Including the edges internal to L gives at least 3n4 + 2n3 + 2τ(ν ′) + 1 edges crossing over l∗. Since the width of l∗ is at most 3n4 + 2n3 + 2k+ 2, it also follows that τ(ν ′) ≤ k+ 12 . This means that the number of edges (vi, vj) in G such that K (ν′) i < K (ν′) L and K (ν′) j > K (ν′) L is at most k. Hence, by partitioning the nodes of G according to the position of their corresponding kernels under ν′, we have an equal size subset partition whose cut is at most k."
    }, {
      "heading" : "3.5 Cutwidth and Internal Boundaries",
      "text" : "We can now present the main results of Section 3.\nTheorem 1. The problem PMCW is NP-complete.\nProof. Let G be a cubic graph with n > 1 vertices, and let k > 0 be some integer. From Lemma 2 and from Lemma 12, we have that 〈G, k〉 is a positive instance of MBW if and only if 〈G′, k′〉 is a positive instance of PMCW. This relation shows that an algorithm for PMCW could be used to solve MBW, and thus PMCW is NP-hard.\nTo conclude the proof, we observe that the problem PMCW is in NP because a linear arrangement of a graph can be guessed in polynomial time and its maximum width can be computed in polynomial time as well.\nWe can now deal with a decision problem associated with the problem of finding a linear parsing strategy for a synchronous rule that minimizes the number of internal boundaries, defined in (2).\nTheorem 2. Let s be a synchronous rule with r nonterminals and with associated permutation πs, and let k be some positive integer. The problem of deciding whether\nmin σ max i∈[r] ib(πs, σ, i) ≤ k\nis NP-complete.\nProof. We have already observed that the relation cw(Gs) = minσ maxi∈[r] ib(πs, σ, k) directly follows from Lemma 1. The statement then follows from Theorem 1."
    }, {
      "heading" : "4 Relating Permutation Multigraphs to SCFGs",
      "text" : "As discussed in Section 2, our main goal is finding efficient ways of parsing synchronous contextfree rules. In this section, we use our results on permutation multigraphs to prove NP-hardness for optimizing both space complexity and time complexity of linear parsing strategies for SCFG rules. We begin by examining space complexity, and then generalize the argument to prove our result on time complexity."
    }, {
      "heading" : "4.1 Space Complexity",
      "text" : "Optimizing the space complexity of a parsing strategy is equivalent to minimizing the maximum that the fan-out function achieves across the steps of the parsing strategy (5). According to the definition of the fan-out function (4), fan-out consists of the two terms ib and eb, accounting for the internal and the external boundaries, respectively, realized at a given step by a linear parsing strategy. Let s be a synchronous rule with Gs the associated permutation multigraph. We have already seen in Lemma 1 a relation between the ib term and the width function for Gs. In order to make precise the equivalence between the fan-out problem and the cutwidth problem for Gs, we must now account for the eb term.\nLet bR and eR be the first and the last vertices of the red path in Gs, and let bG and eG be the first and the last vertices of the green path. We collectively refer to these vertices as the endpoints of Gs, and we define Ve = {bR, eR, bG, eG}. Let σs be some linear parsing strategy for rule s, and\nlet νs be the corresponding linear arrangement for Gs, as defined in Section 3.1. Informally, we observe that under σs the number of external boundaries at a given step i is the number of vertices from the set Ve that have been seen to the left of the current position i under νs (including i itself). Using definition (4) and Lemma 1, this suggests that we can represent the fan-out at i as the width of an augmented permutation multigraph containing special edges from the vertices in Ve, where the special edges always extend past the right end of any linear arrangement. We introduce below some mathematical definitions that formalize this idea.\nAssumeGs has n nodes and set of edges E. We define the extended width at position i ∈ [n]− 1\nto be\newd(Gs, νs, i) = wd(Gs, νs, i) + ∑ v∈Ve I(νs(v) ≤ i) . (8)\nThe contribution of the endpoints to the extended width can be visualized as counting, at each position in the linear arrangement, an additional set of edges running from the endpoint of the red and green paths all the way to the right end of the linear arrangement, as shown in Figure 8. We will refer to these additional edges as extended edges. To simplify the notation below, we also let ewd(Gs, νs, n) = 4.\nLet πs be the permutation associated with synchronous rule s. Observe that the first term in (8) corresponds to the number of internal boundaries ib(πs, σs, i), by Lemma 1, and the second term counts the number of external boundaries eb(πs, σs, i). We can then write, for each i ∈ [n]\nfo(πs, σs, i) = 1\n2 ewd(Gs, νs, i) , (9)\nwhich will be used below to assess the complexity of the fan-out problem. Finally, we define the extended cutwidth of Gs as\necw(Gs) = min ν max i∈[n] ewd(Gs, ν, i) . (10)\nFrom (9) and (10) we see that the extended cutwidth of Gs is related to the optimal computational complexity that we can achieve when parsing synchronous rule s with the techniques described in Section 2.2. With such motivation, we investigate below a decision problem related to the computation of the extended cutwidth of a permutation multigraph.\nFrom now on, we assume that 〈G, k〉 is an instance of MBW, where G is a cubic graph with n\nvertices. We also assume that G′ and k′ are constructed from G and k as in Section 3.2.\nLemma 13. If 〈G, k〉 is a positive instance of MBW, then ecw(G′) ≤ k′ + 2.\nProof. Under the assumption that 〈G, k〉 is a positive instance of MBW, consider the linear arrangement ν used in the proof of Lemma 2 to show that 〈G′, k′〉 is a positive instance of PMCW. We already know that the maximum (regular) width of ν is at most k′. With the exception of the first column of grid L and the last column of grid R, the extended width under ν at positions within L and R is two greater than the (regular) width, because the vertices bR and bG are both to the left, while eR and eG are to the right. For positions in the first column of L, the extended width is one greater than the width, because only bG is to the left, as depicted in Figure 7.\nThe critical point is the last column of R. We observe that the edges connecting vertices in the grid components Gi and M contribute to the extended width at positions within R always in the same amount. We thus focus our analysis on the only edges that are internal to R. Recall that eR is the topmost vertex in the last column of R. We let i be the position of eR under ν. At position i− 1 the contribution to the extendedwidth of the edges internal to R consists of 3n4 + 1 red edges and one green edge; see again Figure 7. At the next position i, one red edge and one green edge internal to R are lost. However, these two edges are replaced by one new red edge from R and one new extended edge impinging on vertex eR. Thus the extended width at positions i− 1 and i must be the same. For all of the next positions corresponding to vertices in the last column of R, the contribution to the extended width of the edges internal to R always decreases.\nFrom the above observations, we conclude that the extended width at positions within grid components L and R is bounded by k′ + 2 = 3n4 + 2n3 + 2k+ 4. As already observed in the proof of Lemma 2, the width at all of the remaining positions for ν is lower by n4+O(n3), and this must also be the case for the extended width, since this quantity exceeds the (regular) width by at most four. The existence of linear arrangement ν thus implies ecw(G′) ≤ k′ + 2.\nLet ν′ be a linear arrangement of G′ having maximum width at most k′ + n2. Then ν′ satisfies the hypotheses of all of the lemmas in Section 3.4 constraining the linear arrangement of the kernels of the grid components of G′. However, contrary to the case of the regular cutwidth, the extended cutwidth is not invariant to a reversal of a linear arrangement. This is so because the extended edges always end up at a position to the right of the right end of any linear arrangement. For this reason we can no longer assume that in ν′ we have L < R. Let then XL and XR be the leftmost and the rightmost, respectively, of L and R under ν′. Let also e∗ be the rightmost of l∗ and r∗.\nWe already know from the first part of the proof of Lemma 12 that the number of kernels\nto the left of K (ν′) XL is n2 , and this is also the number of kernels to the right of K (ν′) XR . Using this fact, the following result can easily be shown using the same argument presented in the proof of\nLemma 11. As in Section 3.4, let τ(ν ′) denote the number of edges (vi, vj) in G such that K (ν′) i < K (ν′) XL and K (ν′) j > K (ν′) XR .\nLemma 14. Let ν′ be a linear arrangement of G′ having maximum width at most k′ + n2. There are at least n 2 · (4n 2) + 2τ(ν ′) distinct edges which cross over e∗, not including edges internal to the grids L or R.\nThe proof of the next lemma uses arguments very similar to those already exploited in the\nproof of Lemma 9 and in the proof of Lemma 12.\nLemma 15. If ecw(G′) ≤ k′ + 2, then 〈G, k〉 is a positive instance of MBW.\nProof. Let ν′ be a linear arrangement of G′ having maximum extendedwidth bounded by k′ + 2 = 3n4 + 2n3 + 2k + 4. Since the maximum (regular) width of G′ is at most its maximum extended width, ν′ satisfies the hypotheses of all of the lemmas in Section 3.4 constraining the arrangement of the kernels and the misplaced nodes from the grid components of G′.\nFrom Lemma 14 there are at least 2n3 + 2τ(ν ′) distinct edges which cross over e∗, not including edges internal to the grids L or R. In addition, there are at least 3n4 + 1 edges internal to XR that are crossing over e∗. Finally, consider the two endpoints of either the red or green path appearing in the first and in the last lines of XL, and let αe be the number of such endpoints that have been misplaced to the right of e∗ under ν′. Note that we have 0 ≤ αe ≤ 2.\nLet P(XL) = {p : (ν ′)−1(p) ∈ XL} and let SXL = {p : (ν ′)−1(p) ∈ XL ∧ p > e ∗}. Because\n|P(XL)| = 36n 8 + 12n4 and |KXL | ≥ 17n 8, we know that |SXL | ≤ |P(XL)− KL′ | ≤ 20n 8. Therefore |SXL | ≤ (12n 4)(3n4 + 1− αe − 2) and we can apply Lemma 8 with X = XL and S = SXL . From Lemma 8, there are at least αe edges internal to XL that cross over e ∗. Along with the 2 − αe extended edges departing from XL, this accounts for two additional edges that cross over e ∗.\nCombining all of the above contributions, the total number of edges crossing over e∗ is at least 3n4 + 2n3 + 2τ(ν ′) + 3. Since the extended width of e∗ is at most 3n4 + 2n3 + 2k+ 4, it also follows that τ(ν ′) ≤ k+ 12 . This means that the number of edges (vi, vj) in G such that K (ν′) i < K (ν′) L and K (ν′) j > K (ν′) L is at most k. Hence, by partitioning the nodes of G according to the position of their corresponding kernels under ν′, we have an equal size subset partition whose cut is at most k.\nTheorem 3. Let G be a permutation multigraph and let k be a positive integer. The problem of deciding whether ecw(G) ≤ k is NP-complete.\nProof. By Lemma 13 and Lemma 15, an algorithm that decides whether ecw(G) ≤ k can be used to solve MBW. Thus the problem in the statement of the theorem is NP-hard. The problem is in NP because the maximum extended width of a linear arrangement can be verified in polynomial time.\nTheorem 4. Let s be a synchronous rule with r nonterminals and with associated permutation πs, and let k be a positive integer. The problem of deciding whether\nmin σ max i∈[n] fo(πs, σ, i) ≤ k\nis NP-complete, where σ ranges over all linear parsing strategies for s.\nProof. The NP-hardness part directly follows from Theorem 3, along with (9) and (10). The problem is also in NP, because the maximum value of the fan-out for a guessed linear parsing strategy can be computed in polynomial time.\nWe have already discussed how fan-out is directly related to the space complexity of the implementation of a linear parsing strategy. From Theorem 4 we then conclude that optimization of the space complexity of linear parsing for SCFGs is NP-hard."
    }, {
      "heading" : "4.2 Time Complexity",
      "text" : "We now turn to the optimization of the time complexity of linear parsing for SCFGs. It turns out that at each step of a linear parsing strategy, the time complexity is related to a variant of the notion of width, called modifiedwidth, computed for the correspondingposition of a permutation graph. With this motivation, we investigate below themodifiedwidth and some extensions of this notion, and we derive our main result in a way which parallels what we have already done in Section 4.1.\nWe start with some additional notation. Let G = (V, E) be an undirected (multi)graph such that |V| = n > 1, and let ν be some linear arrangement of G. For any i ∈ [n], the modified width of G at i with respect to ν, written mwd(G, ν, i), is defined as |{(u, v) ∈ E : ν(u) < i < ν(v)}|. Informally, mwd(G, ν, i) is the number of distinct edges crossing over the vertex at position i-th in the linear arrangement ν. Again in case of multigraphs the size of the previous set should be computed taking into account multiple edge occurrences. The following result is a corollary to Lemma 3.\nCorollary 2. For any grid X = Γ[H,W] with W ≥ 2H + 1, for any linear arrangement ν of X, and for any i with H2 < i ≤ HW − H2, mwd(X, ν, i) ≥ H − 2.\nProof. Modified width at the vertex in position i can be related to the (regular) width of the gaps before and after position i, and the degree ∆(ν−1(i)) of the vertex at position i\nmwd(X, ν, i) = 1\n2 (wd(X, ν, i− 1) +wd(X, ν, i)− ∆(ν−1(i))) .\nFor each i with H2 < i ≤ HW − H2, we can use Corollary 1 and write\nmwd(X, ν, i) ≥ H − 1\n2 ∆(ν−1(i))) .\nBecause vertices in a grid have degree at most four, we have mwd(X, ν, i) ≥ H − 2.\nLet s be a synchronous rule and let Gs be the associated permutation multigraph. Let also νs be a linear arrangement for Gs. We define the extended modified width at i ∈ [n] as\nemwd(Gs, νs, i) = wd(Gs, νs, i) + ∑ v∈Ve I(νs(v) ≤ i) . (11)\nAgain, the contribution of the endpoints of Gs to the extended modified width can be visualized as counting, at each position in the linear arrangement, an additional set of edges running from\nthe endpoint of the red and green paths all the way to the right end of the linear arrangement, as shown in Figure 8. The extended modified cutwidth of Gs is\nemcw(Gs) = min ν max i∈[n] emwd(Gs, ν, i) ,\nwhere ν ranges over all possible linear arrangements for Gs.\nFrom now on, we assume that 〈G, k〉 is an instance of MBW, where G is a cubic graph with n\nvertices. We also assume that G′ and k′ are constructed from G and k as in Section 3.2.\nLemma 16. If 〈G, k〉 is a positive instance of MBW, then emcw(G′) ≤ k′.\nProof. Consider the linear arrangement used in Lemma 13 to show that ecw(G′) ≤ k′ + 2. The critical points in that linear arrangement are all within the L and R components. At all positions in these components, each vertex has two edges extending to its right and two edges extending to its left (one red and one green in each case). Thus, at these positions, the extended modified cutwidth is less than the extended cutwidth by two.\nLemma 17. If emcw(G′) ≤ k′, then 〈G, k〉 is a positive instance of MBW.\nProof. Assume a linear arrangement ν′ forG′ havingmaximum extendedmodifiedwidth bounded by k′. The maximum (non-extended)modified width of G′ must be smaller than or equal to k′, and the maximum (non-extended, non-modified) width of G′ must be smaller than or equal to k′ + 4, because the maximum degree of vertices in G′ is four. Since the maximum width of G′ under ν′ is bounded by k′ + n2, we apply Lemma 14 and conclude that there are at least 2n3 + 2τ(ν ′) distinct edges which cross over the vertex to the left of the gap e∗, not including edges internal to the grids L or R.\nBy Corollary 2, the number of edges internal to XR which cross over the vertex to the left of the gap e∗ is at least 3n4 − 1. Finally, consider the two endpoints of either the red or green path appearing in the first and in the last lines of XL, and let αe be the number of such endpoints that have been misplaced to the right of e∗ under ν′, with 0 ≤ αe ≤ 2. We apply the same argument as in the proof of Lemma 15, and conclude that there are at least αe edges internal to XL that cross over the vertex to the left of the gap e∗. Along with the 2− αe extended edges departing from XL, this accounts for two additional edges that cross over the vertex to the left of the gap e∗.\nCombining all of the above contributions, the total number of edges crossing over the vertex to the left of the gap e∗ is at least 3n4 + 2n3 + 2τ(ν ′) + 1. Since the extended modified width of the vertex to the left of the gap e∗ is at most k′ = 3n4 + 2n3 + 2k+ 2, it also follows that τ(ν ′) ≤ k+ 12 . This means that the number of edges (vi, vj) in G such that K (ν′) i < K (ν′) XL and K (ν′) j > K (ν′) XR is at most k. Hence, by partitioning the nodes of G according to the position of their corresponding kernels under ν′, we have an equal size subset partition whose cut is at most k.\nTheorem 5. Let G be a permutation multigraph and let k be a positive integer. The problem of deciding whether emcw(G) ≤ k is NP-complete.\nProof. By Lemma 17 and Lemma 16, an algorithm that decides whether emcw(G) ≤ k can be used to solve MBW. Thus deciding whether emcw(G) ≤ k is NP-hard. The problem is in NP because the maximum extended modified width of a linear arrangement can be verified in polynomial time.\nWe now relate the notion of extended modified width for a permutation multigraph and the time complexity of a parsing algorithm using a linear strategy. Let s be a synchronous rule with r nonterminals having the form in (7), and let Gs be the permutation multigraph associated with s. Let also σs be some linear parsing strategy defined for s, and let νs be the linear arrangement associated with σs, as defined in Section 3.1. Recall from Section 2.2 that the family of parsing algorithms we investigate in this article use parsing states to represent the boundaries (internal and external) that delimit the substrings of the input that have been parsed at some step, following our strategy σs.\nFor some i with i ∈ [r − 1], let us consider some parsing state with state type (s, σs, i). In the next parsing step i + 1, we move to a new state with state type (s, σs, i+ 1) by adding to our partial analyses the (i+ 1)-th pair of nonterminals from the right-hand side of s, defined according to σs. As already observed in Section 2.2, this operation involves some updates to the sequence of boundaries of our old state of type (s, σs, i). More precisely, the new state is constructed from the old state by removing a number δ (−) i+1 of boundaries, and by adding a number δ (+) i+1 of new boundaries. From the definition of Gs, we know that δ (−) i+1 is the number of backward edges at vertex i + 1, and δ (+) i+1 is the number of forward edges at vertex i + 1, where backward, forward and vertex i + 1 are all defined relative to the linear arrangement νs and include the extended edges. We also have δ (−) i+1 + δ (+) i+1 = ∆(ν −1 s (i+ 1)), where ∆(ν −1(i+ 1)) is the degree of the vertex at position i+ 1.\nThe total number of boundaries ti+1 involved in the parsing step i + 1 is then the number of boundaries for state type (s, σs, i), which includes the δ (−) i+1 boundaries that need to be removed at such step, plus the new boundaries δ (+) i+1 . We already know that ewd(Gs, νs, i) is the number of boundaries for (s, σs, i). We can then write\nti+1 = ewd(Gs, νs, i) + δ (+) i+1\n= ewd(Gs, νs, i)− δ (−) i+1 + δ (−) i+1 + δ (+) i+1 = emwd(Gs, νs, i+ 1) + ∆(ν −1 s (i+ 1)) = emwd(Gs, νs, i+ 1) + 4 .\nThat is, the total number of boundaries involved in a parsing step is the number of boundaries that are not affected by the step, which correspond to edges passing over a vertex in the linear arrangement, emwd(Gs, νs, i+ 1), plus the number of boundaries opened or closed by adding the new nonterminal, which is the vertex’s degree ∆(ν−1s (i+ 1)).\nLet w1 and w2 be the input strings in our synchronous parsing problem, and let n be the maximumbetween the lengths ofw1 andw2. Observe that theremay beO(n ti+1) different instantiations of parsing step i+ 1 in our algorithm. In order to optimize the time complexity of our algorithm,\nrelative to synchronous rule s, we then need to choose a linear arrangement that achieves maximum extended modified width of emcw(Gs). From Theorem 5, we then conclude that optimization of the time complexity of linear parsing for SCFGs is NP-hard."
    }, {
      "heading" : "5 Discussion",
      "text" : "In this section, we discuss the implications of our results for machine translation. Synchronous parsing is the problem of finding a suitable representation of the derivations of a string pair consisting of one string from each language in the translation. In the context of statistical machine translation, this problem arises when we wish to analyze string pairs consisting of known parallel text in, say, English and Chinese, for the purposes of counting how often each SCFG rule is used and estimating its probability. Thus, synchronous parsing corresponds to the training phase of a statistical machine translation system. Our results show that it is NP-hard to find the linear synchronous parsing strategy with the lowest space complexity or the lowest time complexity. This indicates that learning complex translation models from parallel text is a fundamentally hard problem.\nA separate, but closely related, problem arises when translating new Chinese sentences into English, a problem known as decoding. A simple decoding algorithm consists of parsing the Chinese string with the Chinese side of the SCFG, and simply reading the English translation off of the English side of each rule used. This can be accomplished in time O(n3) using the CYK parsing algorithm for (monolingual) context-free grammars, since we use only one side of the SCFG.\nMore generally, we may wish to compute not only the single highest-scoring translation, but a compact representation of all English translations of the Chinese string. Just as the chart constructed during monolingual parsing can be viewed as a non-recursive CFG generating all analyses of a string, we can parse the Chinese string with the Chinese side of the SCFG, retain the resulting chart, and use the English sides of the rules as a non-recursive CFG generating all possible English translations of the Chinese string. However, in general, the rules cannot be binarized in this construction, since the Chinese and English side of each rule are intertwined. This means that the resulting non-recursive CFG has size greater than O(n3), with the exponent depending on the maximum length of the SCFG rules. One way to reduce the exponent is to factor each SCFG rule into a sequence of steps, as in our linear SCFG parsing strategies.\nMachine translation systems do, in fact, require such a representation of possible translations, rather than simply taking the single best translation according to the SCFG. This is because the score from the SCFG is combined with a score from an English N-gram language model in order to bias the output English string toward hypotheseswith a high prior probability, that is, strings that look like valid English sentences. In order to incorporate scores from an English N-gram language model of order m, we extend the dynamic programming algorithm to include in the state of each hypothesis the first and last m − 1 words of each contiguous segment of the English sentence. Thus, the number of contiguous segments in English, which is the fan-out of the parsing strategy on the English side, again enters into the complexity [HZGK09]. Given a parsing strategywith fan-\nout fc on the Chinese side and fan-out fe on the English side, the space complexity of the dynamic programming table is O(n fcV2 fe(m−1)), where n is the length of the Chinese input string, V is the size of the English vocabulary, and m is the order of N-gram language model. Under the standard assumption that each Chinese word has a constant number of possible English translations, this is equivalent to O(n fc+2 fe(m−1)). Thus, our NP-hardness result for the space complexity of linear strategies for synchronous parsing also applies to the space complexity of linear strategies for decoding with an integrated language model.\nSimilarly, the time complexity of language-model-integrated decoding is related to the time complexity of synchronous parsing through the order m of the N-gram language model. In synchronous parsing, the time complexity of a step combining of state of type (s, σ, k) and a nonterminal (A1,k+1, A2,π−1(k+1)) to produce a state of type (s, σ, k+ 1) is O(n a+b+c), where a is the number of boundaries in states of type (s, σ, k), b the number in nonterminal (A1,k+1, A2,π−1(k+1)), and c the number in type (s, σ, k + 1). If we rewrite a as ac + ae, where ac is the number of boundaries in Chinese and ae is the number of boundaries in English, then the exponent for the complexity of synchronous parsing is:\nae + be + ce + ac + be + ce\nand the exponent for language-model-integrated decoding is:\n(m− 1)(ae + be + ce) + ac + be + ce\nNote that these two expressions coincide in the case where m = 2. Since we proved that optimizing the time complexity of linear synchronous parsing strategies is NP-complete, our result also applies to the more general problem of optimizing time complexity of language-model-integrated decoding for language models of general order m.\nOpen Problems This article presents the first NP-hardness result regarding parsing strategies for SCFGs. However, there is a more general version of the problem whose complexity is still open. In this article, we have restricted ourselves to linear parsing strategies, that is, strategies that add one nonterminal at a time to the subset of right hand side nonterminals recognized so far. In general, parsing strategies may group right hand side nonterminals hierarchically into a tree. For some permutations, hierarchical parsing strategies for SCFG rules can be more efficient than linear parsing strategies [HZGK09]. Whether the time complexity of hierarchical parsing strategies is NP-hard is not known even for the more general class of LCFRS. An efficient algorithm for minimizing the time complexity of hierarchical strategies for LCFRS would imply an improved approximation algorithm for the well-studied graph-theoretic problem of treewidth [Gil11]. Minimizing fan-out of hierarchical strategies, on the other hand, is trivial, for both LCFRS and SCFG. This is because the strategy of combining all right hand side nonterminals in one step (that is, forming a hierarchy of only one level) is optimal in terms of fan-out, despite its high time complexity."
    } ],
    "references" : [ {
      "title" : "Syntax directed translations and the pushdown assembler",
      "author" : [ "Alfred V. Aho", "Jeffery D. Ullman" ],
      "venue" : "J. Computer and System Sciences,",
      "citeRegEx" : "Aho and Ullman.,? \\Q1969\\E",
      "shortCiteRegEx" : "Aho and Ullman.",
      "year" : 1969
    }, {
      "title" : "The Theory of Parsing, Translation, and Compiling, volume",
      "author" : [ "Albert V. Aho", "Jeffery D. Ullman" ],
      "venue" : null,
      "citeRegEx" : "Aho and Ullman.,? \\Q1972\\E",
      "shortCiteRegEx" : "Aho and Ullman.",
      "year" : 1972
    }, {
      "title" : "Graph bisection algorithms with good average case",
      "author" : [ "T. Bui", "S. Chaudhuri", "T. Leighton", "M. Sipser" ],
      "venue" : "behavior. Combinatorica,",
      "citeRegEx" : "Bui et al\\.,? \\Q1987\\E",
      "shortCiteRegEx" : "Bui et al\\.",
      "year" : 1987
    }, {
      "title" : "The mathematics of statistical machine translation: Parameter estimation",
      "author" : [ "Peter F. Brown", "Stephen A. Della Pietra", "Vincent J. Della Pietra", "Robert L. Mercer" ],
      "venue" : "Computational Linguistics,",
      "citeRegEx" : "Brown et al\\.,? \\Q1993\\E",
      "shortCiteRegEx" : "Brown et al\\.",
      "year" : 1993
    }, {
      "title" : "Optimal head-driven parsing complexity for linear context-free rewriting systems",
      "author" : [ "Pierluigi Crescenzi", "Daniel Gildea", "Andrea Marino", "Gianluca Rossi", "Giorgio Satta" ],
      "venue" : "In Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics",
      "citeRegEx" : "Crescenzi et al\\.,? \\Q2011\\E",
      "shortCiteRegEx" : "Crescenzi et al\\.",
      "year" : 2011
    }, {
      "title" : "Evaluation of Grammar Formalisms for Applications to Natural Language Processing and Biological Sequence Analysis",
      "author" : [ "David Chiang" ],
      "venue" : "PhD thesis, University of Pennsylvania,",
      "citeRegEx" : "Chiang.,? \\Q2004\\E",
      "shortCiteRegEx" : "Chiang.",
      "year" : 2004
    }, {
      "title" : "Hierarchical phrase-based translation",
      "author" : [ "David Chiang" ],
      "venue" : "Computational Linguistics,",
      "citeRegEx" : "Chiang.,? \\Q2007\\E",
      "shortCiteRegEx" : "Chiang.",
      "year" : 2007
    }, {
      "title" : "An efficient context-free parsing algorithm",
      "author" : [ "Jay Earley" ],
      "venue" : "Communications of the ACM,",
      "citeRegEx" : "Earley.,? \\Q1970\\E",
      "shortCiteRegEx" : "Earley.",
      "year" : 1970
    }, {
      "title" : "What’s in a translation rule",
      "author" : [ "Michel Galley", "Mark Hopkins", "Kevin Knight", "Daniel Marcu" ],
      "venue" : "In Proceedings of the 2004 Meeting of the North American chapter of the Association for Computational Linguistics",
      "citeRegEx" : "Galley et al\\.,? \\Q2004\\E",
      "shortCiteRegEx" : "Galley et al\\.",
      "year" : 2004
    }, {
      "title" : "Grammar factorization by tree decomposition",
      "author" : [ "Daniel Gildea" ],
      "venue" : "Computational Linguistics,",
      "citeRegEx" : "Gildea.,? \\Q2011\\E",
      "shortCiteRegEx" : "Gildea.",
      "year" : 2011
    }, {
      "title" : "Efficient parsing of well-nested linear context-free rewriting systems",
      "author" : [ "Carlos Gómez-Rodrı́guez", "Marco Kuhlmann", "Giorgio Satta" ],
      "venue" : "In Human Language Technologies: The 2010 Annual Conference of the North American Chapter of the Association for Computational Linguistics,",
      "citeRegEx" : "Gómez.Rodrı́guez et al\\.,? \\Q2010\\E",
      "shortCiteRegEx" : "Gómez.Rodrı́guez et al\\.",
      "year" : 2010
    }, {
      "title" : "Optimal reduction of rule length in Linear Context-Free Rewriting Systems",
      "author" : [ "Carlos Gómez-Rodrı́guez", "Marco Kuhlmann", "Giorgio Satta", "DavidWeir" ],
      "venue" : "In Proceedings of the 2009 Meeting of the North American chapter of the Association for Computational Linguistics",
      "citeRegEx" : "Gómez.Rodrı́guez et al\\.,? \\Q2009\\E",
      "shortCiteRegEx" : "Gómez.Rodrı́guez et al\\.",
      "year" : 2009
    }, {
      "title" : "Worst-case synchronous grammar rules",
      "author" : [ "Daniel Gildea", "Daniel Štefankovič" ],
      "venue" : "In Proceedings of the 2007 Meeting of the North American chapter of the Association for Computational Linguistics",
      "citeRegEx" : "Gildea and Štefankovič.,? \\Q2007\\E",
      "shortCiteRegEx" : "Gildea and Štefankovič.",
      "year" : 2007
    }, {
      "title" : "Introduction to Automata Theory, Languages, and Computation",
      "author" : [ "John E. Hopcroft", "Jeffrey D. Ullman" ],
      "venue" : null,
      "citeRegEx" : "Hopcroft and Ullman.,? \\Q1979\\E",
      "shortCiteRegEx" : "Hopcroft and Ullman.",
      "year" : 1979
    }, {
      "title" : "Binarization of synchronous context-free grammars",
      "author" : [ "Liang Huang", "Hao Zhang", "Daniel Gildea", "Kevin Knight" ],
      "venue" : "Computational Linguistics,",
      "citeRegEx" : "Huang et al\\.,? \\Q2009\\E",
      "shortCiteRegEx" : "Huang et al\\.",
      "year" : 2009
    }, {
      "title" : "Statistical phrase-based translation",
      "author" : [ "Philipp Koehn", "Franz Josef Och", "Daniel Marcu" ],
      "venue" : "In Proceedings of the 2003 Meeting of the North American chapter of the Association for Computational Linguistics",
      "citeRegEx" : "Koehn et al\\.,? \\Q2003\\E",
      "shortCiteRegEx" : "Koehn et al\\.",
      "year" : 2003
    }, {
      "title" : "Syntax-directed transduction",
      "author" : [ "II P.M. Lewis", "R.E. Stearns" ],
      "venue" : "Journal of the ACM,",
      "citeRegEx" : "Lewis and Stearns.,? \\Q1968\\E",
      "shortCiteRegEx" : "Lewis and Stearns.",
      "year" : 1968
    }, {
      "title" : "Topological bandwidth",
      "author" : [ "F.S. Makedon", "C.H. Papadimitriou", "I.H. Sudborough" ],
      "venue" : "SIAM Journal on Algebraic and Discrete Methods,",
      "citeRegEx" : "Makedon et al\\.,? \\Q1985\\E",
      "shortCiteRegEx" : "Makedon et al\\.",
      "year" : 1985
    }, {
      "title" : "Optimal cutwidths and bisection widths of 2- and 3-dimensional meshes",
      "author" : [ "José D.P. Rolim", "Ondrej Sýkora", "Imrich Vrto" ],
      "venue" : "In 21st International Workshop on GraphTheoretic Concepts in Computer Science,",
      "citeRegEx" : "Rolim et al\\.,? \\Q1995\\E",
      "shortCiteRegEx" : "Rolim et al\\.",
      "year" : 1995
    }, {
      "title" : "On multiple context-free grammars",
      "author" : [ "H. Seki", "T. Matsumura", "M. Fujii", "T. Kasami" ],
      "venue" : "Theoretical Computer Science,",
      "citeRegEx" : "Seki et al\\.,? \\Q1991\\E",
      "shortCiteRegEx" : "Seki et al\\.",
      "year" : 1991
    }, {
      "title" : "Some computational complexity results for synchronous context-free grammars",
      "author" : [ "Giorgio Satta", "Enoch Peserico" ],
      "venue" : "In Proceedings of Human Language Technology Conference and Conference on Empirical Methods in Natural Language Processing (HLT/EMNLP),",
      "citeRegEx" : "Satta and Peserico.,? \\Q2005\\E",
      "shortCiteRegEx" : "Satta and Peserico.",
      "year" : 2005
    }, {
      "title" : "Synchronous tree-adjoining grammars",
      "author" : [ "Stuart Shieber", "Yves Schabes" ],
      "venue" : "In Proceedings of the 13th International Conference on Computational Linguistics (COLING-90),",
      "citeRegEx" : "Shieber and Schabes.,? \\Q1990\\E",
      "shortCiteRegEx" : "Shieber and Schabes.",
      "year" : 1990
    }, {
      "title" : "An alternative conception of tree-adjoining derivation",
      "author" : [ "Yves Schabes", "Stuart M. Shieber" ],
      "venue" : "Computational Linguistics,",
      "citeRegEx" : "Schabes and Shieber.,? \\Q1994\\E",
      "shortCiteRegEx" : "Schabes and Shieber.",
      "year" : 1994
    }, {
      "title" : "Optimal rank reduction for linear context-free rewriting systems with fan-out two",
      "author" : [ "Benoı̂t Sagot", "Giorgio Satta" ],
      "venue" : "In Proceedings of the 48th Annual Meeting of the Association for Computational Linguistics,",
      "citeRegEx" : "Sagot and Satta.,? \\Q2010\\E",
      "shortCiteRegEx" : "Sagot and Satta.",
      "year" : 2010
    }, {
      "title" : "Characterizing structural descriptions produced by various grammatical formalisms",
      "author" : [ "K. Vijay-Shankar", "D.L. Weir", "A.K. Joshi" ],
      "venue" : "In Proceedings of the 25th Annual Conference of the Association for Computational Linguistics",
      "citeRegEx" : "Vijay.Shankar et al\\.,? \\Q1987\\E",
      "shortCiteRegEx" : "Vijay.Shankar et al\\.",
      "year" : 1987
    }, {
      "title" : "Recognition and parsing of context-free languages in time n3",
      "author" : [ "Daniel H. Younger" ],
      "venue" : "Information and Control,",
      "citeRegEx" : "Younger.,? \\Q1967\\E",
      "shortCiteRegEx" : "Younger.",
      "year" : 1967
    } ],
    "referenceMentions" : [ ],
    "year" : 2013,
    "abstractText" : "Synchronous Context-Free Grammars (SCFGs), also known as syntax-directed translation schemata [AU69, AU72], are unlike context-free grammars in that they do not have a binary normal form. In general, parsing with SCFGs takes space and time polynomial in the length of the input strings, but with the degree of the polynomial depending on the permutations of the SCFG rules. We consider linear parsing strategies, which add one nonterminal at a time. We show that for a given input permutation, the problems of finding the linear parsing strategy with the minimum space and time complexity are both NP-hard.",
    "creator" : "LaTeX with hyperref package"
  }
}