{
  "name" : "1401.1486.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Design & Development of the Graphical User Interface for Sindhi Language",
    "authors" : [ ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : null,
      "text" : "Key Words: Sindhi Computing, GUISL, Sindhi GUI, Sindhi script, Localization, Unicode.\n* Pro Vice Chancellor, Mirpur Khas Campus, University of Sindh, Jamshoro, ** Assistant Professor, Institute of Information & Communication Technologies, University of Sindh, Jamshoro.\n1. INTRODUCTION\nToday computers play very important role in thedaily life of common people, and it is observedthat the use of computers in countries other than developing ones is substantial in every walk of life. It is a fact that the more the developing countries transform their systems to adapt the use of computers the more progress and development they would achieve and hence would reduce the so called gap of ‘digital divide’. The public use of computers, however, is some how dependent on the support for the regional languages of the countries.\nThere are thousands of languages being spoken throughout the world, and it has been noticed that the English speaking countries have an edge over other nations where English is not as their native language in use of computers. There are many countries which have\nadopted their native language in use of computers and succeeded to cope with computing problems. There are some countries where multiple languages are spoken such as India, Sri Lanka and Pakistan. In Pakistan Urdu, Punjabi, Sindhi, Pashto, Blochi and Siraiki etc. are spoken [1].\nSindhi is the official language of Sindh province of Pakistan and it is also one of the 22 constitutionally recognized languages of India. Sindhi is spoken by an estimated 34.4 million people in Pakistan (3rd most spoken language) and about 2.8 million people in India (majority of them being those who migrated from Sindh to India in the wave of the partition of the subcontinent in 1947). During and after the partition of the subcontinent many Sindhi families (both Hindu and Muslims) also moved abroad for permanent settlement in many countries across\nMEHRAN UNIVERSITY RESEARCH JOURNAL OF ENGINEERING & TECHNOLOGY, VOLUME 30, NO. 4, OCTOBER, 2011 [ISSN 0254-7821] 663\n664 MEHRAN UNIVERSITY RESEARCH JOURNAL OF ENGINEERING & TECHNOLOGY, VOLUME 30, NO. 4, OCTOBER, 2011 [ISSN 0254-7821]\nthe globe; thus forming a significant community of Sindhi diasporas [2].\nSindhi language is classified as an Indo-Aryan language belonging to Indo-Iranian branch of the Indo-European language family. Though the original script of Sindhi language found in the remnants of Mohen-jo-Daro (illustrator of some 5000 bc Indus valley civilization) has yet not been interpreted, the preliminary system of writing appeared before 8th century AD (i.e. before the advent of Islam in Sindh in 711 AD). The contributions of Sufi poets like Shah Abdul Latif Bhitai, Sachal Sarmast and Sami further popularized Sindhi language in literary circles in between 14th and 18th century [3]. Since this time, the literature in Sindhi language has grown significantly and currently Sindhi is being used as medium of instruction in Sindhi majority public sector schools of province of Sindh from primary to secondary level (matriculation). Dozens of daily Sindhi newspapers are being published along with several dedicated Sindhi TV channels. Besides this Sindhi is also one of the two languages used by Government of Pakistan to issue computerized national identity cards to its citizens.\nThough the proper use of Sindhi language in all of the above mentioned spheres requires its proper adaptation and progress in terms of modern computer based standards and models; however, too little work has yet been done for the standardization of Sindhi computing as well as development of computer based models of Sindhi script, speech and language [4]. The major issues in Sindhi computing as investigated and observed are due to the following reasons:\n(i) No localized Sindhi Software available.\n(ii) Non-availability of compatible Sindhi fonts for different operating systems with standard Unicode format.\n(iii) Complex process of enabling Sindhi through “Regional and Language Settings”.\n(iv) Non-compatibility of Sindhi keyboard layout for different operating systems.\n(v) Lack of computer literature and books in Sindhi.\n(vi) No educational programs in Sindhi Computing at School and College levels.\n(vii) Research activities at infancy in Sindhi computing.\n(viii) Communication and coordination gap among researchers and professionals etc.\nAs far as we know, so far, neither the provincial government of Sindh nor the federal government of Pakistan has initiated any significant project to fund the research on Sindhi language processing. Not only this but the complete failure of the government to control copy right system and eliminate the use of pirated software has also contributed to the lack of willingness of developers to commit any resources for the research and development of Sindhi language. As a result of this there are only a few legacy tools being used for Sindhi desktop publishing which vary from one publisher/individual to another publisher/individual. Almost all of these tools adapt English-based word processing systems and make use of their specific code pages (mostly based on ASCII scheme) for Sindhi character set. To the best of our knowledge, the development of a Sindhi-based GUI for the processing of Sindhi language has not yet been reported. This paper takes a step towards this aim and presents the design and development of a GUI for SL (Sindhi Language). The rest of the paper is organized as follows: Section 2 presents the background and motivation along with a thorough discussion of the major issues in terms of Sindhi computing and also in terms of the design of the GUISL; Section 3 presents the design and development of the GUISL and finally Section 4 concludes the paper with added description of the future work.\nMEHRAN UNIVERSITY RESEARCH JOURNAL OF ENGINEERING & TECHNOLOGY, VOLUME 30, NO. 4, OCTOBER, 2011 [ISSN 0254-7821] 665"
    }, {
      "heading" : "2. GUISL: DESIGN ISSUES",
      "text" : "Historically, Sindhi language has adopted a variety of writing systems based on the innovations and preferences of particular regional communities. Most of the names of the ancient scripts are either based on the names of the cities/towns (e.g., Khudabadi, Thattai, etc.) or the names of the communities (e.g. Memonki, Luhaniki, Khojiki, Devnagri, Gurmukhi, Perso-Arabic etc.) [8]. During the colonial period, owing to the Sansakrit related nature of Sindhi, some British scholars advocated for the promotion of Devnagri script to be used for Sindhi. To this aim they managed to publish the translation of Bible and SindhiEnglish dictionary using Devnagri script in 1849- 1850 [10]. This move was opposed by some government employees who were only familiar with Perso-Arabic script and their side was backed by some British officials including Captain Sir Richard Francis Burton. The matter got referred to the Court of Directors of the British East India Company.\nBased on the fact that the Muslim names were not properly written with Devnagri, the use of the Perso-Arabic script was recommended by the court. Following this decision, a team of scholars including Sir Burton, Munshi Thanwardas and Mirza Sadiq Ali Beg worked on the standardization of Perso-Arabic based script for Sindhi language. The standardization of this script was completed in 1852 and it consisted of 52 letters derived from PersoArabic scripts with addition of dots and lines to fully represent all of the Sindhi sounds. This script is currently being used in Sindh and abroad and is based on Arabic Nashk style of writing [6,10-11]. Figs. 1-2 show the list of these characters.\nShort vowels and some additional vocalic and consonantal features are also represented through diacritical (Zeer, Zaber, Peush, etc.) marks in Sindhi [3,8] as listed in Fig. 3. The diacritics (also known as aerab) are optionally used in writing, however, for our system development they have not been used for the sake of simplicity and readability.\nThus, the design of GUISL involves numerous key factors that need to be addressed for designing the interface. Sindhi is written and read from right-to-left direction, therefore the system should have the ability to display text from right-to-left and everything of GUI (toolbar, status bar, writing direction, menus, tool tips, popup menus etc.) should be presented from right-to- left for accommodating the Sindhi users.\nAccording to the Unicode standard the characters should be inserted and stored in a simple logical sequence [5]. If we wish to write the word (Sindhi), the keys would be pressed in succession corresponding to the characters making up the word (Sindhi). The text file would store the Unicode codes of these characters in order as shown below.\nTo display the text in an appropriate order of Sindhi the system needs to correspond to each of the successive\n666 MEHRAN UNIVERSITY RESEARCH JOURNAL OF ENGINEERING & TECHNOLOGY, VOLUME 30, NO. 4, OCTOBER, 2011 [ISSN 0254-7821]\ncode to be displayed in the right-to-left order however it would be displayed into left-to-right as shown below. This is what happens with Roman Script making it straight forward and simple to render [4-5,11].\nThus it needs reordering or grouping with one-to-many relationship between characters. As Sindhi language is a cursive like Arabic in its written format [6] the above text is unacceptable as neither the ordering is correct nor the shapes of the characters as per cursive nature of the script.\nThe system should be able to display Sindhi character properly with its cursive forms while ligature used to form Sindhi words. The development of the GUISL should provide easy access for ordinary user and without any additional requirements such as Sindhi Fonts, Keyboard Layout setup, Regional Language Setting etc. These design issues pose impediments in the development of the Sindhi software system."
    }, {
      "heading" : "3. Design & development of the GUISL",
      "text" : "Three major issues are analyzed to design and standardize the Sindhi user interface: Unicode of characters, keyboard layout, and Sindhi cursive form. Unfortunately, there is no ordering (sorting) of Sindhi Unicode characters in the Unicode plane and all the characters are scattered and mixed with Arabic and Farsi character set as shown in Fig. 4 (Sindhi characters are circled highlighting their positions in the plane). The absence of a sequence and segregated set of character coding leads to develop adhoc based systems for process of Sindhi computing. The first step involves changing the orientation of all the GUI elements (toolbar, status bar, writing direction, menus, tool tips, popup menus etc.) in system from right-to-left allowing the initial, middle and last representations of the characters to be rendered appropriately with proper cursive for the ligature to form the word [9]."
    }, {
      "heading" : "3.1 Unicode Based Sindhi Characters Coding",
      "text" : "A static class was created in Java language, declaring all the Unicode based Sindhi characters to be used in GUISL as shown in pseudo-code given in the Algorithm1. The list of characters along with their variable names mapped with Unicode of each character is shown in Table 1."
    }, {
      "heading" : "3.2 Sindhi Cursive Form",
      "text" : "Sindhi script has a cursive form similar to that in Arabic, that is, the letters in the Sindhi script join together into units to form words. Sindhi script also has context sensitive glyph shaping; depending on whether the character joins a word in the initial, medial or final position or is isolated taking a different shape as shown in Table 2. Nonetheless, cursiveness, ligation and context sensitivity are rendering related issues and the output shapes of characters may\nFIG. 4. ARABIC/SINDHI UNICODE PLANE: THE ANNOTATION OF CIRCLES INDICATES THE RELATIVE POSITION OF SINDHI ALPHABET CHARACTERS IN THE PLANE (FOR CLARITY OF UNICDE VALUES PLEASE REFER TO TABLE 1). (SOURCE: HTTP://WWW.UNICODE.ORG/ CHARTS/)\nMEHRAN UNIVERSITY RESEARCH JOURNAL OF ENGINEERING & TECHNOLOGY, VOLUME 30, NO. 4, OCTOBER, 2011 [ISSN 0254-7821] 667\nVariable Unicode Sindhi Veriable Unicode Sindhi Name Letter Name Letter\nsheen 0634 alifMadA 0622\nswad 0635 alif 0627\ndad 0636 beh 0628\ntoye 0637 beeh 067B\nzoye 0638 peh 067E\naieen 0639 beheh 0680\nghain 063A the 062A\nfeh 0641 theh 067F\npeheh 06A6 mytheey 067D\nqaf 0642 tteheh 067A\nKaf 06AA ttay 062B\nkeheh 06A9 jeem 062C\ngaf 06AF dyeh 0684\ngeuh 06B3 nyeh 0683\nngoeh 06B1 cheh 0686\nlam 0644 cheheh 0687\nmeem 0645 hah 062D\nnoon 0646 khay 062E\nrnoon 06BB dal 062F\nwaw 0648 dahal 068C\nheh 06BE dhal 068F\nhamza 0621 ddal 068A\nYeh 064A ddahal 068D\nyehSmall 06C1 zal 0630\nyehHamza 0626 reh 0631\nMin 06FE rdeh 0699\nsindhi Ampersand 06FD zeh 0632\nsceen 0633\nAlgorithm 1: Pseudo code of the static class used for the declaration of Sindhi characters and initialized with their corresponding Unicode characters.\n1: <package> <guisl.com.snd>\n2: <public><static><class><class.name>\n3: <public><static><data type: char><variable.name:alif> = <value: ‘\\u0627’>\n4: <public><static><data type: char><variable.name:beh> = <value: ‘\\u0628’>\n5: <public><static><data type: char><variable.name:beeh> = <value: ‘\\u067B’>\n6: <public><static><data type: char><variable.name:peh> = <value: ‘\\u067E’>\n7: <public><static><data type: char><variable.name:beheh> = <value: ‘\\u0680’>\n8: <public><static><data type: char><variable.name:the> = <value: ‘\\u062A’>\n9: <public><static><data type: char><variable.name:theh> = <value: ‘\\u067F’>\n10: <public><static><data type: char><variable.name:ttay> = <value: ‘\\u062B’>\n. . .\n. . .\n. . .\n. . .\nn: <end of class>\nTABLE 2. MULTIPLE GLYPH FORM OF SINDHI CHARACTERS\nSindhi Isolated Last Medial Initial Unicode Name Glyph Glyph Glyph Glyph\nForm Form Form Form Form\nU+0628 BEG\nU+0646 NOON\nU+064A YEH\nU+062D HAH\nU+0633 SEEN\nU+0635 SAD\nU+0637 TAH\n668 MEHRAN UNIVERSITY RESEARCH JOURNAL OF ENGINEERING & TECHNOLOGY, VOLUME 30, NO. 4, OCTOBER, 2011 [ISSN 0254-7821]\nThe Pseudo code shown in Algorithms 2-3 illustrates the main steps performed on each GUI object for displaying Sindhi text from example 1 and 2 respectively. Each Sindhi character is mapped to a corresponding static variable (Table 1) which is then concatenated with each other to form a Sindhi word as illustrated in examples 1 and 2 below:\nSindhi cursive form: {Sindhi}\nIndiviual Characters {s: Seen} {n : Noon} {dh: Dhal} {y: Yeh} Example 1: Sindhi Word to be formed from the variable joining\nThe Algorithm-3 illustrates the Pseudo.code to create a Sindhi String with multiple words being concatenated to form a statement. First each word is concatenated separately and assigned to variable and then all the variables are concatenated to create a complete statement."
    }, {
      "heading" : "3.3 GUI in Sindhi Language",
      "text" : "Using the variable joining method described in previous section Sindhi GUI architecture was designed as shown in Fig. 5. The system architecture contains the basic GUI elements grouped under the relevant menu. The main menu groups are written in both English and Sindhi script for ease of understanding.\nFig. 6(a-e) demonstrate the various user interface menus with Sindhi script developed for the GUISL. The Menus have been designed with Tab-Based layout instead of conventional Drop-Down menus. The File Menu shown in Fig. 6(a) contains the basic tools regarding the input output operations such as (New File), (Open File), (Save File), etc.\nThe Fig. 6(b) shows the (Edit) menu which contains the tools regarding the basic editing options such as (Undo), (Redo), (Find), etc. Similarly the (Dictionary) menu shown in Fig. 6(c) contains the options for loading various dictionary types such as Sindhi to English Dictionary, English to Sindhi Dictionary, Computer, Medical and Business Sindhi Dictionaries.\nFig. 6(d) contains the on-screen Sindhi keyboard for visual typing using mouse. Two keyboard types have been used in the GUISL system, one with sequential Sindhi keys as shown in Fig. 6(d) and the other is the on-screen Sindhi keyboard layout as shown in Fig. 6(e)."
    }, {
      "heading" : "3.5 User Convenience",
      "text" : "In the GUISL the tooltips have also been written in SindhiEnglish format so that the user may get the information on a particular tool both in Sindhi and in English. Fig. 7(a-c)\nAlgorithm 2. Pseudo code of the function used for the mapping of the Sindhi character from example 1 with its corresponding Unicode (from Table 1), concatenated with each other to form a Sindhi ligature. 1: <function> <function.name> 2: <variable>= String. concatenate( 3: \"\"+<variable: sceen> + <variable:noon> + <variable:dahal> + <variable:yeh>) 4: <GUI Object> {Change Orientation to RIGHT.TO.LEFT} 5: <GUI Object>.setText(<variable>) 6: <end of function>\nSindhi cursive form:\n{Unicode Based Sindhi Word Processor}\nExample 2: Sindhi Word to be formed from the variable joining\nAlgorithm 3. Pseudo code of the function used for the mapping of the Sindhi string from example 2 with its corresponding Unicode (from table 1), concatenated with each other to form a Sindhi statement. 1: <function> <function.name> 2: <variable 1>= String. concatenate(\"\"+<variable:yeh>+ <variable:waw>+<variable:noon> 3: +<variable:yeh>+<variable:kaf>+<variable:waw>+ <variable:ddal>) 4: <variable 2>= String. concatenate(\"\"+ <variable:the>+ <variable:hah> + <variable:the>) 5: <variable 3>= String. concatenate(\"\" 6: +<variable:sceen>+<variable:noon>+<variable:dahal>+ <variable:yeh>) 7: <variable4>= String. concatenate( \"\"+ <variable:lam>+<variable:feh> 8: +<variable:zoye>+<variable:noon>) 9: 10: <variable 5>= String. concatenate(\"\"+ <variable:jeem>+ <variable:waw>+\" \" + <variable:khay> 11: +<variable:toye>+<variable:alif>+<variable:toye>) 12: <variable 6>= String. concatenate( \"\"+<variable 1> + <variable 2> + <variable 3> + 13: + <variable 4> +\" \"+ <variable 5>) 14: <GUI Object> {Change Orientation to RIGHT.TO.LEFT} 15: 16: <GUI Object>.setText(<variable 6>) 17: <end of function>\nMEHRAN UNIVERSITY RESEARCH JOURNAL OF ENGINEERING & TECHNOLOGY, VOLUME 30, NO. 4, OCTOBER, 2011 [ISSN 0254-7821] 669\nFIG. 5. THE MAIN ARCHITECTURE OF THE GUI IN SINDHI\nFIG. 6(A). FILE MENU\nFIG. 6(B). EDIT MEMU\nFIG. 6(C). DICTIONARY MENU\n670 MEHRAN UNIVERSITY RESEARCH JOURNAL OF ENGINEERING & TECHNOLOGY, VOLUME 30, NO. 4, OCTOBER, 2011 [ISSN 0254-7821]\nshows the various tooltips in Sindhi-English format. The bi-directional text right-to-left for Sindhi and left-to- right for English is used. The same method of concatenating Unicode variables from Table 1 to English words have been used to display the text. Fig. 7(a) shows the tooltip for the ‘Save File’. Similarly Fig. 7(b) displays the tooltip regarding the different dictionary types.\nThe Fig. 7(c) displays the tooltip for the ‘Undo’, ‘Redo’ and ‘Exit’ options."
    }, {
      "heading" : "3.6 Message and Tool Windows",
      "text" : "All the pop-up message and tool windows in the system contain the text in both Sindhi and English language as shown in Fig. 8(a-b). Fig. 8(a) shows the message window that appears before closing the file asking to save the changes both in Sindhi and English.\nFig. 8(b) displays the ‘Find and Replace’ tool Window have Sindhi-English text in the title bar of the window and in the tabs of Find and Replace options.\nFig. 8(c) shown below is for the task pane that displays the various tools and tasks in the system with Sindhi text on its labels and buttons."
    }, {
      "heading" : "4. CONCLUSIONS & FUTURE DIRECTIONS",
      "text" : "This paper has concentrated on the issue of designing and development of a GUISL. Various characteristics and issues affecting the use of Sindhi in computing have been discussed such as changing the orientation of the text from right-to-left, ordering/sorting of Sindhi Unicode characters and proper cursiveness for the ligation of words. After successful implementation of the algorithms\nFIG. 6(D). ON-SCREEN SINDHI SEQUENTIAL KEYBOARD\nFIG. 6(E). ON.SCREEN SINDHI KEYBOARD\ndiscussed, the GUI of any application can be defined in Sindhi language. The issues and methods discussed can also be applied on other languages that are written in Perso-Arabic script.\nThis work is targeted at the provision of a generic programming framework for the development of Sindhi language based applications. Based on the present work we are now in the process of the development of a platform independent Sindhi word processor that includes localised (in Sindhi) supporting tools such as dictionaries, translation/transliteration, spell-checker, calendar and calculators."
    }, {
      "heading" : "ACKNOWLEDGEMENTS",
      "text" : "Authors are indebted to acknowledge the valuable suggestions of the anonymous reviewers which helped in\nMEHRAN UNIVERSITY RESEARCH JOURNAL OF ENGINEERING & TECHNOLOGY, VOLUME 30, NO. 4, OCTOBER, 2011 [ISSN 0254-7821] 671\nfurther improving the readability of this article. The constructive discussion with officials of SLA (Sindhi Language Authority), regarding the use of proper technical Sindhi words is also highly appreciated and acknowledged."
    } ],
    "references" : [ {
      "title" : "An Introduction to Sindhi Literature",
      "author" : [ "G.A. Allana" ],
      "venue" : "Sindhi Adabi Board, Jamshoro, Pakistan,",
      "citeRegEx" : "1",
      "shortCiteRegEx" : "1",
      "year" : 1991
    }, {
      "title" : "Revised by Joyo, M.I., Sindhi Language Authority, Hyderabad, Pakistan",
      "author" : [ "D. Bulchand" ],
      "venue" : "“A Manual of Sindhi”,",
      "citeRegEx" : "3",
      "shortCiteRegEx" : "3",
      "year" : 1901
    }, {
      "title" : "Enabling Pakistani Languages through Unicode”, Retrieved from http://download",
      "author" : [ "A.M. Bhurgari" ],
      "venue" : "microsoft. com/download/1/4/2/142aef9 f-1a74-4a24-b1f4-782 d48d41a6d/PakLang.pdf on 20th August,",
      "citeRegEx" : "4",
      "shortCiteRegEx" : "4",
      "year" : 2010
    }, {
      "title" : "The Adaptation of the Perso-Arabic Script for Urdu, Panjabi, and Sindhi",
      "author" : [ "A. Parvez" ],
      "venue" : "LCCN Permalink,",
      "citeRegEx" : "6",
      "shortCiteRegEx" : "6",
      "year" : 1996
    }, {
      "title" : "An Arabic Programming Environment",
      "author" : [ "A.S. Al-Salman" ],
      "venue" : "ACM Symposium on Applied Computing,",
      "citeRegEx" : "9",
      "shortCiteRegEx" : "9",
      "year" : 1996
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "are spoken [1].",
      "startOffset" : 11,
      "endOffset" : 14
    }, {
      "referenceID" : 1,
      "context" : "The contributions of Sufi poets like Shah Abdul Latif Bhitai, Sachal Sarmast and Sami further popularized Sindhi language in literary circles in between 14th and 18th century [3].",
      "startOffset" : 175,
      "endOffset" : 178
    }, {
      "referenceID" : 2,
      "context" : "Though the proper use of Sindhi language in all of the above mentioned spheres requires its proper adaptation and progress in terms of modern computer based standards and models; however, too little work has yet been done for the standardization of Sindhi computing as well as development of computer based models of Sindhi script, speech and language [4].",
      "startOffset" : 352,
      "endOffset" : 355
    }, {
      "referenceID" : 3,
      "context" : "This script is currently being used in Sindh and abroad and is based on Arabic Nashk style of writing [6,10-11].",
      "startOffset" : 102,
      "endOffset" : 111
    }, {
      "referenceID" : 1,
      "context" : ") marks in Sindhi [3,8] as listed in Fig.",
      "startOffset" : 18,
      "endOffset" : 23
    }, {
      "referenceID" : 2,
      "context" : "This is what happens with Roman Script making it straight forward and simple to render [4-5,11].",
      "startOffset" : 87,
      "endOffset" : 95
    }, {
      "referenceID" : 3,
      "context" : "As Sindhi language is a cursive like Arabic in its written format [6] the above text is unacceptable as neither the ordering is correct nor the shapes of the characters as per cursive nature of the script.",
      "startOffset" : 66,
      "endOffset" : 69
    }, {
      "referenceID" : 4,
      "context" : ") in system from right-to-left allowing the initial, middle and last representations of the characters to be rendered appropriately with proper cursive for the ligature to form the word [9].",
      "startOffset" : 186,
      "endOffset" : 189
    } ],
    "year" : 2011,
    "abstractText" : "This paper describes the design and implementation of a Unicode-based GUISL (Graphical User Interface for Sindhi Language). The idea is to provide a software platform to the people of Sindh as well as Sindhi diasporas living across the globe to make use of computing for basic tasks such as editing, composition, formatting, and printing of documents in Sindhi by using GUISL. The implementation of the GUISL has been done in the Java technology to make the system platform independent. The paper describes several design issues of Sindhi GUI in the context of existing software tools and technologies and explains how mapping and concatenation techniques have been employed to achieve the cursive shape of Sindhi script.",
    "creator" : "Adobe PageMaker 7.0"
  }
}