{
  "name" : "1402.6764.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "MAPPING: AN EXPLORATORY STUDY",
    "authors" : [ "Hazlina Haron", "Abdul Azim", "Abd. Ghani" ],
    "emails" : [ "delinn1612@yahoo.com", "zlina1108@uum.edu.my", "azim@fsktm.upm.edu.my" ],
    "sections" : [ {
      "heading" : null,
      "text" : "We describe here a methodology to identify a list of ambiguous Malay words that are commonly being used in Malay documentations such as Requirement Specification. We compiled several relevant and appropriate requirement quality attributes and sentence rules from previous literatures and adopt it to come out with a set of ambiguity attributes that most suit Malay words. The extracted Malay ambiguous words (potential) are then being mapped onto the constructed ambiguity attributes to confirm their vagueness. The list is then verified by Malay linguist experts. This paper aims to identify a list of potential ambiguous words in Malay as an attempt to assist writers to avoid using the vague words while documenting Malay Requirement Specification as well as to any other related Malay documentation. The result of this study is a list of 120 potential ambiguous Malay words that could act as guidelines in writing Malay sentences.\nKEYWORDS\nVagueness, Requirement Quality Attributes, Natural Language Processing, Malay Ambiguity, Ambiguity"
    }, {
      "heading" : "1. INTRODUCTION",
      "text" : "Requirement Specification is a document that acts as a medium between system developer and users. Users specified their systems’ functional needs in a technical documentation. The specification would then be referred by system analysts in the process of developing the requested system. Requirement Specification usually uses natural language, due to its’ flexibility and easy to understand. However, natural language has its own disadvantages such as, tendencies to be prone to ambiguity and misinterpretation. It is often being misunderstood by people from various backgrounds and different levels of knowledge.\nA requirement is said to be ambiguous when a same statement is being interpreted differently by different sets of people. A specification is affected by textual ambiguity when it provokes more than one way of reading a statement. Example, “the customer enters a card and a numeric\npersonal code. If it is not valid then the ATM rejects the card”. It is ambiguous because the word “it” could refer to two distinct objects. It could refer to either a card or a numeric personal code [1]. Words can be ambiguous in many ways. Linguistic ambiguity can be categorized into several main groups such as semantic, syntactic, pragmatic and lexical [2]. This has been agreed upon and then being enhanced into other types of ambiguity such as coordination ambiguity [3] and anaphoric ambiguity [4], [5].\nOne of the main reasons for ambiguity is the use of vague words. Words that are being used are not clear and usually lead to more than one meaning. Vagueness can be termed as not clearly expressed, imprecise, ill-defined and lacked expressions [6] . Vagueness shows a boundary of a word’s meaning that is not clearly stated [7]. The usage of vague words reduces the level of clarity in a sentence. Vagueness can also be defined as ignorance and absence of knowledge [8]. A vague word can also be defined as a word that has multiple equally good possible candidates of the meaning. When a sentence reaches the ‘borderline case’ of truth which is neither true nor false, it is considered vague [9]. Malay words such as ‘maksimum’, ‘automatik’, ‘segera’, ‘secepat mungkin’, ‘pantas’, ‘efisien’, ‘produktif’, ‘anggaran’, ‘kerap’ are some of the adjectives considered vague. These words lead to uncertainty and multiple of interpretations and therefore, should be avoided.\nFigure 1 below depicts a conceptual view of Malay ambiguity and its’ related elements gathered from open-interviews with Malay linguist experts.\nAmbiguity\nLexical\nSyntactic\nContext\nDomain Knowledge\nSingle interpreted text\nLogical Forms\nWords that have more than one meaning\nGrammatical relations, word sense\nUsage of stop words (prepositions, conjunctions, symbols, etc) Sentence that have more than one interpretations in one same sentence by different readers\nSemantic relation\nSentence Interpretation\nFigure 1: Conceptual view of Malay Ambiguity"
    }, {
      "heading" : "2. RELATED WORK",
      "text" : "Although various researches have focused on disambiguation techniques, not many highlighted how these ambiguous words originated. In addition, most previous researches focused on the English language. Due to limitation in scope, it is quite difficult to refer and construct Malay ambiguous words. Hence, this research is adopting the methods used in English and other languages’ methods to suit our area of research."
    }, {
      "heading" : "2.1. Vagueness Vs Ambiguity Issues",
      "text" : "A sentence must have a unique meaning in order to reflect one’s perspective accurately. A sentence containing a vague word, would fail to impart its intended meaning. Vagueness is one of the many sources of ambiguity. For example, “Five piled stones are a heap” [10]. One can consider five piles of stones are a heap, while another might disagree with the statement as he/she may say ten piled stones are then a heap. Vagueness can impact ambiguity that lead to uncertainty and multiple interpretations (refer Figure 2). Vagueness and uncertainty are being distinguished, however, it correlates with one another [9]. They are complimentary but not parallel. Vagueness has a close similarity as semantic indeterminacy or it is termed as ‘semantic nihilism’ [10]. Therefore, many research concluded that to resolve vagueness, context involvement is necessary [8]. Context is crucial to ensure interpretation is unique in a sentence. [9] Vague can be assigned with different semantic value based on different possible situations, and each of the semantic values is called presification. Vague words leads to imprecise meaning, therefore it triggers ambiguity in a sentence. To disambiguate, we have to go back to its’ roots of causal, by eliminating the vague words itself before any ambiguity can be detected."
    }, {
      "heading" : "2.2. Criterion of Ambiguous Words",
      "text" : "A dictionary of 100 ambiguous Arab words that has been developed, takes into consideration more than 10 word senses as the criteria [11]. These senses were extracted from the Arab dictionary. Chantree et al. extracted ambiguous sentences indicate coordination ambiguity and developed ambiguity threshold to set the ambiguity benchmark [12]. Amongst the factors involved in making sure readers understand what a sentence means are sentence length, ambiguous adjectives, adverbs and passive verbs [13]. A list of high potential English ambiguous words has been constructed in an Ambiguity Technical Report as a guideline to avoid ambiguous sentence [14]. Tjong et al. developed rules for clearer sentences in an attempt to avoid ambiguities[15]. These research proof that to begin an investigation to disambiguate an ambiguous sentence, one has to start by determining and identifying the vague words. These vague words could bring misconception and misinterpretation to the readers. As for the writers, they usually are not aware that they are even writing an ambiguous sentence in the first place.\nThrough previous literatures as guidelines, we have tabled out a criterion of potentially ambiguous words that acts as guidelines to extract the poor words as in Table 1.\nattributes: implicit, word class, weakness, temporal, referential and general specific variable.\nWeakness – anggaran Temporal – bulanan Referential – sebelum, begini General specific variable – data itu"
    }, {
      "heading" : "3. PROPOSED METHODOLOGY",
      "text" : "We believed that to minimize and manage ambiguity, one has to go to the root cause. In this case, tracking and identifying the potential vague and ambiguous words are necessary before the process of ambiguity detection can take place. Hence, this strategy will be the first stage from overall of the research work."
    }, {
      "heading" : "3.1. Ambiguity Attributes",
      "text" : "Table 2 below shows the structure of our proposed Ambiguity Attributes in an attempt to create a list of high potential ambiguous Malay words. These attributes are compiled based on several relevant quality attributes from previous literatures. It consists of six attributes most suitable with Malay words. The ambiguous Malay words are extracted based on these attributes from working RS and some have been translated from English using Dwibahasa Kamus Oxford Fajar [16]. Some of the word class attribute’s words were extracted from Kamus Komprehensif Bahasa Melayu [17] for their part of speech (POS)."
    }, {
      "heading" : "3.1. Process of creating Malay Ambiguous Lexicons",
      "text" : "Step 1: We collected samples of Malay Requirement Specifications from companies as our source of training data. Potentially ambiguous words were extracted from the sentences based on criterion as in Table 1.\nFrom literatures, we constructed six ambiguity attributes that are at most relevant and appropriate with our scope (refer Table 2). Based on these attributes, we mapped the extracted potential Malay ambiguous words with the ambiguity attributes to confirm characteristics of vagueness. By filtering using the above criteria, the list of words considered potentially ambiguous are also referred to as ambiguous candidates. They are kept in a repository to be further analysed using contextual-based detection technique.\nStep 3: The identified potentially ambiguous Malay words will undergo a verification process to ensure genuine ambiguity. The verification is expected to be done by Malay linguist experts.\nStep 4: The verified words are stored in a database for the next phase of activities."
    }, {
      "heading" : "4. DISCUSSION",
      "text" : "We have managed to collect 13 sets of Malay language Requirement Specifications from two domains; medical system and student information system. From these sources, a total of 2900 have been words eliminated. Examples of inappropriate words are such as English loanwords, words in short forms, double words such as ‘rekod-rekod’, ‘kata nama khas (KNK)’ and symbols such as full stops and other symbols. We then managed to extract 120 potentially ambiguous Malay words. Table 3 below is the statistics of the words’ mapping onto their appropriate Ambiguity Attributes.\nFrom the statistic generated, the highest percentage of potential ambiguous Malay words falls under ‘Implicit’ category followed by ‘Connectives’ category and ‘Referential’. The articulated data shows that potentially ambiguous Malay words most used are very generic, has a vague boundary, too subjective and reflects an unquantifiable criterion. These are the normal reason that triggers ambiguity. The list of ambiguous words is currently undergoing a verification process by Malay linguist experts. Two experts with the relevant background and expertise of\nthe domain were selected from Faculty of Communication and Malay Language (FKBM), Universiti Putra Malaysia (UPM)."
    }, {
      "heading" : "5. CONCLUSION",
      "text" : "In system requirement, linguistic ambiguity is often ignored or mistakenly unacknowledged. This leads to misunderstanding from both users and system developer’s side, thereby contributing towards a failed system. The after effect of the situation could jeopardize system development cycle and project’s time limitation as well as budgets. The Malay requirement specification environment still lacks in research that focussed on this situation. We have presented here a method to identify potential ambiguous Malay words and managed to construct a list of 120 potential commonly used ambiguous Malay words in a Malay requirement specification. This study is an attempt to assist writers to avoid using the high potential ambiguous words and promote greater clarity in sentence construction of documentation and significantly reduce misinterpretation by readers."
    }, {
      "heading" : "ACKNOWLEDGEMENTS",
      "text" : "We would like to thank the Malay Linguist Experts from UPM, UM and UKM for their support and helpful comments. This work is supported and funded by PhD scholarship from Universiti Utara Malaysia and Universiti Putra Malaysia."
    } ],
    "references" : [ {
      "title" : "Taming Ambiguity in Natural Language Requirements",
      "author" : [ "E. Kamsties", "B. Paech" ],
      "venue" : "International Conference on System and Software Engineering and their Applications, 2000, pp. 1– 8.",
      "citeRegEx" : "1",
      "shortCiteRegEx" : null,
      "year" : 2000
    }, {
      "title" : "Ambiguity in Natural Language Requirements Document",
      "author" : [ "D.M. Berry" ],
      "venue" : "Monterey Workshop 2007. 2007.",
      "citeRegEx" : "2",
      "shortCiteRegEx" : null,
      "year" : 2007
    }, {
      "title" : "Nocuous Ambiguities in Requirement Specifications",
      "author" : [ "F.J. Chantree", "B. Nuseibeh", "A. De Roeck", "A. Willis", "F. of M.", "C. Department of Computing" ],
      "venue" : "The Open University, UK, 2005.",
      "citeRegEx" : "3",
      "shortCiteRegEx" : null,
      "year" : 2005
    }, {
      "title" : "Anaphora Resolution of Malay Text: Issues and Proposed Solution Model",
      "author" : [ "N.K.M. Noor", "S.A. Noah", "M.J.A. Aziz", "M.P. Hamzah" ],
      "venue" : "2010 Int. Conf. Asian Lang. Process., pp. 174–177, Dec. 2010.",
      "citeRegEx" : "4",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "nya ’ as anaphoric word : A proposed solution",
      "author" : [ "N.K.M. N", "M.J. Abd", "S. Azman", "M. Noah" ],
      "venue" : "no. June, pp. 249–254, 2011.",
      "citeRegEx" : "5",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "vague",
      "author" : [ "Merriam-Webster.com" ],
      "venue" : "http://www.merriam-webster.com. 2012.",
      "citeRegEx" : "6",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "A Model of Ambiguity and Vagueness in Clinical Practice Guideline Recommendations",
      "author" : [ "R.N. Shiffman" ],
      "venue" : "AMIA 2005 Symposium Proceedings , 2005.",
      "citeRegEx" : "7",
      "shortCiteRegEx" : null,
      "year" : 2005
    }, {
      "title" : "An Analysis of the Pragmatic Functions of Vague Language in Ekegusii",
      "author" : [ "M. Michieka" ],
      "venue" : "J. Lang. Technol. Entrep. Africa, vol. 3, no. 2, 2012.",
      "citeRegEx" : "8",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Vague, So Untrue",
      "author" : [ "D. Braun", "T. Sider" ],
      "venue" : "NOUS, vol. 2, pp. 133–157, 2007.",
      "citeRegEx" : "10",
      "shortCiteRegEx" : null,
      "year" : 2007
    }, {
      "title" : "Ambiguous Arabic Words Disambiguation",
      "author" : [ "L. Merhbene", "A. Zouaghi", "M. Zrigui" ],
      "venue" : "2010 11th ACIS Int. Conf. Softw. Eng. Artif. Intell. Netw. Parallel/Distributed Comput., pp. 157–164, Jun. 2010.",
      "citeRegEx" : "11",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "Identifying Nocuous Ambiguity in Natural Language Requirements",
      "author" : [ "F.J. Chantree", "A. de Roeck", "B. Nuseibeh", "A. Willis" ],
      "venue" : "The Open University, UK, 2006.  8",
      "citeRegEx" : "12",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Toward a text classification system for the quality assessment of software requirements written in natural language",
      "author" : [ "O. Ormandjieva", "I. Hussain", "L. Kosseim" ],
      "venue" : "Fourth Int. Work. Softw. Qual. Assur. conjunction with 6th ESEC/FSE Jt. Meet. - SOQUA ’07, p. 39, 2007.",
      "citeRegEx" : "13",
      "shortCiteRegEx" : null,
      "year" : 2007
    }, {
      "title" : "The Ambiguity Review Process.",
      "author" : [ "R. Bender" ],
      "venue" : "Bender RBT Inc.,",
      "citeRegEx" : "14",
      "shortCiteRegEx" : "14",
      "year" : 2003
    }, {
      "title" : "Extended Disambiguation Rules for Requirements Specifications",
      "author" : [ "S.F. Tjong", "M. Hartley", "D.M. Berry" ],
      "venue" : "2007.",
      "citeRegEx" : "15",
      "shortCiteRegEx" : null,
      "year" : 2007
    }, {
      "title" : "Kamus Dwibahasa Oxford Fajar",
      "author" : [ "J.M. Hawkins" ],
      "venue" : "Kamus Dwibahasa Oxford Fajar. Oxford Fajar Sdn Bhd, 2007.",
      "citeRegEx" : "16",
      "shortCiteRegEx" : null,
      "year" : 2007
    }, {
      "title" : "Kamus Komprehensif Bahasa Melayu",
      "author" : [ "A. Othman" ],
      "venue" : "Kamus Komprehensif Bahasa Melayu. Oxford Fajar Sdn Bhd, 2005.",
      "citeRegEx" : "17",
      "shortCiteRegEx" : null,
      "year" : 2005
    }, {
      "title" : "The Linguistic Approach to the Natural Language Requirements Quality: Benefit of the use of an Automatic Tool",
      "author" : [ "F. Fabbrini", "M.Fusani", "S.Gnesi", "G.Lami" ],
      "venue" : "Software Engineering Workshop, 2001. Proceedings. 26th Annual NASA Goddard , 2001, pp. 95–105.",
      "citeRegEx" : "18",
      "shortCiteRegEx" : null,
      "year" : 2001
    }, {
      "title" : "A Prototype Tool for Improving the Wording of Requirements",
      "author" : [ "J.K.D. Sc", "C. Eng" ],
      "venue" : "12th Annu. Int. Symp. NCOSE 2002, 2002.",
      "citeRegEx" : "19",
      "shortCiteRegEx" : null,
      "year" : 2002
    }, {
      "title" : "Using a Distributional Thesaurus to Resolve Coordination Ambiguities",
      "author" : [ "F.J. Chantree", "A. Kilgarriff", "A. de Roeck", "A. Willis" ],
      "venue" : "Department of Computing, Faculty of Mathematics and Computing, The Open University, UK, 2005.",
      "citeRegEx" : "20",
      "shortCiteRegEx" : null,
      "year" : 2005
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "It could refer to either a card or a numeric personal code [1].",
      "startOffset" : 59,
      "endOffset" : 62
    }, {
      "referenceID" : 1,
      "context" : "Linguistic ambiguity can be categorized into several main groups such as semantic, syntactic, pragmatic and lexical [2].",
      "startOffset" : 116,
      "endOffset" : 119
    }, {
      "referenceID" : 2,
      "context" : "This has been agreed upon and then being enhanced into other types of ambiguity such as coordination ambiguity [3] and anaphoric ambiguity [4], [5].",
      "startOffset" : 111,
      "endOffset" : 114
    }, {
      "referenceID" : 3,
      "context" : "This has been agreed upon and then being enhanced into other types of ambiguity such as coordination ambiguity [3] and anaphoric ambiguity [4], [5].",
      "startOffset" : 139,
      "endOffset" : 142
    }, {
      "referenceID" : 4,
      "context" : "This has been agreed upon and then being enhanced into other types of ambiguity such as coordination ambiguity [3] and anaphoric ambiguity [4], [5].",
      "startOffset" : 144,
      "endOffset" : 147
    }, {
      "referenceID" : 5,
      "context" : "Vagueness can be termed as not clearly expressed, imprecise, ill-defined and lacked expressions [6] .",
      "startOffset" : 96,
      "endOffset" : 99
    }, {
      "referenceID" : 6,
      "context" : "Vagueness shows a boundary of a word’s meaning that is not clearly stated [7].",
      "startOffset" : 74,
      "endOffset" : 77
    }, {
      "referenceID" : 7,
      "context" : "Vagueness can also be defined as ignorance and absence of knowledge [8].",
      "startOffset" : 68,
      "endOffset" : 71
    }, {
      "referenceID" : 8,
      "context" : "For example, “Five piled stones are a heap” [10].",
      "startOffset" : 44,
      "endOffset" : 48
    }, {
      "referenceID" : 8,
      "context" : "Vagueness has a close similarity as semantic indeterminacy or it is termed as ‘semantic nihilism’ [10].",
      "startOffset" : 98,
      "endOffset" : 102
    }, {
      "referenceID" : 7,
      "context" : "Therefore, many research concluded that to resolve vagueness, context involvement is necessary [8].",
      "startOffset" : 95,
      "endOffset" : 98
    }, {
      "referenceID" : 9,
      "context" : "Criterion of Ambiguous Words A dictionary of 100 ambiguous Arab words that has been developed, takes into consideration more than 10 word senses as the criteria [11].",
      "startOffset" : 161,
      "endOffset" : 165
    }, {
      "referenceID" : 10,
      "context" : "extracted ambiguous sentences indicate coordination ambiguity and developed ambiguity threshold to set the ambiguity benchmark [12].",
      "startOffset" : 127,
      "endOffset" : 131
    }, {
      "referenceID" : 11,
      "context" : "Amongst the factors involved in making sure readers understand what a sentence means are sentence length, ambiguous adjectives, adverbs and passive verbs [13].",
      "startOffset" : 154,
      "endOffset" : 158
    }, {
      "referenceID" : 12,
      "context" : "A list of high potential English ambiguous words has been constructed in an Ambiguity Technical Report as a guideline to avoid ambiguous sentence [14].",
      "startOffset" : 146,
      "endOffset" : 150
    }, {
      "referenceID" : 13,
      "context" : "developed rules for clearer sentences in an attempt to avoid ambiguities[15].",
      "startOffset" : 72,
      "endOffset" : 76
    }, {
      "referenceID" : 14,
      "context" : "The ambiguous Malay words are extracted based on these attributes from working RS and some have been translated from English using Dwibahasa Kamus Oxford Fajar [16].",
      "startOffset" : 160,
      "endOffset" : 164
    }, {
      "referenceID" : 15,
      "context" : "Some of the word class attribute’s words were extracted from Kamus Komprehensif Bahasa Melayu [17] for their part of speech (POS).",
      "startOffset" : 94,
      "endOffset" : 98
    }, {
      "referenceID" : 16,
      "context" : "General [18], [14] Subject or object in the sentence is generic rather than specific.",
      "startOffset" : 8,
      "endOffset" : 12
    }, {
      "referenceID" : 12,
      "context" : "General [18], [14] Subject or object in the sentence is generic rather than specific.",
      "startOffset" : 14,
      "endOffset" : 18
    }, {
      "referenceID" : 16,
      "context" : "Subjective [18] Refers to personal opinion or feeling",
      "startOffset" : 11,
      "endOffset" : 15
    }, {
      "referenceID" : 12,
      "context" : "Boundary [14] It has no definite boundary of true or false (or between yes and no).",
      "startOffset" : 9,
      "endOffset" : 13
    }, {
      "referenceID" : 17,
      "context" : "Unquantifiable [19] Non-quantifiable",
      "startOffset" : 15,
      "endOffset" : 19
    }, {
      "referenceID" : 12,
      "context" : "Adjective[14] Word belonging to one of the major form classes in any of numerous languages and typically serving as a modifier of a noun to denote a quality of the thing named, to indicate its quantity or extent, or to specify a thing as distinct from something else",
      "startOffset" : 9,
      "endOffset" : 13
    }, {
      "referenceID" : 12,
      "context" : "Adverb [14] Word belonging to one of the major form classes in any of the numerous languages, typically serving as a modifier of a verb, an adjective, another adverb, a preposition, a phrase, a clause, or a sentence, expressing some relation of manner or quality, place,",
      "startOffset" : 7,
      "endOffset" : 11
    }, {
      "referenceID" : 12,
      "context" : "Verb [14] Word that characteristically is the grammatical centre of a predicate and expresses an act, occurrence, or mode of being, that in various languages is inflected for agreement with the subject, for tense, for voice, for mood, or for aspect, and that typically has rather full descriptive meaning and characterizing quality but is sometimes nearly devoid of these especially when used as an auxiliary or linking verb",
      "startOffset" : 5,
      "endOffset" : 9
    }, {
      "referenceID" : 12,
      "context" : "Dangling Else [14] The requirement has no other exit when one case is not met (Exception case)",
      "startOffset" : 14,
      "endOffset" : 18
    }, {
      "referenceID" : 10,
      "context" : "Preposition [12], [20] Connective words.",
      "startOffset" : 12,
      "endOffset" : 16
    }, {
      "referenceID" : 18,
      "context" : "Preposition [12], [20] Connective words.",
      "startOffset" : 18,
      "endOffset" : 22
    }, {
      "referenceID" : 17,
      "context" : "Temporal [19], [14] Words that has time/duration type that invites multiple interpretation.",
      "startOffset" : 9,
      "endOffset" : 13
    }, {
      "referenceID" : 12,
      "context" : "Temporal [19], [14] Words that has time/duration type that invites multiple interpretation.",
      "startOffset" : 15,
      "endOffset" : 19
    }, {
      "referenceID" : 12,
      "context" : "Referential (REF) [14], [19], [4], [5], [21] Sentence that contains more than one requirement in a sentence.",
      "startOffset" : 18,
      "endOffset" : 22
    }, {
      "referenceID" : 17,
      "context" : "Referential (REF) [14], [19], [4], [5], [21] Sentence that contains more than one requirement in a sentence.",
      "startOffset" : 24,
      "endOffset" : 28
    }, {
      "referenceID" : 3,
      "context" : "Referential (REF) [14], [19], [4], [5], [21] Sentence that contains more than one requirement in a sentence.",
      "startOffset" : 30,
      "endOffset" : 33
    }, {
      "referenceID" : 4,
      "context" : "Referential (REF) [14], [19], [4], [5], [21] Sentence that contains more than one requirement in a sentence.",
      "startOffset" : 35,
      "endOffset" : 38
    }, {
      "referenceID" : 12,
      "context" : "Variable (VAR) [14] Common word that invites vague interpretation and understanding.",
      "startOffset" : 15,
      "endOffset" : 19
    }, {
      "referenceID" : 16,
      "context" : "Weakness (WN) [18] Sentence that contains weak main verb",
      "startOffset" : 14,
      "endOffset" : 18
    } ],
    "year" : 2014,
    "abstractText" : "We describe here a methodology to identify a list of ambiguous Malay words that are commonly being used in Malay documentations such as Requirement Specification. We compiled several relevant and appropriate requirement quality attributes and sentence rules from previous literatures and adopt it to come out with a set of ambiguity attributes that most suit Malay words. The extracted Malay ambiguous words (potential) are then being mapped onto the constructed ambiguity attributes to confirm their vagueness. The list is then verified by Malay linguist experts. This paper aims to identify a list of potential ambiguous words in Malay as an attempt to assist writers to avoid using the vague words while documenting Malay Requirement Specification as well as to any other related Malay documentation. The result of this study is a list of 120 potential ambiguous Malay words that could act as guidelines in writing Malay sentences.",
    "creator" : "Microsoft® Office Word 2007"
  }
}