{
  "name" : "1405.4097.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "A preliminary study of Croatian Language Syllable Networks",
    "authors" : [ "K. Ban", "A. Meštrović" ],
    "emails" : [ "kristina.ban89@gmail.com,", "ivan.ivakic@net.hr,", "amestrovic@inf.uniri.hr" ],
    "sections" : [ {
      "heading" : null,
      "text" : "Croatian syllable networks analysis. Syllable network is a network in which nodes are syllables and links between them are constructed according to their connections within words. In this paper we analyze networks of syllables generated from texts collected from the Croatian Wikipedia and Blogs. As a main tool we use complex network analysis methods which provide mechanisms that can reveal new patterns in a language structure. We aim to show that syllable networks have much higher clustering coefficient in comparison to Erdös-Renyi random networks. The results indicate that Croatian syllable networks exhibit certain properties of a small world networks. Furthermore, we compared Croatian syllable networks with Portuguese and Chinese syllable networks and we showed that they have similar properties.\nI. INTRODUCTION\nNetwork analysis has become significant method in different research areas such as biology, computer science, economics, sociology, medicine and linguistics. Complex networks are a class of networks that exhibit specific topological features, such as high clustering coefficients, small diameters, power-law degree distribution, community structures, one or several giant components, hierarchical structures, etc. Two important classes of complex networks that can be further differentiated are small-world networks [1, 2, 3] with high clustering as a main property and scale-free networks [4, 5] which can be characterized by power-law degree distribution.\nLanguage can be viewed as a complex network if it is presented as a system of interacting units. Network analysis provides mechanisms that can reveal new patterns in a complex structure and can thus be applied to the study of the patterns in language structures. This, in turn, may contribute to a better understanding of the organization and the structure and evolution of a language.\nNetwork properties of written human languages have already been analyzed in different research studies [6]. Networks based on co-occurrence of words in sentences are analyzed in [7, 8, 9]. The topology of human written language, through a network representation of Orwell’s 1984, is presented in [10], while the co-occurrence properties of words in different languages are studied in [11]. All these studies have shown that language networks exhibit properties indicative of small-world networks, e. g. Pemble and Bingol [12] have constructed two complex networks out of Wikipedia English and German corpora and analyze conceptual networks in different languages.\nSo far, syllable networks have been constructed exclusively for Portuguese [13] and Chinese [14]. In both experiments, syllable networks have a large clustering coefficient and power-law degree distribution, as opposed to the Erdös-Renyi (ER) random networks [15], which have low clustering coefficient and Poisson-like degree distribution. In [13] the syllable network is used to demonstrate that language in itself resembles a living organism, evolving in time and space.\nNetwork analysis of the syllables connections in the words may be of theoretical interest in the domain of phonology, morphology and language topology [16]. Analyses of properties of syllable networks can help in determining the phonetic structure of a language, as well as providing necessary grounds for further linguistic research. Besides theoretical analysis of language, syllable network analysis may be of certain interest in the domain of natural language processing, for speech recognition and speech synthesis. Syllables can be used as acoustic units in automatic speech recognition and as units in text-tospeech systems [17,18,19]. In [18,19] a syllable-based language model is presented and it corresponds to the weighted syllable network.\nIn this paper we describe experiments with syllable networks for the Croatian language. We constructed four different syllable networks from texts collected Croatian Wikipedia and Blogs. The main goal was to analyze if the Croatian language syllable networks have properties of small-world networks and to analyze if these properties are similar to the properties of Portuguese and Chinese syllable networks. Furthermore, the aim was to compare two different strategies for network construction. As well, we wanted to compare networks from two different text corpora. The presented work is the first attempt to model Croatian syllables as the complex network.\nIn the second section we present different syllable network construction strategies, text corpora and syllable networks that are constructed from the text. In the third section we describe how to estimate network measures. In the fourth section we present results. In the fifth section we elaborate on the obtained data and provide concluding remarks.\nII. NETWORKS CONSTRUCTION"
    }, {
      "heading" : "A. Syllable networks construction strategies",
      "text" : "Different strategies can be applied in building syllable networks from text. The idea of a syllable network is to represent syllables as nodes and establish links between them according to their connections within words.\nGenerally speaking, a syllable network can be either undirected or directed and unweighted or weighted. In a directed syllable network, a directed link indicates the direction of the connection; displaying which syllable (node) is the initial and which syllable (node) is the target. By using a directed network, the successor or the predecessor of an intended syllable can be seen, possibly providing the grounds for further statistical analysis of language structure on the phonetic level. Weighted syllable networks contain information about the number of established links between two syllables, which is again significant in phonetic structure analysis.\nA question of how to establish the links between the nodes (syllables) must be discussed. One way is to connect the syllables that belong to the same word (syllable co-occurrence network) and another way is to connect only the neighbour syllables (first-neighbour network). This results in eight different syllable network models. In [13, 14], the network is constructed in a way that two nodes (syllables) are connected if they belong to the same word, making the network undirected and unweighted. This simplified model of a syllable network is constructed in order to study the evolution of the language using phonetic elements [13]. We constructed three networks according to this model.\nIn our opinion, for some purposes that include natural language processing and linguistic studies, it also makes sense to construct a syllable network of syllables that are direct neighbours in the word. Therefore we additionally constructed and analyzed one directed and weighted neighbour network."
    }, {
      "heading" : "B. Data",
      "text" : "We analyzed different networks of syllables from different text corpora. The texts used for building the networks are two large corpora. The first corpus is the Croatian Wikipedia. The second corpus contains 3.218 articles collected from different Croatian blogs (including 4 religious and 5 political portals, 6 blog spaces, 3 webpages with comments and 4 columns from the daily newspapers).\nThe reason why we have chosen these corpora is because our future work is focused on the text collected from the Web. Another possible approach is to choose a dictionary of Croatian language as a network source. But in [13] it is shown that there is no big difference between syllable networks constructed from the book and syllable network constructed from the dictionary for unweighted networks. A problem we encountered was the Wikipedia corpus containing a certain number of foreign words. This is the reason why the initial network had certain syllables unusual for the Croatian language. Therefore, we examined a filtered network from which all nodes with small degree (meaning that they contain some rare and unusual syllables) were excluded. There is a linguistic difference between the two corpora. The Wikipedia corpus is more formal, so there are more standard words with a pattern in writing. On the other hand, the blog corpus is mostly written in an informal manner, with the use of dialect, slang or abbreviations. However, all of the mentioned texts specifics collected from the web are essential for our future work."
    }, {
      "heading" : "C. Syllable networks",
      "text" : "We constructed four different networks. Three of them were designed as word co-occurrence syllable networks: the first from the Wikipedia text - CW, the second from the blog text – CB, and the third was devised from both corpora – CWB. The fourth network was constructed as a directed and weighted first-neighbour syllable network from the Wikipedia text. The number of nodes and edges for all four networks are displayed in table I.\nNetwork construction is implemented in the Python programming language which contains the NetworkX software package developed for the creation, manipulation, and study of the structure, dynamics, and functions of complex networks [20]. For network visualization we used Gephi software [21]. For the separation of a word into syllables we use syllabification algorithm that is implemented according to the rules described in [16]. The syllabification process is Both corpora where in txt file format which made the reading and processing easy and the only problem was the encoding because of our diacritical signs such as č,ć,š etc. The NetworkX module provided us with all the necessary commands to construct a graph and then export it in the desired format.\nThe co-occurrence syllable network constructed from texts from Wikipedia (Cw) visualized using Gephi is shown in Figure 1. The most frequent syllables are pointed out.\nAnother co-occurrence syllable network constructed from blog corpus (CB) is shown in Figure 2. This is a smaller network with smaller number of nodes, but the most frequent nodes (syllables) are similar to the first network, which is discussed in the fourth section.\nThe third network is constructed from both Wikipedia and blog corpora. Syllables with the most connections with other syllables are pointed out and are almost the same as in the first network.\nThe fourth network is constructed as a directed and weighted network of first neighbor syllables from words\nthat appear in the texts of the Croatian Wikipedia. The\nidea was to compare this network to the other three\nnetworks and to see if it had potential in phonetic structure\nanalysis.\nIII. THE NETWORK STRUCTURE ANALYSIS\nIn this section we explain the most important measures for network analysis. Every network has an N number of nodes and K links.\nThe degree of a node i is the number of connections of the node and is denoted by ki. Thus, the average degree of the network is:\nFor every two connected nodes i and j the number of links lying on the path between them is denoted as dij, therefore the average distance of a node i from all other nodes is:\n∑\nFrom where we easily obtain the average path distance L as the average value of di of all nodes:\n∑\nand the maximum distance results in the network diameter, D:\n.\nThe clustering coefficient is described as a presence of connections between the nearest neighbours of a node. The clustering coefficient Ci of a node i is defined as a ratio between the number of edges Ei that actually exist among these ki and the total possible number of edges:\nThe average clustering of a network C is the average value of the clustering coefficient of all the nodes:\n∑\nThe main property of small-world networks is that the distance between two random nodes grows proportionally to the logarithm of the number of nodes. Therefore, smallworld networks tend to have small diameter and short average distance which is the property of random ER networks. Another important property is the high clustering coefficient in comparison to random ER networks. Furthermore, for complex networks it’s typically a power-law degree distribution.\nIV. RESULTS\nOne of our objectives in this experiment is to see if constructed syllable networks of the Croatian language have properties of small–world networks. Small-world properties have already been proven for syllable networks of the Portuguese and the Chinese language; therefore we expected to find similar results for the Croatian language. For the purpose of comparing constructed networks with random networks, ER networks with the same number of nodes and edges have been constructed and all the important properties have been analyzed.\nUsing Gephi we filtered the networks and determined the average degree <k>, diameter D, average distance L, average clustering coefficient C and some other network values. The correspondent values of these coefficients are shown in table II.\nThe results show that all three co-occurrence syllable networks have a small diameter and average path distance. Furthermore, for all three networks it holds which shows that syllable networks are sparse as it is expected for complex networks. In comparison to the ER networks with the same number of nodes and edges these\nnetworks show a high clustering coefficient: ; ; .\nAll these results lead to a conclusion that cooccurrence syllable networks of Croatian language exhibit small world network properties.\nWe compared our results with the results obtained for the Portuguese and Chinese languages and concluded that there is a similarity between these families of syllable networks. Syllable networks of the Portuguese and of the Croatian language are similar in size, are both sparse, have a small diameter, small size of average path length and both have a high clustering coefficient. Syllable networks of the Chinese have different sizes, but the properties show that these are also small-world networks.\nThe results of the fourth, weighted and directed firstneighbour syllable network 1 analysis are shown in table III. Although C for the first-neighbour syllable network was smaller than in the co-occurrence syllable networks, in comparison with the random network, it was still about 30 times larger than random network C. These values indicate that the first-neighbour syllable network may be a small-world network as well, however, more experiments with larger corpora need to be conducted.\nIn these preliminary experiments we did not estimate the degree distributions for syllable networks. However, we did use NetworkX functions to plot degree distributions on the log-log scale and the result that we got for the co-occurrence syllable network is shown in Figure 3. The straight line on log-log scale indicates that a powerlaw distribution should be tested in further experiments.\n1 For the purpose of some network measures estimation, it was\ntransformed into an undirected, unweighted network.\nSmall subnetworks were filtered with ten nodes each from all three networks with the highest degree. The results are shown in table IV. It is shown that all three networks have almost the same nodes with the highest degree. This indicates that different corpora do not create significant differences between the networks.\nIn this paper we presented different approaches in syllable networks construction. Undirected and unweighted word co-occurrence syllable networks have been already constructed and analyzed for two languages: Portuguese and Chinese. The same syllable networks constructed for the Croatian language (from different corpora) exhibited similar results. The networks contain a high cluster coefficient compared to random networks of the same size and small diameter and average path length. In conclusion, the Croatian language syllable networks have properties of small-world networks.\nAnother approach was to construct a directed and weighted first-neighbour syllable network for the Croatian language. As far as we know, this is the first time this syllable network construction type has been utilized. The main idea of this approach is to capture more information about the properties of each syllable (the successor, the predecessor and strength of connections with other syllables). It is shown that this kind of network has smallworld network properties as well.\nThese are just preliminary results and there is still a lot of future research to be conducted in this direction. The syllabification algorithm from [16] should be reconsidered and the correctness of the Croatian syllabification should be assessed.\nFurthermore, detailed statistical analysis should be performed. The experiment should be repeated with larger corpora such as Croatian literature and dictionaries. However, it is necessary to determine an exact degree distribution for all networks. Our plan is to analyze the network growth and possible communities in the network."
    } ],
    "references" : [ {
      "title" : "Nature 393",
      "author" : [ "D.J. Watts", "S.H. Strogatz" ],
      "venue" : "pp. 440",
      "citeRegEx" : "1",
      "shortCiteRegEx" : null,
      "year" : 1998
    }, {
      "title" : "Nature 410",
      "author" : [ "S.H. Strogatz" ],
      "venue" : "pp. 268",
      "citeRegEx" : "2",
      "shortCiteRegEx" : null,
      "year" : 2001
    }, {
      "title" : "The Small World",
      "author" : [ "S. Milgram" ],
      "venue" : "Psychology Today 2, pp. 60–67",
      "citeRegEx" : "3",
      "shortCiteRegEx" : null,
      "year" : 1967
    }, {
      "title" : "Rev",
      "author" : [ "R. Albert", "A.-L. Barabasi" ],
      "venue" : "Mod. Physics 74, pp. 47",
      "citeRegEx" : "4",
      "shortCiteRegEx" : null,
      "year" : 2002
    }, {
      "title" : "Semantic Networks: Structure and Dynamics",
      "author" : [ "J. Borge-Hothoefer", "A. Arenas" ],
      "venue" : "Entropy, 12, pp. 1264-1302",
      "citeRegEx" : "6",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "Language Networks: Their Structure",
      "author" : [ "R.V. Sole", "B. Corominas-Murtra", "S. Valverde", "L. Steels" ],
      "venue" : "Function, and Evolution”, Complexity, 15(6), pp. 20-26",
      "citeRegEx" : "7",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "V.Sole, “The small world of human language",
      "author" : [ "R.R. Ferrer i Cancho" ],
      "venue" : "The Royal Society vol",
      "citeRegEx" : "8",
      "shortCiteRegEx" : "8",
      "year" : 1482
    }, {
      "title" : "Language as an evolving word web",
      "author" : [ "S.N. Dorogovtsev", "J.F.F. Mendes" ],
      "venue" : "Proceedings of The Royal Society of London. Series B, Biological Sciences, 268",
      "citeRegEx" : "9",
      "shortCiteRegEx" : null,
      "year" : 1485
    }, {
      "title" : "Network Properties of written human language",
      "author" : [ "P. Masucci", "G.J. Rodgers" ],
      "venue" : "Physical Review E, 74(2)",
      "citeRegEx" : "10",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Global topology of word co-occurrence networks: Beyond the two-regime power-law",
      "author" : [ "M. Choudhury", "D. Chatterjee", "A. Mukherjee" ],
      "venue" : "Proceedings of the 23rd International Conference on Computational Linguistics: Posters (pp. 162-170). Association for Computational Linguistics",
      "citeRegEx" : "11",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "Complex Networks in Different Languages: A Study of an Emergent Multilingual Encyclopedia",
      "author" : [ "F.C. Pemble", "H. Bingol" ],
      "venue" : "Unifying Themes in Complex Systems, 1, 612",
      "citeRegEx" : "12",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "The Network of syllables in Portuguese",
      "author" : [ "M. Medeiros Soares", "G.Corso", "L.S. Lucena" ],
      "venue" : "Physica A",
      "citeRegEx" : "13",
      "shortCiteRegEx" : "13",
      "year" : 2005
    }, {
      "title" : "The network of Syllables and Characters in Chinese",
      "author" : [ "G. Peng", "J.W. Minett", "W. S-Y. Wang" ],
      "venue" : "Journal of Quantitative Linguistics",
      "citeRegEx" : "14",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "Random Graphs",
      "author" : [ "B. Bollobas" ],
      "venue" : "Academic Press, London",
      "citeRegEx" : "15",
      "shortCiteRegEx" : null,
      "year" : 1985
    }, {
      "title" : "Fonologija hrvatskoga jezika",
      "author" : [ "M. Turk" ],
      "venue" : "Izdavački centar Rijeka, Tiskara Varždin, Varaždin",
      "citeRegEx" : "16",
      "shortCiteRegEx" : null,
      "year" : 1992
    }, {
      "title" : "Tatham,”Word and syllable concatenation in text-to-speech synthesis",
      "author" : [ "M.E. Lewis" ],
      "venue" : "In:Sixth European Conference on Speech Communications and Technology,",
      "citeRegEx" : "17",
      "shortCiteRegEx" : "17",
      "year" : 1999
    }, {
      "title" : "Using syllable-based indexing features and language models to improve German spoken document retrieval",
      "author" : [ "M. Larson", "S. Eickeler" ],
      "venue" : "In Eurospeech’03,",
      "citeRegEx" : "18",
      "shortCiteRegEx" : "18",
      "year" : 2003
    }, {
      "title" : "Syllable based language model for large vocabulary continuous speech recognition of polish",
      "author" : [ "M. Majewski" ],
      "venue" : "Text, Speech and Dialogue, pp. 397-401",
      "citeRegEx" : "19",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "Exploring network structure",
      "author" : [ "A.A. Hagberg", "D.A. Schult", "P.J. Swart" ],
      "venue" : "dynamics, and function using NetworkX”, in Proceedings of the 7th Python in Science Conference ",
      "citeRegEx" : "20",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "and M",
      "author" : [ "M. Bastian", "S. Heymann" ],
      "venue" : "Jacomy, Gephi: An open source software for exploring and manipulating networks",
      "citeRegEx" : "21",
      "shortCiteRegEx" : null,
      "year" : 2009
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "Two important classes of complex networks that can be further differentiated are small-world networks [1, 2, 3] with high clustering as a main property and scale-free networks [4, 5] which can be characterized by power-law degree distribution.",
      "startOffset" : 102,
      "endOffset" : 111
    }, {
      "referenceID" : 1,
      "context" : "Two important classes of complex networks that can be further differentiated are small-world networks [1, 2, 3] with high clustering as a main property and scale-free networks [4, 5] which can be characterized by power-law degree distribution.",
      "startOffset" : 102,
      "endOffset" : 111
    }, {
      "referenceID" : 2,
      "context" : "Two important classes of complex networks that can be further differentiated are small-world networks [1, 2, 3] with high clustering as a main property and scale-free networks [4, 5] which can be characterized by power-law degree distribution.",
      "startOffset" : 102,
      "endOffset" : 111
    }, {
      "referenceID" : 3,
      "context" : "Two important classes of complex networks that can be further differentiated are small-world networks [1, 2, 3] with high clustering as a main property and scale-free networks [4, 5] which can be characterized by power-law degree distribution.",
      "startOffset" : 176,
      "endOffset" : 182
    }, {
      "referenceID" : 4,
      "context" : "Network properties of written human languages have already been analyzed in different research studies [6].",
      "startOffset" : 103,
      "endOffset" : 106
    }, {
      "referenceID" : 5,
      "context" : "Networks based on co-occurrence of words in sentences are analyzed in [7, 8, 9].",
      "startOffset" : 70,
      "endOffset" : 79
    }, {
      "referenceID" : 6,
      "context" : "Networks based on co-occurrence of words in sentences are analyzed in [7, 8, 9].",
      "startOffset" : 70,
      "endOffset" : 79
    }, {
      "referenceID" : 7,
      "context" : "Networks based on co-occurrence of words in sentences are analyzed in [7, 8, 9].",
      "startOffset" : 70,
      "endOffset" : 79
    }, {
      "referenceID" : 8,
      "context" : "The topology of human written language, through a network representation of Orwell’s 1984, is presented in [10], while the co-occurrence properties of words in different languages are studied in [11].",
      "startOffset" : 107,
      "endOffset" : 111
    }, {
      "referenceID" : 9,
      "context" : "The topology of human written language, through a network representation of Orwell’s 1984, is presented in [10], while the co-occurrence properties of words in different languages are studied in [11].",
      "startOffset" : 195,
      "endOffset" : 199
    }, {
      "referenceID" : 10,
      "context" : "Pemble and Bingol [12] have constructed two complex networks out of Wikipedia English and German corpora and analyze conceptual networks in different languages.",
      "startOffset" : 18,
      "endOffset" : 22
    }, {
      "referenceID" : 11,
      "context" : "So far, syllable networks have been constructed exclusively for Portuguese [13] and Chinese [14].",
      "startOffset" : 75,
      "endOffset" : 79
    }, {
      "referenceID" : 12,
      "context" : "So far, syllable networks have been constructed exclusively for Portuguese [13] and Chinese [14].",
      "startOffset" : 92,
      "endOffset" : 96
    }, {
      "referenceID" : 13,
      "context" : "In both experiments, syllable networks have a large clustering coefficient and power-law degree distribution, as opposed to the Erdös-Renyi (ER) random networks [15], which have low clustering coefficient and Poisson-like degree distribution.",
      "startOffset" : 161,
      "endOffset" : 165
    }, {
      "referenceID" : 11,
      "context" : "In [13] the syllable network is used to demonstrate that language in itself resembles a living organism, evolving in time and space.",
      "startOffset" : 3,
      "endOffset" : 7
    }, {
      "referenceID" : 14,
      "context" : "Network analysis of the syllables connections in the words may be of theoretical interest in the domain of phonology, morphology and language topology [16].",
      "startOffset" : 151,
      "endOffset" : 155
    }, {
      "referenceID" : 15,
      "context" : "Syllables can be used as acoustic units in automatic speech recognition and as units in text-tospeech systems [17,18,19].",
      "startOffset" : 110,
      "endOffset" : 120
    }, {
      "referenceID" : 16,
      "context" : "Syllables can be used as acoustic units in automatic speech recognition and as units in text-tospeech systems [17,18,19].",
      "startOffset" : 110,
      "endOffset" : 120
    }, {
      "referenceID" : 17,
      "context" : "Syllables can be used as acoustic units in automatic speech recognition and as units in text-tospeech systems [17,18,19].",
      "startOffset" : 110,
      "endOffset" : 120
    }, {
      "referenceID" : 16,
      "context" : "In [18,19] a syllable-based language model is presented and it corresponds to the weighted syllable network.",
      "startOffset" : 3,
      "endOffset" : 10
    }, {
      "referenceID" : 17,
      "context" : "In [18,19] a syllable-based language model is presented and it corresponds to the weighted syllable network.",
      "startOffset" : 3,
      "endOffset" : 10
    }, {
      "referenceID" : 11,
      "context" : "In [13, 14], the network is constructed in a way that two nodes (syllables) are connected if they belong to the same word, making the network undirected and unweighted.",
      "startOffset" : 3,
      "endOffset" : 11
    }, {
      "referenceID" : 12,
      "context" : "In [13, 14], the network is constructed in a way that two nodes (syllables) are connected if they belong to the same word, making the network undirected and unweighted.",
      "startOffset" : 3,
      "endOffset" : 11
    }, {
      "referenceID" : 11,
      "context" : "This simplified model of a syllable network is constructed in order to study the evolution of the language using phonetic elements [13].",
      "startOffset" : 131,
      "endOffset" : 135
    }, {
      "referenceID" : 11,
      "context" : "But in [13] it is shown that there is no big difference between syllable networks constructed from the book and syllable network constructed from the dictionary for unweighted networks.",
      "startOffset" : 7,
      "endOffset" : 11
    }, {
      "referenceID" : 18,
      "context" : "Network construction is implemented in the Python programming language which contains the NetworkX software package developed for the creation, manipulation, and study of the structure, dynamics, and functions of complex networks [20].",
      "startOffset" : 230,
      "endOffset" : 234
    }, {
      "referenceID" : 19,
      "context" : "For network visualization we used Gephi software [21].",
      "startOffset" : 49,
      "endOffset" : 53
    }, {
      "referenceID" : 14,
      "context" : "For the separation of a word into syllables we use syllabification algorithm that is implemented according to the rules described in [16].",
      "startOffset" : 133,
      "endOffset" : 137
    }, {
      "referenceID" : 14,
      "context" : "The syllabification algorithm from [16] should be reconsidered and the correctness of the Croatian syllabification should be assessed.",
      "startOffset" : 35,
      "endOffset" : 39
    } ],
    "year" : 2014,
    "abstractText" : "This paper presents preliminary results of Croatian syllable networks analysis. Syllable network is a network in which nodes are syllables and links between them are constructed according to their connections within words. In this paper we analyze networks of syllables generated from texts collected from the Croatian Wikipedia and Blogs. As a main tool we use complex network analysis methods which provide mechanisms that can reveal new patterns in a language structure. We aim to show that syllable networks have much higher clustering coefficient in comparison to Erdös-Renyi random networks. The results indicate that Croatian syllable networks exhibit certain properties of a small world networks. Furthermore, we compared Croatian syllable networks with Portuguese and Chinese syllable networks and we showed that they have similar properties.",
    "creator" : "Microsoft® Word 2010"
  }
}