{
  "name" : "1406.1765.pdf",
  "metadata" : {
    "source" : "META",
    "title" : "Linguistic Analysis of Requirements of a Space Project and their Conformity with the Recommendations Proposed by a Controlled Natural Language",
    "authors" : [ "Anne Condamines", "Maxime Warnier" ],
    "emails" : [ "anne.condamines@univ-tlse2.fr", "maxime.warnier@univ-tlse2.fr" ],
    "sections" : [ {
      "heading" : null,
      "text" : "Space Agency (CNES) is to design a writing guide based on the real and regular writing of requirements. As a first step in the project, this paper proposes a linguistic analysis of requirements written in French by CNES engineers. The aim is to determine to what extent they conform to two rules laid down in INCOSE, a recent guide for writing requirements. Although CNES engineers are not obliged to follow any Controlled Natural Language in their writing of requirements, we believe that language regularities are likely to emerge from this task, mainly due to the writers’ experience. The issue is approached using natural language processing tools to identify sentences that do not comply with INCOSE rules. We further review these sentences to understand why the recommendations cannot (or should not) always be applied when specifying largescale projects.\nKeywords: requirements · specifications · technical writing · corpus linguistics · controlled natural language."
    }, {
      "heading" : "1 Introduction",
      "text" : "The study presented in this paper was conducted with a view to improving the writing of requirements at CNES (Centre National d’Études Spatiales).\nThe CNES and our laboratory have been collaborating for several years on questions concerning terminology, text management and the study of risks related to the use of language [1]. As linguists, we propose methods and results based on a corpus linguistics approach, assisted by tools such as parsers, statistical tools, terminology extractors, concordancers or scripting languages. More recently, we were approached on the specific problem of writing requirements.\nThe CNES is the French space agency and, as such, is responsible for designing space systems. Therefore, it has to draft specifications (that must clearly and precisely describe its needs) which are intended for companies that respond to the bids; and, in\nnot always clear, and that as a result there may be divergent interpretations, leading to additional costs, delays or even litigation (since requirements are part of the contract clauses).\nIn order to improve the quality of requirements, many projects have been developed by computational researchers to check the consistency of the requirements after they were written (see [2–4], among others). Still, we believe that the writing itself can be improved by proposing a guide closer to the actual way in which engineers write requirements.\nIn the present study, two kinds of documents were used: the Guide for Writing Requirements recommendations proposed by INCOSE (International Council on Systems Engineering) [5] (a controlled natural language, see below); and a subset of the specifications of a project: Pleiades (see below).\nWe propose a linguistic diagnosis of the way requirements are written in the project by comparing these requirements with the recommendations of the INCOSE guide.\nThe point of view underlying our approach is that guides for writing specifications are not fully adapted to the real writing process: they are sometimes too constraining, and sometimes insufficiently so. They are not written by linguists but by domain experts with a prescriptive point of view based on their experience. This is the case for example in the field of air-traffic control where the ICAO (International Civil Aviation Organization) phraseology is written by controllers [6]. Even if these guides are not always adapted to the reality of language use, we consider that they constitute a good starting point because of the experience of the domain experts. Our other starting point is constituted by specifications that are not written following the recommendations of a guide: this is the case at CNES.\nIndeed, CNES engineers do not use a controlled natural language in order to write better specifications, only requirement management tools (such as IBM Rational DOORS). Nevertheless, they are all experienced in this type of writing. Thus, even if the writers do not consciously follow a controlled natural language, we assume the existence of regularities in the way they write requirements. Writers are indeed influenced both by existing specifications and by certain spontaneous regularities which tend to occur in each recurrent writing situation, two characteristics attributed to textual genres. According to Bhatia [7], a textual genre may be defined as “a recognizable communicative event characterized by a set of communicative purpose(s) identified and mutually understood by the members of the professional or academic community in which it regularly occurs”.\nIt can be noted that the notion of textual genre is not always properly distinguished from that of sublanguage. See for instance the definition given by Somers: “A sublanguage is an identifiable genre or text-type in a given subject field, with a relatively or even absolutely closed set of syntactic structures and vocabulary” [8]. Other authors such as Kurzon [9], Temnikova [10] or Kuhn [11] have highlighted this point. Historically, the most important difference is that the notion of sublanguage was proposed by Harris from a mathematical and distributional perspective [12], while that of\nlinguistic regularities are associated with speakers of the same community. This feature of spontaneous linguistic regularities has been characterized as normaison (“norming’) by the French Linguistic School of Rouen [15] as opposed to normalisation (“normalization”) that concerns the case where linguistic norms are imposed by an organism. In short, we could say that our aim is to propose a normalisation based on the identification of normaison, or, in other words, to improve the writing of specifications without imposing a standard that is too far removed from the engineers’ natural practice.\nThe paper comprises two main parts. In the first one (see section 2), we present the tool-assisted method used for making the diagnosis. In the second one (see section 3), we describe and discuss our preliminary results."
    }, {
      "heading" : "2 Methodology",
      "text" : "Several guides for writing requirements exist, and most of them were designed to avoid undesirable properties of natural language (“unrestricted natural language brings with it a host of well-known problems” [16]), such as ambiguity, polysemy, vagueness, and so on [1, 17].\nTo ensure that these guidelines are close enough to actual practices, and thus really usable, we decided to carry out a diagnosis of the way the specifications are drafted at CNES and then to compare this process with the recommendations made by one of those guides. The aim is to evaluate the conformity of the requirements to the recommendations, and see if the latter can be brought closer to reality.\nWe will first briefly describe our corpus of requirements and the tools we used, and then the linguistic phenomena selected for study in the controlled natural language that we used as a reference."
    }, {
      "heading" : "2.1 Description of the corpus",
      "text" : "A subset of the specifications of an Earth observation satellite called Pleiades, launched in 2011, was obtained from the CNES. From these specifications, we extracted the requirements, that is to say only those parts that play the role of contractual obligations between the CNES and its subcontractors. Requirements should not contain unnecessary information, such as examples or comments.\nRequirements are intended to be autonomous; they are therefore supposed to have no link with the textual segments which precede or follow them. In the specifications we were given, the requirements were easily identifiable because they were framed by specific tags.\nThe requirements were all written in natural language, but some also contained tables or diagrams (which were removed, since they cannot be analyzed automatically). In theory, they should be fully understandable even without those figures – but in practice, this is not always the case."
    }, {
      "heading" : "2.2 Tools and resources",
      "text" : "We used several tools to perform the tasks described in section 3. The syntactic analysis was done using Talismane [18], an open-source parser developed in our laboratory, while the open-source corpus processor Unitex [19] was used for sentence chunking. Short handmade Perl scripts were written for other needs (extraction of the requirements, detection of long sentences, and so on).\nWe also compared our corpus to two other corpora (reduced to the exact same size): (1) a handbook written by experts from the CNES about techniques and technologies used for building and operating spacecraft, intended for semi-experts, and (2) some articles from the French national newspaper Le Monde."
    }, {
      "heading" : "2.3 INCOSE recommendations",
      "text" : "In order to compare the requirements corpus with a controlled natural language, we used the Guide for Writing Requirements recommendations proposed by INCOSE. The aim of this guide is presented as follows: “to draw together advice from a variety of existing standards into a single, comprehensive set of rules and objectives” (p. 10). It is quite general since it “is intended to cover the expression of requirements from across disciplines” (p. 12). INCOSE is therefore intended for engineers who write or review requirements. It can be clearly considered a “naturalist” controlled language (as opposed to the “formalist” approach) [20], whose goal is to facilitate human-tohuman communication [21].\nLike many other controlled natural languages (CNL) aimed at improving communication among humans, the main purpose of INCOSE is to ensure that the message written in natural language has only one possible interpretation. It is worth noting that this point of view about natural language is far from the one adopted by linguistics. 1 It can be reasonably assumed, however, that by establishing guidelines in narrowlydefined situations, it may be possible to limit (if not to remove completely) the inherent difficulties linked to natural language such as ambiguity.\nINCOSE has the four characteristics of controlled natural languages proposed by Kuhn [11], since it has one base language (English), it is a constructed language, it sets constraints on the vocabulary, the syntax and the semantics, and the resulting textual requirements are still understandable by English speakers.\nIt is not a mere style guide, because the recommendations are real rules, not hints – even if the authors admit that “rules have to constantly be adapted to particular situations”. All of them are followed by objectives that explain why the rules are useful.\nThe main “objectives for writing requirement statements” are: singularity, completeness, necessity, comprehensibility, concision, precision and non-ambiguity.\n1 According to Jakobson, for example, the referential function, which is the closest to the one\nconsisting in transmitting information, is only one among the six functions of language [22].\nBecause the phenomena we chose to observe are quite general (i.e. not highly language-dependent), we assume that most of the conclusions we propose for French are valid for English as well. In fact, INCOSE, while written in English and mainly based on older English guides, sometimes gives examples in French.\nSince it was not possible to check the conformity of the requirements to all the recommendations proposed by INCOSE (partly because the study is still in its initial stage, and partly because several of the recommendations cannot be verified in an automated manner), we decided to focus on a selection, all related to what could be called “comprehensibility”; that is, the fact that every (sentence composing a) requirement should be easily understandable by the reader, and that it cannot be misinterpreted, i.e. given a different meaning from the one originally intended by the writer. This notion is closely connected to that of complexity: the more complex a sentence is, the less easy it is to understand.\nThe first rule from INCOSE that we chose to examine is called “Singularity/Propositionals” and states that “combinators” must be avoided: “Combinators are words that join clauses together, such as 'and', 'or', 'then', 'unless'. Their presence in a requirement usually indicates that multiple requirements should be written.” Nevertheless, some of them are still present in the examples of “acceptable” specifications; this paradox suggests that the “combinators” cannot always be avoided.\nThe second rule is called “Completeness/Pronouns” and states that it is better to repeat nouns in full, rather than using pronouns to refer to nouns in other statements: “Pronouns are words such as 'it', 'this', 'that', 'he', 'she', 'they', 'them'. When writing stories, they are a useful device for avoiding the repetition of words; but when writing requirements, pronouns should be avoided, and the proper nouns repeated where necessary.” However, there is no indication about the conditions required for this repetition to be “necessary”; we can merely infer that the aim is to avoid problems due to anaphora resolution. Besides, in the only example given by INCOSE 2 , the ambiguity lies in a determiner, not in a pronoun.\nWe can already point out that these two rules are very general and seem way too\nrestrictive, and that their justifications are evasive."
    }, {
      "heading" : "3 First results",
      "text" : "In subsection 3.1, we present our results concerning the frequency of conjunctions, pronouns and long sentences in our corpus. In subsection 3.2, we propose a selection of examples that break the two rules from INCOSE and try to classify them according to their necessity (mandatory, useful or undesirable).\n2 “The controller shall send the driver's itinary (sic) for the day to the driver” must be pre-\nferred to “The controller shall send the driver his itinary (sic) for the day”.\nThanks to the syntactic analysis, we were able to retrieve all the occurrences of the so-called combinators (since no exhaustive list was given, we looked for all coordinating and subordinating conjunctions) and all the pronouns in the corpus. As can be seen from table 1, both are numerous, suggesting that they are common in unrestricted natural language.\nStill, they are much less frequent in requirements than in the other two corpora, handbooks and newspapers. This is particularly clear in the case of pronouns, which are nearly three times more frequent in newspapers (where repetition is seen as an error of style in French) than in requirements (which are usually much shorter). We believe that such a marked difference is an argument in favor of our initial hypothesis that regularities spontaneously arise in daily practice, and that requirement writing can be considered a textual genre, even when not taught as such.\nFinally, we also considered the length of the sentences composing the requirements. Although INCOSE simply recommends “concise” requirements, several guides for technical writing (such as ASD Simplified Technical English [23]) impose a word limit for each sentence4, because it is believed that longer sentences are harder to process. The results of our measures are shown in table 2.\nOnce again, significant differences exist between the three types of documents: sentences tend to be shorter in requirements, and much longer in newspaper articles.\n3 Percentages indicate the number of occurrences in relation to the total number of words. 4 Usually around 20 words for English. We arbitrarily decided that long sentences (in French)\nare composed of more than 25 words, and that a new sentence begins after each line break.\n“Si la différence (en valeur absolue) entre les dates de fin de lecture de deux fichiers, lus sur tranche de COME M - canal TMI i et sur tranche de COME N - canal TMI j, est inférieure à OPS_DELAI_INTER_FIN_LEC secondes, alors il est interdit d'enchaîner (lecture enchaînée) par la lecture de la tranche de COME N sur le canal i et de la tranche de COME M sur le canal j.”"
    }, {
      "heading" : "3.2 Qualitative analysis (analysis of examples)",
      "text" : "As a first step in the diagnosis, we focus on the description of some examples of sentences that do not follow the INCOSE recommendations and try to understand why.\nCombinators\nSome combinators are mandatory:\n(1) “Le générateur de TCH vérifiera que la valeur du champ PHASE est comprise\nentre 0 et FREQ_DIV -1.” [“The generator of TCH will check that the value of the field PHASE is between 0 and FREQ_DIV-1”] In example 1, the subordinating conjunction “que” cannot be avoided, since it introduces the dependent clause 5 , and the coordinating conjunction “et” is necessary to set the lower and higher limits of the interval.\nSome combinators are not mandatory, but prevent repetitions and multiple sentences:\n(2) “Les champs SM_ID et FM_ID seront extraits à partir de la BDS” [“Fields\nSM_ID and FM_ID will be extracted from the BDS”]\nIf the use of “et” were not allowed in example 2, two distinct sentences would be necessary (“Le champ SM_ID sera extrait à partir de la BDS.” and “Le champ FM_ID sera extrait à partir de la BDS.”). This would lead to longer and probably more confusing requirements: since the two sentences differ by only a single character, the reader may not notice the difference and think it is a duplicated sentence.\nHowever, longer sentences may become less readable: (3) “Cette TC permet de passer contrôle thermique plate-forme en mode\nREDUCED, c'est-à-dire de sélectionner des seuils de régulation \"larges\" pour le contrôle thermique grossier (pour limiter la puissance consommée), et de modifier la valeur d'écrêtage de la puissance injectée pour le contrôle thermique fin.” [“This TC makes it possible to switch the heat control of the platform to REDUCED mode, i.e. to select “broad” regulation thresholds for a coarse heat control (to limit the power consumed), and to change the cut-off value of the injected power for precise heat control.”] In example 3, it would have been better to clearly distinguish the two actions per-\nmitted by the TC – for example, with a bullet list.\n5 In French, the complementizer ‘que’ must always be used.\n(4) “pour n=2 la loi de la taille est respectée de fait mais le test 'FIFO vide' reste\nnécessaire” [“for n=2 the size rule is always respected, but the ‘empty FIFO’ test is still required”] In example 4, the reader is certain that the test is necessary in all cases. Without the\nfirst main clause and the logical connector “mais”, he could have doubted it.\nNonetheless, in several cases, the use of a coordinator does not seem justified; in\nparticular when two sentences are coordinated by “and”:\n(5) “Le format des données de mesure angulaire et Doppler est conforme au\nstandard CCSDS décrit dans le document DA9 et le schéma XML respecte le standard décrit dans DA11.” [“The data format of the angular and Doppler measurement is in accordance with the CCSDS standard described in document DA9 and the XML schema complies with the standard described in DA11.”] (6) “Les demandes sont saisies sur le FOS et le logiciel ARPE gère les conflits\nentre les demandes Spot, Hélios et Pléïades.” [“The requests are to be entered on the FOS and the ARPE software manages conflicts between the requests from Spot, Hélios and Pléïades”] In examples 5 and 6, there is no apparent reason why separate sentences should not\nbe used (parataxis).\nIn some cases, problems arise because of the (absence of proper) coordinators:\n(7) “Pour cela, on utilisera les données BDS (LENGTH et LOCATION_UNIT) de\nla table des OBCD (globaux) ou la description (LONGUEUR) des paramètres diagnostic déjà crées.” [“For this, we will use the BDS data (LENGTH and LOCATION_UNIT) from the (global) OBCD table or the description (LONGUEUR) of the already created diagnostic parameters”] In example 7 above, there are two possible solutions (alternative), but no explanation is given to the reader to tell him in which case(s) one of them should be preferred (or whether they are in fact identical).\n(8) “Sur réception de cette TC, le LVC met à jour la table des surveillances stan-\ndards de l'application destinataire et ré-initialise le compteur d'erreur (remise à 0) associé à cette surveillance.” [“Upon reception of this TC, the LVC updates the table of standard surveillances of the destination application and resets the error counter associated to this surveillance”] In example 8, we know that the LVC has to do two distinct operations, but it is not\nclear whether they are supposed to be done at the same time or one after the other.\n(9) “(eg : 2 et 10 ou 3 et 11)” [“e.g. : 2 and 10 or 3 and 11)”] In example 9, the priorities of the logical operators “et” and “ou” are not clear. (10) “Cet ordre est rejeté si : [“This order is rejected if:”]\n- le mode NORM automatique est actif - le satellite est en mode MAN - le satellite n'est pas en mode convergé (GAP ou SUP) - un ordre MAN/CAP est déjà en attente d'exécution”\n(“or”), or only if they are all met (“and”)? Lists of this kind are very common in our corpus.\nPronouns\nSome pronouns must be avoided, because otherwise the requirement is no longer autonomous:\n(11) “Il calculera aussi, a une fréquence paramétrable (ordre de grandeur 1 mois),\nla moyenne de mise en œuvre et la comparera à la moyenne maximum afin d'anticiper un problème éventuel.” [“It will also calculate, at a frequency that can be parameterized (at monthly intervals), the average time for commissioning and will compare it to the maximum average in order to anticipate any problems.”] The requirement given in example 11 cannot be understood by itself, because the pronoun “il” (“it”) refers to the subject defined in the previous requirement. (And in another requirement, a reference is made to a “previously stated rule”, but there is no indication as to which rule is meant.)\nSome pronouns are mandatory:\n(12) “Sur réception de cette TC, le LVC met à jour le paramètre qui donne la\ntaille maximum d'un paquet TM de type dump” [“Upon reception of this TC, the LCV updates the parameter that gives the maximum size of a TM dump packet”] Without the relative pronoun “that”, it would not be possible to specify which pa-\nrameter is referred to in example 12.\n(13) “Il ne sera pas utile de vérifier ce paquet \" vide \"” [“It won’t be necessary to\ncheck that \"empty\" packet”]\nImpersonal pronouns like the one given in example 13 are widespread in our cor-\npus and can hardly be avoided. They do not refer to another noun.\nSome pronouns are not mandatory, but prevent unnecessary repetitions of words:\n(14) “La liste des TCD est définie en BDS. Elle est donnée ici à titre informatif:”\n[“The list of TCD is defined in BDS. It is given here for information:”]\nCompare example 14 with the same sentences without a pronoun: “La liste des TCD est définie en BDS. La liste des TCD est donnée ici à titre informatif:”. [“The list of TCD is defined in BDS. The list of TCD is given here for information:”]\n(15) “Le paquet ne sera généré que s'il est activé par le LVC.” [“The packet will\nbe generated only if it is activated by the LVC”]\nExample 15 seems even less natural if rewritten without a pronoun: “Le paquet ne sera généré que si le paquet est activé par le LVC.” [“The packet will be generated only if the packet is activated by the LVC”]\nMoreover, French demonstrative pronouns make it possible to avoid ambiguity be-\ntween the subject and the object of a sentence:\ntion of the PARAM_ID diagnostic if the latter is already defined on board”]\nIn example 16, “celui-ci” refers to the closest noun and is therefore unambiguous,\nwhereas “il” could have been ambiguous."
    }, {
      "heading" : "4 Conclusions and future work",
      "text" : "We analyzed a corpus composed of genuine requirements that had been written and used by engineers of the CNES to design a space system. We showed that, even if they did not explicitly follow guidelines, their texts have some interesting particularities, such as shorter sentences than in other textual genres.\nWe also examined two rules (concerning conjunctions and pronouns) from INCOSE, a guide for writing requirements. Using several examples from our corpus, we considered cases where those rules were justified and others where they were inapplicable (at least if literally applied) and should be refined. In fact, we believe that INCOSE, like the guides it is based on, lacks proper linguistic foundations and is not close enough to engineers’ real practices. For instance, the recommended absence of pronouns from the requirements – which implies sometimes cumbersome repetitions – seems hardly compatible with its ideal of “concision” (itself seen as “an aid to Comprehensibility, and therefore subsumed by it”, p. 16).\nIn the future, we intend to conduct a deeper linguistic analysis of our results and to focus on terminology so as to study the use and evolution of terms between comparable corpora. We also want to test the rules of INCOSE on another corpus of requirements. More generally, our intention is to inventory all existing rules in French CNL and to try to automatically test them with our corpora. The final step will be to propose a set of rules that is more consistent and closer to established practice in requirements writing.\nAcknowledgments. We would like to thank the CNES for their active cooperation as well as for providing us with the requirements corpus. We are also grateful to the four reviewers for their relevant suggestions and references."
    } ],
    "references" : [ {
      "title" : "Variations in Terminology",
      "author" : [ "A. Condamines" ],
      "venue" : "Application to the Management of Risks Related to Language Use in the Workplace. Terminology. 16, 30–50",
      "citeRegEx" : "1",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "A Formal Approach to Requirement Verification",
      "author" : [ "D.K. Nair", "S.S. Somé" ],
      "venue" : "SEDE. pp. 148–153",
      "citeRegEx" : "2",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Risk Analysis and Prevention: LELIE, a Tool dedicated to Procedure and Requirement Authoring",
      "author" : [ "F. Barcellini", "C. Albert", "C. Grosse", "P. Saint-Dizier" ],
      "venue" : "LREC. pp. 698–705",
      "citeRegEx" : "3",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Can Text Mining Assistants Help to Improve Requirements Specifications",
      "author" : [ "B. Sateli", "E. Angius", "S.S. Rajivelu", "R. Witte" ],
      "venue" : "Proceedings of the Mining Unstructured Data",
      "citeRegEx" : "4",
      "shortCiteRegEx" : "4",
      "year" : 2012
    }, {
      "title" : "Linguistic Analysis of English Phraseology and plain Language in Air-Ground Communication",
      "author" : [ "S. Lopez", "A. Condamines", "A. Josselin-Leray", "M. O’Donoghue", "R. Salmon" ],
      "venue" : "Journal of Air Transport Studies. 4, 44–60",
      "citeRegEx" : "6",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Analysing genre: Language use in professional settings",
      "author" : [ "V.K. Bhatia" ],
      "venue" : "Longman, London",
      "citeRegEx" : "7",
      "shortCiteRegEx" : null,
      "year" : 1993
    }, {
      "title" : "An Attempt to Use Weighted Cusums to Identify Sublanguages",
      "author" : [ "H. Somers" ],
      "venue" : "D.M.W. Powers (ed.) NeMLaP3/CoNLL 98 : New Methods in Language Processing and Computational Natural Language Learning. pp. 131–139. ACL",
      "citeRegEx" : "8",
      "shortCiteRegEx" : null,
      "year" : 1998
    }, {
      "title" : "Legal Language”: Varieties, Genres, Registers, Discourses",
      "author" : [ "D. Kurzon" ],
      "venue" : "International Journal of Applied Linguistics. 7, 119–139",
      "citeRegEx" : "9",
      "shortCiteRegEx" : null,
      "year" : 1997
    }, {
      "title" : "Text Complexity and Text Simplification in the Crisis Management domain, PhD thesis",
      "author" : [ "I. Temnikova" ],
      "venue" : null,
      "citeRegEx" : "10",
      "shortCiteRegEx" : "10",
      "year" : 2012
    }, {
      "title" : "A Survey and Classification of Controlled Natural Languages",
      "author" : [ "T. Kuhn" ],
      "venue" : "Computational Linguistics. 40, 121–170",
      "citeRegEx" : "11",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Sublanguage: Studies of Language in Restricted Semantic Domains",
      "author" : [ "R. Kittredge", "J. Lehrberger" ],
      "venue" : "Walter de Gruyter, Berlin, New York",
      "citeRegEx" : "12",
      "shortCiteRegEx" : null,
      "year" : 1982
    }, {
      "title" : "Research Genres: Explorations and Applications",
      "author" : [ "J. Swales" ],
      "venue" : "Cambridge University Press, Cambridge",
      "citeRegEx" : "13",
      "shortCiteRegEx" : null,
      "year" : 2004
    }, {
      "title" : "Variation Across Speech and Writing",
      "author" : [ "D. Biber" ],
      "venue" : "Cambridge University Press",
      "citeRegEx" : "14",
      "shortCiteRegEx" : null,
      "year" : 1988
    }, {
      "title" : "Socioterminology Facing Problems in Standardization",
      "author" : [ "L. Guespin" ],
      "venue" : "Proceedings of TLK’90. pp. 642–647",
      "citeRegEx" : "15",
      "shortCiteRegEx" : null,
      "year" : 1990
    }, {
      "title" : "A Controlled Language for the Specification of Contracts",
      "author" : [ "G.J. Pace", "M. Rosner" ],
      "venue" : "Fuchs, N. (ed.) CNL 2009 Workshop. pp. 226–245. Springer, Marettimo",
      "citeRegEx" : "16",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "Searching for and Identifying Conceptual Relationships via a corpus-based approach to a Terminological Knowledge Base (CTKB): method and results",
      "author" : [ "A. Condamines", "J. Rebeyrolle" ],
      "venue" : "Bourigault, D., L’Homme, M.-C., and Jacquemin, C. (eds.) Recent Advances in Computational Terminology. pp. 127–148. John Benjamins, Amsterdam/Philadelphia",
      "citeRegEx" : "17",
      "shortCiteRegEx" : null,
      "year" : 2001
    }, {
      "title" : "Robust French syntax analysis: reconciling statistical methods and linguistic knowledge in the Talismane toolkit",
      "author" : [ "A. Urieli" ],
      "venue" : "PhD thesis",
      "citeRegEx" : "18",
      "shortCiteRegEx" : "18",
      "year" : 2013
    }, {
      "title" : "Naturalness vs",
      "author" : [ "P. Clark", "W.R. Murray", "P. Harrison", "J. Thompson" ],
      "venue" : "Predictability: A Key Debate in Controlled Languages. In: Fuchs, N. (ed.) CNL 2009 Workshop. pp. 65–81. Springer, Marettimo",
      "citeRegEx" : "20",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "On Controlled Natural Languages: Properties and Prospects",
      "author" : [ "A. Wyner", "K. Angelov", "G. Barzdins", "D. Damljanovic", "B. Davis", "N. Fuchs", "S. Hoefler", "K. Jones", "K. Kaljurand", "T. Kuhn", "M. Luts", "J. Pool", "M. Rosner", "R. Schwitter", "J. Sowa" ],
      "venue" : "Fuchs, N. (ed.) CNL 2009 Workshop. pp. 281–289. Springer, Marettimo",
      "citeRegEx" : "21",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "Linguistics and Poetics",
      "author" : [ "R. Jakobson" ],
      "venue" : "Sebeok, T. (ed.) Style in Language. pp. 350–353. , Cambridge",
      "citeRegEx" : "22",
      "shortCiteRegEx" : null,
      "year" : 1960
    }, {
      "title" : "Simplified Technical English",
      "author" : [ "ASD" ],
      "venue" : "International specification for the preparation of maintenance documentation in a controlled language (Issue 4),",
      "citeRegEx" : "23",
      "shortCiteRegEx" : null,
      "year" : 2007
    }, {
      "title" : "Controlling Ambiguities in Legislative Language",
      "author" : [ "A. Bünzli", "S. Höfler" ],
      "venue" : "Rosner, M. and Fuchs, N. (eds.) CNL 2010. pp. 21–42. Springer, Marettimo",
      "citeRegEx" : "24",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Controlled English for Requirements Specifications",
      "author" : [ "N. Fuchs", "R. Schwitter" ],
      "venue" : "IEEE Computer Special Issue on Interactive Natural Language Processing.",
      "citeRegEx" : "25",
      "shortCiteRegEx" : null,
      "year" : 1996
    }, {
      "title" : "Legislative Drafting Guidelines: How Different Are They from Controlled Language Rules for Technical Writing? In: Kuhn, T",
      "author" : [ "S. Höfler" ],
      "venue" : "and Fuchs, N. (eds.) CNL 2012. pp. 138–151. Springer, Zurich",
      "citeRegEx" : "26",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Controlling Controlled English",
      "author" : [ "S. O’Brien" ],
      "venue" : "An Analysis of Several Controlled Language Rule Sets. Proceedings of EAMT-CLAW. pp. 105–114",
      "citeRegEx" : "27",
      "shortCiteRegEx" : null,
      "year" : 2003
    }, {
      "title" : "Law matters, syntax matters and semantics matters",
      "author" : [ "C. Vogel" ],
      "venue" : "Formal linguistics and Law, Trends in Linguistics. Studies and Monographs. 212, 25–54",
      "citeRegEx" : "28",
      "shortCiteRegEx" : null,
      "year" : 2009
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "The CNES and our laboratory have been collaborating for several years on questions concerning terminology, text management and the study of risks related to the use of language [1].",
      "startOffset" : 177,
      "endOffset" : 180
    }, {
      "referenceID" : 1,
      "context" : "In order to improve the quality of requirements, many projects have been developed by computational researchers to check the consistency of the requirements after they were written (see [2–4], among others).",
      "startOffset" : 186,
      "endOffset" : 191
    }, {
      "referenceID" : 2,
      "context" : "In order to improve the quality of requirements, many projects have been developed by computational researchers to check the consistency of the requirements after they were written (see [2–4], among others).",
      "startOffset" : 186,
      "endOffset" : 191
    }, {
      "referenceID" : 3,
      "context" : "In order to improve the quality of requirements, many projects have been developed by computational researchers to check the consistency of the requirements after they were written (see [2–4], among others).",
      "startOffset" : 186,
      "endOffset" : 191
    }, {
      "referenceID" : 4,
      "context" : "This is the case for example in the field of air-traffic control where the ICAO (International Civil Aviation Organization) phraseology is written by controllers [6].",
      "startOffset" : 162,
      "endOffset" : 165
    }, {
      "referenceID" : 5,
      "context" : "According to Bhatia [7], a textual genre may be defined as “a recognizable communicative event characterized by a set of communicative purpose(s) identified and mutually understood by the members of the professional or academic community in which it regularly occurs”.",
      "startOffset" : 20,
      "endOffset" : 23
    }, {
      "referenceID" : 6,
      "context" : "See for instance the definition given by Somers: “A sublanguage is an identifiable genre or text-type in a given subject field, with a relatively or even absolutely closed set of syntactic structures and vocabulary” [8].",
      "startOffset" : 216,
      "endOffset" : 219
    }, {
      "referenceID" : 7,
      "context" : "thors such as Kurzon [9], Temnikova [10] or Kuhn [11] have highlighted this point.",
      "startOffset" : 21,
      "endOffset" : 24
    }, {
      "referenceID" : 8,
      "context" : "thors such as Kurzon [9], Temnikova [10] or Kuhn [11] have highlighted this point.",
      "startOffset" : 36,
      "endOffset" : 40
    }, {
      "referenceID" : 9,
      "context" : "thors such as Kurzon [9], Temnikova [10] or Kuhn [11] have highlighted this point.",
      "startOffset" : 49,
      "endOffset" : 53
    }, {
      "referenceID" : 10,
      "context" : "Historically, the most important difference is that the notion of sublanguage was proposed by Harris from a mathematical and distributional perspective [12], while that of",
      "startOffset" : 152,
      "endOffset" : 156
    }, {
      "referenceID" : 5,
      "context" : "textual genre comes from a more sociolinguistic approach [7, 13] or even a corpus linguistic one [14].",
      "startOffset" : 57,
      "endOffset" : 64
    }, {
      "referenceID" : 11,
      "context" : "textual genre comes from a more sociolinguistic approach [7, 13] or even a corpus linguistic one [14].",
      "startOffset" : 57,
      "endOffset" : 64
    }, {
      "referenceID" : 12,
      "context" : "textual genre comes from a more sociolinguistic approach [7, 13] or even a corpus linguistic one [14].",
      "startOffset" : 97,
      "endOffset" : 101
    }, {
      "referenceID" : 13,
      "context" : "This feature of spontaneous linguistic regularities has been characterized as normaison (“norming’) by the French Linguistic School of Rouen [15] as opposed to normalisation (“normalization”) that concerns the case where linguistic norms are imposed by an organism.",
      "startOffset" : 141,
      "endOffset" : 145
    }, {
      "referenceID" : 14,
      "context" : "Several guides for writing requirements exist, and most of them were designed to avoid undesirable properties of natural language (“unrestricted natural language brings with it a host of well-known problems” [16]), such as ambiguity, polysemy, vagueness, and so on [1, 17].",
      "startOffset" : 208,
      "endOffset" : 212
    }, {
      "referenceID" : 0,
      "context" : "Several guides for writing requirements exist, and most of them were designed to avoid undesirable properties of natural language (“unrestricted natural language brings with it a host of well-known problems” [16]), such as ambiguity, polysemy, vagueness, and so on [1, 17].",
      "startOffset" : 265,
      "endOffset" : 272
    }, {
      "referenceID" : 15,
      "context" : "Several guides for writing requirements exist, and most of them were designed to avoid undesirable properties of natural language (“unrestricted natural language brings with it a host of well-known problems” [16]), such as ambiguity, polysemy, vagueness, and so on [1, 17].",
      "startOffset" : 265,
      "endOffset" : 272
    }, {
      "referenceID" : 16,
      "context" : "The syntactic analysis was done using Talismane [18], an open-source parser developed in our laboratory, while the open-source corpus processor Unitex [19] was used for sentence chunking.",
      "startOffset" : 48,
      "endOffset" : 52
    }, {
      "referenceID" : 17,
      "context" : "It can be clearly considered a “naturalist” controlled language (as opposed to the “formalist” approach) [20], whose goal is to facilitate human-tohuman communication [21].",
      "startOffset" : 105,
      "endOffset" : 109
    }, {
      "referenceID" : 18,
      "context" : "It can be clearly considered a “naturalist” controlled language (as opposed to the “formalist” approach) [20], whose goal is to facilitate human-tohuman communication [21].",
      "startOffset" : 167,
      "endOffset" : 171
    }, {
      "referenceID" : 9,
      "context" : "INCOSE has the four characteristics of controlled natural languages proposed by Kuhn [11], since it has one base language (English), it is a constructed language, it sets constraints on the vocabulary, the syntax and the semantics, and the resulting textual requirements are still understandable by English speakers.",
      "startOffset" : 85,
      "endOffset" : 89
    }, {
      "referenceID" : 19,
      "context" : "consisting in transmitting information, is only one among the six functions of language [22].",
      "startOffset" : 88,
      "endOffset" : 92
    }, {
      "referenceID" : 20,
      "context" : "Although INCOSE simply recommends “concise” requirements, several guides for technical writing (such as ASD Simplified Technical English [23]) impose a word limit for each sentence4, because it is believed that longer sentences are harder to process.",
      "startOffset" : 137,
      "endOffset" : 141
    } ],
    "year" : 2014,
    "abstractText" : "The long term aim of the project carried out by the French National Space Agency (CNES) is to design a writing guide based on the real and regular writing of requirements. As a first step in the project, this paper proposes a linguistic analysis of requirements written in French by CNES engineers. The aim is to determine to what extent they conform to two rules laid down in INCOSE, a recent guide for writing requirements. Although CNES engineers are not obliged to follow any Controlled Natural Language in their writing of requirements, we believe that language regularities are likely to emerge from this task, mainly due to the writers’ experience. The issue is approached using natural language processing tools to identify sentences that do not comply with INCOSE rules. We further review these sentences to understand why the recommendations cannot (or should not) always be applied when specifying large-",
    "creator" : "Microsoft® Word 2010"
  }
}