{
  "name" : "1409.3005.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "A Study of Association Measures and their Combination for Arabic MWT Extraction",
    "authors" : [ "Abdelkader El Mahdaouy", "Eric Gaussier" ],
    "emails" : [ "a.mahdaouy@hotmail.fr", "ouatik@yahoo.com", "eric.gaussier@imag.fr" ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "Automatic Multi-Word Term extraction is an important task in many Natural Language Processing (NLP) applications (Boulaknadel et al., 2008b; Wen et al., 2007). The aim of the MWT acquisition process is to extract specific domain terms from special language corpora (Korkontzelos et al., 2008). The extraction of MWTs is crucial for terminology acquisition, since they are less ambiguous and less polysemous than single word terms, and since their internal structure encodes useful semantic relations (Wen et al., 2008).\nThere are three main approaches to MWT extraction. The first one makes use of linguistic filters. The second one relies on statistical measures based on termhood and/or unithood. Termhood denotes “the degree to which a linguistic unit is related to a specific domain concept”, and unithood denotes “the degree of strength or stability of syntagmatic combinations or collocations” (Kageura et al., 1996). Lastly, the third approach is hybrid and combines the linguistic and the statistical approaches. Hybrid methods extract MWTs using linguistic filters and then rank the list of candidate MWTs according to statistical measures.\nIn this paper, we propose a novel, hybrid method for Arabic MWT extraction. Like other hybrid methods, it includes two main filters. In the first one, we use a part-of-speech (POS) tagger to extract candidate MWTs based on syntactic patterns. In the second one, we propose a novel statistical measure, the NLC-value, that unifies the contextual information and both termhood and unithood measures. We compare this measure to alternative ones in the task of MWT extraction : NTC-value (Vu et al., 2008), LLR+C-value (Al Khatib et al., 2010), C/NC-value and LLR.\nThe remainder of this paper is organized as follows. In the next section, Section 2, we present the related work. Section 3 describes the proposed method to extract MWTs. In Section 4, we present how MWT variation is handled in the proposed method. Section 5 describes the experimental validation and Section 6 concludes this work and presents some perspectives.\nar X\niv :1\n40 9.\n30 05\nv1 [\ncs .C\nL ]\n1 0\nSe p"
    }, {
      "heading" : "2 Related Work",
      "text" : "Several studies have been conducted on MWT extraction for many languages. These studies have either used a linguistic approach, a statistical approach, or a combination of them (hybrid approach). Most recent MWT extraction methods rely on a hybrid approach to efficiently extract MWTs, due to its higher accuracy compared to the two other approaches (Tadic et al., 2003). The linguistic approach uses technical analysis on the current knowledge of the language and its structure. There are two subcategories : approaches based on morpho-syntactic patterns (Daille, 1994) and those based on MWT boundary detection (Bourigault, 1994).\nThe main purpose of applying statistical methods for MWT extraction is to rank candidate terms based on a particular measure that gives higher scores to ”good” candidate terms. Candidate terms above a particular threshold are selected for further processing. The reliance on frequency is based on the simple assumption that a frequent expression indicates an important representation of the domain in question. Therefore, frequent expressions are assumed to represent important concepts. Given a candidate multi-word term, frequency only counts how often the candidate occurs in the text, but doesn’t give any information on the strength of the relationship between words composing the candidate multi-word term. Statistical approaches aim at extracting candidate terms from text corpora by means of association measures (Church et al., 1991) that concentrate on termhood and/or unithood to assign a score to candidate MWTs. These measures are based on frequency and co-occurrence information such as the T-score (Church et al., 1991), the loglikelihood ratio (LLR) (Dunning, 1994), the C/NCValue (Frantzi et al., 1998), etc.\nWhile linguistic approaches focus on syntactic structures, statistical methods focus on the recurrent characteristics of MWTs. Both have their advantages and limitations. As mentioned by Boulaknadel et al. (2008), statistical approaches “are unable to deal with low-frequency MWTs“ while pure linguistic approaches are “language dependent and not flexible enough to cope with complex structures of MWTs” . Hybrid methods try to combine linguistic and statistical techniques\nto extract MWTs in order to avoid the weaknesses of the two approaches.\nBoulaknadel et al. (2008) have relied on a hybrid method to extract Arabic MWTs. As a first step, candidate terms that fit syntactic patterns are extracted from the output of the part-of-speech (POS) tagging tool proposed by Diab (2004). In the second step, the list of candidate terms is ranked according to one of the following association measures : log-likelihood ratio (LLR), Mutual Information (MI), FLR, and T-score. These measures have been evaluated on an Arabic corpus and he results obtained show that LLR outperforms the other association measures.\nBounhass et al.(2009) have followed the same approach (using again Diab’s (2004) POS tagger and LLR) while focusing on compound nouns and thus using a more restricted set of syntactic patterns. For the bigrams, the obtained results outperform those obtained by Boulaknadel et al. (2008).\nA similar study has been conducted by Al Khatib et al. (2010), based on the POS tagger proposed by (Al-Taani et al. , 2009) and an association measure that combines both termhood and unithood through a combination of the C-value and the LLR. Experimental results show promising results for the combined measure.\nMost hybrid methods presented previously have been evaluated on 100 (best) candidate MWTs and deal with bi-grams (i.e. candidate MWTs of length 2). Moreover, they rely on LRR or a combination of LRR and C-value (Al Khatib et al., 2010) and ignore contextual information in the ranking step. To overcome this limitation, we introduce a new association measure that integrates contextual information and both termhood and unithood. Our overall approach is also hybrid and relies on the same linguistic filters as the ones used in the previous studies, based on syntactic patterns applied on the output of the POS tagger developed by (Diab, 2009)."
    }, {
      "heading" : "3 Proposed Method",
      "text" : "Our method for extracting MWT candidates comprises two major steps : the linguistic and the statistical filters."
    }, {
      "heading" : "3.1 Linguistic Filter",
      "text" : "The proposed linguistic filter extracts candidate MWTs based on two core components ; the POS tagger and the sequence identifier. In the literature, several methods for Arabic POS tagging systems have ben developed. We have used the one proposed by (Diab, 2009) as it performs at over 96% accuracy and allows a number of variable user settings. The underlying system uses Support Vector Machine (SVM). Figure (1) illustrates the global schema of our linguistic filter. As a first step, our\nmethod tags the corpus using the AMIRA toolkit (Diab POS Tagger) which is trained from the Penn Arabic TreeBank (PATB) to assign tags for each word in the corpus. Then, the sequence identifier tokenizes tagged files of the corpus and uses syntactic patterns in order to identify candidate terms that fit the rules of the grammar. We have extended the list of syntactic patterns used by Boulaknadel et al. (2008) as follows :\n– (Noun+(Noun|ADJ)+ |(Noun|ADJ)+ |(Noun|ADJ))\n– NounPrepNoun The second major step of the linguistic filter is handling the problem of MWTs variation to improve the effectiveness of extracted MWT candidates. Several categories of term variation are taken into account by this filter : graphical, inflectional, morpho-syntactic and syntactic variants, and are discussed in Section 4."
    }, {
      "heading" : "3.2 Statistical Filter",
      "text" : "In this step, we apply a number of statistical measures to rank the list of candidate MWTs extracted by the linguistic filter. The main objective of our statistical filter is to consider both termhood and unithood measures.\n3.2.1 The C-value The C-value measures the termhood of a candidate string on the basis of several characteristics : number of occurrences, term nesting, and term length. It is defined as :\nC-Value(a) = { log2(|a|) · f(a) if a is not nested, log2(|a|) · (f(a)− g(a)) otherwise\n(1)\nwhere |a| denotes the length in words of candidate term a, f(a) is the number of occurrences of a and :\ng(a) = 1 |Ta| ∑ b∈Ta f(b)\nwhere T (a) denotes the set of longer candidate terms into which a appears (|T (a)| is the cardinality of this set).\nAs one can note, if the candidate term is not nested, its score is solely based on its number of occurrences and length. If it is nested, then its number of occurrences is corrected by the number of occurrences of the terms into which it appears.\n3.2.2 The NC-value The NC-value combines the contextual information of a term together with the C-Value. The contextual information is calculated based on the Nvalue which provides a measure of the terminological status of the context of a given candidate term. It is defined as :\nNvalue (a) = ∑ b∈Ca fa(b) · |T (b)| n\n(2)\nwhere Ca denotes the set of distinct context words of a, fa(b) corresponds to the number of times b occurs in the context of a and n is the total number of terms considered. This measure is then simply combined with the C-value to provide the overall NC-value measure :\nNC−value(a) = 0.8·C−value(a)+0.2·Nvalue(a) (3)\n3.2.3 The NTC-value The aim of the NTC-value (Vu et al., 2008) is to incorporate a unithood feature, through the T-score, to the C/NC-value to improve its performance. The T-score measures the adhesion or differences between two words in a corpus of N words as follows :\nTs(wi, wj) = p(wi, wj)− p(wi) · p(wj)√\np(wi,wj) N\n(4)\nwhere p(wi, wj) corresponds to the probability of observing the bi-gram wi, wj in the corpus ; p(wi) is the probability of word wi in the corpus and corresponds to the marginal probability of p(wi, w). The T-score is integrated in the C/NC measures through a re-weighting of the number of occurrences that privileges terms with a positive T-score :\nF (a) = { f(a) if min(Ts(a)) ≤ 0 f(a) ln(2 + min(Ts(a))otherwise\n(5) where min(Ts(a)) corresponds to the minimum T-score obtained from all the word pairs in a. Substituting F (a) to f(a) in Equation 1 yields the TC-value, which is then combined with the Nvalue as before, leading to the NTC-value :\nNTC-value(a) = 0.8·TCvalue(a)+0.2·Nvalue(a) (6) The resulting metric (6) thus takes into account both contextual information and termhood and unithood measures.\n3.2.4 The NLC-value We follow here the same development as before but rely this time on the more accurate unithood feature LLR (Dunning, 1994), instead of the Tscore, for the combination with the C/NC-value (Frantzi et al., 1998). LLR is a ”goodness of fit” statistics that determines if the words in an observed n-gram come from a sample that is independently distributed (meaning they co-occur by chance) or not. The underlying measure is calculated for bi-grams by the following formula :\nLLR(wj , wj) = a log(a) + b log(b) + c log(c)\n+ d log(d)− (a+ b) log(a+ b) − (a+ c) log(a+ c)− (b+ d) log(b+ d) − (c+ d) log(c+ d) +N log(N)\nwith : a : number of terms in which wi and wj co-occur ; b : number of terms in which only wi occurs ; c : number of terms in which only wj occurs ; d : number of terms in which neither wi nor wj appear ; N : total number of extracted terms.\nFor terms that consist of more than two terms, we calculate the LLR for each big-ram and then consider the minimum value obtained. The number of occurrences of a term is now re-weighted by this minimum value : FL(a) = f(a) · ln(2 + min(LLR(a))) which is used instead of f(a) in the C-value, leading to the LC-value :\nLC-value(a) = { log2(|a|) · FL(a) if a is not nested, log2(|a|) · (FL(a)−GL(a)) else (7) with GL(a) = 1|Ta| ∑ b∈Ta FL(b)\nThis measure is then combined with the Nvalue as before, leading to the NLC-value that integrates contextual information and both termhood and unithood :\nNLC-value(a) = 0.8·LC-value(a)+0.2·Nvalue(a) (8)"
    }, {
      "heading" : "4 Term variation",
      "text" : "As mentioned in the previous section, we have handled the problem of term variation at the linguistic step. Our method takes into account four types of variations : graphical variants, inflectional variants, morpho-syntactic variants and syntactic variants. Graphical variants concern orthographic errors occurred in writing a particular letters (“ ”, “©” and “”) which are very common in Arabic. Furthermore, some letters go through a slight modification in writing, that doesn’t necessarily change the meaning of the word. For example, the letter “©” is replaced by another letter “«” at the end of a MWT, as for “¨¶Aymyk wlt ” which leads to ”Y¶Aymyk wlt “ meaning “chemical pollution”. Inflectional variants are due to the use of different forms for the words constituting a MWT ; these different forms are related to gender and number of adjectives, as in “Xy m wl ” (ocean pollution) and “ AWy m wl ” (pollution of the oceans) and to the presence/absence\nof a definite article, as in “£Ay wl ” (water pollution) and “£Aym wl ” (the water pollution). Morpho-syntactic variants affect the internal structure of term as the words it contains are related through derivational morphology. Two patterns control this type of variation in Arabic MWTs :\n– Noun1Noun2 ⇔ Noun1Adj : wl ” “º wh and “¨¶ wh wlt ” (“air pollution”). – Noun1Adj ⇔ Noun1PrepNoun : “¨Wf y r ” and “Xfn y r ” (“barrel of oil”). We treat these three types of variations by using normalization method and the light stemming algorithm described in (Larkey et al., 2007) on each word of each MWT candidate.\nSyntactic variants modify the internal structure of the MWT candidate by adding one or more words (as adjectives) but do not affect the grammatical categories of the content words of the original MWT candidate. Such variants can be identified, for a given MWT candidate, by searching for all the stemmed MWT candidates that contain it. All the elements that constitute an addition to the original MWT candidate are then considered as context terms."
    }, {
      "heading" : "5 Experiments and Results",
      "text" : ""
    }, {
      "heading" : "5.1 The Corpus",
      "text" : "Since there is no standard domain-specific Arabic corpus, we have built, in order to evaluate our approach, a new corpus specialized on the environmental domain with similar properties as the ones described (Boulaknadel et al. , 2008; Bounhas et al., 2009; Al Khatib et al., 2010).\nThe corpus built contain 1666 files comprising 53569 different tokens (without stop words) extracted from the Web site “Al-Khat Alakhdar” 1. It covers various environmental topics such as pollution, noise effects, water purification, soil degradation, forest preservation, climate change and natural disasters."
    }, {
      "heading" : "5.2 Evaluation and Results",
      "text" : "The evaluation of automatic MWTs extraction is a complex process and is usually performed by comparing each MWT candidate extracted to\n1. http ://www.greenline.com.kw\na domain-specific reference list. When there is no reference list available in the language retained, one can first translate the MWT candidates (using a machine translation system or a bilingual dictionary) and use a reference list available in another language. For the evaluation purpose, we have constituted automatically a reference list of all Arabic MWTs available in the latest version of AGROVOC 2 thesaurus and then use the stemming algorithm to remove prefixes and suffixes for each MWT in the reference list and the extracted MWT list. The next step consists of using an algorithm that considers a MWT candidate as correct if it is included in this list, noting that the MWT candidate and the term in the reference list should have the same number of stemmed words. Otherwise, we translate it and consider it as relevant whether its translation is contained in the European terminological database IATE 3. Finally, the precision is calculated using the number of attested MWTs and the number of considred terms.\nWe computed the association scores (LLR, C-value, NC-value, NTC-value, LLR+C-value, NLC-value) for the MWT candidates and retain from each produced ranking for each statistical measure the k-best candidates, with k ranging from 100 − 300 at intervals of 100. The experimental results illustrated in table 1 show that our method (NLC-value) outperforms the previous methods in term of the quality of the extracted MWTs.\nFurthermore, the combination of the context information and the C-value improves the performance of the process of MWT extraction because the NC-value outperforms the C-value for each\n2. www.fao.org/agrovoc/ 3. http ://iate.europa.eu/iatediff\nconsidered MWT list. The unithood feature LLR outperforms the C/NC-value as expected from previous studies. Figure 2 illustrates the precision obtained for the C/NC-value and the LLR.\nThe integration of contextual information and the T-score unithood measure to the C-value improves the performance of MWT acquisition, since the NTC-value has better precision than the C/NC-value, as illustrated in Figure 3.\nLastly, the combination of termhood and unithood measures (NTC-value, LLR + C-value, NLC-value) is essential for MWT extraction, since all the measures based on this combination perform better than measures using only termhood or unithood (C-value, NC-value, LLR). We note that the statistical measure we have propose, NLC-value, outperforms all other measures. This measure is based on the accurate unithood feature LLR, combined with the NC-value. The\nNLC-value method takes advantages from previous works proposed in (Vu et al., 2008) and (Al Khatib et al., 2010) taken into account contextual information and both termhood and unithood association measures. Figure 4 presents a comparaison of the precision for different statistical measures that combine termhood and unithood.\nThe number of different terms evaluated are 1095 amongst other 1800 terms, moreover the statical measures share 141 terms. The tables 2 and 3 represent the number of terms found in agrovoc and IATE respectively."
    }, {
      "heading" : "6 Conclusion",
      "text" : "In this work, we have presented a hybrid method for Arabic MWT acquisition ; this method takes advantage of existing linguistic and statistical approaches. As a first step, we apply linguistic filters to extract MWT candidates based on syntactic patterns using a sequence identifier component. Then, MWT variants are identified through a morphological analysis of he extracted MWTs based on light stemming. In the statistical step, we\nhave proposed a novel statistical measure, NLCvalue, that consists of ranking MWT candidates by considering contextual information and both termhood and unithood statistical measures.\nExperiments are performed for bi-grams and tri-grams on an environment Arabic corpus. The experimental results show that our method outperforms the previous ones in term of quality of the extracted MWTs. In conclusion, the combination of the best association measures that integrate contextual information and both termhood and unithood statistical measures improves the performance of the MWT acquisition process.\nIn a near future, we plan on using the extracted MWTs in an information retrieval system as complex terms often constitute a better representation of the content of a document than single word terms."
    } ],
    "references" : [ {
      "title" : "Al-Taani A, and Abu-Al-Rub S",
      "author" : [ "Al-Taani" ],
      "venue" : null,
      "citeRegEx" : "Al.Taani,? \\Q2009\\E",
      "shortCiteRegEx" : "Al.Taani",
      "year" : 2009
    }, {
      "title" : "Using statistics in lexical analy",
      "author" : [ "D. Hindle" ],
      "venue" : null,
      "citeRegEx" : "Hindle,? \\Q1991\\E",
      "shortCiteRegEx" : "Hindle",
      "year" : 1991
    }, {
      "title" : "The C-Value/NC-Value Method",
      "author" : [ "T. Tsujii" ],
      "venue" : null,
      "citeRegEx" : "Tsujii,? \\Q1998\\E",
      "shortCiteRegEx" : "Tsujii",
      "year" : 1998
    }, {
      "title" : "Ti",
      "author" : [ "T Vu", "A Aw" ],
      "venue" : "and Zhang M.",
      "citeRegEx" : "Vu et al.2008",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "Yoshida T",
      "author" : [ "Z Wen" ],
      "venue" : "and Xijin T.",
      "citeRegEx" : "Wen et al.2007",
      "shortCiteRegEx" : null,
      "year" : 2007
    }, {
      "title" : "Yoshida T",
      "author" : [ "Z Wen" ],
      "venue" : "and Xijin T.",
      "citeRegEx" : "Wen et al.2008",
      "shortCiteRegEx" : null,
      "year" : 2008
    } ],
    "referenceMentions" : [ ],
    "year" : 2014,
    "abstractText" : "Automatic Multi-Word Term (MWT) extraction is a very important issue to many applications, such as information retrieval, question answering, and text categorization. Although many methods have been used for MWT extraction in English and other European languages, few studies have been applied to Arabic. In this paper, we propose a novel, hybrid method which combines linguistic and statistical approaches for Arabic Multi-Word Term extraction. The main contribution of our method is to consider contextual information and both termhood and unithood for association measures at the statistical filtering step. In addition, our technique takes into account the problem of MWT variation in the linguistic filtering step. The performance of the proposed statistical measure (NLC-value) is evaluated using an Arabic environment corpus by comparing it with some existing competitors. Experimental results show that our NLC-value measure outperforms the other ones in term of precision for both bi-grams and tri-grams.",
    "creator" : "LaTeX with hyperref package"
  }
}