{
  "name" : "1409.8008.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "CRF-based Named Entity Recognition @ICON 2013",
    "authors" : [ "Arjun Das", "Utpal Garain" ],
    "emails" : [ "@ICON", "arjundas.cs@gmail.com", "utpal@isical.ac.in" ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "In the field of NLP (natural language Processing) and IR (information Retrieval) mostly in Questionanswering, Named Entity Recognizer (NER) used to play a crucial role. Unlike English, development of an NER system is difficult for most of the Indian languages due to some inherent problems. For example, there exist some named entities, each of which has a valid dictionary entry. There also exists some language processing challenges, for example, there is no capitalization information, free-word ordering structure and inflectional nature of many Indic languages. Furthermore, gazetteers play an important role for developing a practical NER system. But, building well diversified gazetteers a hard and time consuming work.\nHence, development of a practical NER system is still an active and challenging area of research. Though there are some research works on developing NER system for Indian languages but more research is indeed needed to develop a better insight of the problem and thereby making a practical system. Previously IJCNLP 2008 [IJCNLP, 2008] has organized NER shared task in Indian languages (Hindi, Bengali, Punjabi, Oriya, Telugu, Urdu and English). The task involves NE's detection up to three levels. The system with first position is a hybrid [Saha et al., 2008] one, which has applied maximum entropy model for the first level NE's detection and language specific rules to identify the nested levels. In this task Ekbal et al. [Ekbal et al., 2008] have applied CRF for NE detection."
    }, {
      "heading" : "2 Training and Test Data",
      "text" : "ICON has provided us the training, development and test data (in the ratio of 8:1:1) for the shared task for the Indian languages namely Hindi, Bengali, Punjabi, Telugu, Urdu and English. The details of the dataset are provided in the table 1."
    }, {
      "heading" : "3 CRF-based NE's Detection",
      "text" : "We have applied Conditional Random Field (CRF's) [Lafferty et al., 2001] for predicting the class lebel in the Named Entity Recognition task. In our experiment, we have used the CRF++1, an open-source package. We have used different combination of language independent features [Ekbal et al., 2008] and finally selected those features for which we get the highest accuracy on a development set. Following are the details of the features used in NE detection task:\n• Context Words: The previous and next word of a particular word.\n• Word Prefix and Suffix: We have considered word prefix and suffix from 3 character length to 5 character length for all NNP's.\n• POS and Chunk Information: We have used POS and Chunk information of a particular word as a feature.\n• First and Last Words: We have used the first word of a sentence and the last word i.e. (n-1)th token of the sentence as a feature.\n• Digit: This is a binary valued feature which has been defined depending upon the presence or absence of a digit in a token.\n• Token ID: This is a real valued feature which represents the current token id. This feature provides useful information about the position of the NE tag.\n• Associated Verb: This feature provides the information about the nearest verb for all token. This feature is useful for differentiation between PERSON and LOACATION tag.\n• Gazetteers: We have applied person names gazetteers for English, Bengali and Hindi. We have mined person names automatically from Wikipedia [Garain et al., 2012]. And a manually build gazetteers of Location names is applied to Bengali\n1CRF++ is available at : http://crfpp.googlecode.com/svn/trunk/doc/ind ex.html?source=navbar\nand English. • Capitalization: For English we have\napplied this features. This is also a binary feature, which indicate the presence and absence of a capital letter in the first letter of the word."
    }, {
      "heading" : "4 Results and Error Analysis",
      "text" : "The result of the ICON-2013 shared task is provided in the Table 2. From the results we can say that gazetteers are very helpful to boost the performance of an NER. As we have usesd gazetteers for Bengali, Hindi and English, their preformences seem to be much better with respect to Tamil and Telegu for which we did not use any gazetteers."
    }, {
      "heading" : "5 Conclusion",
      "text" : "The goal of this experiment was to rapidly develop NER for Indic languages. It is experienced that CRF based approach can achieve this goal with limited accuracy. It is experienced that the role of gazetteer is equally important for Indic languages as it is for English. It is true that building diversified gazetteers is time consuming and laborious work but some tricks like use of wiki names, telephone e-directories, who’s who lists, etc. may help to create gazetteers without much manual intervention. We have exercised this aspect in the present experiment and succeeded to improve the system’s performance. However, more language processing might be needed to capture an NE which is basically a valid dictionary word. Use of some shallow parsing technique could be of some help for this purpose. We plan to exercise this in future."
    }, {
      "heading" : "Acknowledgments",
      "text" : "We would like to thanks the organizers of ICON2013 NER Tool Contest."
    } ],
    "references" : [ {
      "title" : "Conditional random fields: Probabilistic models for segmenting and labeling sequence data",
      "author" : [ "John D. Lafferty", "Andrew McCallum", "Fernando C.N. Pereira" ],
      "venue" : "Proceedings of the International Conference on Machine Learning (ICML’01). PP: 282–",
      "citeRegEx" : "Lafferty et al\\.,? 2001",
      "shortCiteRegEx" : "Lafferty et al\\.",
      "year" : 2001
    }, {
      "title" : "Leveraging Statistical Transliteration for Dictionary-Based English-Bengali CLIR of OCR'd Text",
      "author" : [ "Utpal Garain", "Arjun das", "David S. Doermann", "Douglas W. Oard" ],
      "venue" : null,
      "citeRegEx" : "289",
      "shortCiteRegEx" : "289",
      "year" : 2012
    }, {
      "title" : "A Hybrid Named Entity Recognition System for South and South East Asian Languages",
      "author" : [ "S.K. Saha", "S. Chatterji", "S. Dandapat", "S.Sarkar", "P. Mitra" ],
      "venue" : "Proceedings of the Workshop on Named Entity Recognition for In Proceedings of the Workshop on",
      "citeRegEx" : "Saha et al\\.,? 2008",
      "shortCiteRegEx" : "Saha et al\\.",
      "year" : 2008
    }, {
      "title" : "Language Independent Named Entity Recognition in Indian Languages",
      "author" : [ "A. Ekbal", "R Haque", "A. Das", "V. Poka" ],
      "venue" : "Proceedings of the Workshop on NER for SASEAL in IJCNLP-08, India. PP: 43-50.",
      "citeRegEx" : "Ekbal et al\\.,? 2008",
      "shortCiteRegEx" : "Ekbal et al\\.",
      "year" : 2008
    } ],
    "referenceMentions" : [ {
      "referenceID" : 2,
      "context" : "The system with first position is a hybrid [Saha et al., 2008] one, which has applied maximum entropy model for the first level NE's detection and language specific rules to identify the nested levels.",
      "startOffset" : 43,
      "endOffset" : 62
    }, {
      "referenceID" : 3,
      "context" : "[Ekbal et al., 2008] have applied CRF for NE detection.",
      "startOffset" : 0,
      "endOffset" : 20
    }, {
      "referenceID" : 0,
      "context" : "We have applied Conditional Random Field (CRF's) [Lafferty et al., 2001] for predicting the class lebel in the Named Entity Recognition task.",
      "startOffset" : 49,
      "endOffset" : 72
    }, {
      "referenceID" : 3,
      "context" : "We have used different combination of language independent features [Ekbal et al., 2008] and finally selected those features for which we get the highest accuracy on a development set.",
      "startOffset" : 68,
      "endOffset" : 88
    } ],
    "year" : 2013,
    "abstractText" : "This paper describes performance of CRF based systems for Named Entity Recognition (NER) in Indian language as a part of ICON 2013 shared task. In this task we have considered a set of language independent features for all the languages. Only for English a language specific feature, i.e. capitalization, has been added. Next the use of gazetteer is explored for Bengali, Hindi and English. The gazetteers are built from Wikipedia and other sources. Test results show that the system achieves the highest F measure of 88% for English and the lowest F measure of 69% for both Tamil and Telugu. Note that for the least performing two languages no gazetteer was used. NER in Bengali and Hindi finds accuracy (F measure) of 87% and 79%, respectively.",
    "creator" : "Writer"
  }
}