{
  "name" : "1502.02655.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "An investigation into language complexity of World-of-Warcraft game-external texts",
    "authors" : [ "Simon Šuster" ],
    "emails" : [ "s.suster@rug.nl" ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "In computer-assisted language learning, there is a relatively substantial body of work relating to the ways and possible usefulness of including video games in the language learning process. Thus, types and characteristics of in-game communication, the social interaction, and dynamics and communication patterns between gamers are well described. However, very little research has been done on the properties of the text production itself in games and of gaming community. In our opinion, the potential of games for language learning has been largely overlooked by educators, and by researching this language more intensively – both its social aspects and on large collections of texts – we can get to know more precisely in what ways the gaming language can be useful in language learning.\nThis paper focuses on a massively multi-player online game (MMOG), namely World of Warcraft (WoW).1 This research focuses on describing automated ways for analysis of language production of the WoW community and potential problems associated with these techniques. Naturally, various measures can be adopted to determine language complexity. Here, we use measures of lexical richness, lexical density, readability and syntactic complexity. We include in our analysis only game-external texts, which we compare to general English on the web."
    }, {
      "heading" : "2 Background: games as a language-learning tool",
      "text" : "MMOGs are game worlds characterized by its online character, meaning that gamers can interact not only with the game software but also with other players. Collaboration takes place and can be observed both outside the game in various discussion fora and fan sites, and in the game itself. Gaming in the MMOGs is cognitively demanding; it involves exploration of complex problem spaces, constructing and analyzing models, and negotiating meaning within the gaming community; it involves coordinating people, virtual tools and artifacts, and it is also characterized by various forms of texts [1].\n1It is one of the most popular online games ever with presently around 8 million subscribers (see bit.ly/ NCMe4E).\nar X\niv :1\n50 2.\n02 65\n5v 1\n[ cs\n.C L\n] 7\nF eb\nThorne [3] and Thorne et al. [4] looked at the intercultural communication in massively multi-player online games, especially WoW. They notice that WoW is played in language-specific domains that concentrate together speakers of the same language. The advantage of this is that after installing a language pack, the game setting and most probably gamers as well will be language specific. However, this may have the disadvantage of hindering multilingual communication in the game. Thorne [3] provides a case study in which two gamers with different levels of gaming proficiency exchange expert knowledge, language-specific explicit corrections and requests for help. Involving in games often results in increased motivation for L2 learning, as also noted by Thorne.\nThe work most similar to ours is Thorne et al. [2], an exploratory study of linguistic quality and complexity of both internal and external texts of the WoW. By analyzing the complexity of texts gamers engage with, the authors aim to ascertain the relevance of MMOGs for L2 development. In comparison to Thorne et al., our work has a narrower focus and differs in that: a) we provide additional details from the computational analysis of gaming texts, i.e. we also investigate lexical density and fit a probabilistic model for vocabulary growth rate, and b) we contrast the complexity of game texts to diverse web texts from a reference corpus of English.\nRankin et al. [5] claim that MMOGs, especially their role-playing sub-type, are particularly important for language learning because they represent immersive environments allowing fully-fledged experience of a virtual world. They also abound with possibilities for social interaction, they are motivating and they create a virtual world as the context where language students concentrate on accurate and coherent language use, develop and test their practices. Gee [8] sees the language use in games as one developing a complex specialist language, by which children develop their “islands of expertise”. Rankin et al. [6] and Bryant [7] report on successful inclusion of game-related activities in school curricula.\nHere, we do not include in the discussion the educational and conversation games.2 The availability of truly engaging educational games is as of today still limited [9].\nIn this section, we have reviewed the literature that deals mostly with the social aspects of language learning in games. In the next section, we move on to discuss the array of techniques used in this paper to describe the text production of the WoW gaming community."
    }, {
      "heading" : "3 Measuring language complexity",
      "text" : "We first treat the measures emphasizing lexical aspects of language production, and then present a couple of measures that take into account syntactic complexity."
    }, {
      "heading" : "3.1 Lexical measures",
      "text" : "Lexical diversity Lexical diversity measures the size of vocabulary in a text or of an author. It is often used for describing and predicting vocabulary growth [10]. Intuitively, lexical diversity should be quantifiable in terms of different word types. Since this measure is known to depend heavily on text size, number of tokens are also taken into account. A measure using these two types of information is type-token ratio (TTR). However, even TTR is dependent on the text size: it is bigger when texts are small and decreases as the texts get larger. Due to this fact, the comparison is warranted only on same-sized texts or using statistical approximations (corrected ratios) that take this into account, or using probabilistic models. There exist several corrected measures, like Herdan’s C, Guiraud’s R, Yule’s K and others [10]. But since the within-text variability can be large (words are not used randomly), these measures may not be precise at differing sizes of text samples, as shown by Tweedie and Baayen [11]. Similar applies to probabilistic models, such as Sichel’s generalized inverse Gauss-Poisson model and Zipf-Mandelbrot models [12, 11]. Especially the latter performed reasonably well and proved length-invariant in the Tweedie and Baayen’s [11] research. These are also called models for Large Number of Rare Events (LNRE) distributions.\nA simple transformation of TTR is mean segmental type-token ratio (MSTTR), calculated by first computing TTR on same-sized text samples, e.g. of 50 tokens, and then taking the mean [13]. As\n2Such as the open-world adventure game Bot Colony (www.botcolony.com) which encourages user participation in conversation, provides corrective feedback etc.\nthe mean here drowns out the individual differences in samples, all sample-TTRs can be plotted to illustrate the ratio values changing as a function of the position in text.\nLexical density Lexical density has been shown to correlate strongly with lexical diversity [14]. It measures the proportion of content, or lexical, words (verbs, nouns, etc.) to the total number of tokens, and it is an indicator of information packaging in the text. It is not trivial to operationalize the definition of lexical density. First, one should decide what counts as a lexical word. Usually, lexical words are said to occur in closed word classes, like nouns, but there is some controversy, for example, whether it makes sense to count some adverbs as lexical or non-lexical words. Secondly, an example like “turn up” may consist of a lexical word and a non-lexical function word. A slightly more advance system could count phrases as a single lexical item, see Johansson [14] for further discussion.\nReadability Readability formulas try to estimate the degree of text difficulty. There are over 200 of such formulas [15]. Many of those include a combination of sentence complexity – usually mean length of the sentence – and word complexity measures – usually average number of syllables or characters per word, or the proportion of complex words. Lu et al. [13] predict appropriate grade levels of school reading materials successfully with Flesch Reading Ease, Coleman-Liau and New Dale-Chall Readability formulas. Flesch Reading Ease, the formula used in this research, is a function over the number of both syllables and sentences. The reading ease is predicted on a scale from 0 to 100, with 30 being very difficult and 70-and-up being easy. The index is calculated by: Flesch Reading Ease = 206.835−1.015(NWords/NSentences)−84.6(NSyllables/NWords). A modified formula to produce a US grade-level score is called Flesch-Kincaid: Flesch-Kincaid = 0.39(NWords/NSentences) + 11.8(NSyllables/NWords)− 15.59"
    }, {
      "heading" : "3.2 Syntactic-complexity measures",
      "text" : "The simplest measure of syntactic complexity (or rather its proxy) is the mean length of sentences. Although insensitive to structural differences within sentences, it turns out as a reliable indicator of grade level [13]. There exist more complex measures that define the developmental level of the sentences (D-level, DSS scoring, IPSyn) [13], and descriptive techniques, such as comparing the frequencies of POS tags for the most common n-grams between two texts [17], capable of qualitatively accounting for differences in frequency of syntactic constructions in texts. D-level, used in this paper, originates in the child language acquisition research and follows the premise that the most complex sentence types are acquired last [18]. According to Cheung and Kemper [19], D-level is a more adequate index of sentence complexity than other metrics since it is able to differentiate between types of clausal embedding."
    }, {
      "heading" : "4 Experimental setup",
      "text" : "Gathering data We construct a corpus of texts from WoW fora, wikis and, to a lesser extent, news. The compilation was carried out with the BootCat toolkit [20]. The corpus contains 261,000 tokens from 196 URLs. The second corpus used as benchmark is the ukWaC [21]. This corpus was built from diverse web-based texts by querying the .uk Internet domain. The original size of ukWaC is 1.9 billion tokens, from which we sample 261,000-token worth of sentences. The raw corpora were lemmatized and POS-tagged with TreeTagger [22].\nProcessing data In this research, the following measures were calculated: TTR; MSTTR; N, V and Adj density; Flesch Reading Ease and Flesch-Kincaid indices; Mean sentence length; and D-level (only for the WoW corpus). In addition, we fit a LNRE model to the data, which allows comparison of differently sized texts (although not strictly needed here) by interpolation (for smaller samples) or extrapolation (for larger samples).\nFor fitting and plotting probability models, the zipfR package [12] was used. All the measures listed above, except D-level, were calculated in R using the koRpus package [23]. For testing significance of the difference between the two corpora in vocabulary size and vocabulary growth, Z-statistic from languageR [24] package was used.3 When comparing different distributions, as in the case of TTR\n3The variance here is estimated internally by fitting an LNRE model to two texts with a χ2 test.\non text samples and Flesch Reading Ease index on samples, the Kolmogorov-Smirnov test was used to determine the significance of separation between two distributions, cf. Baayen [10].\nD-level scores were calculated with D-Level Analyzer4 [25]. The analyzer required POS tagging of raw texts using Penn Treebank tagset and also syntactic annotation with the Collins’ parser. Due to some incompatibilities between POS-tag scheme and the parser, syntactic analysis was was often erratic, and some issues remained unresolved such as long sentences returning errors when parsed. We therefore included only 2209 sentences (out of 14491) in the analysis."
    }, {
      "heading" : "5 Results",
      "text" : ""
    }, {
      "heading" : "5.1 Lexical diversity",
      "text" : "The table (1) shows main results for WoW and ukWaC corpora. The type-token ratio for the entire ∼230,000-token5 WoW corpus is .09, while the TTR for the ukWaC corpus is 0.12. In other words, the probability of encountering a new type at the end of the WoW corpus is 9 per cent, and in ukWaC, this is only 3 per cent more likely.\nHowever, having just one ratio value for the entire corpus only gives us a rough picture. To reveal the distribution of TTRs on smaller samples, the mean-segmental TTR was also calculated on samples of 100 tokens. Thus, the MSTTR (mean of 2,300 samples) for the WoW corpus is .73, and .74 for ukWaC. Thus, on average, the probability of encountering a new type after a 100-token sample is 73 per cent, and only 1 per cent higher in ukWaC. Since MSTTR is a mean summary of TTRs of samples, it is useful to show the dispersion of the values graphically by estimating the density curve (cf. [10]).\nuniform, i.e. the curve on the graph has a higher and narrower peak. This difference is summarized by standard deviation, SDWoW = .087; SDukWaC = .059. We can attribute these results to greater vocabulary variation in WoW corpus texts, i.e. more texts with lower vocabulary size, but they can also be explained by peculiarities of sampling web texts for WoW corpus.6 The difference between the distributions was statistically significant p < .001 (Kolmogorov-Smirnoff D = .1)."
    }, {
      "heading" : "5.2 Probabilistic model",
      "text" : "Sometimes, it may also be interesting or necessary to look at the vocabulary growth rate, because texts may include the same number of types, but with a different rate of occurrence of unseen types [10]. More broadly, introduction of new types, or counting the hapax legomena in a sample, is indicative of how productive the language or particular facets of language are.\nIn our case, the vocabulary growth rate is estimated by the ratio of the number of hapax legomena to the number of tokens. The results of the growth test for the two corpora are growth.rateWoW = .033, growth.rateukWaC = .059. The difference between the results was determined with the Zstatistic, and was significant with p being effectively 0 (Z = −50.2). Since the size of the compared corpora is the same, the growth rate essentially tells us that there are much less (almost by half) hapaxes in the WoW corpus than in the ukWaC. This finding can be explained by the nature of the corpora: ukWaC is a general, broad-coverage corpus, while WoW is a specialized, one-domain corpus, so a smaller number of new types is introduced. Graphs 3 show the vocabulary growth, i.e. the number of new types encountered when moving linearly through the corpus. The dotted line shows observed counts, and the smooth line the expected values, where its solid part indicates interpolated values and the dashed part extrapolated values. For both corpora, we can see that the expected curve is not very accurate. In these graphs, we fitted the inverse generalized Gauss-Poisson model to the data, which yielded a closer fit than the Zipf-Mandelbrot models, but the result is still not satisfactory: observed curves are mostly high above the curve of expected values; also, new types are sampled more slowly than expected if words were used randomly: the observed curve is under the expected one for around 40,000 tokens in WoW and 100,000 tokens in ukWaC, but following these tokens, the expected growth is clearly underestimated. These two observations may be due to the heavy use of topical words when the discourse is cohesive (words are not randomly chosen in a cohesive discourse), but new texts are constantly being introduced when we move from the beginning\n6E.g. repetitions in internet fora (referring to others’ posts) leading to more samples having lower TTR.\nto the end of the corpus, which may explain the consistent introduction of more and more new types (note how the distance between observed and expected increases).\nAnother noticeable fact is that the observed curve for WoW is less smooth than for ukWaC. Such sharp shifts in the curve are unlikely to occur in “normally” structured cohesive texts. A possible reason is an inaccurate sampling procedure. From what we have noted in this section, it would be impossible to accurately predict the number of hapax (new types), dis-, etc. legomena for larger or smaller samples based on extrapolated or interpolated values."
    }, {
      "heading" : "5.3 Lexical density",
      "text" : "Lexical density was computed separately for nouns, verbs and adjectives (table 1), but cumulatively for all texts in each corpus. The proportion of nouns (excluding proper nouns) is .16 in both corpora. There are fewer verbs, .14 and .15 out of all tokens for WoW and ukWaC, respectively. The difference is bigger for the proportion of adjectives, .06 and .08. These data suggest that there is the same amount of words carrying “nominal” information, whereas the WoW corpus contains smaller proportions of verbs and adjectives. This can be interpreted as the communication in WoW texts being closer to spoken, and ukWaC texts closer to written language, although the difference is minimal. The observation that spoken texts tend to have lower lexical density was made already by Halliday [26]."
    }, {
      "heading" : "5.4 Readability",
      "text" : "The Flesch Reading Ease index was calculated on 1000-token samples. From graph (2), it can be seen that the results look considerably different. The values for WoW texts are more uniform, while the ukWaC values show greater dispersion, SDWoW = 7.6; SDukWaC = 13. This is not surprising, since ukWaC contains more diverse and genre-rich texts with varying degrees of readability. Compared to ukWaC, WoW corpus is then a homogeneous mass with most texts having similar readability. The difference between the means of Flesch scores for two corpora is 13 points, MWoW = 70; MukWaC = 57. This difference is significant at p < .001 (D = .52). By FleschKincaid grading system, this finding means that WoW texts are 2.2-grade levels below the ukWaC corpus, MWoW = 7.8; MukWaC = 10. Flesch’s classification (table 5 in Appendix) of readability of adult reading materials puts these results into a wider perspective. Thus, WoW texts can be described as “standard-style”, understood on average by ∼83% of US adults.7 ukWaC texts are characterized as “fairly difficult”, presumably understood on average by 54% of US adults. The Flesch-Kincaid score of 7.8 for WoW sets its texts at the reading level of the age group 12–14 and higher.8\n5.5 Sentence length\nThe Flesch index, as mentioned before, already incorporates one syntactic information, i.e. the mean sentence length. There are on average 19 words per sentence in WoW texts (see table 2), and two words more in an average ukWaC sentence. According to the table (5), the score for the WoW texts corresponds to style categories “standard” and “fairly difficult”."
    }, {
      "heading" : "5.6 D-level",
      "text" : "The summary results for the D-level of 2209 WoW sentences are MWoW = 3.45;SDWoW = 7.6. Here, it is more interesting to look at the distribution of scores, which resembles a U-shape. In graph 4, most sentences can be described either as level 0 or 7. There are 800 simple sentences and a roughly equivalent number of very complex sentences. This result is in line with the D-level distribution of scores on the game-internal “quest” texts in Thorne et al. [2]. Our results need to be taken with a certain amount of reserve, however, due to the fact that upon manual inspection, several lists, incoherent productions, and errors from parsing and tagging were found. D-0 sentence are thus likely to be over-represented. 714 sentences were analyzed as complex, i.e. containing\n7Of course, this is only a very rough estimate due to datedness of the Flesch’s research on readability. 8In other words, for students of US middle schools (or European secondary schools).\nmore than one structure from the level 1-6. Other sentences at the bottom of this distribution were characterized as sentences with subordinating conjunctions and non-finite clauses in adjunct position (215); sentences with relative clauses modifying verb object, finite clauses as verb objects and a few other types (167); sentences with conjoined constructions and co-ordinations (148) (see table 6 in Appendix for a detailed description of levels). Levels 1, 4 and 6 were rather infrequent, which could be attributed to how the categories were formed – each is a rather narrow category (subject nominalizations, appositions, non-finite complements with own subjects, . . . )."
    }, {
      "heading" : "6 Conclusion",
      "text" : "In this paper, we have presented a brief language-complexity description of the WoW-community texts, and compared those results to the general web corpus ukWaC. Overall, results show that the language production in the WoW corpus is slightly less complex, but not for all measures. Both corpora display the same amount of information packaged in nouns, but the WoW language can be described as more spoken-like, because its lexical density is lower in general. The lexical diversity as measured by TTR on samples reveals that the vocabulary size between texts in the WoW corpus differs to a larger extent than between texts in ukWaC, but on average, WoW texts reach a lower lexical diversity. The readability analysis showed that WoW texts form a homogeneous group with less dispersion than ukWaC texts. On the basis of readability score and average sentence length, the WoW texts can be described as intermediate or “standard-style” texts, appropriate for use with the 12–14 year-old students or older. The analysis of developmental levels, which enabled syntactic analysis of types of sentence embeddings, showed that for the most part, sentence production is either very simple or very complex. To sum up, our analysis shows very diverse results, reflecting the reality of the WoW-community language. Although the ukWaC scores mostly suggest a slightly more complex language, this is understandable since a greater variety of texts is collected in ukWaC than in the WoW corpus. Latter is a corpus of a fairly narrow-scope, technical language (cf. [8]).\nFurther work This study looked at game-external texts, however internal texts and fan fiction are two types of texts that could reveal a different picture than the one presented here. Especially promising avenue for future research is syntactic analysis. A deeper analysis could allow us to examine the most salient constructions (see 3.2). In this research, we chose a general web corpus as a point of comparison for WoW texts, yet other text types could be used, depending on the research aim. By looking for example at academic English, one could research how the complexity of WoW texts compares to the learners’ language production in formal settings."
    } ],
    "references" : [ {
      "title" : "Cognition and literacy in massively multiplayer online games",
      "author" : [ "C.A. Steinkuehler" ],
      "venue" : "In Handbook of Research on New Literacies,",
      "citeRegEx" : "1",
      "shortCiteRegEx" : "1",
      "year" : 2008
    }, {
      "title" : "The semiotic ecology and linguistic complexity of an online game world",
      "author" : [ "S.L. Thorne", "I. Fischer", "X. Lu" ],
      "venue" : "ReCALL Journal,",
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 2012
    }, {
      "title" : "Transcultural communication in open internet environments and massively multiplayer online games",
      "author" : [ "S.L. Thorne" ],
      "venue" : "In Mediating Discourse Online,",
      "citeRegEx" : "3",
      "shortCiteRegEx" : "3",
      "year" : 2008
    }, {
      "title" : "Second language use, socialization, and learning in internet interest communities and online games",
      "author" : [ "S.L. Thorne", "R.W. Black", "J. Sykes" ],
      "venue" : "Modern Language Journal,",
      "citeRegEx" : "4",
      "shortCiteRegEx" : "4",
      "year" : 2009
    }, {
      "title" : "Playing for keeps: gaming as a language learning tool",
      "author" : [ "Y. Rankin", "R. Gold", "B. Gooch" ],
      "venue" : "In ACM SIGGRAPH 2006 Educators program,",
      "citeRegEx" : "5",
      "shortCiteRegEx" : "5",
      "year" : 2006
    }, {
      "title" : "User centered game design: evaluating massive multiplayer online role playing games for second language acquisition",
      "author" : [ "Y. Rankin", "M. McKenzie", "M.W. Shute", "B. Gooch" ],
      "venue" : "In Proceedings of the 2008 ACM SIGGRAPH symposium on Video games,",
      "citeRegEx" : "6",
      "shortCiteRegEx" : "6",
      "year" : 2008
    }, {
      "title" : "Using world of warcraft and other mmorpgs to foster a targeted, social, and cooperative approach toward language learning",
      "author" : [ "T. Bryant" ],
      "venue" : null,
      "citeRegEx" : "7",
      "shortCiteRegEx" : "7",
      "year" : 2006
    }, {
      "title" : "Good video games + good learning: collected essays on video games, learning, and literacy. New literacies and digital epistemologies",
      "author" : [ "J.P. Gee" ],
      "venue" : null,
      "citeRegEx" : "8",
      "shortCiteRegEx" : "8",
      "year" : 2007
    }, {
      "title" : "Beyond façade: Pattern matching for natural language applications",
      "author" : [ "B. Wilcox" ],
      "venue" : null,
      "citeRegEx" : "9",
      "shortCiteRegEx" : "9",
      "year" : 2011
    }, {
      "title" : "Analyzing linguistic data: A practical introduction to statistics using R",
      "author" : [ "R.H. Baayen" ],
      "venue" : null,
      "citeRegEx" : "10",
      "shortCiteRegEx" : "10",
      "year" : 2008
    }, {
      "title" : "How variable may a constant be? measures of lexical richness in perspective",
      "author" : [ "F.J. Tweedie", "R.H. Baayen" ],
      "venue" : "Computers and the Humanities,",
      "citeRegEx" : "11",
      "shortCiteRegEx" : "11",
      "year" : 1998
    }, {
      "title" : "zipfR: Statistical models for word frequency distributions, 2008. R package version 0.6-5",
      "author" : [ "S. Evert", "M. Baroni" ],
      "venue" : null,
      "citeRegEx" : "12",
      "shortCiteRegEx" : "12",
      "year" : 2008
    }, {
      "title" : "Toward a framework for computational assessment of linguistic complexity of grade-level reading",
      "author" : [ "X. Lu", "S.L. Thorne", "D. Gamson" ],
      "venue" : null,
      "citeRegEx" : "13",
      "shortCiteRegEx" : "13",
      "year" : 2011
    }, {
      "title" : "Lexical diversity and lexical density in speech and writing",
      "author" : [ "V. Johansson" ],
      "venue" : "Lund University, Department of Linguistics and Phonetics, Working Papers,",
      "citeRegEx" : "14",
      "shortCiteRegEx" : "14",
      "year" : 2008
    }, {
      "title" : "The Principles of Readability",
      "author" : [ "W.H. Dubay" ],
      "venue" : "Impact Information,",
      "citeRegEx" : "15",
      "shortCiteRegEx" : "15",
      "year" : 2004
    }, {
      "title" : "The art of readable writing: with the Flesch readability formula",
      "author" : [ "R. Flesch" ],
      "venue" : null,
      "citeRegEx" : "16",
      "shortCiteRegEx" : "16",
      "year" : 1974
    }, {
      "title" : "Automatically extracting typical syntactic differences from corpora",
      "author" : [ "W. Wiersma", "J. Nerbonne", "T. Lauttamus" ],
      "venue" : "Literary and Linguistic Computing,",
      "citeRegEx" : "17",
      "shortCiteRegEx" : "17",
      "year" : 2011
    }, {
      "title" : "How complex is that sentence? a proposed revision of the rosenberg and abbeduto d-level scale",
      "author" : [ "M.A. Covington", "C. He", "C. Brown", "L. Naçi", "J. Brown" ],
      "venue" : "CASPR Research Report,",
      "citeRegEx" : "18",
      "shortCiteRegEx" : "18",
      "year" : 2006
    }, {
      "title" : "Competing complexity metrics and adults’ production of complex sentences",
      "author" : [ "H. Cheung", "S. Kemper" ],
      "venue" : "Applied Psycholinguistics,",
      "citeRegEx" : "19",
      "shortCiteRegEx" : "19",
      "year" : 1992
    }, {
      "title" : "Bootcat: Bootstrapping corpora and terms from the web",
      "author" : [ "M. Baroni", "S. Bernardini" ],
      "venue" : "In Proceedings of the 4th Language Resources and Evaluation Conference (LREC),",
      "citeRegEx" : "20",
      "shortCiteRegEx" : "20",
      "year" : 2004
    }, {
      "title" : "The WaCky wide web: a collection of very large linguistically processed web-crawled corpora",
      "author" : [ "M. Baroni", "S. Bernardini", "A. Ferraresi", "E. Zanchetta" ],
      "venue" : "Language Resources and Evaluation,",
      "citeRegEx" : "21",
      "shortCiteRegEx" : "21",
      "year" : 2009
    }, {
      "title" : "Probabilistic Part-of-Speech tagging using decision trees",
      "author" : [ "H. Schmid" ],
      "venue" : "In Proceedings of the International Conference on New Methods in Language Processing,",
      "citeRegEx" : "22",
      "shortCiteRegEx" : "22",
      "year" : 1994
    }, {
      "title" : "koRpus: Text Analysis Tool Set, 2011. R package version 0.01-7",
      "author" : [ "M. Michalke" ],
      "venue" : null,
      "citeRegEx" : "23",
      "shortCiteRegEx" : "23",
      "year" : 2011
    }, {
      "title" : "languageR: Data sets and functions with “Analyzing Linguistic Data: A practical introduction to statistics”",
      "author" : [ "R.H. Baayen" ],
      "venue" : null,
      "citeRegEx" : "24",
      "shortCiteRegEx" : "24",
      "year" : 2010
    }, {
      "title" : "Automatic measurement of syntactic complexity in child language acquisition",
      "author" : [ "X. Lu" ],
      "venue" : "International Journal of Corpus Linguistics,",
      "citeRegEx" : "25",
      "shortCiteRegEx" : "25",
      "year" : 2009
    }, {
      "title" : "Spoken and written language. Language education",
      "author" : [ "M.A.K. Halliday" ],
      "venue" : null,
      "citeRegEx" : "26",
      "shortCiteRegEx" : "26",
      "year" : 1989
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "Gaming in the MMOGs is cognitively demanding; it involves exploration of complex problem spaces, constructing and analyzing models, and negotiating meaning within the gaming community; it involves coordinating people, virtual tools and artifacts, and it is also characterized by various forms of texts [1].",
      "startOffset" : 302,
      "endOffset" : 305
    }, {
      "referenceID" : 2,
      "context" : "Thorne [3] and Thorne et al.",
      "startOffset" : 7,
      "endOffset" : 10
    }, {
      "referenceID" : 3,
      "context" : "[4] looked at the intercultural communication in massively multi-player online games, especially WoW.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 2,
      "context" : "Thorne [3] provides a case study in which two gamers with different levels of gaming proficiency exchange expert knowledge, language-specific explicit corrections and requests for help.",
      "startOffset" : 7,
      "endOffset" : 10
    }, {
      "referenceID" : 1,
      "context" : "[2], an exploratory study of linguistic quality and complexity of both internal and external texts of the WoW.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 4,
      "context" : "[5] claim that MMOGs, especially their role-playing sub-type, are particularly important for language learning because they represent immersive environments allowing fully-fledged experience of a virtual world.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 7,
      "context" : "Gee [8] sees the language use in games as one developing a complex specialist language, by which children develop their “islands of expertise”.",
      "startOffset" : 4,
      "endOffset" : 7
    }, {
      "referenceID" : 5,
      "context" : "[6] and Bryant [7] report on successful inclusion of game-related activities in school curricula.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 6,
      "context" : "[6] and Bryant [7] report on successful inclusion of game-related activities in school curricula.",
      "startOffset" : 15,
      "endOffset" : 18
    }, {
      "referenceID" : 8,
      "context" : "2 The availability of truly engaging educational games is as of today still limited [9].",
      "startOffset" : 84,
      "endOffset" : 87
    }, {
      "referenceID" : 9,
      "context" : "It is often used for describing and predicting vocabulary growth [10].",
      "startOffset" : 65,
      "endOffset" : 69
    }, {
      "referenceID" : 9,
      "context" : "There exist several corrected measures, like Herdan’s C, Guiraud’s R, Yule’s K and others [10].",
      "startOffset" : 90,
      "endOffset" : 94
    }, {
      "referenceID" : 10,
      "context" : "But since the within-text variability can be large (words are not used randomly), these measures may not be precise at differing sizes of text samples, as shown by Tweedie and Baayen [11].",
      "startOffset" : 183,
      "endOffset" : 187
    }, {
      "referenceID" : 11,
      "context" : "Similar applies to probabilistic models, such as Sichel’s generalized inverse Gauss-Poisson model and Zipf-Mandelbrot models [12, 11].",
      "startOffset" : 125,
      "endOffset" : 133
    }, {
      "referenceID" : 10,
      "context" : "Similar applies to probabilistic models, such as Sichel’s generalized inverse Gauss-Poisson model and Zipf-Mandelbrot models [12, 11].",
      "startOffset" : 125,
      "endOffset" : 133
    }, {
      "referenceID" : 10,
      "context" : "Especially the latter performed reasonably well and proved length-invariant in the Tweedie and Baayen’s [11] research.",
      "startOffset" : 104,
      "endOffset" : 108
    }, {
      "referenceID" : 12,
      "context" : "of 50 tokens, and then taking the mean [13].",
      "startOffset" : 39,
      "endOffset" : 43
    }, {
      "referenceID" : 13,
      "context" : "Lexical density Lexical density has been shown to correlate strongly with lexical diversity [14].",
      "startOffset" : 92,
      "endOffset" : 96
    }, {
      "referenceID" : 13,
      "context" : "A slightly more advance system could count phrases as a single lexical item, see Johansson [14] for further discussion.",
      "startOffset" : 91,
      "endOffset" : 95
    }, {
      "referenceID" : 14,
      "context" : "There are over 200 of such formulas [15].",
      "startOffset" : 36,
      "endOffset" : 40
    }, {
      "referenceID" : 12,
      "context" : "[13] predict appropriate grade levels of school reading materials successfully with Flesch Reading Ease, Coleman-Liau and New Dale-Chall Readability formulas.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 12,
      "context" : "Although insensitive to structural differences within sentences, it turns out as a reliable indicator of grade level [13].",
      "startOffset" : 117,
      "endOffset" : 121
    }, {
      "referenceID" : 12,
      "context" : "There exist more complex measures that define the developmental level of the sentences (D-level, DSS scoring, IPSyn) [13], and descriptive techniques, such as comparing the frequencies of POS tags for the most common n-grams between two texts [17], capable of qualitatively accounting for differences in frequency of syntactic constructions in texts.",
      "startOffset" : 117,
      "endOffset" : 121
    }, {
      "referenceID" : 16,
      "context" : "There exist more complex measures that define the developmental level of the sentences (D-level, DSS scoring, IPSyn) [13], and descriptive techniques, such as comparing the frequencies of POS tags for the most common n-grams between two texts [17], capable of qualitatively accounting for differences in frequency of syntactic constructions in texts.",
      "startOffset" : 243,
      "endOffset" : 247
    }, {
      "referenceID" : 17,
      "context" : "D-level, used in this paper, originates in the child language acquisition research and follows the premise that the most complex sentence types are acquired last [18].",
      "startOffset" : 162,
      "endOffset" : 166
    }, {
      "referenceID" : 18,
      "context" : "According to Cheung and Kemper [19], D-level is a more adequate index of sentence complexity than other metrics since it is able to differentiate between types of clausal embedding.",
      "startOffset" : 31,
      "endOffset" : 35
    }, {
      "referenceID" : 19,
      "context" : "The compilation was carried out with the BootCat toolkit [20].",
      "startOffset" : 57,
      "endOffset" : 61
    }, {
      "referenceID" : 20,
      "context" : "The second corpus used as benchmark is the ukWaC [21].",
      "startOffset" : 49,
      "endOffset" : 53
    }, {
      "referenceID" : 21,
      "context" : "The raw corpora were lemmatized and POS-tagged with TreeTagger [22].",
      "startOffset" : 63,
      "endOffset" : 67
    }, {
      "referenceID" : 11,
      "context" : "For fitting and plotting probability models, the zipfR package [12] was used.",
      "startOffset" : 63,
      "endOffset" : 67
    }, {
      "referenceID" : 22,
      "context" : "All the measures listed above, except D-level, were calculated in R using the koRpus package [23].",
      "startOffset" : 93,
      "endOffset" : 97
    }, {
      "referenceID" : 23,
      "context" : "For testing significance of the difference between the two corpora in vocabulary size and vocabulary growth, Z-statistic from languageR [24] package was used.",
      "startOffset" : 136,
      "endOffset" : 140
    }, {
      "referenceID" : 9,
      "context" : "Baayen [10].",
      "startOffset" : 7,
      "endOffset" : 11
    }, {
      "referenceID" : 24,
      "context" : "D-level scores were calculated with D-Level Analyzer4 [25].",
      "startOffset" : 54,
      "endOffset" : 58
    }, {
      "referenceID" : 9,
      "context" : "[10]).",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 9,
      "context" : "Sometimes, it may also be interesting or necessary to look at the vocabulary growth rate, because texts may include the same number of types, but with a different rate of occurrence of unseen types [10].",
      "startOffset" : 198,
      "endOffset" : 202
    }, {
      "referenceID" : 25,
      "context" : "The observation that spoken texts tend to have lower lexical density was made already by Halliday [26].",
      "startOffset" : 98,
      "endOffset" : 102
    }, {
      "referenceID" : 1,
      "context" : "[2].",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 7,
      "context" : "[8]).",
      "startOffset" : 0,
      "endOffset" : 3
    } ],
    "year" : 2015,
    "abstractText" : "We present a language complexity analysis of World of Warcraft (WoW) community texts, which we compare to texts from a general corpus of web English. Results from several complexity types are presented, including lexical diversity, density, readability and syntactic complexity. The language of WoW texts is found to be comparable to the general corpus on some complexity measures, yet more specialized on other measures. Our findings can be used by educators willing to include game-related activities into school curricula.",
    "creator" : "LaTeX with hyperref package"
  }
}