{
  "name" : "1506.06863.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "∆BLEU: A Discriminative Metric for Generation Tasks with Intrinsically Diverse Targets∗",
    "authors" : [ "Michel Galley", "Chris Brockett", "Alessandro Sordoni", "Yangfeng Ji", "Michael Auli", "Chris Quirk", "Margaret Mitchell", "Jianfeng Gao", "Bill Dolan" ],
    "emails" : [ "mgalley@microsoft.com" ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "Many natural language processing tasks involve the generation of texts where a variety of outputs are acceptable or even desirable. Tasks with intrinsically diverse targets range from machine translation, summarization, sentence compression, paraphrase generation, and image-to-text to generation of conversational interactions. A major hurdle for these tasks is automation of evaluation, since the space of plausible outputs can be enormous, and it is it impractical to run a new human evaluation every time a new model is built or parameters are modified.\nIn Statistical Machine Translation (SMT), the automation problem has to a large extent been ameliorated by metrics such as BLEU (Papineni et al., 2002) and METEOR (Banerjee and Lavie, 2005) Although BLEU is not immune from criticism (e.g., Callison-Burch et al. (2006)), its properties are well\n∗To appear at ACL in July 2015 (submitted April 30, 2015, accepted June 9, 2015).\n†Corresponding author: mgalley@microsoft.com ‡The entirety of this work was conducted while at Mi-\ncrosoft Research.\nunderstood, BLEU scores have been shown to correlate well with human judgments (Doddington, 2002; Coughlin, 2003; Graham and Baldwin, 2014; Graham et al., 2015) in SMT, and it has allowed the field to proceed.\nBLEU has been less successfully applied to nonSMT generation tasks owing to the larger space of plausible outputs. As a result, attempts have been made to adapt the metric. To foster diversity in paraphrase generation, Sun and Zhou (2012) propose a metric called iBLEU in which the BLEU score is discounted by a BLEU score computed between the source and paraphrase. This solution, in addition to being dependent on a tunable parameter, is specific only to paraphrase. In image captioning tasks, Vendantam et al. (2015), employ a variant of BLEU in which n-grams are weighted by tf ·idf. This assumes the availability of a corpus with which to compute tf ·idf. Both the above can be seen as attempting to capture a notion of target goodness that is not being captured in BLEU.\nIn this paper, we introduce Discriminative BLEU (∆BLEU), a new metric that embeds human judgments concerning the quality of reference sentences directly into the computation of corpus-level multiple-reference BLEU. In effect, we push part of the burden of human evaluation into the automated metric, where it can be repeatedly utilized.\nOur testbed for this metric is data-driven conversation, a field that has begun to attract interest (Ritter et al., 2011; Sordoni et al., 2015) as an alternative to conventional rule-driven or scripted dialog systems. Intrinsic evaluation in this field is exceptionally challenging because the semantic space of possible responses resists definition and is only weakly constrained by conversational inputs.\nBelow, we describe ∆BLEU and investigate its characteristics in comparison to standard BLEU in the context of conversational response generation.\nar X\niv :1\n50 6.\n06 86\n3v 2\n[ cs\n.C L\n] 2\n4 Ju\nn 20\n15\nWe demonstrate that ∆BLEU correlates well with human evaluation scores in this task and thus can provide a basis for automated training and evaluation of data-driven conversation systems—and, we ultimately believe, other text generation tasks with inherently diverse targets."
    }, {
      "heading" : "2 Evaluating Conversational Responses",
      "text" : "Given an input message m and a prior conversation history c, the goal of a response generation system is to produce a hypothesis h that is both well-formed and a pertinent response to message m (example in Fig. 1). We assume that a set of J references {ri,j} is available for the context ci and message mi, where i ∈ {1 . . . I} is an index over the test set. In the case of BLEU,1 the automatic score of the system output h1 . . . hI is defined as:\nBLEU = BP · exp (∑\nn\nlog pn\n) (1)\nwith:\nBP = { 1 if η > ρ e(1−ρ/η) otherwise\n(2)\nwhere ρ and η are respectively hypothesis and reference lengths.2 Then corpus-level n-gram precision is defined as:\npn =\n∑ i ∑ g ∈n-grams(hi) maxj { #g(hi, ri,j) }∑ i ∑ g ∈n-grams(hi) #g(hi)\nwhere #g(·) is the number of occurrences of n-gram g in a given sentence, and #g(u, v) is a shorthand for min { #g(u),#g(v) } .\nIt has been demonstrated that metrics such as BLEU show increased correlation with human judgment as the number of references increases (Przybocki et al., 2008; Dreyer and Marcu, 2012). Unfortunately, gathering multiple references is difficult in the case of conversations. Data gathered from naturally occurring conversations offer only one response per message. One could search (c,m) pairs that occur multiple times in conversational\n1Unless mentioned otherwise, BLEU refers to the original IBM BLEU as first described in (Papineni et al., 2002).\n2In the case of multiple references, BLEU selects the reference whose length is closest to that of the hypothesis.\ndata with the hope of finding distinct responses, but this solution is not feasible. Indeed, the larger the context, the less likely we are to find pairs that match exactly. Furthermore, while it is feasible to have writers create additional references when the downstream task is relatively unambiguous (e.g., MT), this approach is more questionable in the case of more subjective tasks such as conversational response generation. Our solution is to mine candidate responses from conversational data and have judges rate the quality of these responses. Our new metric thus naturally incorporates qualitative weights associated with references.\n3 Discriminative BLEU\nDiscriminative BLEU, or ∆BLEU, extends BLEU by exploiting human qualitative judgments wi,j ∈ [−1,+1] associated with references ri,j . It is discriminative in that it both rewards matches with “good” reference responses (w > 0) and penalizes matches with “bad” reference responses (w < 0). Formally, ∆BLEU is defined as in Equation 1 and 2, except that pn is instead defined as:∑ i ∑ g ∈n-grams(hi) maxj:g ∈ ri,j { wi,j ·#g(hi, ri,j)\n}∑ i ∑ g ∈n-grams(hi) maxj { wi,j ·#g(hi)\n} In a nutshell, this is saying that each n-gram match is weighted by the highest scoring reference in which it occurs, and this weight can sometimes be negative. To ensure that the denominator is never zero, we assume that, for each i there exists at least one reference ri,j whose weight wi,j is strictly positive. In addition to its discriminative nature, this metric has two interesting properties. First, if all weights wi,j are equal to 1, then the metric score is identical to BLEU. As such, ∆BLEU admits BLEU as a special case. Second, as with IBM BLEU, the maximum theoretical score is also 1. If the hypothesis happens to match the highest weighted reference for each sentence, the numerator equals the denominator and the metric score becomes 1. While we find this metric particularly appropriate for response generation, the metric makes no assumption on the task and is applicable to other text generation tasks such as MT and image captioning."
    }, {
      "heading" : "4 Data",
      "text" : ""
    }, {
      "heading" : "4.1 Multi-reference Datasets",
      "text" : "To create the multi-reference BLEU dev and test sets used in this study, we adapted and extended the\nmethodology of Sordoni et al. (2015). From a corpus of 29M Twitter context-message-response conversational triples, we randomly extracted approximately 33K candidate triples that were then judged for conversational quality on a 5-point Likert-type scale by 3 crowdsourced annotators. Of these, 4232 triples scored an average 4 or higher; these were randomly binned to create seed dev and test sets of 2118 triples and 2114 triples respectively. Note that the dev set is not used in the experiments of this paper, since ∆BLEU and IBM BLEU are metrics that do not require training. However, the dev set is released along with a test set in the dataset release accompanying this paper.\nWe then sought to identify candidate triples in the 29M corpus for which both message and response are similar to the original messages and responses in these seed sets. To this end, we employed an information retrieval algorithm with a bag-of-words BM25 similarity function (Robertson et al., 1995), as detailed in Sordoni et al. (2015), to extract the top 15 responses for each messageresponse pair. Unlike Sordoni et al. (2015), we further appended the original messages (as if par-\nroted back). The new triples were then scored for quality of the response in light of both context and message by 5 crowdsourced raters each on a 5- point Likert-type scale.3 Crucially, and again in contradistinction to Sordoni et al. (2015), we did not impose a score cutoff on these synthetic multireference sets. Instead, we retained all candidate responses and scaled their scores into [−1, +1].\nTable 1 presents representative multi-reference examples (from the dev set) together with their converted scores. The context and messages associated with the supplementary mined responses are also shown for illustrative purposes to demonstrate the range of conversations from which they were taken. In the table, negative-weighted mined responses are semantically orthogonal to the intent of their newly assigned context and message. Strongly negatively weighted responses are completely out of the ballpark (“the weather in Russia is very cool”, “well then! Why were the biscuits needed?”); others are a little more plausible, but irrelevant or possibly topic\n3For this work, we sought 2 additional annotations of the seed responses for consistency with the mined responses. As a result, scores for some seed responses slipped below our initial threshold of 4. Nonetheless, these responses were retained.\nchanging (“ohh I love that song”). Higher-valued positive-weighted mined responses are typically reasonably appropriate and relevant (even though extracted from a completely unrelated conversation), and in some cases can outscore the original response, as can be seen in the third set of examples."
    }, {
      "heading" : "4.2 Human Evaluation of System Outputs",
      "text" : "Responses generated by the 7 systems used in this study on the 2114-triple test set were hand evaluated by 5 crowdsourced raters each on a 5-point Likert-type scale. From these 7 systems, 12 system pairs were evaluated, for a total of about pairwise 126K ratings (12 · 5 · 2114). Here too, raters were asked to evaluate responses in terms of their relevance to both context and message. Outputs from different systems were randomly interleaved for presentation to the raters. We obtained human ratings on the following systems:\nPhrase-based MT: A phrase-based MT system similar to (Ritter et al., 2011), whose weights have been manually tuned. We also included four variants of that system, which we tuned with MERT (Och, 2003). These variants differ in their number of features, and augment (Ritter et al., 2011) with the following phrase-level features: edit distance between source and target, cosine similarity, Jaccard index and distance, length ratio, and DSSM score (Huang et al., 2013). RNN-based MT: the log-probability according to the RNN model of (Sordoni et al., 2015). Baseline: a random baseline.\nWhile ∆BLEU relies on human qualitative judgments, it is important to note that human judgments on multi-references (§ 4.1) and those on system outputs were collected completely independently. We also note that the set of systems listed above specifically does not include a retrieval-based model, as this might have introduced spurious correlation between the two datasets (§ 4.1 and § 4.2)."
    }, {
      "heading" : "5 Setup",
      "text" : "We use two rank correlation coefficients— Kendall’s τ and Spearman’s ρ—to assess the level of correlation between human qualitative ratings (§4.2) and automated metric scores. More formally, we compute each correlation coefficient on a series of paired observations (m1, q1), · · · , (mN , qN ). Here,mi and qi are respectively differences in automatic metric scores and qualitative ratings for two\ngiven systems A and B on a given subset of the test set.4While much prior work assesses automatic metrics for MT and other tasks (Lavie and Agarwal, 2007; Hodosh et al., 2013) by computing correlations on observations consisting of single-sentence system outputs, it has been shown (e.g., Przybocki et al. (2008)) that correlation coefficients significantly increase as observation units become larger. For instance, corpus-level or system-level correlations tend to be much higher than sentence-level correlations; Graham and Baldwin (2014) show that BLEU is competitive with more recent and advanced metrics when assessed at the system level.5\nTherefore, we define our observation unit size to be M = 100 sentences (responses),6 unless stated otherwise. We evaluate qi by averaging human ratings on the M sentences, and mi by computing metric scores on the same set of sentences.7 We compare three different metrics: BLEU, ∆BLEU, and sentence-level BLEU (sBLEU). The last computes sentence-level BLEU scores (Nakov et al., 2012) and averages them on the M sentences (akin to macro-averaging). Finally, unless otherwise noted, all versions of BLEU use n-gram order up to 2 (BLEU-2), as this achieves better correlation for all metrics on this data."
    }, {
      "heading" : "6 Results",
      "text" : "The main results of our study are shown in Table 2. ∆BLEU achieves better correlation with human than BLEU, when comparing the best configuration of each metric.8 In the case of Spearman’s ρ,\n4For each given observation pair (mi, qi), we randomize the order in which A and B are presented to the raters in order to avoid any positional bias.\n5We do not intend to minimize the benefit of a metric that would be competitive at the sentence-level, which would be particularly useful for detailed error analyses. However, our main goal is to reliably evaluate generation systems on test sets of thousands of sentences, in which case any metric with good corpus-level correlation (such as BLEU, as shown in (Graham and Baldwin, 2014)) would be sufficient.\n6Enumerating all possible ways of assigning sentences to observations would cause a combinatorial explosion. Instead, for all our results we sample 1K assignments and average correlations coefficients over them (using the same 1K assignments across all metrics). These assignments are done in such a way that all sentences within an observation belong to the same system pair.\n7We refrained from using larger units, as creating larger observation unitsM reduces the total number of unitsN . This would have caused confidence intervals to be so wide as to make this study inconclusive.\n8This is also the case on single reference. While ∆BLEU and BLEU would have the same correlation if original references all had the same score of 1, it is not unusual for original references to get ratings below 1.\nthe confidence intervals of BLEU (.265, .416) and ∆BLEU (.415, .546) barely overlap, while interval overlap is more significant in the case of Kendall’s τ . Correlation coefficients degrade for BLEU as we go from w ≥ 0.6 to using all references. This is expected, since BLEU treats all references as equal and has no way of discriminating between them. On the other hand, correlation coefficients increase for ∆BLEU after adding lower scoring references. It is also worth noticing that BLEU and sBLEU obtain roughly comparable correlation coefficients. This may come as a surprise, because it has been suggested elsewhere that sBLEU has much worse correlation than BLEU computed at the corpus level (Przybocki et al., 2008). We surmise that (at least for this task and data) the differences in correlations between BLEU and sBLEU observed in prior work may be less the result of a difference between micro- and macro-averaging than they are the effect of different observation unit sizes (as discussed in §5).\nFinally, Figure 2 shows how Spearman’s ρ is affected along three dimensions of study. In particular, we see that ∆BLEU actually benefits from the references with negative ratings. While the improvement is not pronounced, we note that most references have positive ratings. Negatively-weighted references could have a greater effect if, for example, randomly extracted responses had also been annotated."
    }, {
      "heading" : "7 Conclusions",
      "text" : "∆BLEU correlates well with human quality judgments of generated conversational responses, outperforming both IBM BLEU and sentence-level BLEU in this task and demonstrating that it can serve as a plausible intrinsic metric for system de-\nvelopment.9 An upfront cost is paid for human evaluation of the reference set, but following that, the need for further human evaluation can be minimized during system development. ∆BLEU may help other tasks that use multiple references for intrinsic evaluation, including image-to-text, sentence compression, and paraphrase generation, and even statistical machine translation. Evaluation of ∆BLEU in these tasks awaits future work."
    }, {
      "heading" : "Acknowledgments",
      "text" : "We thank the anonymous reviewers, Jian-Yun Nie, and Alan Ritter for their helpful comments and suggestions.\n9An implementation of ∆BLEU, multi-reference dev and test sets, and human rated outputs are available at: http://research.microsoft.com/convo"
    } ],
    "references" : [ {
      "title" : "METEOR: An automatic metric for MT evaluation with improved correlation with human judgments",
      "author" : [ "Banerjee", "Lavie2005] Satanjeev Banerjee", "Alon Lavie" ],
      "venue" : "In Proc. of ACL Workshop on Intrinsic and Extrinsic Evaluation Measures for Machine",
      "citeRegEx" : "Banerjee et al\\.,? \\Q2005\\E",
      "shortCiteRegEx" : "Banerjee et al\\.",
      "year" : 2005
    }, {
      "title" : "Reevaluating the role of BLEU in machine translation research",
      "author" : [ "Miles Osborne", "Philipp Koehn" ],
      "venue" : "In EACL,",
      "citeRegEx" : "Callison.Burch et al\\.,? \\Q2006\\E",
      "shortCiteRegEx" : "Callison.Burch et al\\.",
      "year" : 2006
    }, {
      "title" : "Correlating automated and human assessments of machine translation quality",
      "author" : [ "Deborah Coughlin" ],
      "venue" : "In Proc. of MT Summit IX,",
      "citeRegEx" : "Coughlin.,? \\Q2003\\E",
      "shortCiteRegEx" : "Coughlin.",
      "year" : 2003
    }, {
      "title" : "Automatic evaluation of machine translation quality using n-gram co-occurrence statistics",
      "author" : [ "George Doddington" ],
      "venue" : "In Proc. of HLT,",
      "citeRegEx" : "Doddington.,? \\Q2002\\E",
      "shortCiteRegEx" : "Doddington.",
      "year" : 2002
    }, {
      "title" : "HyTER: Meaning-equivalent semantics for translation evaluation",
      "author" : [ "Dreyer", "Marcu2012] Markus Dreyer", "Daniel Marcu" ],
      "venue" : "In Proc. of HLTNAACL,",
      "citeRegEx" : "Dreyer et al\\.,? \\Q2012\\E",
      "shortCiteRegEx" : "Dreyer et al\\.",
      "year" : 2012
    }, {
      "title" : "Testing for significance of increased correlation with human judgment",
      "author" : [ "Graham", "Baldwin2014] Yvette Graham", "Timothy Baldwin" ],
      "venue" : "In Proc. of EMNLP,",
      "citeRegEx" : "Graham et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Graham et al\\.",
      "year" : 2014
    }, {
      "title" : "Accurate evaluation of segment-level machine translation metrics",
      "author" : [ "Graham et al.2015] Yvette Graham", "Timothy Baldwin", "Nitika Mathur" ],
      "venue" : "In Proc. of NAACL-HLT,",
      "citeRegEx" : "Graham et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Graham et al\\.",
      "year" : 2015
    }, {
      "title" : "Framing image description as a ranking task: Data, models and evaluation metrics",
      "author" : [ "Hodosh et al.2013] Micah Hodosh", "Peter Young", "Julia Hockenmaier" ],
      "venue" : "J. Artif. Int. Res.,",
      "citeRegEx" : "Hodosh et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Hodosh et al\\.",
      "year" : 2013
    }, {
      "title" : "Learning deep structured semantic models for web search using clickthrough data",
      "author" : [ "Huang et al.2013] Po-Sen Huang", "Xiaodong He", "Jianfeng Gao", "Li Deng", "Alex Acero", "Larry Heck" ],
      "venue" : "In Proc. of the 22nd ACM International Conference on Information",
      "citeRegEx" : "Huang et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Huang et al\\.",
      "year" : 2013
    }, {
      "title" : "METEOR: An automatic metric for mt evaluation with high levels of correlation with human judgments",
      "author" : [ "Lavie", "Agarwal2007] Alon Lavie", "Abhaya Agarwal" ],
      "venue" : "In Proc. of the Workshop on Statistical Machine Translation (StatMT),",
      "citeRegEx" : "Lavie et al\\.,? \\Q2007\\E",
      "shortCiteRegEx" : "Lavie et al\\.",
      "year" : 2007
    }, {
      "title" : "Optimizing for SentenceLevel BLEU+1 Yields Short Translations",
      "author" : [ "Nakov et al.2012] Preslav Nakov", "Francisco Guzman", "Stephan Vogel" ],
      "venue" : "In Proc. of COLING",
      "citeRegEx" : "Nakov et al\\.,? \\Q2012\\E",
      "shortCiteRegEx" : "Nakov et al\\.",
      "year" : 2012
    }, {
      "title" : "Minimum error rate training in statistical machine translation",
      "author" : [ "Franz Josef Och" ],
      "venue" : "In Proc. of ACL,",
      "citeRegEx" : "Och.,? \\Q2003\\E",
      "shortCiteRegEx" : "Och.",
      "year" : 2003
    }, {
      "title" : "BLEU: a method for automatic evaluation of machine translation",
      "author" : [ "Salim Roukos", "Todd Ward", "Wei-Jing Zhu" ],
      "venue" : "In Proc. of ACL,",
      "citeRegEx" : "Papineni et al\\.,? \\Q2002\\E",
      "shortCiteRegEx" : "Papineni et al\\.",
      "year" : 2002
    }, {
      "title" : "Official results of the NIST 2008 ”Metrics for MAchine TRanslation",
      "author" : [ "K. Peterson", "S. Bronsart" ],
      "venue" : null,
      "citeRegEx" : "Przybocki et al\\.,? \\Q2008\\E",
      "shortCiteRegEx" : "Przybocki et al\\.",
      "year" : 2008
    }, {
      "title" : "Data-driven response generation in social media",
      "author" : [ "Ritter et al.2011] Alan Ritter", "Colin Cherry", "William B. Dolan" ],
      "venue" : "In Proc. of EMNLP,",
      "citeRegEx" : "Ritter et al\\.,? \\Q2011\\E",
      "shortCiteRegEx" : "Ritter et al\\.",
      "year" : 2011
    }, {
      "title" : "A neural network approach to contextsensitive generation of conversational responses",
      "author" : [ "Michel Galley", "Michael Auli", "Chris Brockett", "Yangfeng Ji", "Meg Mitchell", "Jian-Yun Nie", "Jianfeng Gao", "Bill Dolan" ],
      "venue" : null,
      "citeRegEx" : "Sordoni et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Sordoni et al\\.",
      "year" : 2015
    }, {
      "title" : "Joint learning of a dual SMT system for paraphrase generation",
      "author" : [ "Sun", "Zhou2012] Hong Sun", "Ming Zhou" ],
      "venue" : "In ACL,",
      "citeRegEx" : "Sun et al\\.,? \\Q2012\\E",
      "shortCiteRegEx" : "Sun et al\\.",
      "year" : 2012
    }, {
      "title" : "CIDEr: Consensus-based image description evaluation",
      "author" : [ "Vedantam", "C. Lawrence Zitnick", "Devi Parikh." ],
      "venue" : "CVPR.",
      "citeRegEx" : "Vedantam et al\\.,? 2015",
      "shortCiteRegEx" : "Vedantam et al\\.",
      "year" : 2015
    } ],
    "referenceMentions" : [ {
      "referenceID" : 12,
      "context" : "In Statistical Machine Translation (SMT), the automation problem has to a large extent been ameliorated by metrics such as BLEU (Papineni et al., 2002) and METEOR (Banerjee and Lavie, 2005) Although BLEU is not immune from criticism (e.",
      "startOffset" : 128,
      "endOffset" : 151
    }, {
      "referenceID" : 1,
      "context" : ", Callison-Burch et al. (2006)), its properties are well",
      "startOffset" : 2,
      "endOffset" : 31
    }, {
      "referenceID" : 3,
      "context" : "understood, BLEU scores have been shown to correlate well with human judgments (Doddington, 2002; Coughlin, 2003; Graham and Baldwin, 2014; Graham et al., 2015) in SMT, and it has allowed the field to proceed.",
      "startOffset" : 79,
      "endOffset" : 160
    }, {
      "referenceID" : 2,
      "context" : "understood, BLEU scores have been shown to correlate well with human judgments (Doddington, 2002; Coughlin, 2003; Graham and Baldwin, 2014; Graham et al., 2015) in SMT, and it has allowed the field to proceed.",
      "startOffset" : 79,
      "endOffset" : 160
    }, {
      "referenceID" : 6,
      "context" : "understood, BLEU scores have been shown to correlate well with human judgments (Doddington, 2002; Coughlin, 2003; Graham and Baldwin, 2014; Graham et al., 2015) in SMT, and it has allowed the field to proceed.",
      "startOffset" : 79,
      "endOffset" : 160
    }, {
      "referenceID" : 14,
      "context" : "Our testbed for this metric is data-driven conversation, a field that has begun to attract interest (Ritter et al., 2011; Sordoni et al., 2015) as an alternative to conventional rule-driven or scripted dialog systems.",
      "startOffset" : 100,
      "endOffset" : 143
    }, {
      "referenceID" : 15,
      "context" : "Our testbed for this metric is data-driven conversation, a field that has begun to attract interest (Ritter et al., 2011; Sordoni et al., 2015) as an alternative to conventional rule-driven or scripted dialog systems.",
      "startOffset" : 100,
      "endOffset" : 143
    }, {
      "referenceID" : 13,
      "context" : "It has been demonstrated that metrics such as BLEU show increased correlation with human judgment as the number of references increases (Przybocki et al., 2008; Dreyer and Marcu, 2012).",
      "startOffset" : 136,
      "endOffset" : 184
    }, {
      "referenceID" : 12,
      "context" : "Unless mentioned otherwise, BLEU refers to the original IBM BLEU as first described in (Papineni et al., 2002).",
      "startOffset" : 87,
      "endOffset" : 110
    }, {
      "referenceID" : 15,
      "context" : "methodology of Sordoni et al. (2015). From a corpus of 29M Twitter context-message-response conversational triples, we randomly extracted approximately 33K candidate triples that were then judged for conversational quality on a 5-point Likert-type scale by 3 crowdsourced annotators.",
      "startOffset" : 15,
      "endOffset" : 37
    }, {
      "referenceID" : 15,
      "context" : ", 1995), as detailed in Sordoni et al. (2015), to extract the top 15 responses for each messageresponse pair.",
      "startOffset" : 24,
      "endOffset" : 46
    }, {
      "referenceID" : 15,
      "context" : ", 1995), as detailed in Sordoni et al. (2015), to extract the top 15 responses for each messageresponse pair. Unlike Sordoni et al. (2015), we further appended the original messages (as if parroted back).",
      "startOffset" : 24,
      "endOffset" : 139
    }, {
      "referenceID" : 15,
      "context" : ", 1995), as detailed in Sordoni et al. (2015), to extract the top 15 responses for each messageresponse pair. Unlike Sordoni et al. (2015), we further appended the original messages (as if parroted back). The new triples were then scored for quality of the response in light of both context and message by 5 crowdsourced raters each on a 5point Likert-type scale.3 Crucially, and again in contradistinction to Sordoni et al. (2015), we did not impose a score cutoff on these synthetic multireference sets.",
      "startOffset" : 24,
      "endOffset" : 432
    }, {
      "referenceID" : 14,
      "context" : "Phrase-based MT: A phrase-based MT system similar to (Ritter et al., 2011), whose weights have been manually tuned.",
      "startOffset" : 53,
      "endOffset" : 74
    }, {
      "referenceID" : 11,
      "context" : "We also included four variants of that system, which we tuned with MERT (Och, 2003).",
      "startOffset" : 72,
      "endOffset" : 83
    }, {
      "referenceID" : 14,
      "context" : "These variants differ in their number of features, and augment (Ritter et al., 2011) with the following phrase-level features: edit distance between source and target, cosine similarity, Jaccard index and distance, length ratio, and DSSM score (Huang et al.",
      "startOffset" : 63,
      "endOffset" : 84
    }, {
      "referenceID" : 8,
      "context" : ", 2011) with the following phrase-level features: edit distance between source and target, cosine similarity, Jaccard index and distance, length ratio, and DSSM score (Huang et al., 2013).",
      "startOffset" : 167,
      "endOffset" : 187
    }, {
      "referenceID" : 15,
      "context" : "RNN-based MT: the log-probability according to the RNN model of (Sordoni et al., 2015).",
      "startOffset" : 64,
      "endOffset" : 86
    }, {
      "referenceID" : 7,
      "context" : "4While much prior work assesses automatic metrics for MT and other tasks (Lavie and Agarwal, 2007; Hodosh et al., 2013) by computing correlations on observations consisting of single-sentence system outputs, it has been shown (e.",
      "startOffset" : 73,
      "endOffset" : 119
    }, {
      "referenceID" : 7,
      "context" : "4While much prior work assesses automatic metrics for MT and other tasks (Lavie and Agarwal, 2007; Hodosh et al., 2013) by computing correlations on observations consisting of single-sentence system outputs, it has been shown (e.g., Przybocki et al. (2008)) that correlation coefficients significantly increase as observation units become larger.",
      "startOffset" : 99,
      "endOffset" : 257
    }, {
      "referenceID" : 7,
      "context" : "4While much prior work assesses automatic metrics for MT and other tasks (Lavie and Agarwal, 2007; Hodosh et al., 2013) by computing correlations on observations consisting of single-sentence system outputs, it has been shown (e.g., Przybocki et al. (2008)) that correlation coefficients significantly increase as observation units become larger. For instance, corpus-level or system-level correlations tend to be much higher than sentence-level correlations; Graham and Baldwin (2014) show that BLEU is competitive with more recent and advanced metrics when assessed at the system level.",
      "startOffset" : 99,
      "endOffset" : 486
    }, {
      "referenceID" : 10,
      "context" : "The last computes sentence-level BLEU scores (Nakov et al., 2012) and averages them on the M sentences (akin to macro-averaging).",
      "startOffset" : 45,
      "endOffset" : 65
    }, {
      "referenceID" : 13,
      "context" : "This may come as a surprise, because it has been suggested elsewhere that sBLEU has much worse correlation than BLEU computed at the corpus level (Przybocki et al., 2008).",
      "startOffset" : 146,
      "endOffset" : 170
    } ],
    "year" : 2015,
    "abstractText" : "We introduce Discriminative BLEU (∆BLEU), a novel metric for intrinsic evaluation of generated text in tasks that admit a diverse range of possible outputs. Reference strings are scored for quality by human raters on a scale of [−1, +1] to weight multi-reference BLEU. In tasks involving generation of conversational responses, ∆BLEU correlates reasonably with human judgments and outperforms sentence-level and IBM BLEU in terms of both Spearman’s ρ and Kendall’s τ .",
    "creator" : "LaTeX with hyperref package"
  }
}