{
  "name" : "1510.08480.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Emoticons vs. Emojis on Twitter: A Causal Inference Approach",
    "authors" : [ "Umashanthi Pavalanathan", "Jacob Eisenstein" ],
    "emails" : [ "jacobe}@gatech.edu" ],
    "sections" : [ {
      "heading" : "Introduction",
      "text" : "People are changing writing to express themselves in online settings, often through the use of non-standard orthographies, such as emoticons (e.g., (:) and letter repetitions (e.g., coooolll) (Dresner and Herring 2010; Kalman and Gergle 2014). The introduction of emojis is a potentially dramatic shift in online writing, potentially replacing these user-defined linguistic affordances with predefined graphical icons. With the ability to access a large number of colorful and expressive emoji pictographs, will users stop employing non-standard orthographies for expressive communication in social media?\nIn this abstract, we address the question of whether the individual users’ adoption of emojis reduces the frequency of emoticons used in their tweets. From a sample of mostly English tweets, we extracted authors who were early adopters of emojis, and consider them as the treatment group. To measure the causal effect of emoji adoption on emoticon usage, we choose another set of authors (control) who were not yet using emojis at the same time as the treatment group, and compare the differences in emoticon usage of these two groups between a period of an year. We matched each author in the treatment group with an author in the control group, based on their emoticon usage rate before the treatment period. If the individuals in the treatment group reduce\nCopyright c© 2015, Association for the Advancement of Artificial Intelligence (www.aaai.org). All rights reserved.\ntheir emoticon usage more than the individuals in the control group, this would suggest that emojis are competing with emoticons, and may eventually reduce the amount of nonstandard orthography in social media.\nEmojis are “picture characters” that originated for mobile phones in Japan in the late 1990s, but recently became popular worldwide in text messaging and social media with the adoption of smartphones supporting input and rendering of emoji characters. In contrast to emoticons, which are created from ASCII character sequences, emojis are represented by unicode characters, and are continuously increasing in number with the introduction of new characters in each new unicode version.1 Emoji characters include not only faces, but also concepts and ideas such as weather, vehicles and buildings, food and drink, or activities such as running and dancing (Figure 1, and example tweets in Figure 2). Emoji Tracker reports real time emoji use on Twitter.2\nIn computer mediated communication (CMC), emoticons are interpreted as “emotion icons”, primarily as a way to represent facial expressions, such as smile, in the absence of non-verbal cues (Walther and D’Addario 2001). However, later research has shown that emoticons are not just representation of affective stances; they play many other roles in written communication such as showing author intention, sociocultural differences, and author identity (Derks, Bos, and Von Grumbkow 2007; Schnoebelen 2012; Park et al. 2013). In particular, Dresner and Herring (2010) situate the usage of emoticons in CMC between the extremes of nonlanguage and language.\nWe hypothesize that individuals who adopt emojis tend to use fewer emoticons, indicating that emojis are replacing this particular form of orthographic paralinguistic commu-\n1http://www.unicode.org/reports/tr51/ index.html#Selection_Factors\n2http://www.emojitracker.com/\nar X\niv :1\n51 0.\n08 48\n0v 1\n[ cs\n.C L\n] 2\n8 O\nct 2\n01 5\nnication. We use a matching approach to causal inference to test our hypothesis using observational data from Twitter. Next, we describe the dataset, our study design and report results. Then we first briefly discuss related work and conclude with discussion and future work."
    }, {
      "heading" : "Dataset",
      "text" : "We gathered a corpus of tweets from February 2014 to August 2015, using Twitter’s streaming API. We removed retweets (repetitions of previously posted messages) by excluding messages which contain the “retweeted status” metadata or the “RT” token. We included only authors who have written at least five tweets on average each month and removed authors who have written more than 10% of their tweets in any language other than English."
    }, {
      "heading" : "Extracting Emoji and Emoticon Tokens",
      "text" : "To extract emoji characters from tweets, we converted the messages into unicode representation and used regular expressions to extract unicode characters in the ranges of the “Emoji & Pictographs” category of unicode symbols (other categories include non-Roman characters such as different numbering systems and mathematical symbols). Using this method we identified 1,235 unique emoji characters in a random sample of tweets spanning a period of more than an year (February 2014 to August 2015). Figure 3a shows the percentage of emoji character tokens (i.e., # of emoji tokens # of total tokens ×100%) over time in our our sample of mostly English tweets. 3 As there is no comprehensive list of Twitter emoticons (and new emoticons get introduced over time), we used a data-driven approach to identify emoticons. We constructed regular expressions (e.g., two or more characters with at least one non-alpha numeric character, not containing money/percent/time symbols, etc.) to retrieve an initial set of emoticon-like tokens, and then manually annotated all the items that made up 95% cumulative frequency of emoticon-like tokens, looking at their usage on random examples of tweets. After removing tokens that are not used as emoticons, there were 44 and 52 unique emoticons extracted from tweets of March 2014 and March 2015, respectively. In both cases, the twenty most frequent emoticons made up 90% of all emoticon tokens. Figure 3b shows the percentage of emoticon symbols (i.e., # of emoticon tokens# of total tokens ×100%) over\n3Note that although there is a decreasing trend in emoji usage rate after a peak in June-August 2014 in this sample, emoji usage rate shows an upward trend in a sample of unfiltered tweets, indicating an increasing popularity of emojis on Twitter.\ntime in our sample. Table 1 shows the basic usage statistics of emojis and emoticons for the same sample."
    }, {
      "heading" : "Study Design",
      "text" : "The causal inference question is whether the introduction of emojis causes orthographic features such as emoticons to decrease in frequency. In a randomized experiment, the treatment group would be individuals who used emojis, and the control group would be individuals who did not. We would choose these individuals to have similar pre-treatment characteristics: zero usage of emojis, and comparable usage of emoticons. The treatment effect is the difference in the usage of emoticons after the treatment."
    }, {
      "heading" : "Treatment and Control Groups",
      "text" : "We approximate this randomized experimental setup using observational data. We consider the month of March 2014 as the pre-treatment period and the month of March 2015 as the\npost-treatment period, and our primary analysis is based on tweets from these two months. Before placing tweet authors into treatment and control groups, we first selected a pool of authors with following criteria: users who have written at least five tweets in each month, and who have written less than 10% of their tweets in any language other than English. This criteria was chosen because extraction of non-standard words and emoticon symbols depends on the language of the message.\nFor the treatment group, we selected authors who had not used any emoji characters in March 2014, and who used at least five emoji characters in March 2015. Authors who had not used any emoji characters in both March 2014 and March 2015 were chosen into the control group. We matched authors in the treatment and control group based on their emoticon usage rate (i.e., # of emoticon tokens# of total tokens , matching up to two decimal points) prior to the treatment. We extracted 5,205 such treatment-control author pairs from our treatment and control groups and used these authors for our primary analysis. Figure 4 shows the distribution of emoji usage rates in both the treatment and control groups, before and after treatment.\nCausal Inference Framework When computing the treatment effect, we need to account for the control group’s outcome as well. This is because the overall emoticon usage rate is changing with time as shown in Figure 3b, and hence there might be changes in the emoticon usage rates by the control group even without any intervention. The treatment effect is computed in terms of the following quantities:\nY ti the difference between the post-treatment and pre-treatment emoticon usage rates for author i, who is in the treatment group t Y cj the difference between the post-treatment and pre-treatment emoticon usage rates for author j, who is in the control group c Ȳ t the average difference between post-treatment and pre-treatment emoticon usage rates for the treatment group: Ȳ t = 1\nnt\n∑ i∈T Y t i\nȲ c the average difference between post-treatment and pre-treatment emoticon usage rates for the control group: Ȳ c = 1\nnc\n∑ j∈C Y c j\nWe can then define the average treatment effect as, ATE = Ȳ t − Ȳ c (1)"
    }, {
      "heading" : "Results",
      "text" : "The distributions of authors’ emoticon usage before and after treatment are shown in Figure 5. By design, both the treatment and control groups have similar distributions of emoticon usage before treatment, with an average emoticon usage of 0.50% (i.e., 0.50% of the tokens from tweets of both the treatment and control users are emoticons). We see a decrease in emoticon usage for the treatment group after treatment, as in the distribution shown in Figure 5. After the treatment intervention, the treatment group has an average emoticon token usage of 0.14%, while the control group has an average of 0.30% of emoticon tokens. The overall emoticon usage trend shown in Figure 3b supports the decreased\nemoticon usage in the control group, even without any intervention. The difference between the emoticon usage of the treatment and control groups is statistically significant by a paired t-test (t = −11.11, p ≈ 1 × 10−27), with an average treatment effect of 0.17% decrease in emoticon symbols per token. A preliminary analysis of the rate of change for different emoticon types shows that happy and playful emoticons, such as :-) and :P, had higher rate of decrease than sad emoticons such as :( . This may be because of seemingly fewer sad face emojis compared to emojis with happy and playful faces; further analysis is left for future work."
    }, {
      "heading" : "Related Work",
      "text" : "Causal Inference and Social Media Analysis\nAlthough causal inference framework has been widely used in fields such as epidemiology and political science to design and analyze randomized experiments, this approach was rare in social media research until recently (Muchnik, Aral, and Taylor 2013; King, Pan, and Roberts 2014). Observational studies of causal phenomena are susceptible to confounds because subjects are not randomly assigned to treatment and control groups as in randomized experiments. Several statistical techniques are developed to mitigate these confounds in observational studies of causal phenomena including matching (Rosenbaum and Rubin 1983; Ho et al. 2007) and stratification (Frangakis and Rubin 2002). There has been some recent work employing causal inference techniques such as matching in large scale quantitative studies using observational social media data (Reis and Culotta 2015; Cheng, Danescu-Niculescu-Mizil, and Leskovec 2015). We apply these approaches to the analysis of linguistic style for the first time."
    }, {
      "heading" : "Linguistic Functions of Emoticons",
      "text" : "Emoticons in textual communication has been long studied and considered to be the expressions of emotions that mimic nonverbal cues in speech (Rezabek and Cochenour 1998; Wolf 2000; Crystal 2006). However, there is an increasing understanding that the meaning of emoticons in CMC goes beyond affective stances and varies with social context and author identity (Derks, Bos, and Von Grumbkow 2007; Schnoebelen 2012; Park et al. 2013). Specifically, Dresner and Herring (2010) draw concepts from speech act theory (Austin 1975) and argue that emoticons are indications of the speaker’s intentions, the illocutionary force of the accompanied textual utterances. They identify three broad linguistic functions of emoticons: (1) as emotion indicators, mapped directly onto facial expressions (e.g. happy or sad), (2) as non-emotional meaning, mapped conventionally onto facial expressions (e.g., joking), and (3) as an indication of illocutionary force that do not map conventionally onto facial expressions (e.g., a smiley mitigating the investment in an utterance). Emojis seem to be able to play similar roles (see below), which is why we contrast them with emoticons in this study."
    }, {
      "heading" : "Emojis in Textual Communication",
      "text" : "With the increased popularity of emojis in textual communication, researchers have started to explore the roles of emojis in textual communication. Kelly and Watts (2015) interviewed a culturally diverse set of 20 participants about the differential use of emojis in mediated textual communication with close personal ties and found that beyond expressing emotions, emojis are used for other purposes such as maintaining a conversational connection, permitting a playful interaction, and creating a shared and secret uniqueness within a particular relationship. Novak et al. (2015) developed a sentiment lexicon for emojis using their usage in tweets.4 Our study is the first to consider how emojis compete with emoticons to communicate paralinguistic content."
    }, {
      "heading" : "Discussion and Future Work",
      "text" : "Our results show that the Twitter users who adopt emojis tend to reduce their usage of emoticons, in comparison with matched users who do not adopt emojis. These results support our hypothesis that the emojis compete with emoticons, and that the introduction of emojis can lead to a decline in orthographic variation. Of course, since Twitter has a restriction on the number of characters, in some sense all linguistic features compete for linguistics functions. Nonetheless, the overwhelming majority of Twitter messages are not near the character limit (Eisenstein 2013), indicating that this is unlikely to be the main reason for the decrease in emoticon characters — rather, it seems more likely that emojis are replacing emoticons in fulfilling the same paralinguistic functions. The next steps in this study are to look at how emojis compete with non-standard language such as expressive lengthening (e.g., cooooolll!!! ), non-standard words (e.g., gud), and abbreviations (e.g., lol).\n4http://kt.ijs.si/data/Emoji_sentiment_ ranking/"
    } ],
    "references" : [ {
      "title" : "How to do things with words, volume 367",
      "author" : [ "J.L. Austin" ],
      "venue" : "Oxford University Press.",
      "citeRegEx" : "Austin,? 1975",
      "shortCiteRegEx" : "Austin",
      "year" : 1975
    }, {
      "title" : "Antisocial behavior in online discussion communities",
      "author" : [ "J. Cheng", "C. Danescu-Niculescu-Mizil", "J. Leskovec" ],
      "venue" : "Proceedings of ICWSM. Menlo Park, California: AAAI Press.",
      "citeRegEx" : "Cheng et al\\.,? 2015",
      "shortCiteRegEx" : "Cheng et al\\.",
      "year" : 2015
    }, {
      "title" : "Language and the Internet",
      "author" : [ "D. Crystal" ],
      "venue" : "Cambridge University Press, second edition.",
      "citeRegEx" : "Crystal,? 2006",
      "shortCiteRegEx" : "Crystal",
      "year" : 2006
    }, {
      "title" : "Emoticons and social interaction on the internet: the importance of social context",
      "author" : [ "D. Derks", "A.E. Bos", "J. Von Grumbkow" ],
      "venue" : "Computers in human behavior 23(1):842–849.",
      "citeRegEx" : "Derks et al\\.,? 2007",
      "shortCiteRegEx" : "Derks et al\\.",
      "year" : 2007
    }, {
      "title" : "Functions of the nonverbal in CMC: Emoticons and illocutionary force",
      "author" : [ "E. Dresner", "S.C. Herring" ],
      "venue" : "Communication Theory 20(3):249–268.",
      "citeRegEx" : "Dresner and Herring,? 2010",
      "shortCiteRegEx" : "Dresner and Herring",
      "year" : 2010
    }, {
      "title" : "What to do about bad language on the internet",
      "author" : [ "J. Eisenstein" ],
      "venue" : "Proceedings of the North American Chapter of the Association for Computational Linguistics (NAACL), 359–369.",
      "citeRegEx" : "Eisenstein,? 2013",
      "shortCiteRegEx" : "Eisenstein",
      "year" : 2013
    }, {
      "title" : "Principal stratification in causal inference",
      "author" : [ "C.E. Frangakis", "D.B. Rubin" ],
      "venue" : "Biometrics 58(1):21–29.",
      "citeRegEx" : "Frangakis and Rubin,? 2002",
      "shortCiteRegEx" : "Frangakis and Rubin",
      "year" : 2002
    }, {
      "title" : "Matching as nonparametric preprocessing for reducing model dependence in parametric causal inference",
      "author" : [ "D.E. Ho", "K. Imai", "G. King", "E.A. Stuart" ],
      "venue" : "Political analysis 15(3):199–236.",
      "citeRegEx" : "Ho et al\\.,? 2007",
      "shortCiteRegEx" : "Ho et al\\.",
      "year" : 2007
    }, {
      "title" : "Letter repetitions in computer-mediated communication: A unique link between spoken and online language",
      "author" : [ "Y.M. Kalman", "D. Gergle" ],
      "venue" : "Computers in Human Behavior 34:187 – 193.",
      "citeRegEx" : "Kalman and Gergle,? 2014",
      "shortCiteRegEx" : "Kalman and Gergle",
      "year" : 2014
    }, {
      "title" : "Characterising the inventive appropriation of emoji as relationally meaningful in mediated close personal relationships",
      "author" : [ "R. Kelly", "L. Watts" ],
      "venue" : "Experiences of Technology Appropriation: Unanticipated Users, Usage, Circumstances, and Design.",
      "citeRegEx" : "Kelly and Watts,? 2015",
      "shortCiteRegEx" : "Kelly and Watts",
      "year" : 2015
    }, {
      "title" : "Reverse-engineering censorship in china: Randomized experimentation and participant observation",
      "author" : [ "G. King", "J. Pan", "M.E. Roberts" ],
      "venue" : "Science 345(6199):1251722.",
      "citeRegEx" : "King et al\\.,? 2014",
      "shortCiteRegEx" : "King et al\\.",
      "year" : 2014
    }, {
      "title" : "Social influence bias: A randomized experiment",
      "author" : [ "L. Muchnik", "S. Aral", "S.J. Taylor" ],
      "venue" : "Science 341(6146):647–651.",
      "citeRegEx" : "Muchnik et al\\.,? 2013",
      "shortCiteRegEx" : "Muchnik et al\\.",
      "year" : 2013
    }, {
      "title" : "Sentiment of emojis",
      "author" : [ "P.K. Novak", "J. Smailovic", "B. Sluban", "I. Mozetic" ],
      "venue" : "CoRR abs/1509.07761.",
      "citeRegEx" : "Novak et al\\.,? 2015",
      "shortCiteRegEx" : "Novak et al\\.",
      "year" : 2015
    }, {
      "title" : "Emoticon style: Interpreting differences in emoticons across cultures",
      "author" : [ "J. Park", "V. Barash", "C. Fink", "M. Cha" ],
      "venue" : "Proceedings of ICWSM. Menlo Park, California: AAAI Publications.",
      "citeRegEx" : "Park et al\\.,? 2013",
      "shortCiteRegEx" : "Park et al\\.",
      "year" : 2013
    }, {
      "title" : "Using matched samples to estimate the effects of exercise on mental health via twitter",
      "author" : [ "V.L.D. Reis", "A. Culotta" ],
      "venue" : "Proceedings of the National Conference on Artificial Intelligence (AAAI), 182–188.",
      "citeRegEx" : "Reis and Culotta,? 2015",
      "shortCiteRegEx" : "Reis and Culotta",
      "year" : 2015
    }, {
      "title" : "Visual cues in computer-mediated communication: Supplementing text with emoticons",
      "author" : [ "L.L. Rezabek", "J.J. Cochenour" ],
      "venue" : "Journal of Visual Literacy 18(2).",
      "citeRegEx" : "Rezabek and Cochenour,? 1998",
      "shortCiteRegEx" : "Rezabek and Cochenour",
      "year" : 1998
    }, {
      "title" : "The central role of the propensity score in observational studies for causal effects",
      "author" : [ "P.R. Rosenbaum", "D.B. Rubin" ],
      "venue" : "Biometrika 70(1):41–55.",
      "citeRegEx" : "Rosenbaum and Rubin,? 1983",
      "shortCiteRegEx" : "Rosenbaum and Rubin",
      "year" : 1983
    }, {
      "title" : "Do you smile with your nose? Stylistic variation in Twitter emoticons",
      "author" : [ "T. Schnoebelen" ],
      "venue" : "University of Pennsylvania Working Papers in Linguistics 18(2):14.",
      "citeRegEx" : "Schnoebelen,? 2012",
      "shortCiteRegEx" : "Schnoebelen",
      "year" : 2012
    }, {
      "title" : "The impacts of emoticons on message interpretation in computer-mediated communication. Social science computer review 19(3):324–347",
      "author" : [ "J.B. Walther", "K.P. D’Addario" ],
      "venue" : null,
      "citeRegEx" : "Walther and D.Addario,? \\Q2001\\E",
      "shortCiteRegEx" : "Walther and D.Addario",
      "year" : 2001
    }, {
      "title" : "Emotional expression online: Gender differences in emoticon use",
      "author" : [ "A. Wolf" ],
      "venue" : "CyberPsychology & Behavior 3(5):827–833.",
      "citeRegEx" : "Wolf,? 2000",
      "shortCiteRegEx" : "Wolf",
      "year" : 2000
    } ],
    "referenceMentions" : [ {
      "referenceID" : 4,
      "context" : ", coooolll) (Dresner and Herring 2010; Kalman and Gergle 2014).",
      "startOffset" : 12,
      "endOffset" : 62
    }, {
      "referenceID" : 8,
      "context" : ", coooolll) (Dresner and Herring 2010; Kalman and Gergle 2014).",
      "startOffset" : 12,
      "endOffset" : 62
    }, {
      "referenceID" : 18,
      "context" : "2 In computer mediated communication (CMC), emoticons are interpreted as “emotion icons”, primarily as a way to represent facial expressions, such as smile, in the absence of non-verbal cues (Walther and D’Addario 2001).",
      "startOffset" : 191,
      "endOffset" : 219
    }, {
      "referenceID" : 17,
      "context" : "However, later research has shown that emoticons are not just representation of affective stances; they play many other roles in written communication such as showing author intention, sociocultural differences, and author identity (Derks, Bos, and Von Grumbkow 2007; Schnoebelen 2012; Park et al. 2013).",
      "startOffset" : 232,
      "endOffset" : 303
    }, {
      "referenceID" : 13,
      "context" : "However, later research has shown that emoticons are not just representation of affective stances; they play many other roles in written communication such as showing author intention, sociocultural differences, and author identity (Derks, Bos, and Von Grumbkow 2007; Schnoebelen 2012; Park et al. 2013).",
      "startOffset" : 232,
      "endOffset" : 303
    }, {
      "referenceID" : 4,
      "context" : "In particular, Dresner and Herring (2010) situate the usage of emoticons in CMC between the extremes of nonlanguage and language.",
      "startOffset" : 15,
      "endOffset" : 42
    }, {
      "referenceID" : 16,
      "context" : "Several statistical techniques are developed to mitigate these confounds in observational studies of causal phenomena including matching (Rosenbaum and Rubin 1983; Ho et al. 2007) and stratification (Frangakis and Rubin 2002).",
      "startOffset" : 137,
      "endOffset" : 179
    }, {
      "referenceID" : 7,
      "context" : "Several statistical techniques are developed to mitigate these confounds in observational studies of causal phenomena including matching (Rosenbaum and Rubin 1983; Ho et al. 2007) and stratification (Frangakis and Rubin 2002).",
      "startOffset" : 137,
      "endOffset" : 179
    }, {
      "referenceID" : 6,
      "context" : "2007) and stratification (Frangakis and Rubin 2002).",
      "startOffset" : 25,
      "endOffset" : 51
    }, {
      "referenceID" : 14,
      "context" : "There has been some recent work employing causal inference techniques such as matching in large scale quantitative studies using observational social media data (Reis and Culotta 2015; Cheng, Danescu-Niculescu-Mizil, and Leskovec 2015).",
      "startOffset" : 161,
      "endOffset" : 235
    }, {
      "referenceID" : 15,
      "context" : "Linguistic Functions of Emoticons Emoticons in textual communication has been long studied and considered to be the expressions of emotions that mimic nonverbal cues in speech (Rezabek and Cochenour 1998; Wolf 2000; Crystal 2006).",
      "startOffset" : 176,
      "endOffset" : 229
    }, {
      "referenceID" : 19,
      "context" : "Linguistic Functions of Emoticons Emoticons in textual communication has been long studied and considered to be the expressions of emotions that mimic nonverbal cues in speech (Rezabek and Cochenour 1998; Wolf 2000; Crystal 2006).",
      "startOffset" : 176,
      "endOffset" : 229
    }, {
      "referenceID" : 2,
      "context" : "Linguistic Functions of Emoticons Emoticons in textual communication has been long studied and considered to be the expressions of emotions that mimic nonverbal cues in speech (Rezabek and Cochenour 1998; Wolf 2000; Crystal 2006).",
      "startOffset" : 176,
      "endOffset" : 229
    }, {
      "referenceID" : 17,
      "context" : "However, there is an increasing understanding that the meaning of emoticons in CMC goes beyond affective stances and varies with social context and author identity (Derks, Bos, and Von Grumbkow 2007; Schnoebelen 2012; Park et al. 2013).",
      "startOffset" : 164,
      "endOffset" : 235
    }, {
      "referenceID" : 13,
      "context" : "However, there is an increasing understanding that the meaning of emoticons in CMC goes beyond affective stances and varies with social context and author identity (Derks, Bos, and Von Grumbkow 2007; Schnoebelen 2012; Park et al. 2013).",
      "startOffset" : 164,
      "endOffset" : 235
    }, {
      "referenceID" : 0,
      "context" : "Specifically, Dresner and Herring (2010) draw concepts from speech act theory (Austin 1975) and argue that emoticons are indications of the speaker’s intentions, the illocutionary force of the accompanied textual utterances.",
      "startOffset" : 78,
      "endOffset" : 91
    }, {
      "referenceID" : 1,
      "context" : "Linguistic Functions of Emoticons Emoticons in textual communication has been long studied and considered to be the expressions of emotions that mimic nonverbal cues in speech (Rezabek and Cochenour 1998; Wolf 2000; Crystal 2006). However, there is an increasing understanding that the meaning of emoticons in CMC goes beyond affective stances and varies with social context and author identity (Derks, Bos, and Von Grumbkow 2007; Schnoebelen 2012; Park et al. 2013). Specifically, Dresner and Herring (2010) draw concepts from speech act theory (Austin 1975) and argue that emoticons are indications of the speaker’s intentions, the illocutionary force of the accompanied textual utterances.",
      "startOffset" : 216,
      "endOffset" : 509
    }, {
      "referenceID" : 9,
      "context" : "Kelly and Watts (2015) interviewed a culturally diverse set of 20 participants about the differential use of emojis in mediated textual communication with close personal ties and found that beyond expressing emotions, emojis are used for other purposes such as maintaining a conversational connection, permitting a playful interaction, and creating a shared and secret uniqueness within a particular relationship.",
      "startOffset" : 0,
      "endOffset" : 23
    }, {
      "referenceID" : 9,
      "context" : "Kelly and Watts (2015) interviewed a culturally diverse set of 20 participants about the differential use of emojis in mediated textual communication with close personal ties and found that beyond expressing emotions, emojis are used for other purposes such as maintaining a conversational connection, permitting a playful interaction, and creating a shared and secret uniqueness within a particular relationship. Novak et al. (2015) developed a sentiment lexicon for emojis using their usage in tweets.",
      "startOffset" : 0,
      "endOffset" : 434
    }, {
      "referenceID" : 5,
      "context" : "Nonetheless, the overwhelming majority of Twitter messages are not near the character limit (Eisenstein 2013), indicating that this is unlikely to be the main reason for the decrease in emoticon characters — rather, it seems more likely that emojis are replacing emoticons in fulfilling the same paralinguistic functions.",
      "startOffset" : 92,
      "endOffset" : 109
    } ],
    "year" : 2015,
    "abstractText" : "Online writing lacks the non-verbal cues present in face-toface communication, which provide additional contextual information about the utterance, such as the speaker’s intention or affective state. To fill this void, a number of orthographic features, such as emoticons, expressive lengthening, and non-standard punctuation, have become popular in social media services including Twitter and Instagram. Recently, emojis have been introduced to social media, and are increasingly popular. This raises the question of whether these predefined pictographic characters will come to replace earlier orthographic methods of paralinguistic communication. In this abstract, we attempt to shed light on this question, using a matching approach from causal inference to test whether the adoption of emojis causes individual users to employ fewer emoticons in their text on Twitter. Introduction People are changing writing to express themselves in online settings, often through the use of non-standard orthographies, such as emoticons (e.g., (:) and letter repetitions (e.g., coooolll) (Dresner and Herring 2010; Kalman and Gergle 2014). The introduction of emojis is a potentially dramatic shift in online writing, potentially replacing these user-defined linguistic affordances with predefined graphical icons. With the ability to access a large number of colorful and expressive emoji pictographs, will users stop employing non-standard orthographies for expressive communication in social media? In this abstract, we address the question of whether the individual users’ adoption of emojis reduces the frequency of emoticons used in their tweets. From a sample of mostly English tweets, we extracted authors who were early adopters of emojis, and consider them as the treatment group. To measure the causal effect of emoji adoption on emoticon usage, we choose another set of authors (control) who were not yet using emojis at the same time as the treatment group, and compare the differences in emoticon usage of these two groups between a period of an year. We matched each author in the treatment group with an author in the control group, based on their emoticon usage rate before the treatment period. If the individuals in the treatment group reduce Copyright c © 2015, Association for the Advancement of Artificial Intelligence (www.aaai.org). All rights reserved. Figure 1: Examples of emoji characters used in Twitter (created using http://www.iemoji.com) their emoticon usage more than the individuals in the control group, this would suggest that emojis are competing with emoticons, and may eventually reduce the amount of nonstandard orthography in social media. Emojis are “picture characters” that originated for mobile phones in Japan in the late 1990s, but recently became popular worldwide in text messaging and social media with the adoption of smartphones supporting input and rendering of emoji characters. In contrast to emoticons, which are created from ASCII character sequences, emojis are represented by unicode characters, and are continuously increasing in number with the introduction of new characters in each new unicode version.1 Emoji characters include not only faces, but also concepts and ideas such as weather, vehicles and buildings, food and drink, or activities such as running and dancing (Figure 1, and example tweets in Figure 2). Emoji Tracker reports real time emoji use on Twitter.2 In computer mediated communication (CMC), emoticons are interpreted as “emotion icons”, primarily as a way to represent facial expressions, such as smile, in the absence of non-verbal cues (Walther and D’Addario 2001). However, later research has shown that emoticons are not just representation of affective stances; they play many other roles in written communication such as showing author intention, sociocultural differences, and author identity (Derks, Bos, and Von Grumbkow 2007; Schnoebelen 2012; Park et al. 2013). In particular, Dresner and Herring (2010) situate the usage of emoticons in CMC between the extremes of nonlanguage and language. We hypothesize that individuals who adopt emojis tend to use fewer emoticons, indicating that emojis are replacing this particular form of orthographic paralinguistic commuhttp://www.unicode.org/reports/tr51/ index.html#Selection_Factors http://www.emojitracker.com/ ar X iv :1 51 0. 08 48 0v 1 [ cs .C L ] 2 8 O ct 2 01 5 Figure 2: Examples tweets using emoji characters nication. We use a matching approach to causal inference to test our hypothesis using observational data from Twitter. Next, we describe the dataset, our study design and report results. Then we first briefly discuss related work and conclude with discussion and future work. Dataset We gathered a corpus of tweets from February 2014 to August 2015, using Twitter’s streaming API. We removed retweets (repetitions of previously posted messages) by excluding messages which contain the “retweeted status” metadata or the “RT” token. We included only authors who have written at least five tweets on average each month and removed authors who have written more than 10% of their tweets in any language other than English. Extracting Emoji and Emoticon Tokens To extract emoji characters from tweets, we converted the messages into unicode representation and used regular expressions to extract unicode characters in the ranges of the “Emoji & Pictographs” category of unicode symbols (other categories include non-Roman characters such as different numbering systems and mathematical symbols). Using this method we identified 1,235 unique emoji characters in a random sample of tweets spanning a period of more than an year (February 2014 to August 2015). Figure 3a shows the percentage of emoji character tokens (i.e., # of emoji tokens # of total tokens ×100%) over time in our our sample of mostly English tweets. 3 As there is no comprehensive list of Twitter emoticons (and new emoticons get introduced over time), we used a data-driven approach to identify emoticons. We constructed regular expressions (e.g., two or more characters with at least one non-alpha numeric character, not containing money/percent/time symbols, etc.) to retrieve an initial set of emoticon-like tokens, and then manually annotated all the items that made up 95% cumulative frequency of emoticon-like tokens, looking at their usage on random examples of tweets. After removing tokens that are not used as emoticons, there were 44 and 52 unique emoticons extracted from tweets of March 2014 and March 2015, respectively. In both cases, the twenty most frequent emoticons made up 90% of all emoticon tokens. Figure 3b shows the percentage of emoticon symbols (i.e., # of emoticon tokens # of total tokens ×100%) over Note that although there is a decreasing trend in emoji usage rate after a peak in June-August 2014 in this sample, emoji usage rate shows an upward trend in a sample of unfiltered tweets, indicating an increasing popularity of emojis on Twitter. (a)",
    "creator" : "TeX"
  }
}