{
  "name" : "1511.04661.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "A System for Extracting Sentiment from Large-Scale Arabic Social Data",
    "authors" : [ "Hao Wang", "Vijay R. Bommireddipalli", "Ayman Hanafy", "Mohamed Bahgat", "Sara Noeman", "Ossama S. Emam" ],
    "emails" : [ "vijayrb}@us.ibm.com", "mohamedb@ie,", "noemans@eg,", "emam@eg}.ibm.com" ],
    "sections" : [ {
      "heading" : null,
      "text" : "Keywords-Arabic, Sentiment Analysis, Social Data, Big Data\nI. INTRODUCTION Enterprises have abundant structured and unstructured data from both internal and external sources, which is often analyzed and mined using computers and algorithms in order to provide better products and services to their customers. With the rise of popularity of social media in the last decade and the availability of social data, enterprises now have a quickly growing interest in getting access to and analyzing social media data to enhance the value of their internal data and gain competitive advantage over competitors. Sentiment analysis is particularly interesting and useful for that purpose. For example, a retailer can use polarity in sentiment to determine customers’ preferences and opinions on a product; a financial service company can track customers’ feedback on social media or from surveys to improve its services. Since we were frequently seeing requirements of social data analytics from the industry, we started building systems to facilitate the analysis of social media data. Such requirements were echoed in Arabic-speaking countries and led to the work described in this paper.\nArabic-speaking online population was growing tremendously in recent years. Arabic was ranked the 4th language in terms of the number of users on the Internet [1, 2]. Among all the online activities, social media was a top catalyst to the growth and has received a lot of attention and popularity in many Arabic-speaking countries fueled by\nrecent events. For example, the proportion of Arabic posts on Twitter has grown from almost nothing in 2011 to the 6th among all the languages in 2013 [3].\nArabic is a particularly interesting language. It has been under extensive research in the domain of natural language processing with recent interests in social data analysis and typically sentiment analysis. Microblog posts in Arabic are abundant in Twitter traffic, one of the most popular social media in the world. Arabic has significant differences in terms of lexical and rich morphological features compared to, for example, Latin derived languages. Therefore, it poses special problems to natural language processing and sentiment analysis. One aspect of the differences is sentence structure. An Arabic sentence can be in the form of VerbSubject-Object or Subject-Verb-Object. Sentences can also be constructed without a verb. Another aspect is the rich morphology in word form. A word can have multiple affixes and take many different forms.\nAnother challenge is from the domain of social media. Most written text in that domain is in different Arabic dialects and not the Modern Standard Arabic (MSA). Dialects in particular present new form of word inflections and sentence structure. The biggest challenge in that domain is the fact that there are no exact rules governing such derived dialect and can vary significantly even within the same country. In this work, we attempt to address this issue in Egyptian and Saudi dialects.\nIn the context of above-mentioned challenges, we built a system to extract sentiment and other kinds of information from large volumes of social data. Being able to process a large amount of data efficiently and quickly is key for acquiring accurate and current information. The size of data helps normalize statistics making it robust against noise while on the other hand it supports the identification of anomalies. Such analysis needs to be performed quickly to allow users to take the right actions at the right time that is a key aspect in a highly competitive environment and volatile customer base.\nThe underlying system used as our framework includes a variety of analytic capabilities, such as sentiment analysis, extracting demographic and geographic information and building user profiles. Because of the limited space, we will briefly describe the overall architecture of the system and focus on sentiment analysis for Arabic.\nIn this work we use a rule-based approach to perform sentiment analysis. This approach basically relies on: 1) a rich set of rules that can capture patterns expressing sentiment in the input; 2) a rich set of sentiment lexicons that can typically capture sentiment aspects in its different forms of expressions building. Many sentiment lexicon resources exist for English. But for Arabic and for a particular domain, the sentiment lexicon has to be built from scratch or enhanced from an existing one.\nMultiple sources of social data are available. Here we focus on Twitter data as the source of social media data.\nII. RELATED WORK In the past years, sentiment analysis and opinion mining are of keen interests to researchers and commercial companies partly because of its potential applications in many areas including marketing, politics, and communications research. Research on sentiment analysis has been conducted on a variety of genres of text (such as blogs, surveys, micro-blogs, product and movie reviews) using rule-based, machine learning or hybrid techniques [4, 5]. There were also efforts to build resources such as sentiment lexicon in different languages to support the task of classifying sentiment. Social media data is quickly becoming a rich source of opinionated text. For that reason, it is not surprising that sentiment in social media is now a popular subject of study [6-8].\nHowever, most of sentiment analysis research focuses on English and other Indo-European languages. Little research in this area has been done for Arabic and its dialects [2, 9]. In particular, sentiment in Arabic social media received little attention from researchers although Arabic social media is gaining popularity in great momentum [9]. SAMAR [10] is a system to address the need of sentiment analysis in Arabic. There were a few more studies on this topic [11-14] and on sentence-level Arabic sentiment analysis [15]. To facilitate sentiment analysis in Arabic, there have been some efforts to build sentiment lexicon for Arabic either from translation of English sentiment lexicon or from scratch [16]. Annotated corpora [17, 18] were also created for Arabic sentiment analysis.\nDespite these efforts, there still large need for contributions to Arabic sentiment analysis and research in the particular challenges posed by Arabic. We attempt to build a system to address many of the challenges and that is easily customizable and adaptable to new domains.\nIII. THE SYSTEM As stated earlier robust insights and results from social media require processing significant amount of data. Speed is also a requirement to help decision makers to react quickly to changes highlighted by analytics insights. Thus, in this section we describe the software platform that our sentiment analytics is developed upon.\nThe underlying platform, IBM BigInsights, is an Apache Hadoop-based product for Enterprise to manage and analyze large volumes of structured and unstructured data using commodity hardware. It includes many additional enterprisegrade features, such as data visualization and exploration,\nsecurity and administration, text analytics and machine learning. It provides a web-based UI for common tasks such as managing the Hadoop cluster, managing files stored on the cluster, and running applications to process and analyze data.\nData from social media, blogs and online forums contains immerse and valuable information about customer behaviors and user profiles. However, loading and analyzing social data is not an easy problem due to the large volume, high velocity and variety of the data. Mining relevant information in social data requires special technical skills in many aspects, such as information extraction, sentiment analysis and entity resolution. To facilitate this task, a software product called Social Data Analytics (SDA) was created on top of the above-mentioned big data platform to provide the capabilities to ingest social data and extract relevant information from social data and build user profiles for specific use cases and industries with minimal effort.\nWith SDA, even a novice user can ingest and analyze social media data, identifying user characteristics like gender, locations, names, and hobbies; develop comprehensive user profiles across messages and sources; associate profiles with expressions of sentiment, buzz, intent, and ownership around brands, products, and companies. It enables data analysts with little knowledge in information extraction and sentiment analysis to get results from social data quickly. Currently it only supports English. This work is a part of the effort to add support for Arabic.\nIn SDA, a component called SystemT is used to build extractors to extract all the above-mentioned information. SystemT [19, 20] is an information extraction system built to make the process of developing extractors easier by providing specialized development tools. A core concept in SystemT is AQL [21], a declarative rule language with a SQL-like syntax. AQL replaces multiple obscure languages typically used to build extractors. Because AQL is a declarative language, rule developers can focus on what to extract, allowing SystemT's cost-based optimizer to determine the most efficient execution plan for the extractors. The sentiment extractor for Arabic described in this work is developed based on SystemT and using AQL. The choice of using a rule-based information extraction system instead of a machine learning approach was determined by our business and technical requirements: the software system needs to be adapted to different domains with expert knowledge from the particular domain; it needs to be developed, enhanced and maintained relatively easily; it also needs to provide customization points for users to fix errors and enhance the extraction results. With these considerations, a rule-based approach was a better option for us (see [22] for more discussion on this topic). Section 6.2 provides details on the AQL rules for the Arabic sentiment extractor.\nIV. NORMALIZATION OF ARABIC DIALECT TEXT Majority of social media text often contains non-standard forms of writing. Such lack of standards can impact significantly the quality of information extracted from processed data. The social media content we are interested in\nis from Egypt and the Kingdom of Saudi Arabia. The posts generally are written in their local dialects that have no formal or standard method of writing. The same word may be written in different spelling variations and using different character sets. In such cases, coverage is negatively impacted significantly causing fewer cases to be captured and analyzed. To reduce the negative impact of non-standard text, the text is normalized at both character and word levels in the beginning of our analysis pipeline.\nArabic character level normalization is a common technique and widely used in Arabic NLP especially in social media retrieval tasks [16, 23]. Words are normalized into some forms that are considered as standard for the application in question. For example, three sets of Arabic characters are commonly confused in informal text: AlefHamza, Yeh-Alef Maksora, and Heh-Teh Marbota. In the first case, the word \"تتننأأ\" (you) with an Alef-Hamza as the standard form in Modern Standard Arabic, is commonly written in dialects as \"تتنناا\" with no Hamza above Alef, or incorrectly written as \"تتننإإ\" with Hamza under Alef. The different forms of Alef are normalized to a single form: in our case the most common one (bare Alef). This form is considered the standard one in our system. Another example of normalization is changing Urdu style Heh (Unicode: 0x06C1) and Teh (Unicode: 0x06C3) which are common in Saudi informal writings to their equivalent in Arabic.\nSome special characters are removed if they are not frequently used or if their use may not be always in the correct form. For example, Diacritics (Tashkeel; Unicode 0x064B to 0x065F) and Kasheeda (Unicode 0x0640) are completely removed from text. Moreover, a common practice in informal text is to repeat characters to show emphasis. In such cases repeated characters are removed to match a known word.\nAnother common practice is the use of Roman (ASCII) characters instead of Arabic characters to write Arabic. An example is the word \"e7na\" which should be converted to \"ااننححاا\" (we). We've developed a phrase-based machine translation [24] like model but on character level to convert from Roman characters to Arabic. It takes into account different possible spellings in Roman where all variations are converted into a single frequent dialect or standard Arabic form. On social media, it is extremely common to write mixed Arabic in Roman characters and actual English words so our sentiment analysis provides a customizable exclusion list for words to be excluded from such kind of normalization.\nV. BUILDING ARABIC SENTIMENT LEXICONS Our approach to sentiment classification requires the creation of sentiment lexicons in positive and negative polarities. To build such resources we started with translating existing English sentiment resources in the current system to Standard Arabic (translating sentiment lexicons has been shown to be quite effective [16]). Then our linguists validated the lexicons and removed irrelevant cases.\nThe Standard Arabic lexicons serve as a common ground for creating sentiment lexicons in other dialects. The next step was to add Egyptian and/or Saudi colloquial dialect\nforms expressing different sentiments. For each Arabic word in the lexicon, the linguists added the Egyptian and Saudi equivalent dialect ones if exist in a different form in a kind of a semantic translation. For example, the Arabic expression “للييممجج ااددجج” (very beautiful) has an equivalent Egyptian one “ووللحح ييوواا” and Saudi one “ةةررمم ووللحح” as well. Lexicons were enriched also by adding sentiment expressions and idioms. Also, it is common to express sentiment through conveying prayers or supplications either for in case of positive sentiment or against in case of negative sentiment. An example for negative sentiment expressions is the Arabic equivalent for “Burn in Hell” which depicts anger at someone. On the other hand the idiom “You are an angle” has positive sentiment and is being used when someone is in support or in favor. Since Arabic dialects differ from MSA phonologically and lexically and do not have standard orthography, the accuracies of morphological analyzers available for Arabic dialects are not comparable to that obtained for MSA (which already by itself has its own morphological complexity). Hence, Arabic morphological analyzers were not considered at this phase, and lexicons were enriched by adding most frequent forms for each word to increase the coverage. For example, for the positive word ةةللييممجج (beautiful), its frequent forms as \"ةةللييممججوو\", \"ةةللييممججللاا\" have been added to the positive lexicon. The linguists enriched the lexicons with negation terms as well to handle the cases where the sentiment is reversed due to negation.\nDisambiguation is another challenge. Some expressions overlap with sentiment terms. For example the expression “ححااببصص ررييخخللاا” (good morning) overlaps with the positive word “ررييخخللاا” (good). Also, some male and female names are derived from adjectives that are confused for sentiment. Examples of female names are “ةةففييططلل” (nice) and “ةةللييممجج” (beautiful), and male names are “ببييببحح” (lover) and “ددييععسس” (happy). Thus it was required to create a blocker lexicon (i.e., an exclusion list), which contains all words, expressions and person names that should not be classified as sentiment terms. To further enrich our polarity and blocker lexicons, the linguists checked a few thousands of Arabic tweets to find terms that were missing. They also enriched the lexicons by adding domain specific sentiment words and expressions to enhance the results for each of the use cases. We ended up having Egyptian and Saudi lexicons of about 14K and 18K entries respectively. Details about Lexicons sizes are shown in Table I. There are common MSA entries between Egyptian and Saudi lexicons. Also Saudi lexicons overlaps with Egyptian ones as some Egyptian terms are commonly used in Saudi dialect as well.\nVI. SENTIMENT CLASSIFICATION"
    }, {
      "heading" : "A. Data set",
      "text" : "In this paper, we focus on Twitter data as the source of social media content, although the system can take as input multiple social sources including Twitter, blogs and discussion boards. To measure the accuracy and performance of the system, Twitter data annotated with sentiment polarity is required. Some annotated Twitter data sets from past studies were made publicly available [15, 16]. However, we have to create a new annotated data set because the system will be initially applied to three use cases: Telecommunications in Egyptian Arabic (Egyptian Teleco), Government in Egyptian Arabic (Egyptian Government), and Employment in Saudi Arabic (Saudi Employment). To build the data set, Gnip Twitter API was used to collect Arabic tweets containing keywords for products and companies in Teleco, political events, jobs and employment. Table II shows some examples of the keywords we used for the Teleco use case.\nThe Twitter data set was collected based on several dimensions. The first dimension was the location from which the tweets originated. We gathered tweets mainly from countries speaking our target dialects (Egyptian Arabic and Saudi Arabic) and also included some Arabic tweets from other Arabic countries and around the world. The second dimension was the time of the tweets posted. For the Egyptian Government use case, we collected historical tweets that were posted during different events in the past. The last dimension was the language variations in the tweets. We tried to capture as much spelling variations as we can for each dialect and use case.\nDuplicated tweets and re-tweets were removed. The final data set contains 5,000 tweets per use case (15,000 in total). It was then given to our Arabic annotators, who were asked to manually assign one of the three labels to each tweet: positive, negative and neutral. A tweet is discarded if the annotators did not agree on its classification. For polarity classification experiments, 400 tweets were randomly selected for each polarity category for every use case to create a balanced test set. Thus, the test set contains 1,200 tweets in total for each use case. The rest of the tweets were used as a development set to enrich sentiment lexicons as mentioned in section 5 as well as to develop and enhance sentiment rules. Sometimes a word could indicate completely different polarities in two use cases. Our sentiment rules and lexicons are created and tuned for each use case. Therefore, they are domain-specific and dialectspecific, although a large part of them is common among the use cases.\nBesides the annotated data set we created to measure accuracy of the system, another Twitter data set is prepared to test the system’s performance in analyzing large-scale data set. It includes a month of tweets collected through the Twitter Decahose API (a 10% sample of entire Twitter traffic) in January 2015, which contains about 1.05 billion tweets. With this large data set, we will show that the system adds value to sentiment analysis by enriching sentiment classification results with demographic and geographic\ninformation. For example, the sentiment results can be further broken down by the gender and location of the authors."
    }, {
      "heading" : "B. Analysis Sequence",
      "text" : "Our sentiment analytic pipeline starts with normalizing the text (see Section 4) in each tweet to reduce data sparseness and to prepare data for the next step. The system then identifies relevant tweets by using a keyword-matching algorithm. All the relevant tweets are then assigned a sentiment label using a complex set of rules as well as polarity and blocker lexicons. The rules implemented in our system for Arabic are described below in three processing phases.\n1) Extraction phase:\n1. Extract polarity terms (words/phrases) from a tweet using polarity lexicons.\n2. Extract blocker terms from a tweet using blockers lexicon. 3. Extract question marks and question words from a tweet\nas it is assumed that questions do not carry any sentiment. 4. Extract terms indicating a contrast in context (e.g., but and\nhowever in English) using a change-context lexicon. When a change-context term occurred, the polarity before the change-context term usually is the opposite of the polarity after it. For example, in\n“ ریيفوت ممدع وھھھهوو يش ھهصقنیي نكل ،٬دیيفموو لماكتم جمانربوو اادج عئاارر مكلمع ھهسفن للااوجلاا ززاھهج طخ يلاا طخلاا ریيغتب ررایيخ”,\nthe word “نكل” (but) is the change-context term. The polarity before it is positive and the actual polarity after it is negative.\n2) Exclusion phase:\n1. Exclude extracted polarity terms that overlap with the extracted blocker term. For example, the extracted polarity term “ریيخلاا” will be discarded if it overlaps with the extracted blockers term “ریيخلاا ححابص”.\n2. Exclude polarity terms if a tweet contains questions as determined by step 2 in Extraction phase. As an exception, terms having strong polarity are not excluded. For example, the polarity term “؟ههدد ففرقلاا ھهیيإإ” (What a shet?), although it comes in question form, it is considered\na strong polarity term and hence is not excluded. We created a small lexicon for strong polarity terms.\n3) Linkage phase: In this phase, we try to link through set of rules, the detected polarity terms to the detected objects-of-interest (e.g., a product name) within the tweet. Examples of such rules are:\n1. A link is created if the assigned polarity and the detected object are not too far apart by a predefined number of tokens, and there are no conflicting/contradiction polarity terms in between.\n2. For polarity terms in the form of preferences (e.g., product A is better than product B), the keyword before the preference term is assigned a polarity that is opposite to the polarity of the keyword after the preference term.\n3. For Conjunction patterns (e.g., product A and product B are difficult to use), both keywords are assigned the same polarity."
    }, {
      "heading" : "C. User Profile Extraction",
      "text" : "As mentioned, analysis results are generated against several user segments. These segments are generally based on gender, marital status, home locations and others. Twitter meta-data provides some of this information in a straightforward manner. But in other cases, users may decide not to add such information to their profile or they don't update in a timely manner. For example, a newly wedded person may not update his or her profile except after a while. Such implicit information may be detected through tweet text contents or the changes of profile description text. Back to the newly wedded example, the user may mention that he's going to get married. Another piece of information that isn't provided by twitter meta-data is parental status. In some cases it's of interest to know such information to understand the market segment. A user changing his or her profile with for example \"Got a new a lovely child\" would imply this person becoming a parent. Or a user tweeting \"Facing motherhood challenges with my new baby\" will imply that this person is a female and a parent. Due to space constraint, we cannot describe how user profiles were created in this paper."
    }, {
      "heading" : "D. Results",
      "text" : "1) Results from the annotated data set.\nThe metrics we used to measure sentiment classification results are precision, recall and the standard F-measure. For each use case and sentiment polarity, 400 annotated tweets were randomly selected as the gold standard and then compared to the classification by the system. The classification results for Egyptian Teleco, Egyptian Government and Saudi Employment use cases are reported in Table III, IV and V, respectively.\nFor Egyptian Teleco, we obtained high precisions for the positive category (81.9%) and for the negative category (92.23%). The neutral category has a moderate precision\n(77.34%) but very high recall (91.43%). The F-scores range from 81.7% to 84.74%. The system was intentionally tuned towards high precision for the positive and negative categories for two reasons. First, positive and negative sentiments are much more interesting than neutral sentiment from a business perspective. Second, precision is often more important than recall in real-world applications. Incorrect classification of a false positive may have more significant negative business impact than a false negative.\nFor Egyptian Government use case, we obtained high precision for the negative category (90.46%) and acceptable precisions for the positive and neutral categories (81.25% and 79.02% respectively). The F-scores range from 82.21% to 84.71%.\nFor Saudi Employment use case, the system performed moderately on the negative category (77.92% precision and 71.48% recall) and not so well on the positive category (52.23% precision and 67.25% recall). The system performed the best on the neutral category comparing to the other two categories. The F-scores for both positive and negative categories are the lowest among the three use cases. Reasons for such subpar performance are likely due to the sarcasm language used which makes it difficult to classify correctly, and also due to wrongly classifying tweets with news contents as positives, meanwhile they should be neutral, as tweets with news content do not carry user sentiment. As an example for sarcasm tweets that were wrongly classified as positives, consider\n“ ممایياا بحاا سب ةلططاع يناا عم ههززاجاا# ??ةةززاجلااا ععوبساا اھهنوودددمیي ببررایي ةةددایيزز”\nHere, the user says that she like holidays although she is unemployed, and hope holiday to be extended! For another example, consider\n“ععررااوشلاا فلتب ةةدحوو* . ! ةعامج ایي ةلاطعلاا ایيحت*” Also here the user salutes the unemployment. In summary, our sentiment analysis has obtained satisfying results for the three use cases with F-scores ranging from 74.56% to 87.3% except the positive category in Saudi Employment. For the positive and negative categories that we are mostly interested in, the F-scores range from 74.56% to 84.74% except the positive category in Saudi Employment. The results are comparable to previous studies on sentiment analysis of dialectal Arabic despite of the many differences in test data sets and the approaches to sentiment classification [10, 12, 15].\n2) Results from the large Twitter data set. A 10% sample of entire Twitter traffic in January 2015 was collected and analyzed using the software system described in Section 3. Among the 1.05 billion tweets, 9158 of them were identified by the system as relevant to the Egyptian Teleco use case (i.e., containing keywords in a predefined set) and contains a positive or negative sentiment. Tweets that are relevant to the use case but have neutral or no sentiment are excluded.\nThis analysis examined Arabic tweets that are relevant to the Egyptian Teleco use case. At the end of the analysis, the system outputs a polarity label if either positive or negative sentiment is detected in a tweet. It also produced comprehensive author profiles including information like gender, marital status, job status, home location, and travel destinations. Enriching the sentiment results with this additional demographic and geographic information greatly helps examining and targeting a specific group of users in real business applications. In this use case of Teleco products and services, 6,536 positive and 2,622 negative sentiments were found. Among those tweets both male and female authors are more positive than negative towards the items we are interested in (Figure 1). We can also easily identify the countries (or even cities) with a large number of keywords of the Teleco products and services (Figure 2). Combining the location information and sentiment, it is instantly clear in which markets the users have a more favorable feedback and in which markets the user feedback are more balanced (Figure 3). With the capability of micro-segmentation, a company can selectively focus on the feedback from highvalue users and geographic locations thus be more effective in carrying out marketing campaigns, improving products and services and etc.\nVII. CONCLUSION We presented a system for classifying sentiment in Arabic text. The system is highly customizable and could be adapted to a new domain with moderate effort. It is capable of handling multiple sources of social media content, including Twitter, blogs and online discussion boards. Thanks the underlying technologies like Apache Hadoop, it can analyze massive amount of data in parallel as we demonstrated in the results. Unlike previous systems and models for Arabic, our system is tuned to high precision and moderate recall, which is often desirable in real world applications where sentiment analysis results have direct and real consequences in a business. Besides sentiment polarity,\nthe system extracts from the data much more information, such as user profiles and geo-locations, which greatly extends the value of sentiment analysis. In summary, the system we described is a valuable and unique contribution to the Arabic sentiment analysis literature.\nFor future work, the system can be improved in several aspects including enhancing the sentiment lexicons, finetuning the rules to capture languages patterns that are missed currently, detecting news content in text, and extending to more domains. The positive category in Saudi Employment use case is definitely a subject of further enhancement. Fortunately, in this system it can be done relatively easily by refining the sentiment lexicons (removing lexicon entries that caused excessive false positives) and adding more rules to capture the special and subtle language patterns used in this particular domain.\nREFERENCES [1] http://internetworldstats.com/stats7.htm [2] Korayem, M., Crandall, D., Abdul-Mageed, M.: Subjectivity and\nsentiment analysis of arabic: A survey. Advanced Machine Learning Technologies and Applications, pp. 128-139. Springer (2012)\n[3] http://bits.blogs.nytimes.com/2014/03/09/the-languages-of-twitterusers\n[4] Pang, B., Lee, L.: Opinion mining and sentiment analysis. Foundations and trends in information retrieval 2, 1-135 (2008)\n[5] Liu, B., Zhang, L.: A survey of opinion mining and sentiment analysis. Mining text data, pp. 415-463. Springer (2012)\n[6] Agarwal, A., Xie, B., Vovsha, I., Rambow, O., Passonneau, R.: Sentiment analysis of twitter data. In: Proceedings of the Workshop on Languages in Social Media, pp. 30-38. (2011)\n[7] Neri, F., Aliprandi, C., Capeci, F., Cuadros, M., By, T.: Sentiment analysis on social media. In: Proceedings of the 2012 International Conference on Advances in Social Networks Analysis and Mining (ASONAM 2012), pp. 919-926. IEEE Computer Society, (2012)\n[8] Wang, H., Can, D., Kazemzadeh, A., Bar, F., Narayanan, S.: A system for real-time twitter sentiment analysis of 2012 us presidential election cycle. In: Proceedings of the ACL 2012 System Demonstrations, pp. 115-120. (2012)\n[9] El-Beltagy, S.R., Ali, A.: Open issues in the sentiment analysis of arabic social media: A case study. In: Innovations in Information Technology (IIT), 2013 9th International Conference on, pp. 215-220. (2013)\n[10] Abdul-Mageed, M., Kübler, S., Diab, M.: Samar: A system for subjectivity and sentiment analysis of arabic social media. In: Proceedings of the 3rd Workshop in Computational Approaches to Subjectivity and Sentiment Analysis, pp. 19-28. (2012)\n[11] Al-Subaihin, A.S., Al-Khalifa, H.S.: A System for Sentiment Analysis of Colloquial Arabic Using Human Computation. The Scientific World Journal 2014, (2014)\n[12] Mourad, A., Darwish, K.: Subjectivity and sentiment analysis of modern standard Arabic and Arabic microblogs. In: Proceedings of\nthe 4th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis, pp. 55-64. (2013)\n[13] Abdul-Mageed, M., Diab, M.T., Korayem, M.: Subjectivity and sentiment analysis of modern standard arabic. In: Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies: short papers-Volume 2, pp. 587-591. (2011)\n[14] Abu-Jbara, A., King, B., Diab, M.T., Radev, D.R.: Identifying Opinion Subgroups in Arabic Online Discussions. In: ACL (2), pp. 829-835. (2013)\n[15] Shoukry, A., Rafea, A.: Sentence-level Arabic sentiment analysis. In: Collaboration Technologies and Systems (CTS), 2012 International Conference on, pp. 546-550. IEEE, (2012)\n[16] Abdul-Mageed, M., Diab, M.: Toward building a large-scale Arabic sentiment lexicon. In: Proceedings of the 6th International Global WordNet Conference, pp. 18-22. (2012)\n[17] Refaee, E., Rieser, V.: An Arabic twitter corpus for subjectivity and sentiment analysis. In: Proceedings of the Ninth International Conference on Language Resources and Evaluation (LREC’14), Reykjavik, Iceland, may. European Language Resources Association (ELRA). (2014)\n[18] Abdul-Mageed, M., Diab, M.T.: AWATIF: A Multi-Genre Corpus for Modern Standard Arabic Subjectivity and Sentiment Analysis. In: LREC, pp. 3907-3914. (2012)\n[19] Chiticariu, L., Krishnamurthy, R., Li, Y., Raghavan, S., Reiss, F.R., Vaithyanathan, S.: SystemT: an algebraic approach to declarative information extraction. In: Proceedings of the 48th Annual Meeting of the Association for Computational Linguistics, pp. 128-137. (2010)\n[20] Li, Y., Reiss, F.R., Chiticariu, L.: SystemT: a declarative information extraction system. In: Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies: Systems Demonstrations, pp. 109-114. (2011)\n[21] Fagin, R., Kimelfeld, B., Reiss, F., Vansummeren, S.: Spanners: a formal framework for information extraction. In: Proceedings of the 32nd symposium on Principles of database systems, pp. 37-48. (2013)\n[22] Chiticariu, L., Li, Y., Reiss, F.R.: Rule-Based Information Extraction is Dead! Long Live Rule-Based Information Extraction Systems! In: EMNLP, pp. 827-832. (2013)\n[23] Darwish, K., Magdy, W., Mourad, A.: Language processing for arabic microblog retrieval. In: Proceedings of the 21st ACM international conference on Information and knowledge management, pp. 2427-2430. ACM, (2012)\n[24] Koehn, P., Och, F.J., Marcu, D.: Statistical phrase-based translation. In: Proceedings of the 2003 Conference of the North American Chapter of the Association for Computational Linguistics on Human Language Technology-Volume 1, pp. 48-54. Association for Computational Linguistics, (2003)"
    } ],
    "references" : [ {
      "title" : "Subjectivity and sentiment analysis of arabic: A survey",
      "author" : [ "M. Korayem", "D. Crandall", "M. Abdul-Mageed" ],
      "venue" : "Advanced Machine Learning Technologies and Applications,",
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 2012
    }, {
      "title" : "Opinion mining and sentiment analysis. Foundations and trends in information retrieval",
      "author" : [ "B. Pang", "L. Lee" ],
      "venue" : null,
      "citeRegEx" : "4",
      "shortCiteRegEx" : "4",
      "year" : 2008
    }, {
      "title" : "A survey of opinion mining and sentiment analysis",
      "author" : [ "B. Liu", "L. Zhang" ],
      "venue" : "Mining text data,",
      "citeRegEx" : "5",
      "shortCiteRegEx" : "5",
      "year" : 2012
    }, {
      "title" : "Sentiment analysis of twitter data",
      "author" : [ "A. Agarwal", "B. Xie", "I. Vovsha", "O. Rambow", "R. Passonneau" ],
      "venue" : "Proceedings of the Workshop on Languages in Social Media,",
      "citeRegEx" : "6",
      "shortCiteRegEx" : "6",
      "year" : 2011
    }, {
      "title" : "Sentiment analysis on social media",
      "author" : [ "F. Neri", "C. Aliprandi", "F. Capeci", "M. Cuadros", "T. By" ],
      "venue" : "Proceedings of the 2012 International Conference on Advances in Social Networks Analysis and Mining (ASONAM",
      "citeRegEx" : "7",
      "shortCiteRegEx" : "7",
      "year" : 2012
    }, {
      "title" : "A system for real-time twitter sentiment analysis of 2012 us presidential election cycle",
      "author" : [ "H. Wang", "D. Can", "A. Kazemzadeh", "F. Bar", "S. Narayanan" ],
      "venue" : "Proceedings of the ACL 2012 System Demonstrations,",
      "citeRegEx" : "8",
      "shortCiteRegEx" : "8",
      "year" : 2012
    }, {
      "title" : "Open issues in the sentiment analysis of arabic social media: A case study",
      "author" : [ "S.R. El-Beltagy", "A. Ali" ],
      "venue" : "Innovations in Information Technology (IIT),",
      "citeRegEx" : "9",
      "shortCiteRegEx" : "9",
      "year" : 2013
    }, {
      "title" : "Samar: A system for subjectivity and sentiment analysis of arabic social media",
      "author" : [ "M. Abdul-Mageed", "S. Kübler", "M. Diab" ],
      "venue" : "Proceedings of the 3rd Workshop in Computational Approaches to Subjectivity and Sentiment Analysis,",
      "citeRegEx" : "10",
      "shortCiteRegEx" : "10",
      "year" : 2012
    }, {
      "title" : "A System for Sentiment Analysis of Colloquial Arabic Using Human Computation",
      "author" : [ "A.S. Al-Subaihin", "H.S. Al-Khalifa" ],
      "venue" : "The Scientific World Journal 2014,",
      "citeRegEx" : "11",
      "shortCiteRegEx" : "11",
      "year" : 2014
    }, {
      "title" : "Subjectivity and sentiment analysis of modern standard Arabic and Arabic microblogs",
      "author" : [ "A. Mourad", "K. Darwish" ],
      "venue" : "Proceedings of  the 4th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis,",
      "citeRegEx" : "12",
      "shortCiteRegEx" : "12",
      "year" : 2013
    }, {
      "title" : "Subjectivity and sentiment analysis of modern standard arabic",
      "author" : [ "M. Abdul-Mageed", "M.T. Diab", "M. Korayem" ],
      "venue" : "Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies: short papers-Volume",
      "citeRegEx" : "13",
      "shortCiteRegEx" : "13",
      "year" : 2011
    }, {
      "title" : "Sentence-level Arabic sentiment analysis",
      "author" : [ "A. Shoukry", "A. Rafea" ],
      "venue" : "Collaboration Technologies and Systems (CTS),",
      "citeRegEx" : "15",
      "shortCiteRegEx" : "15",
      "year" : 2012
    }, {
      "title" : "Toward building a large-scale Arabic sentiment lexicon",
      "author" : [ "M. Abdul-Mageed", "M. Diab" ],
      "venue" : "Proceedings of the 6th International Global WordNet Conference,",
      "citeRegEx" : "16",
      "shortCiteRegEx" : "16",
      "year" : 2012
    }, {
      "title" : "An Arabic twitter corpus for subjectivity and sentiment analysis",
      "author" : [ "E. Refaee", "V. Rieser" ],
      "venue" : "Proceedings of the Ninth International Conference on Language Resources and Evaluation (LREC’14),",
      "citeRegEx" : "17",
      "shortCiteRegEx" : "17",
      "year" : 2014
    }, {
      "title" : "AWATIF: A Multi-Genre Corpus for Modern Standard Arabic Subjectivity and Sentiment Analysis",
      "author" : [ "M. Abdul-Mageed", "M.T. Diab" ],
      "venue" : null,
      "citeRegEx" : "18",
      "shortCiteRegEx" : "18",
      "year" : 2012
    }, {
      "title" : "SystemT: an algebraic approach to declarative information extraction",
      "author" : [ "L. Chiticariu", "R. Krishnamurthy", "Y. Li", "S. Raghavan", "F.R. Reiss", "S. Vaithyanathan" ],
      "venue" : "Proceedings of the 48th Annual Meeting of the Association for Computational Linguistics,",
      "citeRegEx" : "19",
      "shortCiteRegEx" : "19",
      "year" : 2010
    }, {
      "title" : "SystemT: a declarative information extraction system. In: Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies: Systems Demonstrations",
      "author" : [ "Y. Li", "F.R. Reiss", "L. Chiticariu" ],
      "venue" : null,
      "citeRegEx" : "20",
      "shortCiteRegEx" : "20",
      "year" : 2011
    }, {
      "title" : "Spanners: a formal framework for information extraction",
      "author" : [ "R. Fagin", "B. Kimelfeld", "F. Reiss", "S. Vansummeren" ],
      "venue" : "Proceedings of the 32nd symposium on Principles of database systems,",
      "citeRegEx" : "21",
      "shortCiteRegEx" : "21",
      "year" : 2013
    }, {
      "title" : "Rule-Based Information Extraction is Dead! Long Live Rule-Based Information Extraction Systems",
      "author" : [ "L. Chiticariu", "Y. Li", "F.R. Reiss" ],
      "venue" : null,
      "citeRegEx" : "22",
      "shortCiteRegEx" : "22",
      "year" : 2013
    }, {
      "title" : "Language processing for arabic microblog retrieval",
      "author" : [ "K. Darwish", "W. Magdy", "A. Mourad" ],
      "venue" : "Proceedings of the 21st ACM international conference on Information and knowledge management,",
      "citeRegEx" : "23",
      "shortCiteRegEx" : "23",
      "year" : 2012
    }, {
      "title" : "Statistical phrase-based translation",
      "author" : [ "P. Koehn", "F.J. Och", "D. Marcu" ],
      "venue" : "Proceedings of the 2003 Conference of the North American Chapter of the Association for Computational Linguistics on Human Language Technology-Volume",
      "citeRegEx" : "24",
      "shortCiteRegEx" : "24",
      "year" : 2003
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "Arabic was ranked the 4th language in terms of the number of users on the Internet [1, 2].",
      "startOffset" : 83,
      "endOffset" : 89
    }, {
      "referenceID" : 1,
      "context" : "Research on sentiment analysis has been conducted on a variety of genres of text (such as blogs, surveys, micro-blogs, product and movie reviews) using rule-based, machine learning or hybrid techniques [4, 5].",
      "startOffset" : 202,
      "endOffset" : 208
    }, {
      "referenceID" : 2,
      "context" : "Research on sentiment analysis has been conducted on a variety of genres of text (such as blogs, surveys, micro-blogs, product and movie reviews) using rule-based, machine learning or hybrid techniques [4, 5].",
      "startOffset" : 202,
      "endOffset" : 208
    }, {
      "referenceID" : 3,
      "context" : "For that reason, it is not surprising that sentiment in social media is now a popular subject of study [6-8].",
      "startOffset" : 103,
      "endOffset" : 108
    }, {
      "referenceID" : 4,
      "context" : "For that reason, it is not surprising that sentiment in social media is now a popular subject of study [6-8].",
      "startOffset" : 103,
      "endOffset" : 108
    }, {
      "referenceID" : 5,
      "context" : "For that reason, it is not surprising that sentiment in social media is now a popular subject of study [6-8].",
      "startOffset" : 103,
      "endOffset" : 108
    }, {
      "referenceID" : 0,
      "context" : "Little research in this area has been done for Arabic and its dialects [2, 9].",
      "startOffset" : 71,
      "endOffset" : 77
    }, {
      "referenceID" : 6,
      "context" : "Little research in this area has been done for Arabic and its dialects [2, 9].",
      "startOffset" : 71,
      "endOffset" : 77
    }, {
      "referenceID" : 6,
      "context" : "In particular, sentiment in Arabic social media received little attention from researchers although Arabic social media is gaining popularity in great momentum [9].",
      "startOffset" : 160,
      "endOffset" : 163
    }, {
      "referenceID" : 7,
      "context" : "SAMAR [10] is a system to address the need of sentiment analysis in Arabic.",
      "startOffset" : 6,
      "endOffset" : 10
    }, {
      "referenceID" : 8,
      "context" : "There were a few more studies on this topic [11-14] and on sentence-level Arabic sentiment analysis [15].",
      "startOffset" : 44,
      "endOffset" : 51
    }, {
      "referenceID" : 9,
      "context" : "There were a few more studies on this topic [11-14] and on sentence-level Arabic sentiment analysis [15].",
      "startOffset" : 44,
      "endOffset" : 51
    }, {
      "referenceID" : 10,
      "context" : "There were a few more studies on this topic [11-14] and on sentence-level Arabic sentiment analysis [15].",
      "startOffset" : 44,
      "endOffset" : 51
    }, {
      "referenceID" : 11,
      "context" : "There were a few more studies on this topic [11-14] and on sentence-level Arabic sentiment analysis [15].",
      "startOffset" : 100,
      "endOffset" : 104
    }, {
      "referenceID" : 12,
      "context" : "To facilitate sentiment analysis in Arabic, there have been some efforts to build sentiment lexicon for Arabic either from translation of English sentiment lexicon or from scratch [16].",
      "startOffset" : 180,
      "endOffset" : 184
    }, {
      "referenceID" : 13,
      "context" : "Annotated corpora [17, 18] were also created for Arabic sentiment analysis.",
      "startOffset" : 18,
      "endOffset" : 26
    }, {
      "referenceID" : 14,
      "context" : "Annotated corpora [17, 18] were also created for Arabic sentiment analysis.",
      "startOffset" : 18,
      "endOffset" : 26
    }, {
      "referenceID" : 15,
      "context" : "SystemT [19, 20] is an information extraction system built to make the process of developing extractors easier by providing specialized development tools.",
      "startOffset" : 8,
      "endOffset" : 16
    }, {
      "referenceID" : 16,
      "context" : "SystemT [19, 20] is an information extraction system built to make the process of developing extractors easier by providing specialized development tools.",
      "startOffset" : 8,
      "endOffset" : 16
    }, {
      "referenceID" : 17,
      "context" : "A core concept in SystemT is AQL [21], a declarative rule language with a SQL-like syntax.",
      "startOffset" : 33,
      "endOffset" : 37
    }, {
      "referenceID" : 18,
      "context" : "With these considerations, a rule-based approach was a better option for us (see [22] for more discussion on this topic).",
      "startOffset" : 81,
      "endOffset" : 85
    }, {
      "referenceID" : 12,
      "context" : "Arabic character level normalization is a common technique and widely used in Arabic NLP especially in social media retrieval tasks [16, 23].",
      "startOffset" : 132,
      "endOffset" : 140
    }, {
      "referenceID" : 19,
      "context" : "Arabic character level normalization is a common technique and widely used in Arabic NLP especially in social media retrieval tasks [16, 23].",
      "startOffset" : 132,
      "endOffset" : 140
    }, {
      "referenceID" : 20,
      "context" : "We've developed a phrase-based machine translation [24] like model but on character level to convert from Roman characters to Arabic.",
      "startOffset" : 51,
      "endOffset" : 55
    }, {
      "referenceID" : 12,
      "context" : "To build such resources we started with translating existing English sentiment resources in the current system to Standard Arabic (translating sentiment lexicons has been shown to be quite effective [16]).",
      "startOffset" : 199,
      "endOffset" : 203
    }, {
      "referenceID" : 11,
      "context" : "Some annotated Twitter data sets from past studies were made publicly available [15, 16].",
      "startOffset" : 80,
      "endOffset" : 88
    }, {
      "referenceID" : 12,
      "context" : "Some annotated Twitter data sets from past studies were made publicly available [15, 16].",
      "startOffset" : 80,
      "endOffset" : 88
    }, {
      "referenceID" : 7,
      "context" : "The results are comparable to previous studies on sentiment analysis of dialectal Arabic despite of the many differences in test data sets and the approaches to sentiment classification [10, 12, 15].",
      "startOffset" : 186,
      "endOffset" : 198
    }, {
      "referenceID" : 9,
      "context" : "The results are comparable to previous studies on sentiment analysis of dialectal Arabic despite of the many differences in test data sets and the approaches to sentiment classification [10, 12, 15].",
      "startOffset" : 186,
      "endOffset" : 198
    }, {
      "referenceID" : 11,
      "context" : "The results are comparable to previous studies on sentiment analysis of dialectal Arabic despite of the many differences in test data sets and the approaches to sentiment classification [10, 12, 15].",
      "startOffset" : 186,
      "endOffset" : 198
    } ],
    "year" : 2015,
    "abstractText" : "Social media data in Arabic language is becoming more and more abundant. It is a consensus that valuable information lies in social media data. Mining this data and making the process easier are gaining momentum in the industries. This paper describes an enterprise system we developed for extracting sentiment from large volumes of social data in Arabic dialects. First, we give an overview of the Big Data system for information extraction from multilingual social data from a variety of sources. Then, we focus on the Arabic sentiment analysis capability that was built on top of the system including normalizing written Arabic dialects, building sentiment lexicons, sentiment classification, and performance evaluation. Lastly, we demonstrate the value of enriching sentiment results with user profiles in understanding sentiments of a specific user group. Keywords-Arabic, Sentiment Analysis, Social Data, Big Data",
    "creator" : "Word"
  }
}