{
  "name" : "1511.07788.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Spoken Language Translation for Polish",
    "authors" : [ "Krzysztof Marasek", "Krzysztof Wołk", "Danijel Koroinek", "Łukasz Brocki", "Ryszard Gubrynowicz" ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : "1. Introduction",
      "text" : "Spoken language translation (SLT) is becoming more and more important in the increasingly globalized world, both from a social and economic point of view. It is one of the major challenges for automatic speech recognition (ASR) and machine translation (MT), driving intense research activities in these areas. While past research in SLT, due to technology limitations, dealt mostly with speech recorded under controlled conditions, today's major challenge is the translation of spoken language as it can be found in real life. Considered application scenarios range from portable translators for tourists, lectures and presentations translation, to broadcast news and shows with live captioning.\nPolish, one of the West-Slavic languages, due to its complex infection and free word order forms a challenge for statistical machine translation (SMT) as well as for automatic speech recognition (ASR). Seven cases, three genders, animate and inanimate nouns, adjectives agreed with nouns in terms of gender, case and number and a lot of words borrowed from other languages which are sometimes infected as the of Polish origin, cause problems in establishing vocabularies of manageable size for ASR and translation to/from other languages and sparseness of data for statistical model training.\nThe state of speech and language technologies in Polish is still weak compared to other languages [1], even though it is improving at a fast pace and should not be considered as an under-resourced language for very long. Several research projects have emerged in the last couple of years dealing with the topics of automation in the telephony environment [2], transcription of legal documents [3] and recently speech-to- speech translation in different settings [4].\nCommercially, there have been a few local startups and a few attempts by world market leaders, but none have yet achieved real adaptation of LVCSR in the field, with the exception of a few (Google and Apple/Nuance) which include ASR as a free service with their other products.\nDespite the ca. 60 millions of Polish speakers world- wide the number of publicly available resources for the preparation of SLT systems is rather limited, making the progress in that slower than for other languages. In this paper our e orts in preparation of the Polish to English SLT system for various tasks ranging from tourist to captioning and lectures are presented.\nThe remainder of the paper is structured as follows. In section 2 Polish data preparation is described; section 3 deals with parallel data, in sections 4 and 5 training of the ASR and SMT is presented. In 6 a description of the live speech-to-speech system is given. Finally, the paper concludes on a discussion on en- countered issues and future work perspectives in section 7."
    }, {
      "heading" : "2. Polish data preparation",
      "text" : ""
    }, {
      "heading" : "2.1. Acoustic data",
      "text" : "Acoustic corpora are a set of audio recording with corresponding transcription describing its content as accurately as possible. The transcription need not be time aligned with the audio, although it helps if it is aligned, at least to the sentence level. Another big advantage is speaker annotation, which helps with the adaptation process.\nSuch data is usually not easily available for most languages. Since it is quite costly to transcribe audio, very little of it is available for free. A couple of paid Polish corpora exist in language repositories, like LDA or ELRA and recently a few have been released for free under the MetaShare project. Unfortunately, audio data is very domain dependent - variance in acoustic environment (reverberation and noise conditions) and speech styles (number of speakers and their manner of speech) greatly affect the ASR performance. That is why indomain data is always encouraged, at least as a boosting mechanism, if little data is available. The quantity of the data does play an important role. A good corpus size is measured in at least tens or hundreds of hours, but significant improvements were noticed with as much as 2000 hours [5].\nWe used Speecon [6] as a general corpus for the initial acoustic models. It is a large nearlystudio quality corpus with people from various regions in Poland reading short sentences and phrases. The data included in the training set consisted of about 40 hours of speech from 133 different speakers. This was coupled with a similar corpus recorded in the studio at our institute with approximately 28 hours and 221 speakers.\nThe projects we participated in provided some clear specifications of domains that are to be researched. The parliamentary data was acquired from the publicly available data on the government websites. This data was proofread and corrected by human transcribers, because the publicly available transcripts were fixed for presentation purposes and did not accurately describe the recorded speech. The size of this corpus was over 100 hours with almost 900 different speakers (not balanced).\nThe subtitling domain was trained using data acquired from the Euronews channel. These were short (1-5 minute long) reports on various news related topics that amounted to around 60 hours of automatically aligned (not proofread) data. Additionally, a smaller set of interview recordings were downloaded from a popular radio station website. This data was very useful because it contained fairly well speaker annotated transcripts of the interviews. The size of the down- loaded data amounted to approximately 28 hours and 159 speakers.\nThe lecture domain was the most di cult to obtain and most di cult to recognize. A dataset was created from lectures lectures recorded during the Nomadic project1 at our institute, which produced about 13 hours of IT related lectures from 6 lecturers. More data was being prepared from other sources online as this paper was written."
    }, {
      "heading" : "2.2. Monolingual text data",
      "text" : "To train Language Models (LMs), a large collection of textual data is needed. LMs are required for both ASR and SMT. In ASR, they are used to evaluate hypotheses generated by the decoder, while in SMT they are used for both languages in the language pair: to analyse and synthesize grammatically correct sentences.\nThe size of the language corpus should be as big as possible. Sizes of hundreds of millions and even billions of tokens are not uncommon for these tasks. The main goal is to represent as many words in as many contexts in order to achieve substantial statistical significance. The size is also highly correlated with the target vocabulary. Given the infected nature of the Polish language, the vocabulary for the equivalent problem in, for example English, is several times larger. Unfortunately, the amount of digitized textual data in Polish is also far smaller than in English. This makes the quality of such systems even worse.\nAll the language models were trained both well known sources like the IPI PAN corpus [7]\n1 http://nomad.p jwstk.edu.pl/\nand various other online sites and publications: major newspapers, e-books, subtitles, etc. We also used the transcripts of the audio corpora for ne-tuning of the data for specific domains. Ultimately, however, more data al- ways proved to be beneficial in almost every case. The largest dataset used to train a LM contained over 145 million tokens in a raw text le that was ca. 1 GB in size."
    }, {
      "heading" : "3. Parallel data preparation",
      "text" : "A parallel corpus contains the same textual data in two or more languages. There are several issues with such corpora, and just like in the case of acoustic corpora, alignment of parallel streams of data plays a significant role in the quality of training. Parallel corpora are generally difficult to obtain and very expensive to produce - even more than acoustic corpora.\nIn our experiments three main types of corpora were used. First two belonged to very narrow domains: the European parliament Proceedings and medical texts. Second was a system based on movie subtitles, because they can be considered as a sample of natural human dialogs. Finally, a system with a wider domain, based on TED lectures on many different topics was also prepared.\nThe Polish data in the TED talks (15 MB) included almost 2 million words that were not tokenized [8]. The transcripts themselves were provided as pure text encoded in UTF-8 as prepared by the FBK team. Additionally, they were separated into sentences (one per line) and aligned in language pairs. A substantial amount (90 MB) of the English data included the PL-EN Europarl v7 corpus prepared during the Euromatrix project. We also used the 500 MB OPUS OpenSubtutles'12 corpus created from a collection of documents obtained from movie subtitles. The EMEA corpora included around 80 MB of data, and 1,044,764 sentences constructed from 11.67M of words that were not tokenized. The data was introduced as pure text encoded in UTF-8. Furthermore, texts were separated into sentences (one per line) and structured in language pairs. The vocabulary consisted of 148,170 unique Polish and 109,326 unique English word forms. The disproportionate vocabulary size and number of words in each of the corpora presented a challenge, especially when it came to translation from English to Polish .\nBefore the training of the translation model, pre-processing had to be performed. This included the removal of long sentences (set to 80 tokens) using the Moses toolkit scripts [9]. Moses is an open-source toolkit for statistical machine translation, which supports linguistically motivated factors, confusion network decoding, and efficient data formats for translation models and language models. In addition to the SMT decoder, the toolkit also includes a wide variety of tools for training, tuning and applying the system to many translation tasks."
    }, {
      "heading" : "3.1. Polish stem extraction",
      "text" : "In order to cope with the vocabulary size discrepancy, as previously mentioned, stems extracted from Polish words were used instead of surface forms. Since the target language was English in the form of normal sentences, it was not necessary to introduce models for converting the stems to the appropriate grammatical forms. For Polish stem extraction, a set of natural language processing tools available at http://nlp.pwr.wroc.pl was used [8]. These tools can be used for:\n• Tokenization\n• Morphosyntactic analysis\n• Text transformation into the featured vectors\nThe following two components were also included:\n• MACA-a universal framework used to connect the different morphological data\n• WCRFT - this framework combines conditional random fields and tiered tagging\nThese tools used sequentially provide output in XML format. This includes the surface form of the to- kens, stems and morphosyntactic tags. With these les we were able to convert polish words to their surface forms and change the word order in sentences to meet the SVO order. This step was relevant because in English the sentence is usually structured according to the Subject-Verb-Object (SVO) word order. Contrariwise, in Polish the word order is much more relaxed and in itself has no significant impact on the sentence meaning, which is decided mostly around the complicated inflection instead."
    }, {
      "heading" : "3.2. English data preparation",
      "text" : "The English data preparation was far less complex than that of the Polish data. We applied a tool to clean the English data by eliminating foreign words, strange symbols, etc. Compared to Polish, the English data included significantly fewer errors. However, some problems needed to be fixed. The most problematic were portions of text in other languages and strange Unicode symbols."
    }, {
      "heading" : "4. ASR techniques",
      "text" : "The goal of ASR is to convert a sequence of acoustic observations into a sequence of words. This is typically achieved by a Markov process which uses a set of observable acoustic probabilities to derive a sequence of hidden states which form a hierarchal structure that models everything from phonetics to word context in the language.\nThe system used in this paper is based on the Kaldi Speech Recognition toolkit [10], which is a WFST based ASR engine containing many of the state-of- the-art methods and algorithms for ASR, including: cepstral-mean normalization (CMN), linear discriminant analysis (LDA) and maximum likelihood linear transformation (MLLT) feature transformation, vocal tract length normalization (VTLN), subspace Gaussian mixture modelling (SGMM), feature space maximum likelihood linear regression (fMLLR) adaptation, training using maximum mutual information (MMI) criterion and speaker adaptive training (SAT), artificial neural network (ANN) and deep neural net- work (DNN) based models. The system is capable of both offline and online decoding and can output results in various formats including 1-best, n-best and lattices.\nAll the experiments were performed on corpora sampled at 16kHz, saved as uncompressed 16-bit little-endian WAV audio les. The acoustic model was trained with 13 MFCC features (including C0) with delta and acceleration coefficients, giving 39 input features per frame. The signal was framed at 100 frames per second with each frame being 25ms long.\nThe standard Kaldi training procedure consists of several stages, each algorithm building on top of results obtained in the previous stage. For an example training set on the Polish Parliament data, the results shown in table I were achieved.\nThe initial model consists of a standard left-to- right 5-state triphone model. It is also normalized using Cepstral Mean and Variance Normalization. In the next experiment, an LDA transform is calculated on the input data. Following that, two types of optimization mechanisms are tested, with Maximum- Mutual Information criterion performing somewhat better than Minimum Phone Error. Next, speaker adaptation is performed using feature space Maxi- mum Likelihood Linear Regression, after which the MMI adaptation performs even better. Several types of MMI methods are tested: the standard MMI is improved by optimizing both model and feature space errors in the fMMI technique, while BMMI additionally boosts paths that contain more errors. The SGMM method is an optimization technique where all the phonetic states share a common GMM structure. This can prove beneficial in situations when small amounts of training data is available, but in our case it is al- ways outperformed by the aforementioned methods.\nSeveral iterations of systems were tested, with most improvements achieved by adding data for language modeling and increasing vocabulary size. In fact, vocabulary size was the main cause of errors in the experiments, with Out-Of-Vocabulary (OOV) words causing most issues. Results for various domains are presented in table II."
    }, {
      "heading" : "5. SMT techniques",
      "text" : "A number of experiments were performed to evaluate various versions for our SMT systems. The experiments involved a number of steps. Processing of the corpora was performed, which included: tokenization, cleaning, factorization, conversion to lower case, splitting, and a final cleaning after splitting. Training data was then processed in order to develop the language model. Tuning was performed for each experiment. Lastly, the experiments were conducted and evaluated using a series of metrics.\nThe baseline system testing was done using the Moses open source SMT toolkit with its Experiment Management System (EMS) [11]. The SRI Language Modeling Toolkit (SRILM) [12] with an interpolated version of the Kneser-Key discounting (interpolate & kndiscount) was used for 5-gram language model training. We used the MGIZA++ tool for word and phrase alignment. KenLM [13] was used to binarize the language model, with a lexical reordering set to use the msd-bidirectional-fe model. Reordering probabilities of phrases was conditioned on lexical values of a phrase. This considers three different orientation types on source and target phrases like mono- tone(M), swap(S) and discontinuous(D). The bidirectional reordering model adds probabilities of possible mutual positions of source counterparts to current and following phrases. The probability distribution to a foreign phrase is determined by f and to the English phrase by e . MGIZA++ is a multi-threaded version of the well-known GIZA++ tool. The symmetrisation method was set to grow-diag-final-and for word alignment processing. First two-way direction alignments obtained from GIZA++ were intersected, so only the alignment points that occurred in both alignments remained. In the second phase, additional alignment points existing in their union were added. The growing step adds potential alignment points of unaligned words and neighbours. Neighbourhood can be set directly to left, right, top or bottom, as well as to diagonal (grow-diag). In the final step, alignment points between words from which at least one is unaligned were added (grow-diag-final). If the grow-diag-final-and method is used, an alignment point between two unaligned words appears."
    }, {
      "heading" : "5.1. TED results",
      "text" : "The experiments on TED, conducted with the use of the test data from years 2010-2013, are de ned in table III and Table IV, respectively, for the Polish to English and English to Polish translations. They are measured by the BLEU, NIST, TER and METEOR metrics [14]. Note that a lower value of the TER metric is better, while the other metrics are better when their values are higher. BASE stands for baseline sys- tem with no improvements, COR is a system with corrected spelling in Polish data, INF is a system using infinitive forms in Polish, SVO is a system with the subject-verb-object word order in a sentence and BEST stands for the best result we achieved."
    }, {
      "heading" : "5.2. EuroParl and OpenSubtitles results",
      "text" : "For the EuroParl and the OPUS OpenSubtitles we conducted experiments on phrase-based system as well as factored system enriched with POS tags. The use of compound splitting and true casing was optional. Some language models were chosen based on their perplexity measure and then also linearly interpolated. Table V shows partial results of our experiments. We used shortcuts abbreviations E (EuroParl) and O (OpenSubtitles), if there\nis no additional suffix it means that test was baseline system trained on phrase-based model, suffix F (e.g. TF) means we used factored model, T refers to data that was true-cased and C means that a compound splitter was used. If the suffix is I we used infinitive forms of all polish data and the S suffix refers to changes in word order to meet SVO schema. In EuroParl experiments suffix L stands for bigger EN in-domain language model. H stands for highest score we obtained by combining methods and interpolating extra data. G su x stands for tests on translation of our data by Google Translator."
    }, {
      "heading" : "5.3. EMEA results",
      "text" : "For the EMEA corpora we conducted 12 experiments as shown in table VI and table VII. The experiment 00 in these tables illustrates the baseline system. Every single experiment comes as a separate modification of the baseline. In addition, the Experiment 01 relies on the true casing and punctuation normalization.\nThe Experiment 02 is improved with the help of the Operation Sequence Model (OSM). The reason for the introduction of the OSM is the provision of phrase-based SMT models, which can memorize dependencies and lexical triggers. In addition, the OSM uses a source and target context, with an exclusion of the spurious phrasal segmentation problems. The OSM is invaluable, especially for the strong mechanisms of reordering. It combines both translation and reordering, deals with the short and long-distance re- ordering, and does not ask for a reordering limit [15].\nThe Experiment 03 includes a factored model that ensures an additional annotation on the word levels, with a possibility to be exploited in different models. We evaluate the part of speech tagged data in correlation with the English language segment as a basis for the factored phrase models [16].\nHierarchically structured phrase-based translations include both the strengths of phrasebased and syntax-based translations. They use phrases (word segments or blocks) as\ntranslation units, including the synchronous context-free grammar cases as rules (syntaxbased translations). Hierarchically structured phrase models ensure the rules with gaps. Since these are illustrated by non-terminals and the rules them- selves are best evaluated with a search algorithm, which is similar to syntactic chart parsing. These models can be categorized as the class of tree-based or grammar-based models. We applied such a model in the Experiment 04.\nThe Target Syntax model includes the application of linguistic annotation for non-terminals in the hierarchically structured models. This asks for a syntactic parser. In this case, we applied the Collins [17] statistical parser of the natural language in the Experiment 05.\nThe Experiment 06 was executed with the help of stemmed alignment of words. The factored translation model enabled it to come up with the word alignment based on word structure, which differs from the surface word formations. One, apparently very popular, method is to apply stemmed words for these alignments of words. There are two main reasons for such actions. For morphologically richness of languages, stemming deals with the data parity problem. On the other hand, GIZA++ may face serious challenges with the immense vocabulary, while the stemming influences the number of unique words.\nThe Experiment 07 applies Dyer's Fast Align [18], which is actually an alternative for the GIZA++. It works much faster with the better results, especially for language pairs, which come with no need for the large-scale reordering.\nIn the Experiment 08 we applied settings recommended by Koehn with his system of Statistical Ma- chine Translation in WMT'13 [19].\nIn Experiment 09 we changed the language model discounting to Witten-Bell. This discounting method considers diversity of predicted words. It was developed for text compression and can be considered to be an instance of Jelinek-Mercer smoothing. The nth order smoothed model is de ned recursively as a linear interpolation between the n-th order maximum likelihood model and the (n-1)th order smooth model [20].\nLexical reordering was set to hier-mslr-bidirectional-fe in Experiment 10. It is a hierarchical reordering method that considers different orientations: monotone, swap, discontinuousleft, and discontinuous-right. The reordering is modelled bidirectionally, based on the previous or next phrase, conditioned on both the source and target languages.\nCompounding is a method of word formation consisting of a combination of two (or more) autonomous lexical elements that form a unit of meaning. This phenomenon is common in German, Dutch, Greek, Swedish, Danish, Finnish, and many other languages.\nFor example, the word “flowerpot” is a closed or open compound in English texts. This results in a lot of unknown words in any text, so splitting up these com- pounds is a common method when translating from such languages. Moses offers a support tool that splits up words if the geometric average of the frequency of its parts is higher than the frequency of a word. In Experiment 11 we used the compound splitting feature. Lastly, for Experiment 12 we used the same settings as for out of domain corpora in IWSLT'13 [11]."
    }, {
      "heading" : "5.4. Speech-to-speech results",
      "text" : "Previous experiments dealt with ASR and SMT performance as individual systems, but ultimately the system was to be used in a speech-to-speech manner, meaning we would get audio as input and expect text and/or audio in a different language as output. The errors of that process wouldn't be merely a sum of errors of underlying tasks, because the errors in previous steps would cause unforeseen consequences to the following. For example, a word missing in ASR output would cause the SMT system to under-perform in un- predictable ways. Another issue is caused by the fact that SMT expects fully punctuated and capitalized text, but ASR returns only a string of words in lower case.\nTo measure the performance of the SMT system we prepared three sets of 24 sentences chosen from the development set of the Euronews corpus: the original hand-proofed transcript, the normalized, non punctuated and lowercase version of the same transcript and finally the result of ASR. This was com- pared to the hand proofed translation of these sentences. The performance of the ASR on these sentences was 10.7% WER."
    }, {
      "heading" : "6. System setup",
      "text" : "Both the SMT and ASR systems discussed in previous chapters have the ability to perform online computation and work in near real-time manner. A couple of demonstration applications were therefore prepared to present the system in real-life situations.\nThe back-end system was designed in two different ways, according to the requirements of the U-Star and EU-Bridge projects accordingly.\nThe U-Star project developed s set of standardized protocols specifically for S2S translation. The proto- col is based around an XML-like markup language named MCML (Modality Conversion Markup Lan- guage) whose purpose is to convert information from one modality (usually speech or text in a particular language) to another. Requests in the system function as REST calls with MCML documents serving as the basis of communication. The system architecture is based on a series of Tomcat servers that route the in- formation requests from the clients to the respective engines. The organization of the servers is tree-like in structure and allows to perform pivoting , ie. if a language pair is not directly translatable by any of the available engines, a third language can be utilized to complete the transaction.\nThe EU-Bridge project adapted a protocol from one of its early members, that was already used in a commercial program for mobile S2S translation. It uses a much more lightweight XML-like serialized protocol than the complicated MCML document. The overall structure of the server is also much more centralized, ie. star-shaped. There is a single point of convergence for all the participants (clients and engines) all of which share a similar (but slightly different) proto- col to the central server.\nTo test the two service architectures, an application was created for the Android operating system. The application features a text input and a text output field, with the ability to switch languages on either of the fields. The input also has the ability to accept recorded audio."
    }, {
      "heading" : "7. Results and conclusions",
      "text" : "After the transcripts have been extracted from the supplied XML les, the same number of lines for both languages was obtained, but there were some discrepancies in the parallel text. Those differences were caused mostly by repetitions in the Polish text and some additional remarks (like Applause or Thanks ) which were not present in the English text. 28 lines have been manually corrected for the whole set of 134325 lines. Given that the talks were translated mostly by volunteers, the training material seemed a bit noisy and imprecise at times.\nThe vocabulary sizes (extracted using SRILM) were 198622 for Polish and 91479 for English, which shows the fundamental problem for the translation - a huge difference in the vocabulary size.\nTokenization of the input data was done using standard tools delivered with Moses with an extension done by FBK for Polish.\nBefore training a translation model, the usual pre- processing was applied, such as removing long sentences (threshold 60) and sentences with length difference exceeding a certain threshold. This was again done using scripts from the Moses toolkit.\nThe final tokenized, lowercased and cleaned training corpora for Polish and English contained 132307 lines, but with an even bigger difference in thr vocabulary size - 47250 for English vs. 123853 for Polish.\nThis big discrepancy between source and target vocabularies shows a necessity of using additional knowledge sources. First, we decided to limit the size of the Polish vocabulary\nby using stems instead of surface forms and, second, to use morphosyntactic tagging as an additional source of information for the preparation of the SMT system.\nSeveral conclusions can be drawn from the experiment results presented here. It was surprising that the truecasing and punctuation normalization decreased the scores by a significant factor. We suppose that the text was already properly cased and punctuated. We observed that, quite strangely, OSM decreased some metrics' results. It usually increases the translation quality. However, in the PL->EN experiment the BLEU score increased just slightly, but other metrics decreased at the same time. A similar phenomenon can be seen in the EN->PL experiments. Here, the BLEU score increased, but other metrics decreased.\nMost of the other experiments worked as anticipated. Almost all of them raised the score a little bit, or were at least confirmed, with each metric increasing in the same manner. Unfortunately, replication of the settings that provided the best system score on IWSLT 2013 evaluation campaign, did not improve the quality on each data set as we had hoped. The most likely reason is that the data used in the IWSLT did not come from any specific text domain, while elsewhere we dealt with very narrow domains. It may also mean that training and tuning parameter adjustment may be required separately for each text domain if improvements cannot be simply replicated.\nOn the other hand, improvements obtained by training the hierarchical based model were surprising. The same, significant improvements can be observed in both the PL->EN and EN->PL translations, which most likely provide a very good starting point for future experiments.\nTranslation from EN to PL is more di cult, which is demonstrated by the worse results obtained in the experiments. The most likely cause is the complicated Polish grammar as well as the larger vocabulary size.\nThe analysis of our experiments led us to conclude that the results of the translations, in which the BLEU measure is greater than 70, can be considered very good within the selected text domain and those above 50 satisfactory. The high evaluation scores indicate that the translations of some of the tested systems should be understandable by a human and good enough to help him in his work. We strongly believe that improving the BLEU score to a threshold over 80 or even 85 would produce systems that could be used in practical applications, when it comes to PL- EN translations. It may be particularly helpful with the Polish language, which is complex from many aspects of its structure, grammar and spelling.\nFinally, the preliminary S2S experiments presented a few outstanding issues to overcome. The greatest of them being the lack of sentence boundaries, punctuation and capitalization. ASR generally outputs only a stream of words and the lack of any sentence boundaried breaks the SMT process. The actual word errors introduced by the ASR do present a problem, but, de- pending on the domain, they needn't be too harmful and the system can\nstill be quite functional. If the error rate is fairly small, the translation is pretty legible, with OOV being the key issue - a rare word or an entity name missing from the ASR output would be unrecoverable in the latter stages of the process. Disregarding the problems for a moment, the system works surprisingly well at times. The authors hope to evolve it into a fully functional system capable of serving as an agent in a conversation between two humans speaking in different languages."
    }, {
      "heading" : "Acknowledgement",
      "text" : "The research leading to these results has received funding from the European Union Seventh Framework Programme (FP7/2007-2013) under grant agreement no 287658."
    } ],
    "references" : [ {
      "title" : "Gubrynowicz, User-centered design for a voice portal, in Aspects of Natural Language",
      "author" : [ "Krzysztof Marasek", "Łukasz Brocki", "Danijel Korzinek", "Krzysztof Szklanny", "Ryszard" ],
      "venue" : "Processing, pp",
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 2009
    }, {
      "title" : "Cylwik, Jurisdic: Polish speech database for taking dictation of legal texts",
      "author" : [ "Grażyna Demenko", "Stefan Grocholewski", "Katarzyna Klessa", "Jerzy Ogórkiewicz", "Agnieszka Wagner", "Marek Lange", "Daniel Sledzinski", "Natalia" ],
      "venue" : "LREC,",
      "citeRegEx" : "3",
      "shortCiteRegEx" : "3",
      "year" : 2008
    }, {
      "title" : "polish-to-english translation system for the iwslt",
      "author" : [ "Krzysztof Marasek", "Ted" ],
      "venue" : "Proceedings IWSLT 2012,",
      "citeRegEx" : "4",
      "shortCiteRegEx" : "4",
      "year" : 2012
    }, {
      "title" : "A historical perspective of speech recognition",
      "author" : [ "Xuedong Huang", "James Baker", "Raj Reddy" ],
      "venue" : "Communications of the ACM,",
      "citeRegEx" : "5",
      "shortCiteRegEx" : "5",
      "year" : 2014
    }, {
      "title" : "Korpus ipi pan, Wersja wstepna",
      "author" : [ "Adam Przepiórkowski" ],
      "venue" : "Instytut Podstaw Informatyki, Polska Akademia Nauk, Warszawa,",
      "citeRegEx" : "7",
      "shortCiteRegEx" : "7",
      "year" : 2004
    }, {
      "title" : "Real-time statistical speech translation, in New Perspectives in Information",
      "author" : [ "Krzysztof Wołk", "Krzysztof Marasek" ],
      "venue" : "Systems and Technologies,",
      "citeRegEx" : "8",
      "shortCiteRegEx" : "8",
      "year" : 2014
    }, {
      "title" : "Open  source toolkit for statistical machine translation, in Proceedings of the 45th Annual Meeting of the ACL on Interactive Poster and Demonstration Sessions",
      "author" : [ "Philipp Koehn", "Hieu Hoang", "Alexandra Birch", "Chris Callison-Burch", "Marcello Federico", "Nicola Bertoldi", "Brooke Cowan", "Wade Shen", "Christine Moran", "Richard Zens", "Moses" ],
      "venue" : "Association for Computational Linguistics,",
      "citeRegEx" : "9",
      "shortCiteRegEx" : "9",
      "year" : 2007
    }, {
      "title" : "The kaldi speech recognition",
      "author" : [ "Daniel Povey", "Arnab Ghoshal", "Gilles Boulianne", "Lukas Burget", "Ondrej Glembek", "Nagendra Goel", "Mirko Hannemann", "Petr Motlicek", "Yanmin Qian", "Petr Schwarz" ],
      "venue" : "toolkit, in Proc. ASRU,",
      "citeRegEx" : "10",
      "shortCiteRegEx" : "10",
      "year" : 2011
    }, {
      "title" : "Polish â english speech statistical machine translation systems for the iwslt",
      "author" : [ "Krzysztof Wołk", "Krzysztof Marasek" ],
      "venue" : "Proceedings of the 10th International Workshop on Spoken Language Translation,",
      "citeRegEx" : "11",
      "shortCiteRegEx" : "11",
      "year" : 2013
    }, {
      "title" : "Srilm-an extensible language modeling toolkit",
      "author" : [ "Andreas Stolcke" ],
      "venue" : "in INTERSPEECH,",
      "citeRegEx" : "12",
      "shortCiteRegEx" : "12",
      "year" : 2002
    }, {
      "title" : "Scalable modified Kneser- Ney language model estimation, in Proceedings of the 51st Annual Meeting of the Association for Computational Linguistics, So a, Bulgaria",
      "author" : [ "Kenneth Heafield", "Clark", "Philipp Koehn" ],
      "venue" : null,
      "citeRegEx" : "13",
      "shortCiteRegEx" : "13",
      "year" : 2013
    }, {
      "title" : "Alignment of the polish-english parallel text for a statistical machine translation",
      "author" : [ "Krzysztof Wołk", "Krzysztof Marasek" ],
      "venue" : "Computer Technology and Application,",
      "citeRegEx" : "14",
      "shortCiteRegEx" : "14",
      "year" : 2013
    }, {
      "title" : "Munich- edinburgh-stuttgart submissions of osm systems at wmt13",
      "author" : [ "Nadir Durrani", "Alexander Fraser", "Helmut Schmid", "Hassan Sajjad", "Richárd Farkas" ],
      "venue" : "Proceedings of the Eighth Workshop on Statistical Machine Translation,",
      "citeRegEx" : "15",
      "shortCiteRegEx" : "15",
      "year" : 2013
    }, {
      "title" : "Factored translation models",
      "author" : [ "Philipp Koehn", "Hieu Hoang" ],
      "venue" : "in EMNLP-CoNLL. Citeseer,",
      "citeRegEx" : "16",
      "shortCiteRegEx" : "16",
      "year" : 2007
    }, {
      "title" : "Intricacies of collins' parsing model",
      "author" : [ "Daniel M Bikel" ],
      "venue" : "Computational Linguistics,",
      "citeRegEx" : "17",
      "shortCiteRegEx" : "17",
      "year" : 2004
    }, {
      "title" : "A simple, fast, and effective reparameterization of ibm model 2., in HLT-NAACL",
      "author" : [ "Chris Dyer", "Victor Chahuneau", "Noah A Smith" ],
      "venue" : "Citeseer,",
      "citeRegEx" : "18",
      "shortCiteRegEx" : "18",
      "year" : 2013
    }, {
      "title" : "A comparative study of witten bell and kneser-ney smoothing methods for statistical machine translation",
      "author" : [ "AS M Mahmudul Hasan", "Saria Islam", "M Arifur Rahman" ],
      "venue" : "Journal of Information Technology,",
      "citeRegEx" : "20",
      "shortCiteRegEx" : "20",
      "year" : 2012
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "Several research projects have emerged in the last couple of years dealing with the topics of automation in the telephony environment [2], transcription of legal documents [3] and recently speech-to- speech translation in different settings [4].",
      "startOffset" : 134,
      "endOffset" : 137
    }, {
      "referenceID" : 1,
      "context" : "Several research projects have emerged in the last couple of years dealing with the topics of automation in the telephony environment [2], transcription of legal documents [3] and recently speech-to- speech translation in different settings [4].",
      "startOffset" : 172,
      "endOffset" : 175
    }, {
      "referenceID" : 2,
      "context" : "Several research projects have emerged in the last couple of years dealing with the topics of automation in the telephony environment [2], transcription of legal documents [3] and recently speech-to- speech translation in different settings [4].",
      "startOffset" : 241,
      "endOffset" : 244
    }, {
      "referenceID" : 3,
      "context" : "A good corpus size is measured in at least tens or hundreds of hours, but significant improvements were noticed with as much as 2000 hours [5].",
      "startOffset" : 139,
      "endOffset" : 142
    }, {
      "referenceID" : 4,
      "context" : "All the language models were trained both well known sources like the IPI PAN corpus [7]",
      "startOffset" : 85,
      "endOffset" : 88
    }, {
      "referenceID" : 5,
      "context" : "The Polish data in the TED talks (15 MB) included almost 2 million words that were not tokenized [8].",
      "startOffset" : 97,
      "endOffset" : 100
    }, {
      "referenceID" : 6,
      "context" : "This included the removal of long sentences (set to 80 tokens) using the Moses toolkit scripts [9].",
      "startOffset" : 95,
      "endOffset" : 98
    }, {
      "referenceID" : 5,
      "context" : "pl was used [8].",
      "startOffset" : 12,
      "endOffset" : 15
    }, {
      "referenceID" : 7,
      "context" : "The system used in this paper is based on the Kaldi Speech Recognition toolkit [10], which is a WFST based ASR engine containing many of the state-of- the-art methods and algorithms for ASR, including: cepstral-mean normalization (CMN), linear discriminant analysis (LDA) and maximum likelihood linear transformation (MLLT) feature transformation, vocal tract length normalization (VTLN), subspace Gaussian mixture modelling (SGMM), feature space maximum likelihood linear regression (fMLLR) adaptation, training using maximum mutual information (MMI) criterion and speaker adaptive training (SAT), artificial neural network (ANN) and deep neural net- work (DNN) based models.",
      "startOffset" : 79,
      "endOffset" : 83
    }, {
      "referenceID" : 8,
      "context" : "The baseline system testing was done using the Moses open source SMT toolkit with its Experiment Management System (EMS) [11].",
      "startOffset" : 121,
      "endOffset" : 125
    }, {
      "referenceID" : 9,
      "context" : "The SRI Language Modeling Toolkit (SRILM) [12] with an interpolated version of the Kneser-Key discounting (interpolate & kndiscount) was used for 5-gram language model training.",
      "startOffset" : 42,
      "endOffset" : 46
    }, {
      "referenceID" : 10,
      "context" : "KenLM [13] was used to binarize the language model, with a lexical reordering set to use the msd-bidirectional-fe model.",
      "startOffset" : 6,
      "endOffset" : 10
    }, {
      "referenceID" : 11,
      "context" : "They are measured by the BLEU, NIST, TER and METEOR metrics [14].",
      "startOffset" : 60,
      "endOffset" : 64
    }, {
      "referenceID" : 12,
      "context" : "It combines both translation and reordering, deals with the short and long-distance re- ordering, and does not ask for a reordering limit [15].",
      "startOffset" : 138,
      "endOffset" : 142
    }, {
      "referenceID" : 13,
      "context" : "We evaluate the part of speech tagged data in correlation with the English language segment as a basis for the factored phrase models [16].",
      "startOffset" : 134,
      "endOffset" : 138
    }, {
      "referenceID" : 14,
      "context" : "In this case, we applied the Collins [17] statistical parser of the natural language in the Experiment 05.",
      "startOffset" : 37,
      "endOffset" : 41
    }, {
      "referenceID" : 15,
      "context" : "The Experiment 07 applies Dyer's Fast Align [18], which is actually an alternative for the GIZA++.",
      "startOffset" : 44,
      "endOffset" : 48
    }, {
      "referenceID" : 16,
      "context" : "The nth order smoothed model is de ned recursively as a linear interpolation between the n-th order maximum likelihood model and the (n-1)th order smooth model [20].",
      "startOffset" : 160,
      "endOffset" : 164
    }, {
      "referenceID" : 8,
      "context" : "Lastly, for Experiment 12 we used the same settings as for out of domain corpora in IWSLT'13 [11].",
      "startOffset" : 93,
      "endOffset" : 97
    } ],
    "year" : 2015,
    "abstractText" : "Spoken language translation (SLT) is becoming more important in the increasingly globalized world, both from a social and economic point of view. It is one of the major challenges for automatic speech recognition (ASR) and machine translation (MT), driving intense research activities in these areas. While past research in SLT, due to technology limitations, dealt mostly with speech recorded under controlled conditions, today's major challenge is the translation of spoken language as it occurs in real life. Considered application scenarios range from portable translators for tourists, lectures and presentations translation, to broadcast news and shows with live captioning. We would like to present PJIIT's experiences in the SLT gained from the Eu-Bridge 7th framework project and the U-Star consortium activities for the Polish/English language pair. Presented research concentrates on ASR adaptation for Polish (state-of-the-art acoustic models: DBN-BLSTM training, Kaldi: LDA+MLLT+SAT+MMI), language modeling for ASR and MT (text normalization, RNN-based LMs, n-gram model domain interpolation) and statistical translation techniques (hierarchical mod-els, factored translation models, automatic casing and punctuation, comparable and bilingual corpora preparation). While results for the well-de ned domains (phrases for travellers, parliament speeches, medical documentation, movie subtitling) are very encouraging, less de ned domains (presentation, lectures) still form a challenge. Our progress in the IWSLT TED task (MT only) will be presented, as well as current progress in the Polish ASR.",
    "creator" : null
  }
}