{
  "name" : "1601.02431.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Non-standard Linguistic Variation in Online Social Networks",
    "authors" : [ "Claudia Peersman", "Walter Daelemans", "Reinhild Vandekerckhove", "Bram Vandekerckhove", "Leona Van Vaerenbergh" ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : null,
      "text" : "  \nWe present a corpus-based analysis of the effects of age, gender and region of origin on the production of\nboth ‘netspeak’ or ‘chatspeak’ features and regional speech features in Flemish Dutch posts that were collected from a Belgian online social network platform. The present study shows that combining quantitative and qualitative approaches is essential for understanding non-standard linguistic variation in a CMC corpus. It also presents a methodology that enables the systematic study of this variation by including all non-standard words in the corpus. The analyses resulted in a convincing illustration of the Adolescent Peak Principle. In addition, our approach revealed an intriguing correlation between the use of regional speech features and chatspeak features.\nKeywords: Chatspeak, Regional Speech, Age Grading, Gender Effect, Adolescent Peak, Corpus-based Analysis.\nNon-standard Linguistic Variation in Online Social Networks\n  \n2\nIntroduction  \nIn linguistics, non-standard language usage is defined as any language usage that differs from the\n(un)officially recognized prestige language variant as it is used primarily in written language and formal speech situations (Trotta, 2011). Correlations between the use of non-standard language and sociological variables such as age and gender have already been observed in many spoken discourse studies. In her overview of variationist sociolinguistic research, Tagliamonte (2012: 32) states that there is a consensus among sociolinguists (e.g., Wolfram, 1969; Labov, 1972; Trudgill, 1983; Milroy, Milroy, Hartley & Walshaw, 1994; Cheshire, 2002) that of “all the sociolinguistic principles, the clearest and most consistent one is the contrast between women and men”, which is defined as the Gender Effect. More specifically, (i) in stable sociolinguistic stratification, men tend to use more non-standard forms than women do and (ii) women are usually the innovators in linguistic change (Labov, 1990). With regard to Age Grading, research has shown that people of different ages use speech appropriate to their age group (e.g., Downes, 1984; Labov, 1994; Wardaugh, 2002). That is, when a linguistic variety is not part of the standard language, its usage tends to peak during adolescence (i.e., 15-17 year old), “when peer pressure not to conform to society’s norms is greatest” (Holmes, 1992), while pre- and post-adolescents are found to use these variables less frequently (e.g., Labov, 2001; Chambers, 2003). This effect is usually referred to as the Adolescent Peak Principle. However, as social pressure increases and the use of standard language becomes more important for e.g., building a career and/or raising children, people are more inclined to adapt to society’s norms. Hence, the use of standard (or prestige) forms tends to peak between the ages of 30 and 55 (e.g., Tagliamonte, 2012).\nAlthough there is no one-to-one relationship between CMC and spoken discourse (e.g., Daft and Lengal,\n1984; Kiesler, Siegel & McGuire, 1984; Herring, Stein & Virtanen, 2013), paralinguistic and nonverbal cues, which are absent from the written repertoire, are often compensated by ‘netspeak’ or ‘chatspeak’ features, such as emoticons, character flooding and the use of uppercase to express emphasis (e.g., Crystal, 2001). Moreover, the loose cross-turn relatedness in multiparticipant CMC has not only encouraged language play (Herring et al., 2013), leading to the rise of typical chatspeak abbreviations and concatenations (e.g., ‘bff’ (best friends\nNon-standard Linguistic Variation in Online Social Networks\n  \n3\nforever), ‘brb’ (be right back)), it has also led to a tradeoff between strictly applying spelling rules and maximizing one’s typing speed. For example, errors and typos are seldom corrected and punctuation marks are often left out. Although such features are becoming more common across different cultures and languages, Thurlow and Poff’s (2013) research showed less convergence of such practices than predicted by Baron (1984). Moreover, they found a tendency to represent ‘regiolectal spellings’ in text messages (SMS) within the US (see also Eisenstein, O’Connor, Smith & Xing, 2010; Siebenhaar, 2006).\nIn this study, we introduce a corpus of Flemish Dutch posts from the Netlog social network1 that was\ncollected without any researchers’ interventions, together with the users’ profile information (age, gender and location). What makes this corpus interesting for studies on non-standard linguistic variation, is that it contains two types of non-standard language use to which the above mentioned Age Grading and Gender Effect could apply: (i) newly incoming non-standard forms — of which (female) adolescents have been shown to be the innovators in spoken discourse (e.g., Tagliamonte, 2012) — that are characteristic of CMC, and (ii) written representations of regional and dialect forms that are typical for colloquial speech in Flanders (see also Vandekerckhove & Nobels, 2010). However, studies on dialect vitality in Flanders (e.g., Vandekerckhove, 2009; Van Keymeulen, 1993) have shown that especially younger people tend to use fewer dialect forms than they did a few decades ago. Therefore, we examine the effect of age, gender and region on both these types of non-standard language use based on a subset of the Netlog corpus, which was balanced according to age (13 to 49), gender and dialect region (West-Flanders, East-Flanders, Brabant and Limburg). We first perform a qualitative analysis by manually categorizing all non-standard words that were present in this subset as either typical chatspeak features or belonging to one (or more) of the Flemish dialects or regiolects. Based on this linguistic information we set up a forward stepwise mixed-effects logistic regression analysis (Breslow & Clayton, 1993), in which we examine the effects of age, gender and region on the production of both chatspeak and regiolectal forms in our subset. This corpus-based approach, in which we include all occurrences of nonstandard language, also enables us to construct a more systematic view of these effects in our CMC corpus.\nNon-standard Linguistic Variation in Online Social Networks\n  \n4\nWe start with a description of the Netlog corpus, in which we also illustrate both types of non-standard\nlanguage use we encountered in it. Next, we turn to the first part of our study in which we describe the compilation of the Netlog subset and elaborate on the operationalization of non-standard language. We also explain which parameters were used to attribute the words to one of both types of non-standard language use. Next, we present the results of the statistical analyses and compare them to previous findings in related research. We conclude our study with an overview of our results and our research contributions."
    }, {
      "heading" : "The Netlog Corpus",
      "text" : ""
    }, {
      "heading" : "Structure",
      "text" : "Netlog is a Belgian online social networking platform that focuses mainly on European adolescents and has over 99 million members, utilizing over 40 different languages. Members can create a profile page containing blogs, pictures, videos, events, playlists, etc. that can be shared with other members. The entire Netlog corpus contains 1,537,283 Flemish Dutch Netlog posts with a total of 18,713,627 tokens (i.e., words, emoticons and punctuation marks). For each post we were able to obtain information about the age, gender and geographical location of the authors. The posts have an average length of 12.2 word tokens. Table 1 provides an overview of the distribution of the users per main dialect region, gender and age group. Since it was impossible to perform manual verification of the linked profiles, it is possible that some of the profiles contain false information. However, we assume the number of these posts to be too limited to be of concern for the statistical analyses.\nNon-standard Linguistic Variation in Online Social Networks\n  \n5"
    }, {
      "heading" : "Characteristics of Non-Standard Language Variation in Flanders and its Reflection in Chatspeak",
      "text" : "constitute a vertical and horizontal continuum (cf. Auer & Hinskens, 1996). The so-called horizontal continuum relates to the dialectal and regiolectal geolinguistic variation, whereas the vertical continuum ranges from small-scale local dialects to the standard language, in this case Belgian Standard Dutch, which deviates from Netherlandic Dutch in some minor respects. The diaglossic vertical continuum (see also Auer, 2005) is marked by intermediate varieties that are typical of Flemish colloquial speech. Their use seems to be expanding at the expense of the two poles of the continuum (Van Hoof & Vandekerckhove, 2013; Grondelaers & Van Hout, 2011; Vandekerckhove, 2009). These popular ‘in-between’ or regiolectal (rather than dialectal) varieties are still marked by regional differences (e.g., Geeraerts, 2001), and can be grouped according to their geographical distribution into four main regiolect areas: Brabant (Antwerp and Flemish-Brabant), WestFlanders, East-Flanders and Limburg (see Figure 1). In Table 2 we provide an example post for each region from our corpus and its equivalents in Standard Dutch and English. Since these regional non-standard varieties are frequently used in Flemish Netlog users’ posts, they are crucial for the present study. However, a complicating factor is that there is no standard spelling for regional features. As a consequence, non-standard\nNon-standard Linguistic Variation in Online Social Networks\n  \n6\nforms can be represented by multiple spelling variants. For example, the non-standard Flemish use of ‘schoon’ in the meaning of beautiful2 occurs in the Netlog corpus as ‘schoon’, ‘schuun’, ‘sgoown’, ‘sgoon’, ‘skone’, ‘skoon’, ‘skwone’, ‘skwune’, ‘skwoane’, ‘skwunne’ and ‘skwnee’. This enormous amount of orthographic variation proves a major challenge in the selection and categorization of written chat data.\nApart from these occurrences of regional non-standard variation, a second type of non-standard language\nvariation, typical of chatspeak in general, is found in our corpus: Netlog users often omit letters or even entire words or use abbreviations and acronyms in order to maximize their typing speed. In addition, spelling errors are rarely corrected and punctuation marks are often left out. Moreover, to emphasize the content, a flooding of characters or uppercase is often used and (parts of) sentences are concatenated. This is illustrated in Table 3. In certain cases, chatspeak features and non-standard regional features may be combined in one single lexeme. For example, the word ‘wroem’ is an abbreviated form of ‘woaroem’, which represents the dialect pronunciation of ‘waarom’ (why) in Brabant, while ‘skwne’ is short for ‘skwunne’ or ‘skwoane’, which is the south-eastern West-Flemish variant of ‘schoon’ (beautiful).\nFigure 1. The Four Main Dialect Regions in Flanders: West-Flanders, East-Flanders, Brabant and Limburg.\nNon-standard Linguistic Variation in Online Social Networks\n  \n7\nbalanced subset of the Netlog corpus."
    }, {
      "heading" : "Context",
      "text" : "The study of the variation of linguistic characteristics in CMC according to an authors’ age or gender has\nbeen a popular subject in both sociolinguistic and computational linguistic studies. At first, most of the studies\nNon-standard Linguistic Variation in Online Social Networks\n  \n8\nwere based on large collections of weblogs or “blogs”, i.e., personal, informal writings listed in reversechronological order on a blogger’s web site (e.g., Sarawgi, Gajulapalli & Choi, 2011; Mukherjee & Liu, 2010; Zang & Zang, 2010; Goswami, Sarkar & Rustagi, 2009; Argamon, Koppel, Pennebaker & Schler, 2007; Nowson & Oberlander, 2007; Yan & Yan, 2006). The main advantage of using blog corpora is that blog sites are publicly available and they usually contain information about the blogger’s profile. Argamon et al. (2007), Goswami et al. (2009) already analysed distributions of (non-dictionary) words in blogs with regard to age and gender. Although their research focused on automatically predicting age and gender in CMC and not on linguistic variation, the study did report that teenage bloggers tend to use more non-dictionary words than adult bloggers do. Additionally, in their analysis of the number of non-dictionary words used per 1000 words across the 10s, 20s, 30s and higher age groups, female teen bloggers clearly used more non-dictionary words than the male teens, but the other age groups did not show significant gender differences. However, because other modes like online social networks or chat rooms usually do not provide open access to their users’ profile, to our knowledge, there is only one study that employs a quantitative approach to investigate the correlation between the non-standard language usage and profile metadata in these modes of CMC: in his study on code choice and code-switching in Swiss-German chat rooms, Siebenhaar (2006) found that younger and older chatters use more dialect than chatters of the middle-aged group, but his study was only based on a list of 70 Standard German words that had a corresponding form in Swiss German. Consequently he could only investigate about 10 percent of the words in his chat corpus.\nWith regard to Flemish spoken discourse, Plevoets (2008) also studied the effects of age, gender and region\nin a corpus of spoken Dutch transcriptions (the CGN3, which also includes spontaneous informal speech) on the use of “in-between”-varieties. His study revealed a correlation between register and region and between register and age, meaning that the dialectic background of the regions is still reflected in informal speech and that Flemish people born in 1940 or later clearly use non-standard variation in these situations. No correlation was found between register and gender. However, his study only included a prototypical set of linguistics features, the selection of which was determined by prior knowledge about the central Brabantic regiolect. Moreover,\nNon-standard Linguistic Variation in Online Social Networks\n  \n9\nduring the compilation of this corpus the informants who participated in the so-called ‘spontaneous conversations’ all received the explicit request to stick to Standard Dutch, which — as we mentioned before — does not correspond with actual Flemish colloquial speech practices. Furthermore, although there were no researchers present during the conversations, the informants actually had to record them. Both these factors, of course, did not contribute to the spontaneity of the conversations.\nThe present study examines the effects of age, gender and region — including potential interactions — on the use of typical chatspeak features and regional speech features in a corpus of Flemish social network posts. Moreover, we include all occurrences of non-standard language use in our analyses, which enables a more systematic study of both feature types. In the first part of our study, we go into the extraction and preprocessing of a subset of the Netlog corpus and discuss the balancing of our data over age, gender and region. We also describe the operationalization of non-standard language and the parameters that were used to categorise each non-standard word into one of both types. In the second part, we turn to a discussion of the results of the statistical analyses."
    }, {
      "heading" : "Compilation of a Netlog Subset",
      "text" : "Posts on the Netlog social network can contain multiple quotes from previous posts, of which we do not\nhave the correct age, region and gender metadata. Therefore, the first step in pre-processing the data consisted of extracting only the last post of each interaction, of which we do have the required metadata, and saving these as separate files. In the second step of pre-processing we tokenized our dataset, lowercased all words and removed all punctuation marks, emoticons, e-mail addresses, phone numbers and hyperlinks so that only the word forms remained. Additionally, we reduced all four or more consecutive identical characters (character flooding) to three, so that e.g., the tokens ‘niiice’ and ‘niiiiiice’ (nice) were considered as the same type4. Given that the individual language usage of a Netlog user could bias our results if he or she was represented in the\nNon-standard Linguistic Variation in Online Social Networks\n  \n10\ndataset by multiple posts, we chose to include only one post per user. Furthermore, we only selected posts that contained a minimum of three words.\nFor the age distribution in our dataset, we aimed at an equal distribution over 10s, 20s, 30s and 40s, but as the minimum age to create a Netlog profile is 13, we balanced our dataset per age year from 13 to 49. We did not include data from users older than 50, because there were not enough data available for each combination of age group and region in our dataset.\nThe smallest group of available authors in the corpus was the 34-year-old female group from Limburg with\nonly 27 unique authors that had produced a post of at least three words. Therefore, we balanced our dataset as follows: 27 posts per age year (13 to 49), gender (male and female) and dialect region (West-Flanders, EastFlanders, Brabant and Limburg). This resulted in 7,952 posts (3,963 female and 3,989 male), which together accounted for 129,358 words. There were 1,998 authors from West-Flanders, 1,998 from East-Flanders, 1,995 authors from Brabant and 1,961 from Limburg.\nThe next phase of pre-processing consisted of extracting the number of standard and non-standard words per\npost. This categorization was done automatically by matching each word to the official wordlist of the Dutch Language5, Standard English or Standard French6. We define a non-standard word as a word that does not occur in these lists, nor in a list of personal, geographical and brand names we collected manually. This resulted in the following information for each word in the subset: author ID, age, gender and region and a binary score for ‘non-standardness’: 0 if it was found in our standard word list or in the list of names and foreign words, and 1, otherwise. The dataset contained 115,914 (90%) standard and 13,444 non-standard words."
    }, {
      "heading" : "Categorizing the Data",
      "text" : "The Netlog corpus and its subset contain two types of non-standard language use: non-standard chatspeak\nforms and written representations of regional speech (either dialect or levelled dialect/regiolect) that are typical for everyday speech in Flanders. To investigate whether age, gender and/or region show a significant effect on\nNon-standard Linguistic Variation in Online Social Networks\n  \n11\nthe production of one of these types or both, we categorized each word that was labelled as non-standard during the pre-processing of the subset (see the previous section) as either chatspeak or regional.\nFirst, we categorized all occurrences of spelling deviations and typing errors (i.e., both deliberate deviations\nfrom the standard language and undeliberate errors, e.g., ‘vandaga’ instead of ‘vandaag’ (today), ‘gecontacteert’ instead of ‘gecontacteerd’ (contacted)), character flooding (e.g., ‘waaarom’ instead of ‘waarom’ (why)) and all abbreviations and other creative adaptations that do not show any regional influence (e.g., ‘bff’ (best friend forever) and ‘vr’ for ‘voor’ (for)) as chat language. In the chat category we also included all forms that represented standard spoken Dutch, but were written in a non-standard way (e.g., all clitics without regional features like ‘kheb’ for “‘k heb” (I have), standard Dutch pronunciation assimilations like ‘feesje’ instead of the standard written form ‘feestje’ (party) and reduced forms of personal pronouns such as ‘dachtek’ for “dacht ik” (thought I)). Non-standard English forms (e.g., ‘disign’ instead of ‘design’, ‘wanna’ for ‘want to’) were also included in the chat category.\nWords in the regional speech category had to display dialect or regiolect features at the level of vocabulary,\nthe representation of vowels and consonants, inflections or conjugations. In other words, although our analysis was performed at the lexeme level, phonological, morphological and lexical deviations from Standard Dutch were taken into account when categorizing a word into the regional speech category. In addition, abbreviated forms that showed regional influence in the process of abbreviating were also included. For example, the Standard Dutch word ‘voor’ (for) was represented by ‘vr’, ‘veu’ and ‘vo(e)’ in our subset: the first abbreviation ‘vr’ does not show any regional influence and was categorized as chat, while the other two varieties lean towards the Brabantic and West-Flemish pronunciation respectively and were therefore categorized as regional speech. We provide some examples of regional words, their Standard Dutch equivalents and their English translation in Table 4.\nIn the next two sections we examine the effects of age, gender and region on the distribution of both types of non-standard words (chatspeak and regional speech) in our Netlog subset. To assess these effects, we employed two separate mixed-effects logistic regression analyses with random by-author intercepts. In the first part we\nNon-standard Linguistic Variation in Online Social Networks\n  \n12\ncompare typical chatspeak productions with standard language productions and in the second part we compare regional word productions with standard language productions. Our analyses were based on 114,327 standard, 5,885 regional and 9,146 chatspeak features.\nTable 4. Examples of Flemish dialect variation in the Netlog subset.\nType of Dialect\nVariation\nNetlog\nexample\nStandard\nDutch\nEnglish\nVocabulary\nbegaaie\nkozn\nlekstok mokkes\nvuil maken\nneef lolly\nmeisjes\nto smudge\nnephew lollipop\ngirls\nVocals\noltid\nworoem\nzuizu\nweurst\naltijd\nwaarom sowieso\nworst\nalways\nwhy\nanyway sausage\nConsonants\nskone vinne\npercies\ngeleje\nschone vinden precies geleden\nbeautiful\nto find\njust ago\nInflections\nschatteke\ndieje\nbroere dadde\nschatje\ndie\nbroer\ndat\nhoney\nthat\nbrother\nthat\nConjugations\nkgaan hemk\neje\nkzin\n‘k ga\nheb ‘k heb je ‘k ben\nI go\nhave I\nhave you\nI am\nNon-standard Linguistic Variation in Online Social Networks\n  \n13"
    }, {
      "heading" : "Regiolectal Features Versus Chatspeak Features",
      "text" : "Analysis 1: Effects of Age, Gender and Region on the Production of Chatspeak Features.\nTo assess the effects of age, region, and gender and potential interactions on the probability of chatspeak\nproduction (chatspeak vs. standard), we employed stepwise mixed-effects logistic regression (Breslow & Clayton, 1993).7 To allow for non-linearity in the effect of age, restricted cubic splines were used (Harrell, 2001), meaning that the age variable was split in a number of intervals with the effect of age on the probability of producing a chat word being fitted as a cubic curve within each interval. At the meeting points of these intervals — the knots — the curves are constrained to have smooth transitions, and beyond the observed values, the independent variable (in this case age) is assumed to be linearly related to the dependent variable (in this case chatspeak probability). Each knot adds a coefficient to the regression model, which can be tested for its statistical significance. There were 123,473 words in this data set: 114,327 (93%) standard words and 9,146 chat words. The observations were clustered in 7,950 authors (3,962 female, 3,988 male). The dataset included 1,994 authors from Brabant, 1,961 from Limburg, 1,997 from East-Flanders and 1,998 from West-Flanders.\nTo investigate the age effect, knots were placed at the begin- and endpoint, respectively 13 and 49, and at the\nages 27, 33, and 39. The knots at 27, 33 and 39 were added after visual inspection of the mean proportions of non-standard language per age. Additionally, we also placed knots at the ages of 15 and 17 to test whether the Adolescent Peak Principle (e.g., Chambers, 2003; Labov, 2001) can also be found in our CMC data. Given that recent studies in Flemish linguistics (e.g., Vandekerckhove, 2009; Taeldeman, 2008; Plevoets, 2008; Van Keymeulen, 1993) discuss (and in some cases question) the importance of the Brabant region in the recent development of regiolects that have a wider geographical range than the local dialects do, in this analysis, region was treatment-coded with Brabant as the reference level.\nThe results of our analysis are summarized in Figure 2, which shows the effects of age, region and gender on\nthe chat word probability. The final model contained significant main fixed effects for age (χ2(6) = 1038.7, p <\nNon-standard Linguistic Variation in Online Social Networks\n  \n14\n.001) and region (χ2(3) = 25.1, p < .001) with random intercepts for author (SD = 0.86). Gender did not have a significant effect (χ2(1) = 2.58, p = .108) and there were no significant interactions between age and region (χ2(18) = 8.25, p = .975), age and gender (χ2(6) = 8.79, p = .186) or gender and region (χ2(3) = 3.75, p = .289). As our analysis shows, age did have a significant non-linear effect on the chat word probability. The probability of the production of a chatspeak feature by users from Brabant rose from around 0.15 at 13 to a peak of 0.19 at 15, decreased sharply after that peak until it reached 0.05 at the age of 28. This rise and fall of the chat word probability strongly supports the Adolescent Peak Principle. Although female adolescents are thought to be the innovators of newly incoming non-standard forms — which in this case would be typical chat words like ‘zjg’ for ‘zie je graag’ (love you) — there was no interaction between age and gender, which means that our results show no change in the gender effect on the chat word probability during the adolescent peak. Quite unexpectedly, we found a very slight (and not significant) increase in the chat word probability between 29 and 33, but after the age of 33, it steadily decreases to reach 0.03 at the age of 41 and remains constant at older ages. As for the region variable, we found no significant difference in chat word probability between EastFlanders and Brabant (β = 0.05, SE = 0.05, p = .288), but Netlog users from Limburg were significantly less likely to produce chatspeak features than users from Brabant (β = −0.11, SE = 0.05, p = .023), while users from West-Flanders employed significantly more chatspeak forms than users from Brabant (β = 0.12, SE = 0.05, p = .010).\nNon-standard Linguistic Variation in Online Social Networks\n  \n15\nAnalysis 2: Effects of Age, Gender and Region on the Production of Regiolectal Features\nTo assess the effects of age, region, and gender and potential interactions on the probability of a regional\nword production (regional speech vs. standard), we used the same approach as for the previous analysis, namely forward stepwise mixed-effects logistic regression. The data set consisted of 120,212 words, of which 114,327 were standard words and 5,885 were regional speech features.8 These observations were clustered in 7,932 authors (3,953 female, 3,979 male). In this analysis, the dataset contained Netlog posts from 1,992 Brabantic, 1,956 Limburgish, 1,988 East-Flemish and 1,996 West-Flemish authors. To capture the non-linearity in the relation between age and dialect word probability, a restricted cubic spline function was fitted with five knots. After visual inspection of the regional word production proportions per author, knots were placed at the endpoints 13 and 49, and at the ages 15, 17, and 33. The knots at 15 and 17 again tested the adolescent peak\nNon-standard Linguistic Variation in Online Social Networks\n  \n16\nhypothesis. There were no additional non-linearities to account for (χ2(1) = 0.18, p = .667).\nThe results of the regional speech use analysis are summarized in Figure 3. The analysis showed significant\nmain fixed effects for age (χ2(4) = 782.36, p < .001) and region (χ2(3) = 98.12, p < .001) with random intercepts for author (SD = 1.30). Gender again did not show a significant effect on the regional word probability (χ2(1) = 0.64, p = .425), and there were no significant interactions between gender and age (χ2(4) = 8.89, p = .064), or gender and region (χ2(3) = 1.55, p = .670). Although a likelihood ratio test indicated that there was a significant interaction between age and region (χ2(12) = 33.04, p < .001), none of the interaction coefficients differed significantly from zero (all Wald z p-values > .16). With regard to the age variable, as is visualized in Figure 3, the probability of producing a regional word for authors from Brabant rose from around 0.07 at the age of 13 to a peak of 0.11 at 15, and then decreased smoothly to a value around 0.01 at 49. As for the region variable, we found no significant difference in regional word probability between East-Flanders and Brabant (β = −0.01, SE = 0.07, p = .875). The curves for these two regions coincide almost perfectly. However, Netlog users from Limburg were significantly less likely to produce regional speech features than users from Brabant (β = −0.42, SE = 0.07, p < .001). Additionally, West-Flemish authors employed significantly more regional words than users from Brabant did (β = 0.26, SE = 0.07, p < .001).\nNon-standard Linguistic Variation in Online Social Networks\n  \n17\npeople (e.g., Vandekerckhove, 2009), the curve’s rise and fall around the age of 15 also confirms the presence of the Adolescent Peak Principle in the use of regional speech forms in Flemish CMC. These findings could be explained by Siebenhaar’s (2006) theory that, although their knowledge of their local dialect is declining, using dialect forms in CMC is attractive for teenagers, because the writing process is dissociated from orthography and other writing standards that are learnt in a school context. Moreover, the effects we found regarding the region variable can be aligned with the “extraordinary dialect vitality” that has been ascribed to the WestFlemish region (compared to other regions in Dutch-speaking Belgium), while in Limburg, the process of dialect loss was accelerated by the industrialization of some parts of the province which led to massive immigration from other parts of Belgium and from foreign countries (e.g., Vandekerckhove, 2009; Belemans & Keulen, 2004; Belemans, 1997; Van Keymeulen, 1993).\nNon-standard Linguistic Variation in Online Social Networks\n  \n18"
    }, {
      "heading" : "Discussion",
      "text" : "In this study, we used a subset of the Netlog corpus that was balanced according to age (13 to 49), gender\nand dialect region (West-Flanders, East-Flanders, Brabant and Limburg) to assess the effects of these sociological variables on non-standard linguistic variation in Flemish social network posts. What makes this corpus interesting for linguistic variation studies is that it contains two types of non-standard language use: newly incoming non-standard forms that are inherent to the medium and written representations of older regional and dialect forms that are typical for colloquial speech. Therefore, we manually categorized each nonstandard word into either ‘chatspeak’ or ‘regional speech’ and applied a forward stepwise mixed-effects logistic regression analysis to examine the effects of age, gender and region on the production of both chatspeak and regiolectal forms in our subset. Our analyses showed that age had a significant non-linear effect on the production of both types, indicating that the principle of Age Grading, that was reported in previous spoken discourse studies of e.g., Downes (1984), Holmes (1992) and Labov (1994), is reflected in Flemish CMC, if only partially, because we were not able to include data from the older (plus 50) age groups in the subset.\nThe pattern of Age Grading is usually found to be a U-shaped curve (Downes, 1984) in which the use of\nnon-standard linguistic variables tends to peak during adolescence. Our analyses indeed show that both the chat word probability and the regional word probability peak between the ages of 13 and 15, which corroborates the presence of the Adolescent Peak Principle. The latter finding is quite remarkable given the on-going dialect loss processes in Flanders, which mainly affect these younger groups. However, except for West-Flanders, most adolescents produce regional speech with a wide geographical reach rather than small-scale local dialect forms. The latter may not be part of their verbal repertoire anymore. In spite of that, they clearly seem to enjoy displaying their (limited) knowledge of regional varieties, the use of which appears to function as a (regional) solidarity marker. Moreover, producing non-standard speech in a written medium dissociates the writing process from orthography and writing standards learnt at school, which makes it extra attractive (Siebenhaar, 2006). Yet, this still does not explain why the peak of the regional word probability starts to decrease after the age of fifteen. Flemish adolescents surely do not possess a more extensive knowledge of regional speech than\nNon-standard Linguistic Variation in Online Social Networks\n  \n19\npost-adolescents do and post-adolescents are equally familiar with writing non-standard forms as their younger peers. The presence of an Adolescent Peak in the regional word probability could therefore indicate that the use of regional words in chat becomes less ‘cool’ during post-adolescence, because it is associated with a younger age group. However, this hypothesis requires further research to be confirmed.\nIn accordance with Plevoets’ (2008) study, we found no significant effect for gender. Additionally, although\nfemale adolescents are thought to be the innovators of newly incoming non-standard (in this case chatspeak) forms, our results suggested no change in the gender effect on the probability that chatspeak features are produced during the adolescent peak.\nWith regard to the region effect, our findings support previous dialectological studies stating that the West-\nFlemish region appears to be marked by extraordinary dialect preservation, while Limburg is subject to dramatic dialect loss, but our study also adds a new element: our analyses show the same interregional differences for the use of typical chatspeak features, which are non-standard but not rooted in the local dialects. These results suggest that the degree of dialect vitality in a region can function as a threshold, not only for including regiolectal features, but also for including other non-standard (chat) features in chatspeak.\nSummarizing, our study does not only confirm that combining quantitative and qualitative approaches is\nessential when dealing with non-standard linguistic variation in a CMC corpus (e.g., Vandekerckhove & Nobels, 2010; Siebenhaar, 2006; Androutsopoulos & Ziegler, 2004), it also presents a corpus-based approach which allows to shift the research focus from a selection of non-standard linguistic variables, leading to a limited view of non-standard language variation, to a more systematic approach which incorporates all nonstandard lexemes in the selected subcorpus. Until now, this kind of inclusive approach seems to have been absent in the research on online social network discourse (Herring et al., 2013). The most striking findings of the present study relate, first of all, to the unambiguous illustration of the Adolescent Peak Principle and, secondly, to the intriguing co-occurrence of non-standard regional features and non-standard chatspeak features in written social network posts produced by Flemish teenagers. The latter finding offers new perspectives on\nNon-standard Linguistic Variation in Online Social Networks\n  \n20\nthe notion of non-standard speech and demonstrates the added value of CMC research for variational linguistics.                                                                                                                  NOTES 1 http://nl.netlog.com/\n2  In Standard Dutch, ‘schoon’ means clean. 3 http://lands.let.kun.nl/cgn/ 4 We did not reduce them to two, because then the word could become standard Dutch. For example, the intensifier in ‘zooo slecht’ (sooo bad) could be wrongly interpreted as the standard form ‘zoo’ (idem). 5 The Bronbestand van de woordenlijst van de Nederlandse taal was used to create the official Dutch spelling dictionary and is available via the TST-Centrale website: http://www.inl.nl/tstcentrale/nl/producten/lexica/bronbestand-woordenlijst-nederlandse-taal-2005/7-26. 6 http://packages.debian.org/nl/lenny/ 7 We used the R package lme4 (Bates, Mächler, & Bolker, 2012) for all mixed-effects regression analyses in this paper. 8 The standard word observations are the same as the standard words in the chatspeak analysis.\nNon-standard Linguistic Variation in Online Social Networks\n  \n21\n                                                                                                                                                                                                                                                                                                                                                                                                                          "
    } ],
    "references" : [ {
      "title" : "Exploring language variation on the Internet: Regional speech in a chat community",
      "author" : [ "J. Androutsopoulos", "E. Ziegler" ],
      "venue" : "In: Language Variation in Europe, eds. G. Gunnarsson, L. Bergström, G. Eklund, S. Fridell, L. Hansen, A. Karstadt, B. Nordberg, E. Sundgren and M. Thelander. Uppsala, Uppsala University Press, 99–111.",
      "citeRegEx" : "Androutsopoulos and Ziegler,? 2004",
      "shortCiteRegEx" : "Androutsopoulos and Ziegler",
      "year" : 2004
    }, {
      "title" : "Mining the Blogosphere: Age, gender and the varieties of self-expression",
      "author" : [ "S. Argamon", "M. Koppel", "J. Pennebaker", "J. Schler" ],
      "venue" : "First Monday, 12(9), http://firstmonday.org/htbin/cgiwrap/bin/ojs/index.php/fm/article/view/2003.",
      "citeRegEx" : "Argamon et al\\.,? 2007",
      "shortCiteRegEx" : "Argamon et al\\.",
      "year" : 2007
    }, {
      "title" : "A postscript: Code-switching and social identity",
      "author" : [ "P. Auer" ],
      "venue" : "Journal of Pragmatics, 37(3), 403-410.",
      "citeRegEx" : "Auer,? 2005",
      "shortCiteRegEx" : "Auer",
      "year" : 2005
    }, {
      "title" : "The convergence and divergence of dialects in Europe",
      "author" : [ "P. Auer", "F. Hinskens" ],
      "venue" : "New and not so new develepments in an old area. Sociolinguistica, 10, 1-30.",
      "citeRegEx" : "Auer and Hinskens,? 1996",
      "shortCiteRegEx" : "Auer and Hinskens",
      "year" : 1996
    }, {
      "title" : "Computer mediated communication as a force in language change",
      "author" : [ "N. Baron" ],
      "venue" : "Visible Language, 18(2), 118-141.",
      "citeRegEx" : "Baron,? 1984",
      "shortCiteRegEx" : "Baron",
      "year" : 1984
    }, {
      "title" : "lme4: Linear mixed-effects models using S4 classes",
      "author" : [ "D. Bates", "M. Mächler", "B. Bolker" ],
      "venue" : "R package version 0.999999-0. http://CRAN.R-project.org/package=lme4",
      "citeRegEx" : "Bates et al\\.,? 2012",
      "shortCiteRegEx" : "Bates et al\\.",
      "year" : 2012
    }, {
      "title" : "Dialectverlies bij Genker jongeren",
      "author" : [ "R. Belemans" ],
      "venue" : "Hasselt, Vereniging voor Limburgse Dialect- en Naamkunde.",
      "citeRegEx" : "Belemans,? 1997",
      "shortCiteRegEx" : "Belemans",
      "year" : 1997
    }, {
      "title" : "Taal in stad en land",
      "author" : [ "R. Belemans", "R. Keulen" ],
      "venue" : "Belgisch-Limburgs. Tielt, Lannoo.",
      "citeRegEx" : "Belemans and Keulen,? 2004",
      "shortCiteRegEx" : "Belemans and Keulen",
      "year" : 2004
    }, {
      "title" : "Approximate inference in generalized linear mixed models",
      "author" : [ "N. Breslow", "D. Clayton" ],
      "venue" : "Journal of the American Statistical Association, 421(9), 9-25.",
      "citeRegEx" : "Breslow and Clayton,? 1993",
      "shortCiteRegEx" : "Breslow and Clayton",
      "year" : 1993
    }, {
      "title" : "Sociolinguistic Theory: Linguistic Variation and Its Social Significance",
      "author" : [ "J. Chambers" ],
      "venue" : "Malden and Oxford, Blackwell.",
      "citeRegEx" : "Chambers,? 2003",
      "shortCiteRegEx" : "Chambers",
      "year" : 2003
    }, {
      "title" : "Sex and gender in variationist research",
      "author" : [ "J. Cheshire" ],
      "venue" : "In: The Handbook of Language Variation and Change, eds. J. Chambers, P. Trudgill and N. Schilling-Estes. Malden and Oxford, Blackwell, 423-443.",
      "citeRegEx" : "Cheshire,? 2002",
      "shortCiteRegEx" : "Cheshire",
      "year" : 2002
    }, {
      "title" : "Language and the Internet",
      "author" : [ "D. Crystal" ],
      "venue" : null,
      "citeRegEx" : "Crystal,? \\Q2001\\E",
      "shortCiteRegEx" : "Crystal",
      "year" : 2001
    }, {
      "title" : "Language and Society",
      "author" : [ "CT: JAI Press", "W. 191-233. Downes" ],
      "venue" : null,
      "citeRegEx" : "Press and Downes,? \\Q1984\\E",
      "shortCiteRegEx" : "Press and Downes",
      "year" : 1984
    }, {
      "title" : "Een zondagspak? Het Nederlands in Vlaanderen: gedrag, beleid, attitudes",
      "author" : [ "Pages", "D. 1277-1287. Geeraerts" ],
      "venue" : "Ons Erfdeel,",
      "citeRegEx" : "Pages and Geeraerts,? \\Q2001\\E",
      "shortCiteRegEx" : "Pages and Geeraerts",
      "year" : 2001
    }, {
      "title" : "Stylometric Analysis of Bloggers' Age",
      "author" : [ "Goswami", "Sumit", "Sudeshna Sarkar", "Mayur Rustagi" ],
      "venue" : null,
      "citeRegEx" : "Goswami et al\\.,? \\Q2009\\E",
      "shortCiteRegEx" : "Goswami et al\\.",
      "year" : 2009
    }, {
      "title" : "Pragmatics of Computer-Mediated Communication",
      "author" : [ "S. Springer. Herring", "D. Stein", "T. Virtanen" ],
      "venue" : null,
      "citeRegEx" : "Herring et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Herring et al\\.",
      "year" : 2013
    }, {
      "title" : "An Introduction to Sociolinguistics",
      "author" : [ "Boston", "De Gruyter. Holmes", "Janet" ],
      "venue" : "London and New York: Longman. In: Time Warps,",
      "citeRegEx" : "Boston et al\\.,? \\Q1992\\E",
      "shortCiteRegEx" : "Boston et al\\.",
      "year" : 1992
    }, {
      "title" : "Social psychological aspects of computer mediated",
      "author" : [ "Kruskal. Stanford", "CSLI Publications", "S. v-xv. Kiesler", "J. Siegel", "T. McGuire" ],
      "venue" : null,
      "citeRegEx" : "Stanford et al\\.,? \\Q1984\\E",
      "shortCiteRegEx" : "Stanford et al\\.",
      "year" : 1984
    }, {
      "title" : "The intersection of sex and social class in the course of linguistic change",
      "author" : [ "Labov", "William." ],
      "venue" : "Language Variation and Change, 2(2), 205-254.",
      "citeRegEx" : "Labov and William.,? 1990",
      "shortCiteRegEx" : "Labov and William.",
      "year" : 1990
    }, {
      "title" : "Principles of Linguistic Change: Volume 1: Internal Factors",
      "author" : [ "Labov", "William." ],
      "venue" : "Cambridge and Oxford, Blackwell.",
      "citeRegEx" : "Labov and William.,? 1994",
      "shortCiteRegEx" : "Labov and William.",
      "year" : 1994
    }, {
      "title" : "Principles of Linguistic Change: Volume 2: Social Factors",
      "author" : [ "Labov", "William." ],
      "venue" : "Malden and Oxford, Blackwell.",
      "citeRegEx" : "Labov and William.,? 2001",
      "shortCiteRegEx" : "Labov and William.",
      "year" : 2001
    }, {
      "title" : "Glottal stops and Tyneside glottalization: Competing patterns of variation and change in Brittish English",
      "author" : [ "J. Milroy", "L. Milroy", "S. Hartley", "D. Walshaw" ],
      "venue" : "Language Variation and Change, 6(3), 327357.",
      "citeRegEx" : "Milroy et al\\.,? 1994",
      "shortCiteRegEx" : "Milroy et al\\.",
      "year" : 1994
    }, {
      "title" : "Improving gender classification of blog authors",
      "author" : [ "A. Mukherjee", "B. Liu" ],
      "venue" : "Proceedings of the 2010 Conference on Empirical Methods in Natural Language Processing. EMNLP '10. Association for Computational Linguistics, Stroudsburg, 207-217.",
      "citeRegEx" : "Mukherjee and Liu,? 2010",
      "shortCiteRegEx" : "Mukherjee and Liu",
      "year" : 2010
    }, {
      "title" : "Identifying more bloggers: Towards large scale personality classification of personal weblog",
      "author" : [ "S. Nowson", "J. Oberlander" ],
      "venue" : "International Conference on Weblogs and Social Media. http://nowson.com/papers/NowOberICWSM07.pdf",
      "citeRegEx" : "Nowson and Oberlander,? 2007",
      "shortCiteRegEx" : "Nowson and Oberlander",
      "year" : 2007
    }, {
      "title" : "Tussen spreek- en standaardtaal",
      "author" : [ "K. Plevoets" ],
      "venue" : "Een corpusgebaseerd onderzoek naar de situationele, regionale en sociale verspreiding van enkele morfosyntactische verschijnselen uit het gesproken Belgisch Nederlands. PhD dissertation. http://statbel.fgov.be/nl/binaries/1431_nl_tcm325-110921.pdf",
      "citeRegEx" : "Plevoets,? 2008",
      "shortCiteRegEx" : "Plevoets",
      "year" : 2008
    }, {
      "title" : "Gender Attribution: Tracing Stylometric Evidence Beyond Topic and Genre",
      "author" : [ "R. Sarawgi", "K. Gajulapalli", "Y. Choi" ],
      "venue" : "Proceedings of the Fifteenth Conference on Computational Natural Language Learning. Association for Computational Linguistics, Stroudsburg, 78-86.",
      "citeRegEx" : "Sarawgi et al\\.,? 2011",
      "shortCiteRegEx" : "Sarawgi et al\\.",
      "year" : 2011
    }, {
      "title" : "Code choice and code-switching in Swiss-German Internet Relay Chat rooms",
      "author" : [ "B. Siebenhaar" ],
      "venue" : "Journal of Sociolinguistics, 10(4), 481-506.",
      "citeRegEx" : "Siebenhaar,? 2006",
      "shortCiteRegEx" : "Siebenhaar",
      "year" : 2006
    }, {
      "title" : "Zich stabiliserende grammaticale kenmerken in Vlaamse tussentaal",
      "author" : [ "Taeldeman", "Johan" ],
      "venue" : "Taal en Tongval,",
      "citeRegEx" : "Taeldeman and Johan.,? \\Q2008\\E",
      "shortCiteRegEx" : "Taeldeman and Johan.",
      "year" : 2008
    }, {
      "title" : "Pragmatics of computer-mediated modes",
      "author" : [ "C. Blackwell. Thurlow", "M. Poff" ],
      "venue" : "Text messaging. In: Pragmatics of",
      "citeRegEx" : "Thurlow and Poff,? 2013",
      "shortCiteRegEx" : "Thurlow and Poff",
      "year" : 2013
    }, {
      "title" : "Institutionen för språk och litteraturer, 139-158",
      "author" : [ "Interdisciplinaria", "Linguistica et Litteraria" ],
      "venue" : "Trudgill, P",
      "citeRegEx" : "Interdisciplinaria and Litteraria.,? \\Q1983\\E",
      "shortCiteRegEx" : "Interdisciplinaria and Litteraria.",
      "year" : 1983
    }, {
      "title" : "Code eclecticism: linguistic variation and code alternation",
      "author" : [ "R. Vandekerckhove", "J. Nobels" ],
      "venue" : null,
      "citeRegEx" : "Vandekerckhove and Nobels,? \\Q2010\\E",
      "shortCiteRegEx" : "Vandekerckhove and Nobels",
      "year" : 2010
    }, {
      "title" : "Gender classification of weblog authors",
      "author" : [ "X. Linguistics. Yan", "L. Yan" ],
      "venue" : "Computational Approaches to Analyzing",
      "citeRegEx" : "Yan and Yan,? 2006",
      "shortCiteRegEx" : "Yan and Yan",
      "year" : 2006
    }, {
      "title" : "Predicting gender from blog posts",
      "author" : [ "Weblogs", "C. AAAI. Zhang", "P. Zhang" ],
      "venue" : "Technical Report. University of",
      "citeRegEx" : "Weblogs et al\\.,? 2010",
      "shortCiteRegEx" : "Weblogs et al\\.",
      "year" : 2010
    } ],
    "referenceMentions" : [ {
      "referenceID" : 10,
      "context" : "In her overview of variationist sociolinguistic research, Tagliamonte (2012: 32) states that there is a consensus among sociolinguists (e.g., Wolfram, 1969; Labov, 1972; Trudgill, 1983; Milroy, Milroy, Hartley & Walshaw, 1994; Cheshire, 2002) that of “all the sociolinguistic principles, the clearest and most consistent one is the contrast between women and men”, which is defined as the Gender Effect.",
      "startOffset" : 135,
      "endOffset" : 242
    }, {
      "referenceID" : 9,
      "context" : ", 15-17 year old), “when peer pressure not to conform to society’s norms is greatest” (Holmes, 1992), while pre- and post-adolescents are found to use these variables less frequently (e.g., Labov, 2001; Chambers, 2003).",
      "startOffset" : 183,
      "endOffset" : 218
    }, {
      "referenceID" : 15,
      "context" : "Moreover, the loose cross-turn relatedness in multiparticipant CMC has not only encouraged language play (Herring et al., 2013), leading to the rise of typical chatspeak abbreviations and concatenations (e.",
      "startOffset" : 105,
      "endOffset" : 127
    }, {
      "referenceID" : 26,
      "context" : "Moreover, they found a tendency to represent ‘regiolectal spellings’ in text messages (SMS) within the US (see also Eisenstein, O’Connor, Smith & Xing, 2010; Siebenhaar, 2006).",
      "startOffset" : 106,
      "endOffset" : 175
    }, {
      "referenceID" : 26,
      "context" : "Although such features are becoming more common across different cultures and languages, Thurlow and Poff’s (2013) research showed less convergence of such practices than predicted by Baron (1984).",
      "startOffset" : 89,
      "endOffset" : 115
    }, {
      "referenceID" : 4,
      "context" : "Although such features are becoming more common across different cultures and languages, Thurlow and Poff’s (2013) research showed less convergence of such practices than predicted by Baron (1984). Moreover, they found a tendency to represent ‘regiolectal spellings’ in text messages (SMS) within the US (see also Eisenstein, O’Connor, Smith & Xing, 2010; Siebenhaar, 2006).",
      "startOffset" : 184,
      "endOffset" : 197
    }, {
      "referenceID" : 1,
      "context" : "Argamon et al. (2007), Goswami et al.",
      "startOffset" : 0,
      "endOffset" : 22
    }, {
      "referenceID" : 1,
      "context" : "Argamon et al. (2007), Goswami et al. (2009) already analysed distributions of (non-dictionary) words in blogs with regard to age and gender.",
      "startOffset" : 0,
      "endOffset" : 45
    }, {
      "referenceID" : 1,
      "context" : "Argamon et al. (2007), Goswami et al. (2009) already analysed distributions of (non-dictionary) words in blogs with regard to age and gender. Although their research focused on automatically predicting age and gender in CMC and not on linguistic variation, the study did report that teenage bloggers tend to use more non-dictionary words than adult bloggers do. Additionally, in their analysis of the number of non-dictionary words used per 1000 words across the 10s, 20s, 30s and higher age groups, female teen bloggers clearly used more non-dictionary words than the male teens, but the other age groups did not show significant gender differences. However, because other modes like online social networks or chat rooms usually do not provide open access to their users’ profile, to our knowledge, there is only one study that employs a quantitative approach to investigate the correlation between the non-standard language usage and profile metadata in these modes of CMC: in his study on code choice and code-switching in Swiss-German chat rooms, Siebenhaar (2006) found that younger and older chatters use more dialect than chatters of the middle-aged group, but his study was only based on a list of 70 Standard German words that had a corresponding form in Swiss German.",
      "startOffset" : 0,
      "endOffset" : 1069
    }, {
      "referenceID" : 24,
      "context" : "With regard to Flemish spoken discourse, Plevoets (2008) also studied the effects of age, gender and region in a corpus of spoken Dutch transcriptions (the CGN, which also includes spontaneous informal speech) on the use of “in-between”-varieties.",
      "startOffset" : 41,
      "endOffset" : 57
    }, {
      "referenceID" : 24,
      "context" : "Given that recent studies in Flemish linguistics (e.g., Vandekerckhove, 2009; Taeldeman, 2008; Plevoets, 2008; Van Keymeulen, 1993) discuss (and in some cases question) the importance of the Brabant region in the recent development of regiolects that have a wider geographical range than the local dialects do, in this analysis, region was treatment-coded with Brabant as the reference level.",
      "startOffset" : 49,
      "endOffset" : 131
    }, {
      "referenceID" : 6,
      "context" : "Moreover, the effects we found regarding the region variable can be aligned with the “extraordinary dialect vitality” that has been ascribed to the WestFlemish region (compared to other regions in Dutch-speaking Belgium), while in Limburg, the process of dialect loss was accelerated by the industrialization of some parts of the province which led to massive immigration from other parts of Belgium and from foreign countries (e.g., Vandekerckhove, 2009; Belemans & Keulen, 2004; Belemans, 1997; Van Keymeulen, 1993).",
      "startOffset" : 427,
      "endOffset" : 517
    }, {
      "referenceID" : 25,
      "context" : "These findings could be explained by Siebenhaar’s (2006) theory that, although their knowledge of their local dialect is declining, using dialect forms in CMC is attractive for teenagers, because the writing process is dissociated from orthography and other writing standards that are learnt in a school context.",
      "startOffset" : 37,
      "endOffset" : 57
    }, {
      "referenceID" : 26,
      "context" : "Moreover, producing non-standard speech in a written medium dissociates the writing process from orthography and writing standards learnt at school, which makes it extra attractive (Siebenhaar, 2006).",
      "startOffset" : 181,
      "endOffset" : 199
    }, {
      "referenceID" : 26,
      "context" : "Summarizing, our study does not only confirm that combining quantitative and qualitative approaches is essential when dealing with non-standard linguistic variation in a CMC corpus (e.g., Vandekerckhove & Nobels, 2010; Siebenhaar, 2006; Androutsopoulos & Ziegler, 2004), it also presents a corpus-based approach which allows to shift the research focus from a selection of non-standard linguistic variables, leading to a limited view of non-standard language variation, to a more systematic approach which incorporates all nonstandard lexemes in the selected subcorpus.",
      "startOffset" : 181,
      "endOffset" : 269
    }, {
      "referenceID" : 15,
      "context" : "Until now, this kind of inclusive approach seems to have been absent in the research on online social network discourse (Herring et al., 2013).",
      "startOffset" : 120,
      "endOffset" : 142
    }, {
      "referenceID" : 23,
      "context" : "In accordance with Plevoets’ (2008) study, we found no significant effect for gender.",
      "startOffset" : 19,
      "endOffset" : 36
    } ],
    "year" : 2016,
    "abstractText" : "We present a corpus-based analysis of the effects of age, gender and region of origin on the production of both ‘netspeak’ or ‘chatspeak’ features and regional speech features in Flemish Dutch posts that were collected from a Belgian online social network platform. The present study shows that combining quantitative and qualitative approaches is essential for understanding non-standard linguistic variation in a CMC corpus. It also presents a methodology that enables the systematic study of this variation by including all non-standard words in the corpus. The analyses resulted in a convincing illustration of the Adolescent Peak Principle. In addition, our approach revealed an intriguing correlation between the use of regional speech features and chatspeak features.",
    "creator" : "Word"
  }
}