{
  "name" : "1601.03288.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Predicting the Effectiveness of Self-Training: Application to Sentiment Classification",
    "authors" : [ "Vincent Van Asch", "Walter" ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : null,
      "text" : "I. INTRODUCTION\nWHEN developing and testing techniques to increase theperformance of natural language processing systems, the choice of the corpora to test the technique may influence the efficacy of the new technique. For this reason it is important to introduce a second dimension, apart from the performance scores, that can describe the corpora that have been selected. We have chosen to introduce similarity scores in a self-training setup in order to identify those setups for which the self-training technique is useful."
    }, {
      "heading" : "A. Self-training procedure",
      "text" : "Self-training is a semi-supervised machine learning method developed mainly to enhance the performance of a machine learner on corpora that are more dissimilar from the training corpus than one would prefer. When train and test data distributions are too different, models trained on the training data will not generalize to the test data.\nThe self-training procedure is, in its plain form, a two-step technique. Variants of the self-training procedure include an instance selection step to increase the probability of adding only informative instances to the training data. We do not address instance selection in this paper.\nThree corpora are needed for self-training: a labeled training corpus, a labeled test corpus, and an unlabeled additional corpus [1]. During self-training, a model is learned from the training data and it is applied to the unlabeled data. Thus, the additional training data is created by automatically labeling unlabeled data. Next, the (partially incorrectly) labeled additional data is appended to the original training data (selftraining step 1). This first labeling step is followed by a second\nBoth authors are with CLiPS, University of Antwerp, Belgium For contact information, see www.clips.uantwerpen.be\ntraining phase using the original training data plus the newly labeled data. The model resulting from this phase is then used to label the test data (self-training step 2). The expectation is that labeling the test data in self-training step 2 yields more correct labels than simply labeling the test data depending only on the information present in the original training data.\nIt remains controversial whether self-training is a useful method; it is not shown to lead to performance gain for every experimental setup. Reference [2] argues that self-training is only beneficial in those situations for which the training and test data are sufficiently dissimilar, but other factors – most obviously labeling accuracy of the unlabeled data – may have an influence too. Rather than dismissing the self-training technique as dysfunctional, we want to identify those setups for which performance gain can be expected.\nSince self-training is a technique to enhance the performance in situations of data sparseness, it can be linked to the notion of domain adaptation. For an introduction to domain adaptation see [3]. In a domain adaptation context the test corpus and the training corpus originate from different domains. Unfortunately, the term domain is a vague concept and defining a domain in an objective manner is a contentious task. Reference [4], drawing upon [5] and the EAGLES initiative [6], mentions two types of parameters to categorize corpora: external (intended audience, purpose, and setting) and internal (lexical or grammatical (co)occurrence features). A domain would then be an external parameter, viz. the subject field, like finances, mathematics, or linguistics.\nHowever, in machine learning, the only requirement of a domain is that the underlying distribution of the words of a corpus coming from that domain is different from the distribution of other domains. This broadens the scope of a domain, but it still remains unclear how to express the difference between the distributions and, as a consequence, there are no objective boundaries to a domain. In practice, domain corpora are straightforwardly gathered from different subject fields, but it would be equally valid to collect texts using different registers, like newswire data, e-mail correspondence and novels, all on the same subject. Irrespective of how domain corpora are collected, the basic assumption is that cross-domain machine learning will suffer from sub-optimal generalization.\nThe objective of this study is to investigate the foundations of a self-adapting classifier. Consider a system that has access to one labeled training corpus and a collection of unlabeled corpora coming from varying domains. If an unseen, unlabeled text is presented to this system, this system should be able to select from the unlabeled corpora the corpus (or corpora) that would facilitate the labeling process most. In this manner, the\nar X\niv :1\n60 1.\n03 28\n8v 1\n[ cs\n.C L\n] 1\n3 Ja\nn 20\n16\n2 classifier would be able to adapt itself to each newly presented text. In this paper, two assumptions of this scenario are tested: the assumption that it is possible to select an unlabeled corpus that increases the performance and the assumption that it is better to select an unlabeled corpus than it is to include all additional unlabeled data. The first assumption corresponds to the assumption that self-training can be helpful if a suitable combination of corpora is involved.\nTo be able to select the best-suited unlabeled corpus, the classifier in this study relies on similarity measures. A similarity measure expresses the similarity of two corpora and various implementations are available. Common implementations are unknown word ratio and Kullback-Leibler (see Section III-C). Combining the concept of self-training and domain similarities may enable us to make a distinction between useful and harmful self-training setups.\nThe bulk of his paper tackles the question when selftraining is helpful. It starts with an overview of related research (Section II) followed by an overview of the different elements that are used in the experiments (Section III), experimental results (Section IV), discussion and additional experiments (Section V), and conclusions (Section VI)."
    }, {
      "heading" : "II. RELATED RESEARCH",
      "text" : "The concepts of self-training were first introduced by [1], but more recent examples are given by [7], [8], and [2]. There are many variations on self-training. Reference [9] combines the self-training concept with ensemble learning for citation classification. Thus, instead of using a single classifier that has to be trained, they use an ensemble of classifiers. Another interesting approach is the combination of self-training with active learning [10]. Instead of using the entire training set to label the unlabeled data, a portion is kept apart. This heldout data is labeled together with the unlabeled data in selftraining step 1. The most confidently classified instances of the unlabeled data are added to the training corpus together with the least confidently labeled held-out data. The intention is to select useful data in a more rigorous manner.\nIt is possible to use similarities between corpora as such, using their outcome to draw inferences about them [11], [12], but an additional interesting usage involves applying similarities in a machine learning setup.\nSimilarities are used in natural language processing in various situations ranging from feature selection [13], [14] and measuring the similarity between two language models [15], [16] to training corpus creation [8], [17]–[19]. An example of training corpus creation is presented by [20]. They employ the Rényi divergence [21] to create a combination of different training corpora in order to increase the labeling performance for a specific test corpus.\nSimilarities have also been used to predict the performance of machine learners [22], [23]. A good example of such an application is the prediction of parsing accuracy [24]. Although there are issues when similarity measures are used (see Section V-A), good results have been obtained for these tasks. Apart from the Rényi divergence, some of the similarities that are used are perplexity, Kullback-Leibler divergence [25], and the Skew divergence [26].\nDespite the fact that authors have shown that a similarity [19], [23] or a linear combination of similarities [8] can be successfully used to link the similarity between domains to the performance of a natural language processing system, no consensus exists about which similarity or combination of similarities is best suited for the task. The best similarity is not selected on theoretical grounds but by testing a range of similarities and selecting the best one. For the research of [27], measuring the cross-entropy between two domains offered the best results when adapting a baseline language model to a new domain.\nThe bag-of-words approaches presented above are not the only manner of computing similarities automatically. It is possible to obtain a richer comparison of texts using the semantics. Current research focuses on semantic textual similarity (STS) [28]. Most of these similarities draw from various sources like dependency parsing, part-of-speech tagging and/or latent Dirichlet allocation. An interesting software package in this context is the DKPro Similarity package [29], which implements various semantic similarities in addition to less complex string matching similarities.\nSimilarity measures have been used on a range of corpora and currently we know of two papers that carry out domain similarity research on the same corpus that we use [30], [31].\nReference [30] shows that instead of exploiting the correlation between the test/training similarity and the accuracy, one could also use the correlation between the similarity and the accuracy drop. The accuracy drop is the difference between the accuracy of an in-domain experiment, using the test corpus, and the accuracy of a cross-domain experiment. In this setup, the in-domain accuracy is considered to be an upper bound. Reference [30] also introduces the notion of domain complexity, which may be expressed by the percentage of rare words in a domain. Examining the corpus of [32], they observe that less complex source domains tend to give a smaller accuracy drop on more complex target domains. They prefer to use χ2 in combination with inverse document frequencies (IDF) to measure domain similarity.\nReference [31] investigates instance selection for the corpus of [32]. He strives for the identification of the most helpful instances using the Jensen-Shannon divergence."
    }, {
      "heading" : "III. EXPERIMENTAL DESIGN",
      "text" : ""
    }, {
      "heading" : "A. Definitions",
      "text" : "There are two levels of evaluation in this paper. The first level is the self-training experiment and the second level is the evaluation of how well self-training gain can be predicted. For maximal clarity, some explicit definitions are given here first.\nsimilarity A number expressing the degree to which two corpora are similar. The higher this number, the less similar the corpora are.1 The exact meaning of similar depends on the similarity measure that is used.\nlabeling experiment A labeling experiment consists of labeling instances. Often this involves a training phase using\n1Because higher values express less similarity this is sometimes called distance. However, the term distance entails certain mathematical properties that we do not demand from a similarity measure.\n3 a labeled training corpus and a test phase during which the unlabeled instances of the test corpus are assigned a label. This is a standard classification experiment. We use the term labeling to be able to differentiate this experiment from the second level classification experiment that involves the classification of self-training setups according to the selftraining gain.\nlabeling performance The performance of a labeling experiment. Labeling performance can be quantified using accuracy, precision, recall, F-score, etc. and these scores are calculated using the gold standard of the test data.\nself-training experiment Each self-training experiment is linked to a particular setup involving three corpora: a labeled training corpus, a labeled test corpus and unlabeled additional data. This is an experiment as described in Section I-A.\nself-training gain The performance gain obtained when the labeling performance for a given test and training set is compared with and without the introduction of self-training. The inverse is self-training loss.\nself-training gain prediction Apart from the labeling experiments, which are the basis of the self-training experiments, this is the second type of classification experiment discussed in this paper. It can be regarded as a second level experiment, meaning that first a range of self-training experiments is conducted before self-training gain is predicted. The classification consists of separating the setups that lead to self-training gain from the others.\nprediction performance The performance of self-training gain prediction. A self-training experiment counts as a true positive if it is correctly predicted to result in self-training gain. Prediction performance can be quantified using accuracy, precision, recall, F-score, etc."
    }, {
      "heading" : "B. Corpus and labeling task",
      "text" : "Self-training can be applied to every supervised machine learning problem. In this paper, the labeling task consists of a binary sentiment classification task. The goal is to label an instance based on a product review according to the sentiment expressed in the review: Is the review favorable to the product or not?\nThe instances for this task are bag-of-word instances coming from the sentiment classification corpus of [32].2 The main reason why we chose this corpus is that it contains data for various domains which is labeled for the same task.\nTo minimize corpus size effects, the corpora for the different domains are normalized to a size of 2,500 instances. We chose this number as a trade-off between sufficient corpus size and sufficient number of domains that have more than 2,500 instances to sample from. In the end, 13 domains meet the corpus size constraints: beauty, baby, camera & photo, sports & outdoors, health & personal care, apparel, toys & games, video, kitchen & housewares, electronics, dvd, books, and music.\nAfter randomly sampling the instances, a script is used to convert the instances into a format fit for the machine learner,\n2Multi-Domain Sentiment Dataset (v. 2.0) in April 2013 retrieved from www.cs.jhu.edu/∼mdredze/datasets/sentiment/unprocessed.tar.gz .\ni.e. SVMLight v6.02 [33]. The machine learner is used with default settings.\nFor each self-training experiment, three different corpora are needed. With 13 domains, a total of 1,716 distinct setups (= 13× 12× 11) are conceivable. Of these 1,716 self-training experiments, 94% of the setups lead to performance loss. It is clear that with only 106 setups in the positive class, selftraining – with little additional data – is more often detrimental to performance than it is helpful. This illustrates that being able to identify setups leading to decreased accuracy can be of help when the use of self-training is considered.\nWe briefly discuss a few general observations involving the data. When carrying out regular cross-domain labeling experiments, the average macro-averaged F1-score is 60.61%, equalling an accuracy of 85.44%. Although the experiments are not directly comparable, the cross-domain accuracy is in the same region as reported by [32] meaning that the machine learner is not underperforming.\nCarrying out the 1,716 self-training experiments results in an average F1-score loss of 3.5%. If performance increases, an average of 0.6% is added to the score. The differences in F1-score are rather small, but for the best self-training setups the difference is statistically significant at the 1% confidence level.3 Also note that in a regular self-training setup, considerably more additional unlabeled data is added, which may lead to more self-training gain. We conducted a small experiment with dvd (training), video (test), and apparel as additional data. Using all apparel data (8,940 instances instead of 2,500) leads to a labeling performance F-score increase of 4.98% instead of 4.29%. This small experiment shows that adding more additional data, as one would normally do, may indeed lead to a higher self-training gain. Although the self-training gain in our experiments is rather small, more data may lead to more gain thus making the selection of the right corpora more relevant."
    }, {
      "heading" : "C. Similarity measures",
      "text" : "An important issue is how the similarity between corpora can be measured. The features of the corpus of [32] consist of tokens. An instance can be considered a bag-of-words and can be converted into a vector. The values in the vector indicate whether a given token occurs in the sample text or not. In this manner, an entire corpus can be reduced to a single vector, namely the centroid of all instance-based vectors in that corpus. If we have a vector for the test corpus and one for the training corpus, for example, cosine similarity between the two domain vectors can be computed. During the experiments, the cosine similarity and the Euclidean distance between the two vectors are computed. To make the similarity independent of sample size, the actual values in the corpus-based vectors are not the raw counts but the point-wise mutual information (pmi) values. Point-wise mutual information also smoothes down the influence of large token count differences. Given the two raw count vectors of the two corpora that are compared, the pmi-\n3Using approximate randomization testing [34], [35].\n4 value of token t in vector v becomes:\npmi(t, v) = log ( n cvt c∗t c v ∗ ) (1)\ncvt : count of token t in vector v c∗t : sum of all counts of token t cc∗ : sum of the counts in vector v n : sum of all counts\nInstead of calculating a distance between vectors, it is also possible to consider the vector as a probability distribution of tokens occurring in a corpus. Similarity between probability distributions can be calculated with e.g the Kullback-Leibler divergence (KL; [25]):\nKL(P ;Q) = ∑ k pklog2 (pk qk ) (2)\nwith pk the value in the vector of the test corpus P at position k and qk the value of the vector of the training corpus Q at position k.4\nApart from the Kullback-Leibler divergence, we also implemented the Jensen-Shannon divergence (JS; [36]):\nJS(P ;Q)= 12\n[ KL ( P ;P+Q2 ) +KL ( Q;P+Q2 )] (3)\nUsing the same notation as for the KL-divergence. The JSdivergence can be considered as a symmetric version of KL.\nA fifth similarity measure that has been used is the simple Unknown Word Ratio (sUWR; [22], [37]). The sUWR is the proportion of tokens t in the test corpus P that are not seen in the training corpus Q:\nsUWR(P ;Q) = |{t|t /∈ Q ∧ t ∈ P}| |{t|t ∈ P}|\n(4)\nIn summary, in this study, we evaluate five similarity measures on their usefulness to predict self-training gain (i.e. their prediction performance)."
    }, {
      "heading" : "IV. EXPERIMENTS",
      "text" : ""
    }, {
      "heading" : "A. Baseline systems",
      "text" : "For our experiments, four different baselines are computed: two one-class-prediction baselines and two uncomplicated learner baselines. All results tables contain the precision on self-training gain prediction, macro-averaged F-score for performance prediction, and the accuracy of the performance prediction.\nWe include the accuracy because it gives a general insight in the correct predictions. Because the majority class has more influence on the accuracy and because the accuracy ignores the precision, we also include the macro-averaged F-score. This score gives the best sense of how well a system performs.\nIn a practical situation, a system developer may be most interested in the precision of self-training gain prediction. Indeed, if a self-training setup is predicted to lead to a performance gain, the developer wants this prediction to be\n4When qk = 0, smoothing is applied by setting qk = 2−52.\ntrustworthy. All other evaluation scores, like recall on gain, can be computed from the scores that are reported in this paper.5\na) One-class prediction: The baseline of the self-training gain prediction can be set to predicting that self-training will always increase labeling performance (the POS baseline) or that it will never increase labeling performance (the NEG baseline). The precision on gain, the macro-averaged F-score and the accuracy are reported in Table I. As a consequence of the nature of the baselines, the accuracy of a baseline system equals the precision of the class label that is predicted.\nGiven the nature of the corpus, only 106 out of 1,716 setups result in self-training gain, it can be expected that always predicting a loss after self-training produces better overall scores.\nb) Uncomplicated prediction: As we will see later, selftraining gain, using the sentiment prediction corpus, is highly dependent on the choice of the test and training corpus, regardless of the nature of the additional data. For this reason, using information about the outcome of previous test/training combinations will produce another type of baseline. One such baseline system may predict gain if at least one similar test/training combination in the training corpus leads to selftraining gain (ONCE). The second may predict gain if the majority of the similar test/training instances lead to selftraining gain (MAJ). For both baseline systems, the precision on gain, the macro-averaged F-score and the accuracy are reported in Table II."
    }, {
      "heading" : "B. Self-training gain prediction",
      "text" : "In this section, we will discuss two methods to tackle the prediction of setups that lead to gain after self-training. The unsupervised method consists of calculating an indicator based on the similarities between the corpora that are involved. The supervised method consists of training a machine learner on the similarities between the corpora.\n1) Unsupervised: The unsupervised way of predicting selftraining gain is based on the performance indicator δ developed by [23]. This indicator is defined as:\nδ =\n∣∣ test/training similarity test/additional data similarity − 1 ∣∣ test/training similarity\ntest/additional data similarity − 1 (5)\nThis indicator weighs the similarity between test and training corpus relative to the similarity between test corpus and the additional data. Its design is such that δ is +1 if gain is expected from self-training; otherwise the value is -1.\nFor the prediction performance, all 1,716 self-training experiments are carried out and the performance is measured. The results, substituting the five similarity measures in Equation 5, are given in Table I.\nThe performance indicator δ is a simplification. As a consequence, the indicator can be optimized by varying the -1 in Equation 5. Ideally, one would determine the required value using a separate development partition. Because of the limited\n5An online tool is available at www.clips.uantwerpen.be/cgi-bin/vincent/ scoreconverter.html.\n5\ndata, we did not carry out these experiments. We optimized using the test partition, which leads to overfitting. Nevertheless, we report on one such system, optimized Euclidean, in Table I. The optimized value is -1.1. We include these scores because they reveal that the precision on gain remains low even after improper optimization.\nFrom our observations, we conclude that it is unlikely to obtain reasonable prediction performance by using the performance indicator. The default choice is to say that selftraining will never lead to gain, i.e. the NEG baseline. Only if one is anxious to discover a setup that leads to self-training gain, using the performance indicator can be helpful to at least narrow down the amount of setups that need to be tested. In this case, the Euclidean distance and the JensenShannon divergence seem to be the best options to compute the similarities.\n2) Supervised: For supervised performance prediction, three similarity values are taken as the features: test/train, additional/train, and test/additional.\na) Leave-one-out cross-validation: Of the 1,716 selftraining experiments, no two setups are the same. The outcome of a leave-one-out cross-validation experiment can be an estimate of how well an unseen setup can be labeled as leading to gain or loss. We choose a kNN-based machine learner to estimate self-training gain 6. The feature metric, the metric that defines how close neighbors are, is set to the Euclidean distance because the default feature metric is more appropriate for categorical features.\nThe scores are given in Table II. The values in Table II are better than those in the previous table. Predicting with around 70% precision whether a setup will be profitable seems acceptable and it may convince a system developer to carry out self-training. However, there are two remarks that have to be made. Pragmatically, when designing a system, one does not always have the data to train a machine learner to predict the self-training gain. Secondly, looking at the setups that lead to self-training gain reveals a weakness of the classification. We will expand on this observation.\n6TiMBL 6.4.2 – http://ilk.uvt.nl/timbl\nEach test/training/additional data combination is unique, but if only the test and training data are taken into account, 11 setups include the same test and training data. Examining which setups lead to self-training gain reveals that once a test/train pair experiences an advantage from self-training, the advantage is often present irrespective of the nature of the additional data. This means that there is information leakage using this leave-one-out cross-validation setup. Indeed, 10 test/train pairs similar to the test instance are present in the training split. Because the 10 pairs included in the training data are very likely a correct indication of the self-training gain/loss for the one pair in the test partition, the 70% prediction precision is no surprise. Evaluation would be more relevant if the prediction performance for an entirely new setup is measured.\nBased on the results of Table II, we can conclude that once it is known that carrying out self-training can increase the labeling performance, the source of the unlabeled data is less important. This observation raises questions about the nature of the differences between the test and training corpus. Performance loss due to a specific, yet unidentified, kind of difference can be mediated by adding additional information through self-training. If this difference between test and training corpus is not sufficiently prominent, self-training will be of no help. Often domain adaptation is needed without having access to knowledge about previous self-training experiments. In the next section, we will investigate what can be done best if a given test/training combination has not been seen before.\nb) Tailored leave-one-out: In the previous paragraph, we have shown that knowledge about previous outcomes of a test/training combination leads to high scores. However, sometimes a given test/training combination may not have been tested yet. To examine how well self-training gain can be predicted in that situation, a tailored leave-on-out routine is implemented.\nFor each instance, three corpora are involved: training, test and the unlabeled data (extra). The instance contains three numbers: the train/test similarity, the train/extra similarity and the test/extra similarity. Any instance that contains any pair of corpora from the test instance is excluded from the training\n6\npartition (60 instances). Also, any instance containing the same corpus as the unlabeled corpus in the test instance is excluded from the training partition (396 instances).\nAs a result, we have 1,716 folds with 1 instance in the test partition and 1,260 instances in the training partition. This split ensures that the similarities of the test instance are not present in the training partition. The results are presented in Table III.\nThe scores in Table III are clearly lower than the scores in Table II. This could be expected because this setup emulates classifying an entirely new combination of domains. However, apart from the precision on self-training gain for the non-probability-distribution-based similarities, these scores are higher than the scores for the unsupervised method in Table I.\nThe experiments of this section confirm the observation that prior knowledge about the outcome of self-training experiments is the best predictor for new self-training experiments. Although this may not come as a surprising conclusion, it also holds when the tested combination of corpora was not seen before, meaning that the performance prediction classifier was able to learn from setups unrelated to the test setup. This is an indication that the similarity scores capture useful information about the corpora, in the context of sentiment classification."
    }, {
      "heading" : "V. DISCUSSION",
      "text" : ""
    }, {
      "heading" : "A. Limitations of similarity scores",
      "text" : "Predicting self-training gain appears to work best if information about a collection of self-training experiments is available. Although this is a restriction on the practicability of the technique, performance prediction can be the working method of choice in selected situations. It can be useful to sum up some limitations that should be taken into account when similarity measures are used.\nc) Class label independence: Similarity measures do not use the class labels. Consider two corpora that are completely disjunct with respect to class labels but very similar in the feature space. A similarity measure will probably underestimate the difference between the two corpora and overestimate the labeling performance. Luckily there are labeling tasks (partof-speech tagging, sentiment prediction, . . . ) for which this extreme situation is not likely to occur, but it still means that the linearity between similarity and performance should be assessed for each new task.\nd) Corpus size: Similarity measures are corpus size dependent. In our experiments all corpora are of the same size, but in a real situation this may not be the case. For example,\nthe overlap measure quantifies the number of unseen elements in the test set given a training set. If a larger test set of the same test domain is taken, the number of unseen elements will probably decrease. The decrease is the result of chance and does not stem from a higher similarity between the domains.\ne) Similarity measure: It can be difficult to find a similarity measure fit for the task. In addition, substantiating why a given measure works well can be unfeasible."
    }, {
      "heading" : "B. Different experimental setups",
      "text" : "The nature of self-training and self-training gain prediction is complex and many design choices have to be made when setting up experiments. In this section, we explore two different setups that aim at obtaining more insight in the importance of the nature of the additional data.\nA first research question is whether the additional data of the self-training in previous experiments is large enough. One may expect that more additional data would more easily lead to self-training gain.\nA second experimental design change tackles the need for the similarities based on the additional data. Indeed, much information is already present in the test and training corpus. Is it useful to include extra information?\nBecause we change the experimental design, the number of self-training experiments is different for each change in setup. More details are given in the following paragraphs.\nf) Concatenated additional data set: In the setup of the previous self-training experiments, the unlabeled, additional data that is added is limited to the data of a single domain. The research question that is addressed in this paragraph is: Why limit the additional data to a single domain? Can the concatenated data of all domains lead to the same results?\nTo address this question, we set up a collection of 156 selftraining experiments. The training and test corpora are the same as in the previous experiments, the additional corpus is different. The additional corpus consists of the concatenation of all 11 domains that are neither the training nor the test corpus.\nThe overlap in setups that lead to self-training gain are given in Fig. 1. The grid shows that there are many grey cells. These cells are the training/test combinations that lead at least once to self-training gain if a selected domain is added as unlabeled data, but there is no benefit if the concatenated data is used during self-training. This indicates that it is useful to select the right domain to add as unlabeled data, because adding all domains together eliminates the self-training gain. Since not all data is good data, it is interesting to be able to predict self-training gain. Fig. 1 also contains four dotted cells. These are the setups for which only the concatenated data is helpful. Including the BULK approach in the experiments of Section IV would be a helpful extension to the research in this paper. We did not do this for corpus size reasons explained in Section V-A.\ng) Only test/train similarity as a feature: In Section IV, the experiments are carried out using all three similarities: test/train, test/additional, and additional/train. In Section IV-B2, it is shown that knowledge of the the test/train\n7 apparel\nbaby\nbeauty\nbooks\ncamera & photo\ndvd\nelectronics\nhealth & personal care\nkitchen & housewares\nmusic\nsports & outdoors\ntoys & games\nvideo\nap pa\nre l\nba by be au\nty\nbo ok\ns\nca m\ner a\n& ph\not o\ndv d el ec\ntro ni\ncs\nhe al\nth &\np er\nso na\nl c ar\ne\nki tc\nhe n\n& ho\nus ew\nar es\nm us\nic\nsp or\nts &\no ut\ndo or\ns\nto ys\n& g\nam es\nvid eo\nTRAINING\nTE ST\n: BOTH\n: DOMAIN\n: BULK\nFig. 1. A grid showing the self-training gain difference between a setup in which the additional data is a single domain (DOMAIN) and a setup in which the additional data is the concatenated data from all other domains (BULK). If a given training/test combination leads to self-training gain in both approaches, the cell is crossed. If only the DOMAIN approach leads to gain, the cell is greyed. If only the BULK approach leads to gain, the cell is dotted. If there is no gain, the cell is blank. Note that for the DOMAIN approach, each cell represents 11 self-training experiments and if at least one of these 11 setups leads to gain, the cell is colored. For example, using music as training corpus and apparel as test corpus, leads to self-training gain for both DOMAIN and BULK.\ncombination is already very informative. For this reason, we carried out tailored leave-one-out experiments, using only the test/train similarities as a feature. The results are given in Table IV. Comparison of these results with Table III reveal that the scores are very similar.\nThe differences between the usage of one or three similarities come mainly from the fact that using three features leads to more predictions of self-training gain, i.e. self-training setups labeled as POS. For the Cosine distance, no extra true positives for the POS-class are predicted, only false positives, leading to a lower macro-averaged F-score. But in general, the extra true positives smooth out the effect of the extra false positives, leading to an increase in F-score. The only exception is the Kullback-Leibler divergence. Adding extra features leads to the prediction of less POS-labels. We consider this as a property of the divergence and have no explanation for this\ndifferent behavior. Based on the precision gain, using only the test/training similarity for prediction appears to be the best option. Even when the given test/training combination has previously not been seen."
    }, {
      "heading" : "VI. CONCLUSION",
      "text" : "In this paper, we showed that self-training can be a performance boosting technique for a strict selection of setups.\nConsider a system developer who wants to implement an online labeling tool. He has one tagged corpus and a range of unlabeled corpora at his disposal. He does not know which data a user will be submitting and, as a consequence, he does not know which unlabeled corpus to add to his tagged corpus. It is also very likely that the submitted corpus will be an unseen corpus. For the binary sentiment classification data, we have shown that he could assess the similarity between his training corpus, his unlabeled corpora and the unseen test corpus and predict whether he should add the unlabeled data to his training corpus before tagging the test corpus.\nFor unsupervised prediction, the best thing to do is always assume self-training loss. If one wants to be able to predict a self-training gain setup, the performance indicator can be used.\nFor supervised prediction, if previously computed outcomes are available for identical corpora, the best thing to do is to predict the same outcome as the majority of the identical training/test combinations. If no previous information is available for identical corpora, the similarities between the test and the training can be used to predict the outcome of the selftraining experiment. The test/additional and additional/training similarities can be added as extra features, but if precision on gain is the selection criterion, this extension seems to be unnecessary.\nWe do not make claims about the best choice of similarity measure because all measures have their disadvantages. Nevertheless, based on the experiments it appears that probabilitydistribution-based measures are more precise, and more specific: i.e. the Jensen-Shannon divergence.\nA general conclusion regarding similarity measures is that the similarity between domains is important when evaluating domain adaptation techniques. A domain adaptation technique may lead to better results on nearby domains than on domains that are further apart. Or vice versa. Not knowing how similar domains are may lead to unjustified conclusions when comparing different domain adaptation techniques that are tested an a variety of corpora.\nFor this reason, a widely accepted technique to measure domain similarity would be an important addition to domain adaptation research. If further research could provide such a similarity measure, judging the applicability of domain adaptation techniques would become a lot more objective.\nAPPENDIX\nWe refer to two online resources that are not essential to a clear understanding of this article:\n8 • www.clips.uantwerpen.be/∼vincent/self-training/scripts. html For reference, the experimental implementations that are used in this study are made available online. Because the creation of a standalone application is not one of the goals of this research, the implementations are a collection of scripts rather than a mature software package. • www.clips.uantwerpen.be/∼vincent/self-training Additional insight into the structure of the corpus based on the three similarity measures as it is used in Section IV-B2 can be gained from this vector space visualization."
    }, {
      "heading" : "ACKNOWLEDGMENT",
      "text" : "This research is funded by the Research Foundation Flanders (FWO-project G.0478.10 – Statistical Relational Learning of Natural Language)"
    } ],
    "references" : [ {
      "title" : "Statistical parsing with a context-free grammar and word statistics,",
      "author" : [ "E. Charniak" ],
      "venue" : "Proceedings of the Fourteenth National Conference on Artificial Intelligence and Ninth Innovative Applications of Artificial Intelligence Conference",
      "citeRegEx" : "1",
      "shortCiteRegEx" : "1",
      "year" : 1997
    }, {
      "title" : "Self-training without reranking for parser domain adaptation and its impact on semantic role labeling,",
      "author" : [ "K. Sagae" ],
      "venue" : "Proceedings of the 2010 Workshop on Domain Adaptation for Natural Language Processing. Uppsala,",
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 2010
    }, {
      "title" : "Domain adaptation for statistical classifiers,",
      "author" : [ "H. Daumé III", "D. Marcu" ],
      "venue" : "Journal of Artificial Intelligence Research,",
      "citeRegEx" : "3",
      "shortCiteRegEx" : "3",
      "year" : 2006
    }, {
      "title" : "Genres, registers, text types, domain, and styles: Clarifying the concepts and navigating a path through the BNC jungle,",
      "author" : [ "D.Y.W. Lee" ],
      "venue" : "Language Learning & Technology,",
      "citeRegEx" : "4",
      "shortCiteRegEx" : "4",
      "year" : 2001
    }, {
      "title" : "Variation across speech and writing",
      "author" : [ "D. Biber" ],
      "venue" : null,
      "citeRegEx" : "5",
      "shortCiteRegEx" : "5",
      "year" : 1988
    }, {
      "title" : "Preliminary recommendations on text typology,",
      "author" : [ "J. Sinclair", "J. Ball" ],
      "venue" : "Consiglio Nazionale delle Ricerche, Istituto di Linguistica Computazionale, Pisa, Italy, Expert Advisory Group on Language Engineering Standards (EAGLES) EAG—TCWG—TTYP/P,",
      "citeRegEx" : "6",
      "shortCiteRegEx" : "6",
      "year" : 1996
    }, {
      "title" : "Instance weighting for domain adaptation in NLP,",
      "author" : [ "J. Jiang", "C. Zhai" ],
      "venue" : "Proceedings of the 45th Annual Meeting of the Association of Computational Linguistics",
      "citeRegEx" : "7",
      "shortCiteRegEx" : "7",
      "year" : 2007
    }, {
      "title" : "Any domain parsing: Automatic domain adaptation for natural language parsing,",
      "author" : [ "D. McClosky" ],
      "venue" : "Ph.D. dissertation,",
      "citeRegEx" : "8",
      "shortCiteRegEx" : "8",
      "year" : 2010
    }, {
      "title" : "Ensemble-style self-training on citation classification,",
      "author" : [ "C. Dong", "U. Schäfer" ],
      "venue" : "Proceedings of 5th International Joint Conference on Natural Language Processing. Chiang Mai, Thailand: Asian Federation of Natural Language Processing,",
      "citeRegEx" : "9",
      "shortCiteRegEx" : "9",
      "year" : 2011
    }, {
      "title" : "Reserved self-training: A semisupervised sentiment classification method for chinese microblogs,",
      "author" : [ "Z. Liu", "X. Dong", "Y. Guan", "J. Yang" ],
      "venue" : "Proceedings of the Sixth International Joint Conference on Natural Language Processing. Nagoya, Japan: Asian Federation of Natural Language Processing,",
      "citeRegEx" : "10",
      "shortCiteRegEx" : "10",
      "year" : 2013
    }, {
      "title" : "The textual characteristics of traditional and open access scientific journals are similar,",
      "author" : [ "K. Verspoor", "K.B. Cohen", "L. Hunter" ],
      "venue" : "BMC Bioinformatics,",
      "citeRegEx" : "11",
      "shortCiteRegEx" : "11",
      "year" : 2009
    }, {
      "title" : "Challenging stereotypes about academic writing: Complexity, elaboration, explicitness,",
      "author" : [ "D. Biber", "B. Gray" ],
      "venue" : "Journal of English for Academic Purposes,",
      "citeRegEx" : "12",
      "shortCiteRegEx" : "12",
      "year" : 2010
    }, {
      "title" : "Inducing features of random fields,",
      "author" : [ "S. Della Pietra", "V. Della Pietra", "J. Lafferty" ],
      "venue" : "IEEE Transactions on Pattern Analysis and Machine Intelligence,",
      "citeRegEx" : "13",
      "shortCiteRegEx" : "13",
      "year" : 1997
    }, {
      "title" : "Unsupervised feature selection using feature similarity,",
      "author" : [ "P. Mitra", "C. Murthy", "S.K. Pal" ],
      "venue" : "IEEE Transactions on Pattern Analysis and Machine Intelligence,",
      "citeRegEx" : "14",
      "shortCiteRegEx" : "14",
      "year" : 2002
    }, {
      "title" : "On the effectiveness of the skew divergence for statistical language analysis,",
      "author" : [ "L. Lee" ],
      "venue" : "in 8th International Workshop on Artificial Intelligence and Statistics (AISTATS",
      "citeRegEx" : "15",
      "shortCiteRegEx" : "15",
      "year" : 2001
    }, {
      "title" : "Toward a unified approach to statistical language modeling for chinese,",
      "author" : [ "J. Gao", "J. Goodman", "M. Li", "K.-F. Lee" ],
      "venue" : "Transactions on Asian Language Information Processing,",
      "citeRegEx" : "16",
      "shortCiteRegEx" : "16",
      "year" : 2002
    }, {
      "title" : "Extracting discriminative concepts for domain adaptation in text mining,",
      "author" : [ "B. Chen", "W. Lam", "I. Tsang", "T.-L. Wong" ],
      "venue" : "Proceedings of the 15th ACM SIGKDD international conference on Knowledge discovery and data mining, ser. KDD ’09",
      "citeRegEx" : "17",
      "shortCiteRegEx" : "17",
      "year" : 2009
    }, {
      "title" : "Intelligent selection of language model training data,",
      "author" : [ "R.C. Moore", "W. Lewis" ],
      "venue" : "Proceedings of the ACL 2010 Conference Short Papers. Uppsala, Sweden: Association for Computational Linguistics,",
      "citeRegEx" : "18",
      "shortCiteRegEx" : "18",
      "year" : 2010
    }, {
      "title" : "Domain adaptation for parsing,",
      "author" : [ "B. Plank" ],
      "venue" : "Ph.D. dissertation, University of Groningen, the Netherlands,",
      "citeRegEx" : "19",
      "shortCiteRegEx" : "19",
      "year" : 2011
    }, {
      "title" : "Multiple source adaptation and the Rényi divergence,",
      "author" : [ "Y. Mansour", "M. Mohri", "A. Rostamizadeh" ],
      "venue" : "Proceedings of the Twenty-Fifth Conference on Uncertainty in Artificial Intelligence",
      "citeRegEx" : "20",
      "shortCiteRegEx" : "20",
      "year" : 2009
    }, {
      "title" : "On measures of information and entropy,",
      "author" : [ "A. Rényi" ],
      "venue" : "Proceedings of the 4th Berkeley Symposium on Mathematics, Statistics and Probability,",
      "citeRegEx" : "21",
      "shortCiteRegEx" : "21",
      "year" : 1961
    }, {
      "title" : "Correlating natural language parser performance with statistical measures of the text,",
      "author" : [ "Y. Zhang", "R. Wang" ],
      "venue" : "Proceedings of the 32nd annual German conference on Advances in artificial intelligence. Paderborn, Germany: Springer-Verlag,",
      "citeRegEx" : "22",
      "shortCiteRegEx" : "22",
      "year" : 2009
    }, {
      "title" : "Using domain similarity for performance estimation,",
      "author" : [ "V. Van Asch", "W. Daelemans" ],
      "venue" : "Proceedings of the 2010 Workshop on Domain Adaptation for Natural Language Processing. Uppsala,",
      "citeRegEx" : "23",
      "shortCiteRegEx" : "23",
      "year" : 2010
    }, {
      "title" : "Soricut, “Automatic prediction of parser accuracy,",
      "author" : [ "S. Ravi", "K. Knight" ],
      "venue" : "Proceedings of the 2008 Conference on Empirical Methods in Natural Language Processing. Honolulu, Hawaii: Association for Computational Linguistics,",
      "citeRegEx" : "24",
      "shortCiteRegEx" : "24",
      "year" : 2008
    }, {
      "title" : "On information and sufficiency,",
      "author" : [ "S. Kullback", "R.A. Leibler" ],
      "venue" : "The Annals of Mathematical Statistics,",
      "citeRegEx" : "25",
      "shortCiteRegEx" : "25",
      "year" : 1951
    }, {
      "title" : "Measures of distributional similarity,",
      "author" : [ "L. Lee" ],
      "venue" : "Proceedings of the 37th Annual Meeting of the Association for Computational Linguistics. Maryland, USA: Association for Computational Linguistics,",
      "citeRegEx" : "26",
      "shortCiteRegEx" : "26",
      "year" : 1999
    }, {
      "title" : "An empirical study on language model adaptation using a metric of domain similarity,",
      "author" : [ "W. Yuan", "J. Gao", "H. Suzuki" ],
      "venue" : "Natural Language Processing IJCNLP 2005, ser. Lecture Notes in Computer Science,",
      "citeRegEx" : "27",
      "shortCiteRegEx" : "27",
      "year" : 2005
    }, {
      "title" : "SEM 2013 shared task: Semantic textual similarity,” in Second Joint Conference on Lexical and Computational Semantics, Volume 1: Proceedings of the Main Conference and the Shared Task: Semantic Textual Similarity",
      "author" : [ "E. Agirre", "D. Cer", "M. Diab", "A. Gonzalez-Agirre", "W. Guo" ],
      "venue" : null,
      "citeRegEx" : "28",
      "shortCiteRegEx" : "28",
      "year" : 2013
    }, {
      "title" : "DKPro similarity: An open source framework for text similarity,” in Proceedings of the 51st Annual Meeting of the Association for Computational Linguistics: System Demonstrations",
      "author" : [ "D. Bär", "T. Zesch", "I. Gurevych" ],
      "venue" : null,
      "citeRegEx" : "29",
      "shortCiteRegEx" : "29",
      "year" : 2013
    }, {
      "title" : "Biographies or blenders: Which resource is best for cross-domain sentiment analysis?",
      "author" : [ "N. Ponomareva", "M. Thelwall" ],
      "venue" : "Computational Linguistics and Intelligent Text Processing, ser. Lecture Notes in Computer Science,",
      "citeRegEx" : "30",
      "shortCiteRegEx" : "30",
      "year" : 2012
    }, {
      "title" : "Domain adaptation using domain similarity- and domain complexity-based instance selection for cross-domain sentiment analysis,",
      "author" : [ "R. Remus" ],
      "venue" : "Proceedings of the IEEE 12th International Conference on Data Mining Workshops. Brussels,",
      "citeRegEx" : "31",
      "shortCiteRegEx" : "31",
      "year" : 2012
    }, {
      "title" : "Biographies, Bollywood, Boomboxes and Blenders: Domain adaptation for sentiment classification,",
      "author" : [ "J. Blitzer", "M. Dredze", "F. Pereira" ],
      "venue" : "Proceedings of the 45th Annual Meeting of the Association of  9 Computational Linguistics. Prague, Czech Republic: Association for Computational Linguistics,",
      "citeRegEx" : "32",
      "shortCiteRegEx" : "32",
      "year" : 2007
    }, {
      "title" : "Making large-scale support vector machine learning practical,",
      "author" : [ "T. Joachims" ],
      "venue" : null,
      "citeRegEx" : "33",
      "shortCiteRegEx" : "33",
      "year" : 1999
    }, {
      "title" : "Computer-intensive methods for testing hypotheses",
      "author" : [ "E.W. Noreen" ],
      "venue" : "New York, NY, USA: John Wiley,",
      "citeRegEx" : "34",
      "shortCiteRegEx" : "34",
      "year" : 1989
    }, {
      "title" : "More accurate tests for the statistical significance of result differences,",
      "author" : [ "A. Yeh" ],
      "venue" : "Proceedings of the 18th International Conference on Computational Linguistics,",
      "citeRegEx" : "35",
      "shortCiteRegEx" : "35",
      "year" : 2000
    }, {
      "title" : "Divergence measures based on the Shannon entropy,",
      "author" : [ "J. Lin" ],
      "venue" : "IEEE Transactions on Information Theory,",
      "citeRegEx" : "36",
      "shortCiteRegEx" : "36",
      "year" : 1991
    }, {
      "title" : "Dutch dependency parser performance across domains,",
      "author" : [ "B. Plank", "G. van Noord" ],
      "venue" : "CLIN meeting,",
      "citeRegEx" : "37",
      "shortCiteRegEx" : "37",
      "year" : 2010
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "Three corpora are needed for self-training: a labeled training corpus, a labeled test corpus, and an unlabeled additional corpus [1].",
      "startOffset" : 129,
      "endOffset" : 132
    }, {
      "referenceID" : 1,
      "context" : "Reference [2] argues that self-training is only beneficial in those situations for which the training and test data are sufficiently dissimilar, but other factors – most obviously labeling accuracy of the unlabeled data – may have an influence too.",
      "startOffset" : 10,
      "endOffset" : 13
    }, {
      "referenceID" : 2,
      "context" : "For an introduction to domain adaptation see [3].",
      "startOffset" : 45,
      "endOffset" : 48
    }, {
      "referenceID" : 3,
      "context" : "Reference [4], drawing upon [5] and the EAGLES initiative [6], mentions two types of parameters to categorize corpora: external (intended audience, purpose, and setting) and internal (lexical or grammatical (co)occurrence features).",
      "startOffset" : 10,
      "endOffset" : 13
    }, {
      "referenceID" : 4,
      "context" : "Reference [4], drawing upon [5] and the EAGLES initiative [6], mentions two types of parameters to categorize corpora: external (intended audience, purpose, and setting) and internal (lexical or grammatical (co)occurrence features).",
      "startOffset" : 28,
      "endOffset" : 31
    }, {
      "referenceID" : 5,
      "context" : "Reference [4], drawing upon [5] and the EAGLES initiative [6], mentions two types of parameters to categorize corpora: external (intended audience, purpose, and setting) and internal (lexical or grammatical (co)occurrence features).",
      "startOffset" : 58,
      "endOffset" : 61
    }, {
      "referenceID" : 0,
      "context" : "The concepts of self-training were first introduced by [1], but more recent examples are given by [7], [8], and [2].",
      "startOffset" : 55,
      "endOffset" : 58
    }, {
      "referenceID" : 6,
      "context" : "The concepts of self-training were first introduced by [1], but more recent examples are given by [7], [8], and [2].",
      "startOffset" : 98,
      "endOffset" : 101
    }, {
      "referenceID" : 7,
      "context" : "The concepts of self-training were first introduced by [1], but more recent examples are given by [7], [8], and [2].",
      "startOffset" : 103,
      "endOffset" : 106
    }, {
      "referenceID" : 1,
      "context" : "The concepts of self-training were first introduced by [1], but more recent examples are given by [7], [8], and [2].",
      "startOffset" : 112,
      "endOffset" : 115
    }, {
      "referenceID" : 8,
      "context" : "Reference [9] combines the self-training concept with ensemble learning for citation classification.",
      "startOffset" : 10,
      "endOffset" : 13
    }, {
      "referenceID" : 9,
      "context" : "Another interesting approach is the combination of self-training with active learning [10].",
      "startOffset" : 86,
      "endOffset" : 90
    }, {
      "referenceID" : 10,
      "context" : "It is possible to use similarities between corpora as such, using their outcome to draw inferences about them [11], [12], but an additional interesting usage involves applying similarities in a machine learning setup.",
      "startOffset" : 110,
      "endOffset" : 114
    }, {
      "referenceID" : 11,
      "context" : "It is possible to use similarities between corpora as such, using their outcome to draw inferences about them [11], [12], but an additional interesting usage involves applying similarities in a machine learning setup.",
      "startOffset" : 116,
      "endOffset" : 120
    }, {
      "referenceID" : 12,
      "context" : "Similarities are used in natural language processing in various situations ranging from feature selection [13], [14] and measuring the similarity between two language models [15], [16] to training corpus creation [8], [17]–[19].",
      "startOffset" : 106,
      "endOffset" : 110
    }, {
      "referenceID" : 13,
      "context" : "Similarities are used in natural language processing in various situations ranging from feature selection [13], [14] and measuring the similarity between two language models [15], [16] to training corpus creation [8], [17]–[19].",
      "startOffset" : 112,
      "endOffset" : 116
    }, {
      "referenceID" : 14,
      "context" : "Similarities are used in natural language processing in various situations ranging from feature selection [13], [14] and measuring the similarity between two language models [15], [16] to training corpus creation [8], [17]–[19].",
      "startOffset" : 174,
      "endOffset" : 178
    }, {
      "referenceID" : 15,
      "context" : "Similarities are used in natural language processing in various situations ranging from feature selection [13], [14] and measuring the similarity between two language models [15], [16] to training corpus creation [8], [17]–[19].",
      "startOffset" : 180,
      "endOffset" : 184
    }, {
      "referenceID" : 7,
      "context" : "Similarities are used in natural language processing in various situations ranging from feature selection [13], [14] and measuring the similarity between two language models [15], [16] to training corpus creation [8], [17]–[19].",
      "startOffset" : 213,
      "endOffset" : 216
    }, {
      "referenceID" : 16,
      "context" : "Similarities are used in natural language processing in various situations ranging from feature selection [13], [14] and measuring the similarity between two language models [15], [16] to training corpus creation [8], [17]–[19].",
      "startOffset" : 218,
      "endOffset" : 222
    }, {
      "referenceID" : 18,
      "context" : "Similarities are used in natural language processing in various situations ranging from feature selection [13], [14] and measuring the similarity between two language models [15], [16] to training corpus creation [8], [17]–[19].",
      "startOffset" : 223,
      "endOffset" : 227
    }, {
      "referenceID" : 19,
      "context" : "An example of training corpus creation is presented by [20].",
      "startOffset" : 55,
      "endOffset" : 59
    }, {
      "referenceID" : 20,
      "context" : "They employ the Rényi divergence [21] to create a combination of different training corpora in order to increase the labeling performance for a specific test corpus.",
      "startOffset" : 33,
      "endOffset" : 37
    }, {
      "referenceID" : 21,
      "context" : "Similarities have also been used to predict the performance of machine learners [22], [23].",
      "startOffset" : 80,
      "endOffset" : 84
    }, {
      "referenceID" : 22,
      "context" : "Similarities have also been used to predict the performance of machine learners [22], [23].",
      "startOffset" : 86,
      "endOffset" : 90
    }, {
      "referenceID" : 23,
      "context" : "A good example of such an application is the prediction of parsing accuracy [24].",
      "startOffset" : 76,
      "endOffset" : 80
    }, {
      "referenceID" : 24,
      "context" : "Apart from the Rényi divergence, some of the similarities that are used are perplexity, Kullback-Leibler divergence [25], and the Skew divergence [26].",
      "startOffset" : 116,
      "endOffset" : 120
    }, {
      "referenceID" : 25,
      "context" : "Apart from the Rényi divergence, some of the similarities that are used are perplexity, Kullback-Leibler divergence [25], and the Skew divergence [26].",
      "startOffset" : 146,
      "endOffset" : 150
    }, {
      "referenceID" : 18,
      "context" : "Despite the fact that authors have shown that a similarity [19], [23] or a linear combination of similarities [8] can be successfully used to link the similarity between domains to the performance of a natural language processing system, no consensus exists about which similarity or combination of similarities is best suited for the task.",
      "startOffset" : 59,
      "endOffset" : 63
    }, {
      "referenceID" : 22,
      "context" : "Despite the fact that authors have shown that a similarity [19], [23] or a linear combination of similarities [8] can be successfully used to link the similarity between domains to the performance of a natural language processing system, no consensus exists about which similarity or combination of similarities is best suited for the task.",
      "startOffset" : 65,
      "endOffset" : 69
    }, {
      "referenceID" : 7,
      "context" : "Despite the fact that authors have shown that a similarity [19], [23] or a linear combination of similarities [8] can be successfully used to link the similarity between domains to the performance of a natural language processing system, no consensus exists about which similarity or combination of similarities is best suited for the task.",
      "startOffset" : 110,
      "endOffset" : 113
    }, {
      "referenceID" : 26,
      "context" : "For the research of [27], measuring the cross-entropy between two domains offered the best results when adapting a baseline language model to a new domain.",
      "startOffset" : 20,
      "endOffset" : 24
    }, {
      "referenceID" : 27,
      "context" : "Current research focuses on semantic textual similarity (STS) [28].",
      "startOffset" : 62,
      "endOffset" : 66
    }, {
      "referenceID" : 28,
      "context" : "An interesting software package in this context is the DKPro Similarity package [29], which implements various semantic similarities in addition to less complex string matching similarities.",
      "startOffset" : 80,
      "endOffset" : 84
    }, {
      "referenceID" : 29,
      "context" : "Similarity measures have been used on a range of corpora and currently we know of two papers that carry out domain similarity research on the same corpus that we use [30], [31].",
      "startOffset" : 166,
      "endOffset" : 170
    }, {
      "referenceID" : 30,
      "context" : "Similarity measures have been used on a range of corpora and currently we know of two papers that carry out domain similarity research on the same corpus that we use [30], [31].",
      "startOffset" : 172,
      "endOffset" : 176
    }, {
      "referenceID" : 29,
      "context" : "Reference [30] shows that instead of exploiting the correlation between the test/training similarity and the accuracy, one could also use the correlation between the similarity and the accuracy drop.",
      "startOffset" : 10,
      "endOffset" : 14
    }, {
      "referenceID" : 29,
      "context" : "Reference [30] also introduces the notion of domain complexity, which may be expressed by the percentage of rare words in a domain.",
      "startOffset" : 10,
      "endOffset" : 14
    }, {
      "referenceID" : 31,
      "context" : "Examining the corpus of [32], they observe that less complex source domains tend to give a smaller accuracy drop on more complex target domains.",
      "startOffset" : 24,
      "endOffset" : 28
    }, {
      "referenceID" : 30,
      "context" : "Reference [31] investigates instance selection for the corpus",
      "startOffset" : 10,
      "endOffset" : 14
    }, {
      "referenceID" : 31,
      "context" : "of [32].",
      "startOffset" : 3,
      "endOffset" : 7
    }, {
      "referenceID" : 31,
      "context" : "The instances for this task are bag-of-word instances coming from the sentiment classification corpus of [32].",
      "startOffset" : 105,
      "endOffset" : 109
    }, {
      "referenceID" : 32,
      "context" : "02 [33].",
      "startOffset" : 3,
      "endOffset" : 7
    }, {
      "referenceID" : 31,
      "context" : "Although the experiments are not directly comparable, the cross-domain accuracy is in the same region as reported by [32] meaning that the machine learner is not underperforming.",
      "startOffset" : 117,
      "endOffset" : 121
    }, {
      "referenceID" : 31,
      "context" : "The features of the corpus of [32] consist of tokens.",
      "startOffset" : 30,
      "endOffset" : 34
    }, {
      "referenceID" : 33,
      "context" : "3Using approximate randomization testing [34], [35].",
      "startOffset" : 41,
      "endOffset" : 45
    }, {
      "referenceID" : 34,
      "context" : "3Using approximate randomization testing [34], [35].",
      "startOffset" : 47,
      "endOffset" : 51
    }, {
      "referenceID" : 24,
      "context" : "g the Kullback-Leibler divergence (KL; [25]):",
      "startOffset" : 39,
      "endOffset" : 43
    }, {
      "referenceID" : 35,
      "context" : "4 Apart from the Kullback-Leibler divergence, we also implemented the Jensen-Shannon divergence (JS; [36]):",
      "startOffset" : 101,
      "endOffset" : 105
    }, {
      "referenceID" : 21,
      "context" : "A fifth similarity measure that has been used is the simple Unknown Word Ratio (sUWR; [22], [37]).",
      "startOffset" : 86,
      "endOffset" : 90
    }, {
      "referenceID" : 36,
      "context" : "A fifth similarity measure that has been used is the simple Unknown Word Ratio (sUWR; [22], [37]).",
      "startOffset" : 92,
      "endOffset" : 96
    }, {
      "referenceID" : 22,
      "context" : "oped by [23].",
      "startOffset" : 8,
      "endOffset" : 12
    } ],
    "year" : 2016,
    "abstractText" : "The goal of this paper is to investigate the connection between the performance gain that can be obtained by selftraining and the similarity between the corpora used in this approach. Self-training is a semi-supervised technique designed to increase the performance of machine learning algorithms by automatically classifying instances of a task and adding these as additional training material to the same classifier. In the context of language processing tasks, this training material is mostly an (annotated) corpus. Unfortunately self-training does not always lead to a performance increase and whether it will is largely unpredictable. We show that the similarity between corpora can be used to identify those setups for which self-training can be beneficial. We consider this research as a step in the process of developing a classifier that is able to adapt itself to each new test corpus that it is presented with.",
    "creator" : "LaTeX with hyperref package"
  }
}