{
  "name" : "1602.00104.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Extracting Keyword for Disambiguating Name Based on the Overlap Principle",
    "authors" : [ "Mahyuddin K. M. Nasution" ],
    "emails" : [ "mahyuddin@usu.ac.id" ],
    "sections" : [ {
      "heading" : null,
      "text" : "ar X\niv :1\n60 2.\n00 10\n4v 1\n[ cs\n.I R\n] 3\n0 Ja\nn 20\nKeywords: semantic, synonymy, polysemy, snippet."
    }, {
      "heading" : "1 Introduction",
      "text" : "In semantic the disambiguation is the process of identifying related to essence of word, the nature of which is passed on to any object or entity, and also the meaning is embedded to it by how people use it. Basically, the meaning has been stored in the dictionary, the dictionary was based on events that have occurred in the social, and today they have been shared on the web page. The issues of disambiguation therefore is related to the special case of WSD (word sense disambiguation) [1,2], especially with the name of someone who is also the words. Today, along with the growth of the web on the Internet, it is difficult to determine a web page associated with the intended person is right and proper, especially with the presence of semantic meaning as a synonymy and polysemy. Therefore, this paper expressed an approach for identifying a person with exploring web snippets.\n⋆ Proceeding of International Conference on Information Technology and Engineering Application (4-th ICIBA), Book 1, 119-125, February 20-21, 2015."
    }, {
      "heading" : "2 Research Methodology",
      "text" : ""
    }, {
      "heading" : "2.1 Related Work",
      "text" : "Most of works addressed the name disambiguation, among them about preparing information for person-specific [3]; finding to the association of persons such as the social networks [4]; distinguishing the different persons with keyword/key phrases [5], associating a domain of citations in the scientific papers [6], etc. However, none of the mentioned works attempt to extract dynamic features of person as the current context to do name disambiguation through queries expansion as a way for fighting against explosion of information on the Internet, that is increasing and expanding relationship between the persons and the words continuously, mainly to face the common words like ”information”, that is an indwell word always for each person in information era.\nSemantically, there are motivations of disambiguation problem:\n1. Meronymy [7]: x is part y or ”is-a”, part to whole relation - the semantic relation that holds between a part and the whole. In other word, the page for x belong to the categories of y. For example, the page for the Barack Obama in Wikipedia1 belong to the categories (a) President of the United State2, (b) United States Senate3, (c) Illinois Senate4, (d) Black people5, etc. In other case, some entities are associated with multi-categories. For example, Noam Chomsky is a linguist and Noam Chomsky is also a critic of American foreign policy. 2. Honolomy: x has y as part of itself or ”has-a”, whole to part relation - the semantic relation that holds between a whole and its parts. For example, in DBLP, the author name ”Shahrul Azman Mohd Noah” has a name label as ”Shahrul Azman Noah”. 3. Hyponymy [8]: x be subordinate of y or ”has-property”, subordination - the semantic relation of being subordinate or belong to a lower rank or class. In other word, the page for x has subcategories of y. For example, the homepage of ”Tengku Mohd Tengku Sembok” has categories pages: Home, Biography, Curriculum Vitae, Gallery, Others, Contact, Links, etc. Some pages also contain name label ”Tengku Mohd Tengku Sembok”. 4. Synonymy [9,10]: x denotes the same as y, the semantic relation that holds between two words or can (in the context) express the same meaning. This means that the entity may have multiple name variations/abbreviations in citations across publications. For example, in DBLP, the author name ”Tengku\n1 https://en.wikipedia.org/wiki/Barack_Obama 2 https://en.wikipedia.org/wiki/President_of_the_United_States 3 https://en.wikipedia.org/wiki/United_States_Senate 4 https://en.wikipedia.org/wiki/Illinois_Senate_career_of_Barack_Obama 5 https://en.wikipedia.org/wiki/Black_people\nMohd Tengku Sembok” is sometimes written as ”T. Mohd T. Sembok”, ”Tengku M. T. Sembok”. 5. Polysemy [10]: Lexical ambiguity, individual word or phrase or label that can be used to express two or more different meanings. This means that different entities may share the same name label in multiple citations. For example, both ”Guangyu Chen” and ”Guilin Chen” are used as ”G. Chen” in their citations."
    }, {
      "heading" : "2.2 A Model",
      "text" : "Let A = {ai|i = 1, ...,M} is a set of person (real-world entities). There is Ad = {bj|j = 1, ..., N} as a set of ambiguous names which need to be disambiguated, e.g., {”John Barnes”,. . .}, thus A is a reference entities table containing peoples which the names in Ad may represent, e.g. {”John Barnes (computer scientist)”, ”John Barnes (American author)”, ”John Barnes (football player)”,. . .}. Consider D = {dk|k = 1, . . . ,K} is a set of documents containing the names in Ad, where possibility At = {atl|l = 1, . . . , L} is a set of composition of name tokens (first/middle/last name or in abbreviations), and due to a person has multiple name variations, e.g., ”Shahrul Azman Noah (Professor)” has names/aliases as in {”Shahrul Azman Mohd Noah”, ”Shahrul Azman Noah”, ”S. A. M. Noah”, ”Noah, S. A. M.”, . . .}. Moreover, the persons name sometimes affected by the background of social communities, like nation, tribes, religion, etc., where a community simply is characterized by the properties in common. For example, some names of Malaysia or Indonesia peoples sometimes insert special terms: ”bin”, ”b”, ”binti” or ”bt” (respect to ”son of” or daughter of”), e.g., one name variation of ”Shahrul Azman Noah” is ”Shahrul Azman b Mohd Noah”. In another case, an certain community give the characteristic to communitys members, such as the academic community will add the academic degree such as ”Prof.” (professor) to its members.\nIdentifying named entity relates to all observed names in D, i.e., Ax = {axo|o = 1, . . . , O}, which need to be patterned and disambiguated. The persons names can be rendered differently in online information sources. They are not named with single pattern of tokens, they are not also labeled with unique identifiers, and therefore the names of people also associated with the uncertain things. Text searching relies on matching pattern, searching on a name based on pattern will only match the form a searcher enters in a search box. This causes low recall and negatively affects search precision [11], when the name of a single person is represented in different ways in the same database [12], such as on the motivation above.\nIndeed, in scientific publications such as from IEEE, ACM, Springer, etc., all need the shortened forms of name, especially forenames represented only by initials. However, the shortened form of name is not only makes the name variation, but it creates the name ambiguity in online information sources, such as Web. For example, the name ”J. Barnes” can represent ”John Barnes (computer scientist)”, ”Jack Barnes (American communist leader)”, ”Johnnie Barnes (American football player)”, ”Johnny Barnes (Bermudian eccentric)”, ”Joshua Barnes\n(English scholar)”, etc. Name disambiguation is an important problem in information extraction about persons, and is one of themes in Semantic Web. Thus, the persons name can be expressed by using different aliases due to multiple reasons as motives: use of abbreviations, different naming conventions, misspelling, pseudonyms in publication or bibliographies (citations), or naming variations over time. Some different real world entities have the same name, or they share some aliases. So, it is also a semantic problem. We conclude that there are two fundamental reasons of name disambiguation semantically for identifying entities generally, or persons specially, i.e.,\n1. different entities can share the same name (lexical ambiguity), and 2. a single entity can be designated by multiple names (referential ambiguity).\nFormally, these name disambiguation problems have tasks:\n1. ∀a ∈ A, there is a relation ξ to assign a list of documents D containing a\nsuch that ξ : A M :N −→ Ad, Ad is a subset of Ax, where ξ(a) ∈ Ad,\n2. ∀a ∈ A, there is a relation ζ : A M :L −→ At, At is a subset of Ax, where\nζ(a) ∈ At.\nSemantically, extracting the keyword from web snippet is to tie ξ and ζ into a bundle whereby a group of documents exactly associate with one entity only."
    }, {
      "heading" : "2.3 Proposed Approach",
      "text" : "We start this approach with describing some concepts:\n1. A word w is the basic unit of discrete data, defined to be an item from a vocabulary indexed by {1, . . . ,K}, where wk = 1 if k ∈ K, and wk = 0 otherwise; 2. A term tx consists of at least one word or a sequence of words, or tx = (w1, . . . , wl), l = k, k is a number of parameters representing word, and |tx| = k is size of tx; 3. Let a web page denoted by ω and a set of web pages indexed by search engine be containing pairs of term and web page. Let tx is a search term and a web page contain tx is ωx, we obtain Ωx = {(tx, ωx)}, Ωx is a subset of Ω, or tx ∈ ωx in Ωx. |Ωx| = |{tx, ωx}| is cardinality of x; 4. Let tx is a search term. S = {wa, . . . , wmax} is a web snippet (briefly snippet) about tx that returned by search engine, where max = ±50 words. L = {Si|i = 1, . . . , N} is a list of snippet.\nBased on these concepts, we develop an approach based on the overlap principle [13] to extract keywords from web snippet. The interpretation of overlap principle by using the query as a composition of tx ∩ ty or ”tx,ty” is to get a reflection the real world from the web, while to implement it we use one of similarity measures, for example, the similarity based on Kolmogorov complexity [14]\nsim(tx, ty) = log(2|Ωx ∩Ωy|\nlog(|Ωx|+ |Ωy |) (1)\nWe assume that ambiguity is caused by overlapping interpretations and understanding of the things that exist in the real world. This assumption describes the usefulness of intersection of regular sets. Therefore, we can formulate the conditions of the overlap principle as follows:\nFor first condition (Condition 1): Let tx be a term and ta is a representation term of person name a ∈ A. We define a condition of overlap principle of tx and ta, i.e. ta∩tx = ∅, but ta, tx ∈ ωa and ta, tx ∈ ωx, such that ta, tx ∈ S.\nSecond condition (Condition 2): Let ta, tx, ty ∈ S with |Ωx| = |Ωy|. We define a condition of overlap principle between ta and tx or ty, i.e. |Ωa∩Ωx| > |Ωa ∩Ωy|."
    }, {
      "heading" : "3 Results and Discussion",
      "text" : ""
    }, {
      "heading" : "3.1 Evaluation and Dataset",
      "text" : "Consider a set L of documents or snippets, each containing a reference to a person. Let P = {P1, . . . , P|P |} be a partition of ξ and ζ into references to the same person, so for example Pi = {S1, S4, S5, S9} might be a set of references to ”Abdul Razak Hamdan” the information technology professor. Let C = {C1, . . . , C|C|} be a collection of disjoint subset of L created by algorithm and manually validated such that each Si has a identifier, i.e., URL address, Table 1. Then, we will denote by LC the references that have been clusters based on collection. Based on measure were introduced [9], we define a notation of recall Rec() as follows: Rec(Si) = (|{S ∈ P (Si) : C(S) = C(Si)}|)/(|{S ∈ P (Si)}|) and a notation of precision Prec() as follows: Prec(Si) = (|{S ∈ C(Si) : P (S) = P (Si)}|)/(|{S ∈ C(Si)}|) where P (Si) as a set Pi containing reference Si and C(Si) to be the set Ci containing Si. Thus, the precision of a reference to ”Abdul Razak Hamdan” is the fraction of references in the same cluster that are also to ”Abdul Razak Hamdan”. We obtain average recall (REC), precision (PREC), and F -measure for the clustering C as follows:\nREC =\n∑ S∈LC Rec(S)\n|LC | (2)\nPREC =\n∑ S∈LC Prec(S)\n|LC | (3)\nF = 2 ·REC · PREC\nREC + PREC (4)"
    }, {
      "heading" : "3.2 Experiment",
      "text" : "Let us consider information context of actors, that includes all relevant relationships as well as interaction history, where Yahoo! Search engines fall short of utilizing any specific information, especially context information, and just use full text index search in web snippets. In experiment, we use maximum of 1, 000 web snippets for search term ta representing an actor. The web snippets generate the words list for each actor, outputs very rare words because of the diversity its vocabularies. For example, the list of words for a named actor ”Abdul Razak Hamdan” generated a list of 26 candidate words. For example, we have as many as 85 web pages about Abdul Razak Hamdan in our dataset. By using Yahoo! Search, we execute the query ”Abdul Razak Hamdan” and a keyword ”science”, then we get 39 web pages that contain the name ”Abdul Razak Hamdan” and a word ”science”, and in accordance with our dataset. We obtain this value when loading 387-th web page, and this value persists until the maximum number of loading of web pages, i.e. 500. Thus, we obtain Rec(”Abdulah Razak Hamdan,science”) = 46% and Prec(”Abdullah Razak Hamdan,science”) = 10%. There are 11 words, {science, Malaysia, software, data, based, technology, study, computer, using, nor, system}, and we have the counting of REC = 0.82, PREC = 0.23 and F = 0.36, see Table 2."
    }, {
      "heading" : "4 Conclusion",
      "text" : "The approach based on overlap principle has the potential to be incorporated into existing method for extracting personal feature like as keyword. It shows how to\nuncover a keyword by exploiting web snippets and hit counts. Our near future work is to compare some methods for looking into the possibility of enhancing this method."
    } ],
    "references" : [ {
      "title" : "Automatic word sense discrimination",
      "author" : [ "H. Schutze" ],
      "venue" : "Computational Linguistics,",
      "citeRegEx" : "1",
      "shortCiteRegEx" : "1",
      "year" : 1998
    }, {
      "title" : "Finding predominant word senses in untagged text",
      "author" : [ "D. McCarthy", "R. Koeling", "J. Weeds", "J. Carroll" ],
      "venue" : "Proceedings of the 42nd Metting of the Association for Computational Linguistics (ACL04),",
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 2004
    }, {
      "title" : "Unsupervised personal name disambiguation",
      "author" : [ "G.S. Mann", "D. Yarowsky" ],
      "venue" : "Proceedings of Computational Natural Language Learning (CoNLL 2003),",
      "citeRegEx" : "3",
      "shortCiteRegEx" : "3",
      "year" : 2003
    }, {
      "title" : "Disambiguating web appearances of people in a social network",
      "author" : [ "R. Bekkerman", "A. McCallum" ],
      "venue" : "The Fourteenth International World Wide Web Conference or Proc. Of WWW,",
      "citeRegEx" : "4",
      "shortCiteRegEx" : "4",
      "year" : 2005
    }, {
      "title" : "From ambiguous names to identifiable entities",
      "author" : [ "X. Li", "P. Morie", "Roth", "D. Semantic integration in text" ],
      "venue" : "AI Magazine, 26(1), 45-58",
      "citeRegEx" : "5",
      "shortCiteRegEx" : null,
      "year" : 2005
    }, {
      "title" : "Name disambiguation in author citations using a K-way spectral clustering method",
      "author" : [ "H. Han", "H. Zha", "C.L. Giles" ],
      "venue" : "Proceedings of the 5th ACM/IEEE-CS Joint Conference on Digital Libraries (JCDL",
      "citeRegEx" : "6",
      "shortCiteRegEx" : "6",
      "year" : 2005
    }, {
      "title" : "Named entity disambiguation on an ontology enriched by Wikipedia",
      "author" : [ "H.T. Nguyen", "T.H. Cao" ],
      "venue" : null,
      "citeRegEx" : "7",
      "shortCiteRegEx" : "7",
      "year" : 2008
    }, {
      "title" : "A hybrid statistical and rule-based incremental approach",
      "author" : [ "H.T. Nguyen", "Cao", "T.H. Named entity disambiguation" ],
      "venue" : "In ASWC 2008, LNCS 5367, J. Domingue and C. Anutariya, Eds, Heidelberg: Springer, 420-433",
      "citeRegEx" : "8",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "Disambiguation of references to individuals, RJI0364",
      "author" : [ "L. Lloyd", "V. Bhagwan", "D. Gruhl", "A. Tomkins" ],
      "venue" : "Computer Science, October",
      "citeRegEx" : "9",
      "shortCiteRegEx" : "9",
      "year" : 2005
    }, {
      "title" : "Generative models for name disambigution (poster paper)",
      "author" : [ "Y. Song", "J. Huang", "I.G. Councill", "J. Li", "C.L. Giles" ],
      "venue" : "WWW",
      "citeRegEx" : "10",
      "shortCiteRegEx" : "10",
      "year" : 2007
    }, {
      "title" : "Name-matching algorithm for legal case-management system",
      "author" : [ "L.K. Branting" ],
      "venue" : "Journal of Information, Law, and Technology (JILT),",
      "citeRegEx" : "11",
      "shortCiteRegEx" : "11",
      "year" : 2002
    }, {
      "title" : "A latent Dirichlet model for unsupervised entity resolution",
      "author" : [ "I. Bhattachrya", "L. Getoor" ],
      "venue" : "In Proceedings of the 6th SIAM Conference on Data Mining (SIAM),",
      "citeRegEx" : "12",
      "shortCiteRegEx" : "12",
      "year" : 2006
    }, {
      "title" : "Extracting social networks from web documents, The 1st National Doctoral Seminar on Artificial Intelligence Technology (CAIT)",
      "author" : [ "M.K.M. Nasution", "Noah", "S.A. M" ],
      "venue" : "Universiti Kebangsaan Malaysia,",
      "citeRegEx" : "13",
      "shortCiteRegEx" : "13",
      "year" : 2010
    }, {
      "title" : "Clustering and similarity",
      "author" : [ "Nasution", "M.K. Mahyuddin. Kolmogorov complexity" ],
      "venue" : "Bulletin of Mathematics, 3(1), 1-16",
      "citeRegEx" : "14",
      "shortCiteRegEx" : null,
      "year" : 2010
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "The issues of disambiguation therefore is related to the special case of WSD (word sense disambiguation) [1,2], especially with the name of someone who is also the words.",
      "startOffset" : 105,
      "endOffset" : 110
    }, {
      "referenceID" : 1,
      "context" : "The issues of disambiguation therefore is related to the special case of WSD (word sense disambiguation) [1,2], especially with the name of someone who is also the words.",
      "startOffset" : 105,
      "endOffset" : 110
    }, {
      "referenceID" : 2,
      "context" : "Most of works addressed the name disambiguation, among them about preparing information for person-specific [3]; finding to the association of persons such as the social networks [4]; distinguishing the different persons with keyword/key phrases [5], associating a domain of citations in the scientific papers [6], etc.",
      "startOffset" : 108,
      "endOffset" : 111
    }, {
      "referenceID" : 3,
      "context" : "Most of works addressed the name disambiguation, among them about preparing information for person-specific [3]; finding to the association of persons such as the social networks [4]; distinguishing the different persons with keyword/key phrases [5], associating a domain of citations in the scientific papers [6], etc.",
      "startOffset" : 179,
      "endOffset" : 182
    }, {
      "referenceID" : 4,
      "context" : "Most of works addressed the name disambiguation, among them about preparing information for person-specific [3]; finding to the association of persons such as the social networks [4]; distinguishing the different persons with keyword/key phrases [5], associating a domain of citations in the scientific papers [6], etc.",
      "startOffset" : 246,
      "endOffset" : 249
    }, {
      "referenceID" : 5,
      "context" : "Most of works addressed the name disambiguation, among them about preparing information for person-specific [3]; finding to the association of persons such as the social networks [4]; distinguishing the different persons with keyword/key phrases [5], associating a domain of citations in the scientific papers [6], etc.",
      "startOffset" : 310,
      "endOffset" : 313
    }, {
      "referenceID" : 6,
      "context" : "Meronymy [7]: x is part y or ”is-a”, part to whole relation - the semantic relation that holds between a part and the whole.",
      "startOffset" : 9,
      "endOffset" : 12
    }, {
      "referenceID" : 7,
      "context" : "Hyponymy [8]: x be subordinate of y or ”has-property”, subordination - the semantic relation of being subordinate or belong to a lower rank or class.",
      "startOffset" : 9,
      "endOffset" : 12
    }, {
      "referenceID" : 8,
      "context" : "Synonymy [9,10]: x denotes the same as y, the semantic relation that holds between two words or can (in the context) express the same meaning.",
      "startOffset" : 9,
      "endOffset" : 15
    }, {
      "referenceID" : 9,
      "context" : "Synonymy [9,10]: x denotes the same as y, the semantic relation that holds between two words or can (in the context) express the same meaning.",
      "startOffset" : 9,
      "endOffset" : 15
    }, {
      "referenceID" : 9,
      "context" : "Polysemy [10]: Lexical ambiguity, individual word or phrase or label that can be used to express two or more different meanings.",
      "startOffset" : 9,
      "endOffset" : 13
    }, {
      "referenceID" : 10,
      "context" : "This causes low recall and negatively affects search precision [11], when the name of a single person is represented in different ways in the same database [12], such as on the motivation above.",
      "startOffset" : 63,
      "endOffset" : 67
    }, {
      "referenceID" : 11,
      "context" : "This causes low recall and negatively affects search precision [11], when the name of a single person is represented in different ways in the same database [12], such as on the motivation above.",
      "startOffset" : 156,
      "endOffset" : 160
    }, {
      "referenceID" : 12,
      "context" : "Based on these concepts, we develop an approach based on the overlap principle [13] to extract keywords from web snippet.",
      "startOffset" : 79,
      "endOffset" : 83
    }, {
      "referenceID" : 13,
      "context" : "The interpretation of overlap principle by using the query as a composition of tx ∩ ty or ”tx,ty” is to get a reflection the real world from the web, while to implement it we use one of similarity measures, for example, the similarity based on Kolmogorov complexity [14]",
      "startOffset" : 266,
      "endOffset" : 270
    }, {
      "referenceID" : 8,
      "context" : "Based on measure were introduced [9], we define a notation of recall Rec() as follows: Rec(Si) = (|{S ∈ P (Si) : C(S) = C(Si)}|)/(|{S ∈ P (Si)}|) and a notation of precision Prec() as follows: Prec(Si) = (|{S ∈ C(Si) : P (S) = P (Si)}|)/(|{S ∈ C(Si)}|) where P (Si) as a set Pi containing reference Si and C(Si) to be the set Ci containing Si.",
      "startOffset" : 33,
      "endOffset" : 36
    } ],
    "year" : 2016,
    "abstractText" : "Name disambiguation has become one of the main themes in the Semantic Web agenda. The semantic web is an extension of the current Web in which information is not only given well-defined meaning, but also has many purposes that contain the ambiguous naturally or a lot of thing came with the overlap, mainly deals with the persons name. Therefore, we develop an approach to extract keywords from web snippet with utilizing the overlap principle, a concept to understand things with ambiguous, whereby features of person are generated for dealing with the variety of web, the web is steadily gaining ground in the semantic research.",
    "creator" : "LaTeX with hyperref package"
  }
}