{
  "name" : "1603.01417.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Dynamic Memory Networks for Visual and Textual Question Answering",
    "authors" : [ "Caiming Xiong", "Stephen Merity", "Richard Socher" ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : "1. Introduction",
      "text" : "Neural network based methods have made tremendous progress in image and text classification (Krizhevsky et al., 2012; Socher et al., 2013b). However, only recently has progress been made on more complex tasks that require logical reasoning. This success is based in part on the addition of memory and attention components to complex neural networks. For instance, memory networks (Weston et al., 2015b) are able to reason over several facts written in natural language or (subject, relation, object) triplets. Attention mechanisms have been successful components in both machine translation (Bahdanau et al., 2015; Luong et al., 2015) and image captioning models (Xu et al., 2015).\nThe dynamic memory network (Kumar et al., 2015) (DMN) is one example of a neural network model that has both a memory component and an attention mechanism. The DMN yields state of the art results on question answering with supporting facts marked during training, sentiment analysis, and part-of-speech tagging.\nWe analyze the DMN components, specifically the input\nAnswer\nQuestionInput Module\nAnswer\nQuestionInput Module\n(a) Text Question-Answering (b) Visual Question-Answering\nWhat kind of tree is in the background?\nKitchen Palm\nJohn moved to the garden.\nJohn got the apple there.\nJohn moved to the kitchen.\nSandra got the milk there.\nJohn dropped the apple.\nJohn moved to the office.\nWhere is the apple?\nEpisodic Memory\nAttention Mechanism Memory Update\nEpisodic Memory\nAttention Mechanism Memory Update\nFigure 1. Question Answering over text and images using a Dynamic Memory Network.\nmodule and memory module, to improve question answering. We propose a new input module which uses a two level encoder with a sentence reader and input fusion layer to allow for information flow between sentences. For the memory, we propose a modification to gated recurrent units (GRU) (Chung et al., 2014). The new GRU formulation incorporates attention gates that are computed using global knowledge over the facts. Unlike before, the new DMN+ model does not require that supporting facts (i.e. the facts that are relevant for answering a particular question) are labeled during training. The model learns to select the important facts from a larger set.\nIn addition, we introduce a new input module to represent images. This module is compatible with the rest of the DMN architecture and its output is fed into the memory module. We show that the changes in the memory module that improved textual question answering also improve visual question answering. Both tasks are illustrated in Fig. 1."
    }, {
      "heading" : "2. Dynamic Memory Networks",
      "text" : "We begin by outlining the DMN for question answering and the modules as presented in Kumar et al. (2015).\nThe DMN is a general architecture for question answering (QA). It is composed of modules that allow different aspects such as input representations or memory components to be analyzed and improved independently. The modules, depicted in Fig. 1, are as follows:\nar X\niv :1\n60 3.\n01 41\n7v 1\n[ cs\n.N E\n] 4\nM ar\n2 01\n6\nInput Module: This module processes the input data about which a question is being asked into a set of vectors termed facts, represented as F = [f1, . . . , fN ], whereN is the total number of facts. These vectors are ordered, resulting in additional information that can be used by later components. For text QA in Kumar et al. (2015), the module consists of a GRU over the input words.\nAs the GRU is used in many components of the DMN, it is useful to provide the full definition. For each time step i with input xi and previous hidden state hi−1, we compute the updated hidden state hi = GRU(xi, hi−1) by\nui = σ ( W (u)xi + U (u)hi−1 + b (u) )\n(1) ri = σ ( W (r)xi + U (r)hi−1 + b (r) ) (2)\nh̃i = tanh ( Wxi + ri ◦ Uhi−1 + b(h) ) (3)\nhi = ui ◦ h̃i + (1− ui) ◦ hi−1 (4)\nwhere σ is the sigmoid activation function, ◦ is an elementwise product, W (z),W (r),W ∈ RnH×nI , U (z), U (r), U ∈ RnH×nH , nH is the hidden size, and nI is the input size.\nQuestion Module: This module computes a vector representation q of the question, where q ∈ RnH is the final hidden state of a GRU over the words in the question.\nEpisodic Memory Module: Episode memory aims to retrieve the information required to answer the question q from the input facts. To improve our understanding of both the question and input, especially if questions require transitive reasoning, the episode memory module may pass over the input multiple times, updating episode memory after each pass. We refer to the episode memory on the tth pass over the inputs as mt, where mt ∈ RnH , the initial memory vector is set to the question vector: m0 = q.\nThe episodic memory module consists of two separate components: the attention mechanism and the memory update mechanism. The attention mechanism is responsible for producing a contextual vector ct, where ct ∈ RnH is a summary of relevant input for pass t, with relevance inferred by the question q and previous episode memory mt−1. The memory update mechanism is responsible for generating the episode memory mt based upon the contextual vector ct and previous episode memory mt−1. By the final pass T , the episodic memory mT should contain all the information required to answer the question q.\nAnswer Module: The answer module receives both q and mT to generate the model’s predicted answer. For simple answers, such as a single word, a linear layer with softmax activation may be used. For tasks requiring a sequence output, an RNN may be used to decode a = [q;mT ], the concatenation of vectors q andmT , to an ordered set of tokens. The cross entropy error on the answers is used for training\nand backpropagated through the entire network."
    }, {
      "heading" : "3. Improved Dynamic Memory Networks: DMN+",
      "text" : "We propose and compare several modeling choices for two crucial components: input representation, attention mechanism and memory update. The final DMN+ model obtains the highest accuracy on the bAbI-10k dataset without supporting facts and the VQA dataset (Antol et al., 2015). Several design choices are motivated by intuition and accuracy improvements on that dataset."
    }, {
      "heading" : "3.1. Input Module for Text QA",
      "text" : "In the DMN specified in Kumar et al. (2015), a single GRU is used to process all the words in the story, extracting sentence representations by storing the hidden states produced at the end of sentence markers. The GRU also provides a temporal component by allowing a sentence to know the content of the sentences that came before them. Whilst this input module worked well for bAbI-1k with supporting facts, as reported in Kumar et al. (2015), it did not perform well on bAbI-10k without supporting facts (Sec. 6.1).\nWe speculate that there are two main reasons for this performance disparity, all exacerbated by the removal of supporting facts. First, the GRU only allows sentences to have context from sentences before them, but not after them. This prevents information propagation from future sentences. Second, the supporting sentences may be too far away from each other on a word level to allow for these distant sentences to interact through the word level GRU.\nInput Fusion Layer\nFor the DMN+, we propose replacing this single GRU with two different components. The first component is a sentence reader, responsible only for encoding the words into a sentence embedding. The second component is the input fusion layer, allowing for interactions between sentences. This resembles the hierarchical neural auto-encoder architecture of Li et al. (2015) and allows content interaction between sentences. We adopt the bi-directional GRU for this input fusion layer because it allows information from both past and future sentences to be used. As gradients do not need to propagate through the words between sentences, the fusion layer also allows for distant supporting sentences to have a more direct interaction.\nFig. 2 shows an illustration of an input module, where a positional encoder is used for the sentence reader and a bi-directional GRU is adopted for the input fusion layer. Each sentence encoding fi is the output of an encoding scheme taking the word tokens [wi1, . . . , w i Mi\n], where Mi is the length of the sentence.\nThe sentence reader could be based on any variety of encoding schemes. We selected positional encoding described in Sukhbaatar et al. (2015) to allow for a comparison to their work. GRUs and LSTMs were also considered but required more computational resources and were prone to overfitting if auxiliary tasks, such as reconstructing the original sentence, were not used.\nFor the positional encoding scheme, the sentence representation is produced by fi = ∑j=1 M lj ◦ wij , where ◦ is element-wise multiplication and lj is a column vector with structure ljd = (1 − j/M) − (d/D)(1 − 2j/M), where d is the embedding index and D is the dimension of the embedding.\nThe input fusion layer takes these input facts and enables an information exchange between them by applying a bidirectional GRU.\n−→ fi = GRUfwd(fi, −−→ fi−1) (5) ←− fi = GRUbwd(fi, ←−− fi+1) (6)\n←→ fi = ←− fi + −→ fi (7)\nwhere fi is the input fact at timestep i, −→ fi is the hidden state of the forward GRU at timestep i, and ←− fi is the hidden state of the backward GRU at timestep i. This allows contextual information from both future and past facts to impact ←→ fi .\nWe explored a variety of encoding schemes for the sentence reader, including GRUs, LSTMs, and the positional encoding scheme described in Sukhbaatar et al. (2015). For simplicity and speed, we selected the positional encoding scheme. GRUs and LSTMs were also considered but required more computational resources and were prone to overfitting if auxiliary tasks, such as reconstructing the\noriginal sentence, were not used."
    }, {
      "heading" : "3.2. Input Module for VQA",
      "text" : "To apply the DMN to visual question answering, we introduce a new input module for images. The module splits an image into small local regions and considers each region equivalent to a sentence in the input module for text. The input module for VQA is composed of three parts, illustrated in Fig. 3: local region feature extraction, visual feature embedding, and the input fusion layer introduced in Sec. 3.1.\nLocal region feature extraction: To extract features from the image, we use a convolutional neural network (Krizhevsky et al., 2012) based upon the VGG-19 model (Simonyan & Zisserman, 2014). We first rescale the input image to 448× 448 and take the output from the last pooling layer which has dimensionality d = 512 × 14 × 14. The pooling layer divides the image into a grid of 14× 14, resulting in 196 local regional vectors of d = 512.\nVisual feature embedding: As the VQA task involves both image features and text features, we add a linear layer with tanh activation to project the local regional vectors to the textual feature space used by the question vector q.\nInput fusion layer: The local regional vectors extracted from above do not yet have global information available to them. Without global information, their representational power is quite limited, with simple issues like object scaling or locational variance causing accuracy problems.\nTo solve this, we add an input fusion layer similar to that of the textual input module described in Sec. 3.1. First, to produce the input facts F , we traverse the image in a snake like fashion, as seen in Figure 3. We then apply a bi-directional GRU over these input facts F to produce the\nglobally aware input facts ←→ F . The bi-directional GRU allows for information propagation from neighboring image patches, capturing spatial information."
    }, {
      "heading" : "3.3. The Episodic Memory Module",
      "text" : "The episodic memory module, as depicted in Fig. 4, retrieves information from the input facts ←→ F = [ ←→ f1 , . . . , ←→ fN ] provided to it by focusing attention on a subset of these facts. We implement this attention by associating a single scalar value, the attention gate gti , with each fact ←→ f i during pass t. This is computed by allowing interactions between the fact and both the question representation and the episode memory state.\nzti=[ ←→ fi ◦ q; ←→ fi ◦mt−1; | ←→ fi − q|; | ←→ fi −mt−1|] (8)\nZti =W (2) tanh ( W (1)zti + b (1) ) + b(2) (9)\ngti= exp(Zti )∑Mi k=1 exp(Z t k)\n(10)\nwhere ←→ fi is the ith fact, mt−1 is the previous episode memory, q is the original question, ◦ is the element-wise product, | · | is the element-wise absolute value, and ; represents concatenation of the vectors.\nThe DMN implemented in Kumar et al. (2015) involved a more complex set of interactions within z, containing the additional terms [f ;mt−1; q; fTW (b)q; fTW (b)mt−1]. After an initial analysis, we found these additional terms were not required.\nAttention Mechanism\nOnce we have the attention gate gti we use an attention mechanism to extract a contextual vector ct based upon the current focus. We focus on two types of attention: soft attention and a new attention based GRU. The latter improves performance and is hence the final modeling choice for the DMN+.\nSoft attention: Soft attention produces a contextual vector ct through a weighted summation of the sorted list of vectors ←→ F and corresponding attention gates gti : c\nt =∑N i=1 g t i ←→ f i This method has two advantages. First, it is easy to compute. Second, if the softmax activation is spiky it can approximate a hard attention function by selecting only a single fact for the contextual vector whilst still being differentiable. However the main disadvantage to soft attention is that the summation process loses both positional and ordering information. Whilst multiple attention passes can retrieve some of this information, this is inefficient.\nAttention based GRU: For more complex queries, we would like for the attention mechanism to be sensitive to both the position and ordering of the input facts ←→ F . An RNN would be advantageous in this situation except they cannot make use of the attention gate from Equation 10.\nWe propose a modification to the GRU architecture by embedding information from the attention mechanism. The update gate ui in Equation 1 decides how much of each dimension of the hidden state to retain and how much should be updated with the transformed input xi from the current timestep. As ui is computed using only the current input and the hidden state from previous timesteps, it lacks any knowledge from the question or previous episode memory.\nBy replacing the update gate ui in the GRU (Equation 1) with the output of the attention gate gti (Equation 10) in Equation 4, the GRU can now use the attention gate for updating its internal state. This change is depicted in Fig 5.\nhi=g t i ◦ h̃i + (1− gti) ◦ hi−1 (11)\nAn important consideration is that gti is a scalar, generated using a softmax activation, as opposed to the vector ui ∈ RnH , generated using a sigmoid activation. This allows us to easily visualize how the attention gates activate over the input, later shown for visual QA in Fig. 6. Though not explored, replacing the softmax activation in Equation 10 with a sigmoid activation would result in gti ∈ RnH . To produce the contextual vector ct used for updating the episodic memory state mt, we use the final hidden state of the attention based GRU.\nEpisode Memory Updates\nAfter each pass through the attention mechanism, we wish\nto update the episode memory mt−1 with the newly constructed contextual vector ct, producing mt. In the DMN, a GRU with the initial hidden state set to the question vector q is used for this purpose. The episodic memory for pass t is computed by\nmt = GRU(ct,mt−1) (12)\nThe work of Sukhbaatar et al. (2015) suggests that using different weights for each pass through the episodic memory may be advantageous. When the model contains only one set of weights for all episodic passes over the input, it is referred to as a tied model, as in the “Mem Weights” row in Table 1.\nFollowing the memory update component used in Sukhbaatar et al. (2015) and Peng et al. (2015) we experiment with using a ReLU layer for the memory update, calculating the new episode memory state by\nmt = ReLU ( W t[mt−1; ct; q] + b ) (13)\nwhere ; is the concatenation operator, W t ∈ RnH×nH , b ∈ RnH , and nH is the hidden size. The untying of weights and using this ReLU formulation for the memory update improves accuracy by another 0.5% as shown in Table 1 in the last column. The final output of the memory network is passed to the answer module as in the original DMN."
    }, {
      "heading" : "4. Related Work",
      "text" : "The DMN is related to two major lines of recent work: memory and attention mechanisms. We work on both visual and textual question answering which have, until now, been developed in separate communities.\nNeural Memory Models The earliest recent work with a memory component that is applied to language processing is that of memory networks (Weston et al., 2015b) which adds a memory component for question answering over simple facts. They are similar to DMNs in that they also have input, scoring, attention and response mechanisms. However, unlike the DMN their input module computes sentence representations independently and hence cannot easily be used for other tasks such as sequence labeling. Like the original DMN, this memory network requires that supporting facts are labeled during QA training. End-toend memory networks (Sukhbaatar et al., 2015) do not have this limitation. In contrast to previous memory models with a variety of different functions for memory attention retrieval and representations, DMNs (Kumar et al., 2015) have shown that neural sequence models can be used for input representation, attention and response mechanisms. Sequence models naturally capture position and temporality of both the inputs and transitive reasoning steps.\nNeural Attention Mechanisms Attention mechanisms allow neural network models to use a question to selectively pay attention to specific inputs. They can benefit image classification (Stollenga et al., 2014), generating captions for images (Xu et al., 2015), among others mentioned below, and machine translation (Cho et al., 2014; Bahdanau et al., 2015; Luong et al., 2015). Other recent neural architectures with memory or attention which have proposed include neural Turing machines (Graves et al., 2014), neural GPUs (Kaiser & Sutskever, 2015) and stack-augmented RNNs (Joulin & Mikolov, 2015).\nQuestion Answering in NLP Question answering involving natural language can be solved in a variety of ways to which we cannot all do justice. If the potential input is a large text corpus, QA becomes a combination of information retrieval and extraction (Yates et al., 2007). Neural approaches can include reasoning over knowledge bases, (Bordes et al., 2012; Socher et al., 2013a) or directly via sentences for trivia competitions (Iyyer et al., 2014).\nVisual Question Answering (VQA) In comparison to QA in NLP, VQA is still a relatively young task that is feasible only now that objects can be identified with high accuracy. The first large scale database with unconstrained questions about images was introduced by Antol et al. (2015). While VQA datasets existed before they did not include openended, free-form questions about general images (Geman et al., 2014). Others are were too small to be viable for a deep learning approach (Malinowski & Fritz, 2014). The only VQA model which also has an attention component is the stacked attention network (Yang et al., 2015). Their work also uses CNN based features. However, unlike our input fusion layer, they use a single layer neural network to map the features of each patch to the dimensionality of the question vector. Hence, the model cannot easily incorporate adjacency of local information in its hidden state. A model that also uses neural modules, albeit logically inspired ones, is that by Andreas et al. (2016) who evaluate on knowledgebase reasoning and visual question answering. We compare directly to their method on the latter task and dataset.\nRelated to visual question answering is the task of describing images with sentences (Kulkarni et al., 2011). Socher et al. (2014) used deep learning methods to map images and sentences into the same space in order to describe images with sentences and to find images that best visualize a sentence. This was the first work to map both modalities into a joint space with deep learning methods, but it could only select an existing sentence to describe an image. Shortly thereafter, recurrent neural networks were used to generate often novel sentences based on images (Karpathy & FeiFei, 2015; Chen & Zitnick, 2014; Fang et al., 2015; Xu et al., 2015)."
    }, {
      "heading" : "5. Datasets",
      "text" : "To analyze our proposed model changes and compare our performance with other architectures, we use three datasets."
    }, {
      "heading" : "5.1. bAbI-10k",
      "text" : "For evaluating the DMN on textual question answering, we use bAbI-10k English (Weston et al., 2015a), a synthetic dataset which features 20 different tasks. Each example is composed of a set of facts, a question, the answer, and the supporting facts that lead to the answer. The dataset comes in two sizes, referring to the number of training examples each task has: bAbI-1k and bAbI-10k. The experiments in Sukhbaatar et al. (2015) found that their lowest error rates on the smaller bAbI-1k dataset were on average three times higher than on bAbI-10k."
    }, {
      "heading" : "5.2. DAQUAR-ALL visual dataset",
      "text" : "The DAtaset for QUestion Answering on Real-world images (DAQUAR) (Malinowski & Fritz, 2014) consists of 795 training images and 654 test images. Based upon these images, 6,795 training questions and 5,673 test questions were generated. Following the previously defined experimental method, we exclude multiple word answers (Malinowski et al., 2015; Ma et al., 2015). The resulting dataset covers 90% of the original data. The evaluation method uses classification accuracy over the single words. We use this as a development dataset for model analysis (Sec. 6.1)."
    }, {
      "heading" : "5.3. Visual Question Answering",
      "text" : "The Visual Question Answering (VQA) dataset was constructed using the Microsoft COCO dataset (Lin et al., 2014) which contained 123,287 training/validation images and 81,434 test images. Each image has several related questions with each question answered by multiple people. This dataset contains 248,349 training questions, 121,512 validation questions, and 244,302 for testing. The testing data was split into test-development, test-standard and testchallenge in Antol et al. (2015).\nEvaluation on both test-standard and test-challenge are implemented via a submission system. test-standard may only be evaluated 5 times and test-challenge is only evaluated at the end of the competition. To the best of our knowledge, VQA is the largest and most complex image dataset for the visual question answering task."
    }, {
      "heading" : "6. Experiments",
      "text" : ""
    }, {
      "heading" : "6.1. Model Analysis",
      "text" : "To understand the impact of the proposed module changes, we analyze the performance of a variety of DMN models on textual and visual question answering datasets.\nThe original DMN (ODMN) is the architecture presented in Kumar et al. (2015) without any modifications. DMN2 only replaces the input module with the input fusion layer (Sec. 3.1). DMN3, based upon DMN2, replaces the soft attention mechanism with the attention based GRU proposed in Sec. 3.3. Finally, DMN+, based upon DMN3, is an untied model, using a unique set of weights for each pass and a linear layer with a ReLU activation to compute the memory update. We report the performance of the model variations in Table 1.\nA large improvement to accuracy on both the bAbI-10k textual and DAQUAR visual datasets results from updating the input module, seen when comparing ODMN to DMN2. On both datasets, the input fusion layer improves interaction between distant facts. In the visual dataset, this improvement is purely from providing contextual information from neighboring image patches, allowing it to handle objects of varying scale or questions with a locality aspect. For the textual dataset, the improved interaction between sentences likely helps the path finding required for logical reasoning when multiple transitive steps are required.\nThe addition of the attention GRU in DMN3 helps answer questions where complex positional or ordering information may be required. This change impacts the textual dataset the most as few questions in the visual dataset are likely to require this form of logical reasoning. Finally, the untied model in the DMN+ overfits on some tasks compared to DMN3, but on average the error rate decreases.\nFrom these experimental results, we find that the combination of all the proposed model changes results, culminating in DMN+, achieves the highest performance across both the visual and textual datasets."
    }, {
      "heading" : "6.2. Comparison to state of the art using bAbI-10k",
      "text" : "We trained our models using the Adam optimizer (Kingma & Ba, 2014) with a learning rate of 0.001 and batch size of 128. Training runs for up to 256 epochs with early stopping if the validation loss had not improved within the last 20 epochs. The model from the epoch with the lowest validation loss was then selected. Xavier initialization was used for all weights except for the word embeddings, which used random uniform initialization with range [− √ 3, √ 3]. Both the embedding and hidden dimensions were of size d = 80. We used `2 regularization on all weights except bias and used dropout on the initial sentence encodings and the an-\nswer module, keeping the input with probability p = 0.9. The last 10% of the training data on each task was chosen as the validation set. For all tasks, three passes were used for the episodic memory module, allowing direct comparison to other state of the art methods. Finally, we limited the input to the last 70 sentences for all tasks except QA3 for which we limited input to the last 130 sentences, similar to Sukhbaatar et al. (2015).\nOn some tasks, the accuracy was not stable across multiple runs. This was particularly problematic on QA3, QA17, and QA18. To solve this, we repeated training 10 times using random initializations and evaluated the model that achieved the lowest validation set loss.\nText QA Results\nWe compare our best performing approach, DMN+, to two state of the art question answering architectures: the end to end memory network (E2E) (Sukhbaatar et al., 2015) and the neural reasoner framework (NR) (Peng et al., 2015). Neither approach use supporting facts for training.\nThe end-to-end memory network is a form of memory network (Weston et al., 2015b) tested on both textual question answering and language modeling. The model features both explicit memory and a recurrent attention mechanism. We select the model from the paper that achieves the lowest mean error over the bAbI-10k dataset. This model utilizes positional encoding for input, RNN-style tied weights for the episode module, and a ReLU non-linearity for the\nmemory update component.\nThe neural reasoner framework is an end-to-end trainable model which features a deep architecture for logical reasoning and an interaction-pooling mechanism for allowing interaction over multiple facts. While the neural reasoner framework was only tested on QA17 and QA19, these were two of the most challenging question types at the time.\nIn Table 2 we compare the accuracy of these question answering architectures, both as mean error and error on individual tasks. The DMN+ model reduces mean error by 1.4% compared to the the end-to-end memory network, achieving a new state of the art for the bAbI-10k dataset.\nOne notable deficiency in our model is that of QA16: Basic Induction. In Sukhbaatar et al. (2015), an untied model using only summation for memory updates was able to achieve a near perfect error rate of 0.4. When the memory update was replaced with a linear layer with ReLU activation, the end-to-end memory network’s overall mean error decreased but the error for QA16 rose sharply. Our model experiences the same difficulties, suggesting that the more complex memory update component may prevent convergence on certain simpler tasks.\nThe neural reasoner model outperforms both the DMN and end-to-end memory network on QA17: Positional Reasoning. This is likely as the positional reasoning task only involves minimal supervision - two sentences for input, yes/no answers for supervision, and only 5,812 unique examples after removing duplicates from the initial 10,000\ntraining examples. Peng et al. (2015) add an auxiliary task of reconstructing both the original sentences and question from their representations. This auxiliary task likely improves performance by preventing overfitting."
    }, {
      "heading" : "6.3. Comparison to state of the art using VQA",
      "text" : "For the VQA dataset, each question is answered by multiple people and the answers may not be the same, the generated answers are evaluated using human consensus. For each predicted answer ai for the ith question with target answer set T i, the accuracy of VQA: AccV QA = 1 N ∑N i=1min( ∑ t∈Ti 1(ai==t)\n3 , 1) where 1(·) is the indicator function. Simply put, the answer ai is only 100% accurate if at least 3 people provide that exact answer.\nTraining Details We use the Adam optimizer (Kingma & Ba, 2014) with a learning rate of 0.003 and batch size of 100. Training runs for up to 256 epochs with early stopping if the validation loss has not improved in the last 10 epochs. For weight initialization, we sampled from a random uniform distribution with range [−0.08, 0.08]. Both the word embedding and hidden layers were vectors of size d = 512. We apply dropout on the initial image output from the VGG convolutional neural network (Simonyan & Zisserman, 2014) as well as the input to the answer module, keeping input with probability p = 0.5.\nResults and Analysis\nThe VQA dataset is composed of three question domains: Yes/No, Number, and Other. This enables us to analyze the performance of the models on various tasks that require different reasoning abilities.\nThe comparison models are separated into two broad\nclasses: those that utilize a full connected image feature for classification and those that perform reasoning over multiple small image patches. Only the SAN and DMN approach use small image patches, while the rest use the fully-connected whole image feature approach.\nHere, we show the quantitative and qualitative results in Table 3 and Fig. 6, respectively. The images in Fig. 6 illustrate how the attention gate gti selectively activates over relevant portions of the image according to the query. In Table 3, our method outperforms baseline and other state-of-the-art methods across all question domains (All) in both test-dev and test-std, and especially for Other questions, achieves a wide margin compared to the other architectures, which is likely as the small image patches allow for finely detailed reasoning over the image.\nHowever, the granularity offered by small image patches does not always offer an advantage. The Number questions may be not solvable for both the SAN and DMN architectures, potentially as counting objects is not a simple task when an object crosses image patch boundaries."
    }, {
      "heading" : "7. Conclusion",
      "text" : "We have proposed new modules for the DMN framework to achieve strong results without supervision of supporting facts. These improvements include the input fusion layer to allow interactions between input facts and a novel attention based GRU that allows for logical reasoning over ordered inputs. Our resulting model obtains state of the art results on both the VQA dataset and the bAbI-10k text question-answering dataset, proving the framework can be generalized across input domains."
    } ],
    "references" : [ {
      "title" : "Learning to Compose Neural Networks for Question Answering",
      "author" : [ "J. Andreas", "M. Rohrbach", "T. Darrell", "D. Klein" ],
      "venue" : "arXiv preprint arXiv:1601.01705,",
      "citeRegEx" : "Andreas et al\\.,? \\Q2016\\E",
      "shortCiteRegEx" : "Andreas et al\\.",
      "year" : 2016
    }, {
      "title" : "VQA: Visual Question Answering",
      "author" : [ "S. Antol", "A. Agrawal", "J. Lu", "M. Mitchell", "D. Batra", "C.L. Zitnick", "D. Parikh" ],
      "venue" : "arXiv preprint arXiv:1505.00468,",
      "citeRegEx" : "Antol et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Antol et al\\.",
      "year" : 2015
    }, {
      "title" : "Neural machine translation by jointly learning to align and translate",
      "author" : [ "D. Bahdanau", "K. Cho", "Y. Bengio" ],
      "venue" : "In ICLR,",
      "citeRegEx" : "Bahdanau et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Bahdanau et al\\.",
      "year" : 2015
    }, {
      "title" : "Joint Learning of Words and Meaning Representations for Open-Text",
      "author" : [ "A. Bordes", "X. Glorot", "J. Weston", "Y. Bengio" ],
      "venue" : "Semantic Parsing. AISTATS,",
      "citeRegEx" : "Bordes et al\\.,? \\Q2012\\E",
      "shortCiteRegEx" : "Bordes et al\\.",
      "year" : 2012
    }, {
      "title" : "Learning a recurrent visual representation for image caption generation",
      "author" : [ "X. Chen", "C.L. Zitnick" ],
      "venue" : "arXiv preprint arXiv:1411.5654,",
      "citeRegEx" : "Chen and Zitnick,? \\Q2014\\E",
      "shortCiteRegEx" : "Chen and Zitnick",
      "year" : 2014
    }, {
      "title" : "Learning Phrase Representations using RNN Encoder-Decoder for Statistical Machine Translation",
      "author" : [ "K. Cho", "B. van Merrienboer", "C. Gulcehre", "D. Bahdanau", "F. Bougares", "H. Schwenk", "Y. Bengio" ],
      "venue" : "In EMNLP,",
      "citeRegEx" : "Cho et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Cho et al\\.",
      "year" : 2014
    }, {
      "title" : "Empirical evaluation of gated recurrent neural networks on sequence modeling",
      "author" : [ "J. Chung", "C. Gulcehre", "K. Cho", "Y. Bengio" ],
      "venue" : "arXiv preprint arXiv:1412.3555,",
      "citeRegEx" : "Chung et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Chung et al\\.",
      "year" : 2014
    }, {
      "title" : "From captions to visual concepts and back",
      "author" : [ "H. Fang", "S. Gupta", "F. Iandola", "R. Srivastava", "L. Deng", "P. Dollar", "J. Gao", "X. He", "M. Mitchell", "J. Platt" ],
      "venue" : "In CVPR,",
      "citeRegEx" : "Fang et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Fang et al\\.",
      "year" : 2015
    }, {
      "title" : "A Visual Turing Test for Computer Vision Systems",
      "author" : [ "D. Geman", "S. Geman", "N. Hallonquist", "L. Younes" ],
      "venue" : "In PNAS,",
      "citeRegEx" : "Geman et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Geman et al\\.",
      "year" : 2014
    }, {
      "title" : "A Neural Network for Factoid Question Answering over Paragraphs",
      "author" : [ "M. Iyyer", "J. Boyd-Graber", "L. Claudino", "R. Socher", "H. Daumé III" ],
      "venue" : "In EMNLP,",
      "citeRegEx" : "Iyyer et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Iyyer et al\\.",
      "year" : 2014
    }, {
      "title" : "Inferring algorithmic patterns with stack-augmented recurrent nets",
      "author" : [ "A. Joulin", "T. Mikolov" ],
      "venue" : "In NIPS,",
      "citeRegEx" : "Joulin and Mikolov,? \\Q2015\\E",
      "shortCiteRegEx" : "Joulin and Mikolov",
      "year" : 2015
    }, {
      "title" : "Deep Visual-Semantic Alignments for Generating Image Descriptions",
      "author" : [ "A. Karpathy", "L. Fei-Fei" ],
      "venue" : "In CVPR,",
      "citeRegEx" : "Karpathy and Fei.Fei,? \\Q2015\\E",
      "shortCiteRegEx" : "Karpathy and Fei.Fei",
      "year" : 2015
    }, {
      "title" : "Adam: A method for stochastic optimization",
      "author" : [ "Kingma", "Diederik", "Ba", "Jimmy" ],
      "venue" : "arXiv preprint arXiv:1412.6980,",
      "citeRegEx" : "Kingma et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Kingma et al\\.",
      "year" : 2014
    }, {
      "title" : "Imagenet classification with deep convolutional neural networks",
      "author" : [ "A. Krizhevsky", "I. Sutskever", "G.E. Hinton" ],
      "venue" : "In NIPS,",
      "citeRegEx" : "Krizhevsky et al\\.,? \\Q2012\\E",
      "shortCiteRegEx" : "Krizhevsky et al\\.",
      "year" : 2012
    }, {
      "title" : "Baby talk: Understanding and generating image descriptions",
      "author" : [ "G. Kulkarni", "V. Premraj", "S. Dhar", "S. Li", "Y. Choi", "A.C. Berg", "T.L. Berg" ],
      "venue" : "In CVPR,",
      "citeRegEx" : "Kulkarni et al\\.,? \\Q2011\\E",
      "shortCiteRegEx" : "Kulkarni et al\\.",
      "year" : 2011
    }, {
      "title" : "Ask Me Anything: Dynamic Memory Networks for Natural Language Processing",
      "author" : [ "A. Kumar", "O. Irsoy", "P. Ondruska", "M. Iyyer", "J. Bradbury", "I. Gulrajani", "R. Socher" ],
      "venue" : "arXiv preprint arXiv:1506.07285,",
      "citeRegEx" : "Kumar et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Kumar et al\\.",
      "year" : 2015
    }, {
      "title" : "A Hierarchical Neural Autoencoder for Paragraphs and Documents",
      "author" : [ "J. Li", "M.T. Luong", "D. Jurafsky" ],
      "venue" : "arXiv preprint arXiv:1506.01057,",
      "citeRegEx" : "Li et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Li et al\\.",
      "year" : 2015
    }, {
      "title" : "Microsoft COCO: Common Objects in Context",
      "author" : [ "T.Y. Lin", "M. Maire", "S. Belongie", "J. Hays", "P. Perona", "D. Ramanan", "P. Dollár", "C.L. Zitnick" ],
      "venue" : null,
      "citeRegEx" : "Lin et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Lin et al\\.",
      "year" : 2014
    }, {
      "title" : "Effective approaches to attention-based neural machine translation",
      "author" : [ "M.T. Luong", "H. Pham", "C.D. Manning" ],
      "venue" : "In EMNLP,",
      "citeRegEx" : "Luong et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Luong et al\\.",
      "year" : 2015
    }, {
      "title" : "Learning to Answer Questions From Image Using Convolutional Neural Network",
      "author" : [ "L. Ma", "Z. Lu", "H. Li" ],
      "venue" : "arXiv preprint arXiv:1506.00333,",
      "citeRegEx" : "Ma et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Ma et al\\.",
      "year" : 2015
    }, {
      "title" : "A Multi-World Approach to Question Answering about Real-World Scenes based on Uncertain Input",
      "author" : [ "M. Malinowski", "M. Fritz" ],
      "venue" : "In NIPS,",
      "citeRegEx" : "Malinowski and Fritz,? \\Q2014\\E",
      "shortCiteRegEx" : "Malinowski and Fritz",
      "year" : 2014
    }, {
      "title" : "Ask your neurons: A neural-based approach to answering questions about images",
      "author" : [ "M. Malinowski", "M. Rohrbach", "M. Fritz" ],
      "venue" : "In ICCV,",
      "citeRegEx" : "Malinowski et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Malinowski et al\\.",
      "year" : 2015
    }, {
      "title" : "Image question answering using convolutional neural network with dynamic parameter prediction",
      "author" : [ "H. Noh", "P.H. Seo", "B. Han" ],
      "venue" : "arXiv preprint arXiv:1511.05756,",
      "citeRegEx" : "Noh et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Noh et al\\.",
      "year" : 2015
    }, {
      "title" : "Towards neural network-based reasoning",
      "author" : [ "B. Peng", "Z. Lu", "H. Li", "K. Wong" ],
      "venue" : "arXiv preprint arXiv:1508.05508,",
      "citeRegEx" : "Peng et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Peng et al\\.",
      "year" : 2015
    }, {
      "title" : "Very deep convolutional networks for large-scale image recognition",
      "author" : [ "K. Simonyan", "A. Zisserman" ],
      "venue" : "arXiv preprint arXiv:1409.1556,",
      "citeRegEx" : "Simonyan and Zisserman,? \\Q2014\\E",
      "shortCiteRegEx" : "Simonyan and Zisserman",
      "year" : 2014
    }, {
      "title" : "Reasoning With Neural Tensor Networks For Knowledge Base Completion",
      "author" : [ "R. Socher", "D. Chen", "C.D. Manning", "A.Y. Ng" ],
      "venue" : "In NIPS,",
      "citeRegEx" : "Socher et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Socher et al\\.",
      "year" : 2013
    }, {
      "title" : "Recursive deep models for semantic compositionality over a sentiment treebank",
      "author" : [ "R. Socher", "A. Perelygin", "J. Wu", "J. Chuang", "C. Manning", "A. Ng", "C. Potts" ],
      "venue" : "In EMNLP,",
      "citeRegEx" : "Socher et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Socher et al\\.",
      "year" : 2013
    }, {
      "title" : "Grounded compositional semantics for finding and describing images with sentences",
      "author" : [ "R. Socher", "A. Karpathy", "Q.V. Le", "C.D. Manning", "A.Y. Ng" ],
      "venue" : "In ACL,",
      "citeRegEx" : "Socher et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Socher et al\\.",
      "year" : 2014
    }, {
      "title" : "Deep Networks with Internal Selective Attention through Feedback Connections",
      "author" : [ "M.F. Stollenga", "J. Masci", "F. Gomez", "J. Schmidhuber" ],
      "venue" : "In NIPS,",
      "citeRegEx" : "Stollenga et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Stollenga et al\\.",
      "year" : 2014
    }, {
      "title" : "Towards ai-complete question answering: A set of prerequisite toy tasks",
      "author" : [ "J. Weston", "A. Bordes", "S. Chopra", "T. Mikolov" ],
      "venue" : "arXiv preprint arXiv:1502.05698,",
      "citeRegEx" : "Weston et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Weston et al\\.",
      "year" : 2015
    }, {
      "title" : "Ask Me Anything: Free-form Visual Question Answering Based on Knowledge from External Sources",
      "author" : [ "Q. Wu", "P. Wang", "C. Shen", "Hengel", "A. van den", "A. Dick" ],
      "venue" : "arXiv preprint arXiv:1511.06973,",
      "citeRegEx" : "Wu et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Wu et al\\.",
      "year" : 2015
    }, {
      "title" : "Show, attend and tell: Neural image caption generation with visual attention",
      "author" : [ "K. Xu", "J. Ba", "R. Kiros", "K. Cho", "A.C. Courville", "R. Salakhutdinov", "R.S. Zemel", "Y. Bengio" ],
      "venue" : "In ICML,",
      "citeRegEx" : "Xu et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Xu et al\\.",
      "year" : 2015
    }, {
      "title" : "Stacked attention networks for image question answering",
      "author" : [ "Z. Yang", "X. He", "J. Gao", "L. Deng", "A. Smola" ],
      "venue" : "arXiv preprint arXiv:1511.02274,",
      "citeRegEx" : "Yang et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Yang et al\\.",
      "year" : 2015
    }, {
      "title" : "Textrunner: Open information extraction on the web",
      "author" : [ "A. Yates", "M. Banko", "M. Broadhead", "M.J. Cafarella", "O. Etzioni", "S. Soderland" ],
      "venue" : "In HLT-NAACL (Demonstrations),",
      "citeRegEx" : "Yates et al\\.,? \\Q2007\\E",
      "shortCiteRegEx" : "Yates et al\\.",
      "year" : 2007
    }, {
      "title" : "Simple baseline for visual question answering",
      "author" : [ "B. Zhou", "Y. Tian", "S. Sukhbaatar", "A. Szlam", "R. Fergus" ],
      "venue" : "arXiv preprint arXiv:1512.02167,",
      "citeRegEx" : "Zhou et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Zhou et al\\.",
      "year" : 2015
    } ],
    "referenceMentions" : [ {
      "referenceID" : 13,
      "context" : "Neural network based methods have made tremendous progress in image and text classification (Krizhevsky et al., 2012; Socher et al., 2013b).",
      "startOffset" : 92,
      "endOffset" : 139
    }, {
      "referenceID" : 2,
      "context" : "Attention mechanisms have been successful components in both machine translation (Bahdanau et al., 2015; Luong et al., 2015) and image captioning models (Xu et al.",
      "startOffset" : 81,
      "endOffset" : 124
    }, {
      "referenceID" : 18,
      "context" : "Attention mechanisms have been successful components in both machine translation (Bahdanau et al., 2015; Luong et al., 2015) and image captioning models (Xu et al.",
      "startOffset" : 81,
      "endOffset" : 124
    }, {
      "referenceID" : 31,
      "context" : ", 2015) and image captioning models (Xu et al., 2015).",
      "startOffset" : 36,
      "endOffset" : 53
    }, {
      "referenceID" : 15,
      "context" : "The dynamic memory network (Kumar et al., 2015) (DMN) is one example of a neural network model that has both a memory component and an attention mechanism.",
      "startOffset" : 27,
      "endOffset" : 47
    }, {
      "referenceID" : 6,
      "context" : "For the memory, we propose a modification to gated recurrent units (GRU) (Chung et al., 2014).",
      "startOffset" : 73,
      "endOffset" : 93
    }, {
      "referenceID" : 15,
      "context" : "We begin by outlining the DMN for question answering and the modules as presented in Kumar et al. (2015).",
      "startOffset" : 85,
      "endOffset" : 105
    }, {
      "referenceID" : 15,
      "context" : "For text QA in Kumar et al. (2015), the module consists of a GRU over the input words.",
      "startOffset" : 15,
      "endOffset" : 35
    }, {
      "referenceID" : 1,
      "context" : "The final DMN+ model obtains the highest accuracy on the bAbI-10k dataset without supporting facts and the VQA dataset (Antol et al., 2015).",
      "startOffset" : 119,
      "endOffset" : 139
    }, {
      "referenceID" : 15,
      "context" : "In the DMN specified in Kumar et al. (2015), a single GRU is used to process all the words in the story, extracting sentence representations by storing the hidden states produced at the end of sentence markers.",
      "startOffset" : 24,
      "endOffset" : 44
    }, {
      "referenceID" : 15,
      "context" : "In the DMN specified in Kumar et al. (2015), a single GRU is used to process all the words in the story, extracting sentence representations by storing the hidden states produced at the end of sentence markers. The GRU also provides a temporal component by allowing a sentence to know the content of the sentences that came before them. Whilst this input module worked well for bAbI-1k with supporting facts, as reported in Kumar et al. (2015), it did not perform well on bAbI-10k without supporting facts (Sec.",
      "startOffset" : 24,
      "endOffset" : 444
    }, {
      "referenceID" : 16,
      "context" : "This resembles the hierarchical neural auto-encoder architecture of Li et al. (2015) and allows content interaction between sentences.",
      "startOffset" : 68,
      "endOffset" : 85
    }, {
      "referenceID" : 13,
      "context" : "Local region feature extraction: To extract features from the image, we use a convolutional neural network (Krizhevsky et al., 2012) based upon the VGG-19 model (Simonyan & Zisserman, 2014).",
      "startOffset" : 107,
      "endOffset" : 132
    }, {
      "referenceID" : 15,
      "context" : "The DMN implemented in Kumar et al. (2015) involved a more complex set of interactions within z, containing the additional terms [f ;mt−1; q; fW q; fW (b)mt−1].",
      "startOffset" : 23,
      "endOffset" : 43
    }, {
      "referenceID" : 23,
      "context" : "(2015) and Peng et al. (2015) we experiment with using a ReLU layer for the memory update, calculating the new episode memory state by",
      "startOffset" : 11,
      "endOffset" : 30
    }, {
      "referenceID" : 15,
      "context" : "In contrast to previous memory models with a variety of different functions for memory attention retrieval and representations, DMNs (Kumar et al., 2015) have shown that neural sequence models can be used for input representation, attention and response mechanisms.",
      "startOffset" : 133,
      "endOffset" : 153
    }, {
      "referenceID" : 28,
      "context" : "They can benefit image classification (Stollenga et al., 2014), generating captions for images (Xu et al.",
      "startOffset" : 38,
      "endOffset" : 62
    }, {
      "referenceID" : 31,
      "context" : ", 2014), generating captions for images (Xu et al., 2015), among others mentioned below, and machine translation (Cho et al.",
      "startOffset" : 40,
      "endOffset" : 57
    }, {
      "referenceID" : 5,
      "context" : ", 2015), among others mentioned below, and machine translation (Cho et al., 2014; Bahdanau et al., 2015; Luong et al., 2015).",
      "startOffset" : 63,
      "endOffset" : 124
    }, {
      "referenceID" : 2,
      "context" : ", 2015), among others mentioned below, and machine translation (Cho et al., 2014; Bahdanau et al., 2015; Luong et al., 2015).",
      "startOffset" : 63,
      "endOffset" : 124
    }, {
      "referenceID" : 18,
      "context" : ", 2015), among others mentioned below, and machine translation (Cho et al., 2014; Bahdanau et al., 2015; Luong et al., 2015).",
      "startOffset" : 63,
      "endOffset" : 124
    }, {
      "referenceID" : 33,
      "context" : "If the potential input is a large text corpus, QA becomes a combination of information retrieval and extraction (Yates et al., 2007).",
      "startOffset" : 112,
      "endOffset" : 132
    }, {
      "referenceID" : 3,
      "context" : "Neural approaches can include reasoning over knowledge bases, (Bordes et al., 2012; Socher et al., 2013a) or directly via sentences for trivia competitions (Iyyer et al.",
      "startOffset" : 62,
      "endOffset" : 105
    }, {
      "referenceID" : 9,
      "context" : ", 2013a) or directly via sentences for trivia competitions (Iyyer et al., 2014).",
      "startOffset" : 59,
      "endOffset" : 79
    }, {
      "referenceID" : 8,
      "context" : "While VQA datasets existed before they did not include openended, free-form questions about general images (Geman et al., 2014).",
      "startOffset" : 107,
      "endOffset" : 127
    }, {
      "referenceID" : 32,
      "context" : "The only VQA model which also has an attention component is the stacked attention network (Yang et al., 2015).",
      "startOffset" : 90,
      "endOffset" : 109
    }, {
      "referenceID" : 0,
      "context" : "The first large scale database with unconstrained questions about images was introduced by Antol et al. (2015). While VQA datasets existed before they did not include openended, free-form questions about general images (Geman et al.",
      "startOffset" : 91,
      "endOffset" : 111
    }, {
      "referenceID" : 0,
      "context" : "A model that also uses neural modules, albeit logically inspired ones, is that by Andreas et al. (2016) who evaluate on knowledgebase reasoning and visual question answering.",
      "startOffset" : 82,
      "endOffset" : 104
    }, {
      "referenceID" : 14,
      "context" : "Related to visual question answering is the task of describing images with sentences (Kulkarni et al., 2011).",
      "startOffset" : 85,
      "endOffset" : 108
    }, {
      "referenceID" : 7,
      "context" : "Shortly thereafter, recurrent neural networks were used to generate often novel sentences based on images (Karpathy & FeiFei, 2015; Chen & Zitnick, 2014; Fang et al., 2015; Xu et al., 2015).",
      "startOffset" : 106,
      "endOffset" : 189
    }, {
      "referenceID" : 31,
      "context" : "Shortly thereafter, recurrent neural networks were used to generate often novel sentences based on images (Karpathy & FeiFei, 2015; Chen & Zitnick, 2014; Fang et al., 2015; Xu et al., 2015).",
      "startOffset" : 106,
      "endOffset" : 189
    }, {
      "referenceID" : 13,
      "context" : "Related to visual question answering is the task of describing images with sentences (Kulkarni et al., 2011). Socher et al. (2014) used deep learning methods to map images and sentences into the same space in order to describe images with sentences and to find images that best visualize a sentence.",
      "startOffset" : 86,
      "endOffset" : 131
    }, {
      "referenceID" : 29,
      "context" : "For evaluating the DMN on textual question answering, we use bAbI-10k English (Weston et al., 2015a), a synthetic dataset which features 20 different tasks. Each example is composed of a set of facts, a question, the answer, and the supporting facts that lead to the answer. The dataset comes in two sizes, referring to the number of training examples each task has: bAbI-1k and bAbI-10k. The experiments in Sukhbaatar et al. (2015) found that their lowest error rates on the smaller bAbI-1k dataset were on average three times higher than on bAbI-10k.",
      "startOffset" : 79,
      "endOffset" : 433
    }, {
      "referenceID" : 21,
      "context" : "Following the previously defined experimental method, we exclude multiple word answers (Malinowski et al., 2015; Ma et al., 2015).",
      "startOffset" : 87,
      "endOffset" : 129
    }, {
      "referenceID" : 19,
      "context" : "Following the previously defined experimental method, we exclude multiple word answers (Malinowski et al., 2015; Ma et al., 2015).",
      "startOffset" : 87,
      "endOffset" : 129
    }, {
      "referenceID" : 17,
      "context" : "The Visual Question Answering (VQA) dataset was constructed using the Microsoft COCO dataset (Lin et al., 2014) which contained 123,287 training/validation images and 81,434 test images.",
      "startOffset" : 93,
      "endOffset" : 111
    }, {
      "referenceID" : 1,
      "context" : "The testing data was split into test-development, test-standard and testchallenge in Antol et al. (2015).",
      "startOffset" : 85,
      "endOffset" : 105
    }, {
      "referenceID" : 15,
      "context" : "The original DMN (ODMN) is the architecture presented in Kumar et al. (2015) without any modifications.",
      "startOffset" : 57,
      "endOffset" : 77
    }, {
      "referenceID" : 23,
      "context" : ", 2015) and the neural reasoner framework (NR) (Peng et al., 2015).",
      "startOffset" : 47,
      "endOffset" : 66
    }, {
      "referenceID" : 23,
      "context" : "NR = Neural Reasoner with original auxiliary task from Peng et al. (2015). DMN+ and E2E achieve an error of 0 on bAbI question sets (1,4,10,12,13,15,20).",
      "startOffset" : 55,
      "endOffset" : 74
    }, {
      "referenceID" : 0,
      "context" : "VQA numbers are from Antol et al. (2015); ACK Wu et al.",
      "startOffset" : 21,
      "endOffset" : 41
    }, {
      "referenceID" : 0,
      "context" : "VQA numbers are from Antol et al. (2015); ACK Wu et al. (2015); iBOWIMG -Zhou et al.",
      "startOffset" : 21,
      "endOffset" : 63
    }, {
      "referenceID" : 0,
      "context" : "VQA numbers are from Antol et al. (2015); ACK Wu et al. (2015); iBOWIMG -Zhou et al. (2015); DPPnet - Noh et al.",
      "startOffset" : 21,
      "endOffset" : 92
    }, {
      "referenceID" : 0,
      "context" : "VQA numbers are from Antol et al. (2015); ACK Wu et al. (2015); iBOWIMG -Zhou et al. (2015); DPPnet - Noh et al. (2015); D-NMN - Andreas et al.",
      "startOffset" : 21,
      "endOffset" : 120
    }, {
      "referenceID" : 0,
      "context" : "(2015); D-NMN - Andreas et al. (2016); SAN -Yang et al.",
      "startOffset" : 16,
      "endOffset" : 38
    }, {
      "referenceID" : 0,
      "context" : "(2015); D-NMN - Andreas et al. (2016); SAN -Yang et al. (2015)",
      "startOffset" : 16,
      "endOffset" : 63
    }, {
      "referenceID" : 23,
      "context" : "Peng et al. (2015) add an auxiliary task of reconstructing both the original sentences and question from their representations.",
      "startOffset" : 0,
      "endOffset" : 19
    } ],
    "year" : 2016,
    "abstractText" : "Neural network architectures with memory and attention mechanisms exhibit certain reasoning capabilities required for question answering. One such architecture, the dynamic memory network (DMN), obtained high accuracy on a variety of language tasks. However, it was not shown whether the architecture achieves strong results for question answering when supporting facts are not marked during training or whether it could be applied to other modalities such as images. Based on an analysis of the DMN, we propose several improvements to its memory and input modules. Together with these changes we introduce a novel input module for images in order to be able to answer visual questions. Our new DMN+ model improves the state of the art on both the Visual Question Answering dataset and the bAbI-10k text question-answering dataset without supporting fact supervision.",
    "creator" : "TeX"
  }
}