{
  "name" : "1603.04236.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Interactive Tools and Tasks for the Hebrew Bible: From Language Learning to Textual Criticism",
    "authors" : [ "Nicolai Winther-Nielsen" ],
    "emails" : [ "nwn@dbi.edu" ],
    "sections" : [ {
      "heading" : null,
      "text" : "1 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\nAncient texts can support intertextuality in different ways through digital tools for databases and for tasks that scholars and studentsdo, when they interactwith the texts in new ways. This contribution explores how the corpus of the Hebrew Bible created and maintained by the Eep Talstra Center for Bible and Computer has potential for redefining the way we learn from our ancient texts as modern knowledge workers. It first describes how the corpus was used for development of Bible Online Learner as a persuasive technologyto enhance language learning with, in and around a databasethat drivesinteractive tasks for learners.The achievements obtained through so far are very promising, and it can help us explore textual criticism as another target for interactive study of the Hebrew Biblethrough corpus-technology. Because textual criticism is an increasingly specialized area of research which depends on digital resources. The commercial solution from Logos Bible Software offers advanced scholarly resources from the German Bible Society as a model for how affluent Westernscholars can use technology for the Hebrew corpus. The achievements in corpus-driven learning and the potential of commercial resources can help us suggest new tasks in textual criticism based on online applications which use corpora for a new kind of textual corpus criticism. Some promising tools for text categorization, analysis of translation shifts and interpretation are recommended as potential models for the future. The main goal in the future must be more open global access for the new tools.\nKeywords Hebrew Bible; Corpus; ETCBC; language learning; Logos Bible software; textual criticism; Joshua\nINTRODUCTION Jane Hart in her 9th annual list of Top 100 Tools for Learning 2015 concludes from the response of more than two thousand top educators that again the list is “dominated by free online (social) tools” [http1]. In her analysis of these surveys, [Hart, 2014: 25]furthermore distills five key features profiling how high performing knowledge workers like to learn in flow, ongoing, on demand, socially and autonomously. This does not exactly match the traditional profile of scholars specializing in the study of ancients texts. Yet the modern university educating for the new global society, is no doubt also raising the professional bar for education and research in their Oriental or Biblical Studies departments, not least because these departments typically educate for specialized low-income jobs, and their candidates often take up jobs outside their narrow specialization in ancients texts. In this process of inevitable change for modern social learning, the creation of databases for the study of ancient texts like the Hebrew Bible can play a key pedagogical role. I will make a case for using corpora to train knowledge workers to use new tools for new tasks, and I will discuss this kind\n2 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\nof digital interaction for a corpus of the Hebrew Bible constructed and maintained by the Eep Talstra Center for Bible and Computer (ETCBC) at the VU University in Amsterdam.\n$My contribution supplements Van Peursen‟s description of the ETCBC…$$, but focuses on a special applied linguistic use of the ETCBC corpus, emphasizing its ability to foster intertextually and new skills, This contribution has three sections with different angles on the role of the intertextuality of ancient texts. In the first section, I describe how the ETCBC already functions as a tool for task-based training of crucial skills in language learning. The second section shifts to the challenge of textual criticism in a discussion of digital tools that are already now commercially available for interactive study and education based on the ETCBC. The third section endeavours to look at the challenge of interactivity for the future by proposing a new framework for what I will call a Textual Corpus Criticism (TCC), envisioning new tools and tasks for corpus-based studies of the Hebrew Bible.\nI INTERACTIVE TASKS IN BIBLE ONLINE LEARNER\nDigital media are rapidly expanding the pace and space of social interaction and self-directed learning, fundamentally changing practice and outcomes for Second Language Acquisition. As an example, the dissertation of [Marissa, 2013] shows how intertextuality can enhance literacy practice for Indonesian English language learners using Twitter. Unfortunately, this kind of intertextuality will not work for the one-directional information processing of ancient languages like Biblical Hebrew and texts like the Hebrew Bible, as social interaction is gone for good. Digital media can help students converse in Modern spoken Ivrith, cultivating vocabulary acquisition, but is a remix of modern language use and ancient text study based on an artificial intertextuality, missing the full authentic reality of the world of the ancient documents.\nAs a substitute for the missing communication partner who disappeared thousands of years ago, we can still learn from their texts, and [Flowerdew, 2012] shows the great potential of corpora for language learning. At the outset, this requires that the texts in the corpus are both teacher-effective and user-friendly. I will therefore first focus on two areas of the „Learning Object Rating Instrument‟ proposed by [Nesbit and Belfer. 2004: 148]: The corpus must be motivational, providing the “Ability to motivate and stimulate the interest or curiosity of an identified population of learners”. It must also afford interaction usability, supporting “Ease of navigation, predictability of the user interface and the quality of User Interface help features”. In the following, I will first describe various persuasive models designed to foster ability and motivation and then explain the design of a learner-friendly interface for the corpus, before I in a third and last sub-section provide global evidence for the successful operation of this system."
    }, {
      "heading" : "1.1 Models for Corpus-driven Persuasive learning",
      "text" : "When I joined the research-team of the ETCBC some 25 years ago, I soon discovered how effective it was in [Winther-Nielsen, 1995] to integrate a strong corpus-technology in analyses of the linguistics, discourse structure and interpretation of a book from the Hebrew Bible like Joshua. From 2003, I taught Biblical Hebrew and in collaboration with Dr Ulrik SandborgPetersen implemented an interactive quiz tool supporting training of all essential paradigms of Biblical Hebrew. 1 Observing how students acquired new skills for grammatical analysis of the tricky paradigms of the Hebrew verb, I began wondering how we could turn the entire corpus of the Hebrew Bible into an interactive task for the learner and increase the impressive\n1 Ulrik Sandborg-Petersen has now developed this project into a commercial quiz tool for not only Hebrew, but also New Testament Greek and modern Spanish, as well as soon also Latin, see [http2].\n3 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\nlearning results, which I had already observed from interactive training on paradigms and reported in [Winther-Nielsen, 2011]. This was made possible when we got a grant to explore the effect of persuasion for corpus-based learning in the EU project EuroPLOT 2010-2013. 2\nOur design for learning with, in and around a corpus was from the beginning based on the ideas developed for Persuasive Technology by [Fogg. 2003]. His theory provided an approach to a design with focus on a tool for training, a medium for simulation and a social actor presence. In my first implemented model, I sorted his seven functions for a toolaccording to whether they support ability or motivation and how effective oven seven functions are on a cline.. 3 The highest degree of motivation is reached when the technology simply offers suggestions at the right time. However, most learners first need to be enabled to perform simple tasks by (1) reduction of the complexity of a learning task. They may then proceed to a more persuasive enablement when the technology through the function (2) tunneling takes the user step-by-step through acquiring some skills intended by a teacher. However, a more persuasive enablement is that the technology through (3) tailoring can adapt to an individual learner‟s needs based on calculation of the goals and achievements of other learners. Similar for the motivational functions, which are again listed by Fogg‟s numbering of the seven functions: the crudest way is motivation through (7) conditioning like the rewards in a selfcorrective exam. A more persuasive motivation helps the teacher supervise learners through (6) surveillance, because they can the learning outcomes continuously. However, true internalized motivation can develop when learners through (5) self-monitoring can direct their own learning projects and define their own goals while they observe what they do and reflect on how to improv their performance. The ultimate ideal learning state is then reached in function (4) suggestion, when learners float around in a fine-tune learning environment which matches the right kind of enablement and motivation at each appropriate moment, providing the optimal scaffolding for all tasks and outcomes. 4\nIn all learning, it is crucial that students get instant response with corrective feedback. I therefore worked out a second model of instantfeedback for corpus-driven learning from [Laurillard, 2012: 60]who has set up a framework for learning from a practice environment. In this kind of system, the corpus and additional teaching can model the learning to be practiced, and the corpus also checks for errors made by learners and instantly can suggest corrections that need to be trained again. 5 Laurillard‟s model can integrate the social world into design for learning and it explains how learners engage with other learners in a plotted practice environment.\nThe third and latest unified model in [Winther-Nielsen 2014: 85-87] did not only introduce a model to explain the force of a persuasive learning technology, 6 but it more importantly also proposed a designfor flow in a RAMP-model, which handles the triggering mechanisms needed in a persuasive system. The goal in this proposal is to capture research on intrinsic motivation by Csikszentmihalyi, Deci, Ryan, Pink and other experts in educational\n2 See the results published by [Behringer and Sinclari, 2013].PLOT is an acronym for Persasive Learning Objects and Technologies; EuroPLOT was funded by the Education, Audiovisual and Culture Executive Agency (EACEA) of the European Commission through the Livelong Learning Program with grant #511633. 3 The seminal ideas were submitted by [Winther-Nielsen. MS] in 2012 for a special issue which unfortunately has not been published yet by 2016. This first model is also summarized in [Winther-Nielsen, 2014: 84-85]. 4 Suggestion is “the ultimate goal of any persuasive technology, at the peak of its persuasive force, the khairos”\n[Winther-Nielsen, 2014: 85]. 5 See [Winther-Nielsen, 2013a: 23-25] and [Gottschalk and Winther-Nielsen, 2013: 112-113]. 6 The distinction between the intended goal of the designer and the actual outcome is explained by [WintherNielsen, 2014: 83-84] through Speech Act Theory: “pedagogical content (pC) can fulfill an intended persuasive force (pF) under specific technological conditions. … the successful persuasive outcome (pO) … is foremost a matter of different kinds of contextual responses achieved by the persuasive event.”\n4 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\npsychology. The model combines relatedness, autonomy, mastery, and purpose, hence the acronyms RAMP. It is designed to bring learners into a perfect state of mind where they completely absorb into their learning activities, love their learning challenges which are not too hard, and forget about time and place. For the modern knowledge worker this means to learn through work-flow, ongoing, when they demand the learningand find it socially supportive, offering them a high degree of autonomy. 7\nAccordingly, the RAMP model starts with purpose as the crucial challenge for initial engagement and to some extent ti must come across as an invitation for each individual. 8 After commitment, [Winther-Nielsen, 2014: 87] envisions that the learning technology will generate the optimal persuasive flow by “gradually strengthening the autonomy and increasing the mastery towards full self-directed control and perfection.” Through appropriate instructional content and the right kind of ability support, the technology assists the learner in proceeding in the personally most desirable direction. The seven functions for tools in Persuasive Technology trigger at the right stage and place, creating flow through a learning experience that takes learners to some relationship defined for a social context. 9 In this sense,persuasive learning fuels enablement and motivation leading to mastery and autonomy, and offering social and professional relationships, and together this“gives us the triggers that can ramp-up persuasive learning” [ibid: 87].\nThis latest version of the model of persuasive corpus-driven learning also includes a model for different kinds of contexts, layered as ever expanding ellipses around the RAMP: the innermost ellipsis is the context of the database as a macro-learning-object which can be programmed to function as a corpus-driven motor for learning. Around this object are the learners with all their own personal learning projects and developers and learning designers trying to create spaces for self-directed learning. The learner‟s practice environment is framed by a third and broader context which is the educational environment, and this is where the purposes for engaging in learning is influenced by teachers and institutions. The fourth and widest kind of context is all the informal social learning going on in society, and the group performance described by [Hart, 2014]for the knowledge-worker at work.These factors define a very broad kind of intertextuality that play a role for the study of ancient texts, but they are fluid and not easy to pinpoint, because they are formed by the many roles of the Bible in church and society. These contexts form the four expanding spaces of learning objects, selfdirection of learners, institutional facilitation, and peer-collaboration in a social world that must be taken into account in the earning environment.\nIt may well be possible to refine these three persuasive models for interactivity around a database and come up with new explanations of how force, flow and context trigger persuasive learning. The social end our models have to be very open and flexible in order to be able to accommodate all modern and global contexts which we know now and which can evolve in the future.\n7 See [Hart, 2014:25]: (1) Knowledge worskers learn in the flow of work, not in classes or online courses of long duration. (2) They learn continuously, by informally reading, overhearing, and observing (this accounts for some 80-90 % of total learning). (3) They learn on demand, encountering information immediately. (4) They learn socially, working among peers (5) They learn autonomously, by self-directed, self-organised and self-managed choice and control. 8 In the opinion of [Winther-Nielsen, 2014: 87], the efficiency of a technology depends on “its ability to adapt to all learners and their cultures, even to those who are forced to use the technology or have to force themselves to do so”. 9 According to [Winther-Nielsen, 2014: 87] the ultimate goal is to “function in some social context of a class, group or online community, and ultimately help the learner to achieve a social position at work and in society.”\n5 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal"
    }, {
      "heading" : "1.2 The Learner-Friendly Corpus-interface in Bible Online Learner",
      "text" : "The models for interactive learning from an ancient text are strong, yet they will remain an empty explanation high claims for interactivity, if they are not implemented in a tool for learning from our ancient texts. Fortunately, we already have a well developed solution up and running and can illustrate our models in this tool.\nThe architecture of a tool for corpus-driven learning started with a project describedby [Tøndering, 2009]as the PC program Ezer Emdros Exercise Tool (3ET) for quizzing from the ETCBC corpus. While 3ET applied the idea of reusable and repurposable learning objects very well, it did not support motivation, and the program did not sell well. Fortunately, in the EU project we had the opportunity to redesign 3ET into a delivery of a persuasive PC program, PLOTLearner. In 2013, in the final phase of the EU project, but outside the funding of this project we then started to repurpose for the future. We developed an online version of the PC program because we realized that it is difficult to develop efficiently for different platforms, and apps are not useful for large amounts of learning content such as the Hebrew Bible. 10 The new online tool is called Bible Online Learner, or Bible OL, and it not only uses the same ETCBC database as SHEBANQ, but it is also interlinked with thissecond major tool. 11\nThe role of this database within the studies of the humanities has already been described by [Sandborg-Petersen, 2011], and the current research on this corpus is described $in the contribution by Wido van Peursen (infra)$$. In order to appreciate how the ancient text is handled in a digital tool, it is important to understand the distinction between a database and a corpus. Developers of tools will have to construct and use a linguistically annotated textdatabase as a system for storing and retrieving data and for querying the annotated data as described by [Sandborg-Petersen. 2011: 263], but this database only serves as a corpus when “its primary function is to be a research instrument.” The key to the new interactive way of learning from an ancient text is the ability to design for learning with, in and around this corpus through an interface which supports navigation through explorative inquiry and training in practice. To support learning in and with a corpus, the interface must emulate how learners explore the text for comprehension and then use it to train essential skills for language learning. Using the encoding and linguistic annotation of the ETCBC corpus. Bible OL therefore offers a choice between display of texts and selection of exercises. When learners are logged in with a Facebook or Google account, they will furthermore get access to statistics about the learning outcomes they have achieved so far.\nThe new way of language learning breaks away from the older Grammar-Translation Method which,as described in [Winther-Nielsen, MS],depended on the teacher introducing subjects to be memorized, then offered some practice drills in the best cases, and finally students were required to reproduce the teachers information in class or on tests. The new corpus-driven architecture is designed for a very different learning experience, implementing the principle of persuasive learning for continuous integration of inquiry and practice through seamless moves back and forth between displays and exercises.\n10\nPLOTLearner can still be downloaded in the format delivered to the EU project at [http3]. In early 2015 we updated the program with the new open access ETCBC database, but the PC program will not be developed any more, and instead all new development is invested in the online technology. 11\nThese open resources are accessible at [http4] and [http5]. Research on the database for almost four decades has since 2014 been licensed under a Creative Commons Attribution-NonCommercial 4.0 International License. The interlinking of the two interfaces means that students can click from the display of the corpus in one tool to a display of the same text in the other tool. Searches in SHEBANQ can be uploaded for learning practice in Bible OL.\n6 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\nThis redefines the source of learning, the role of the learner and the process of learning in three fundamentally new ways. First, the presentation of the content of the learning is moved from the teacher-defined lecture to the interactive corpus. The content of this corpus can be defined as a macro learning object in the sense that the database stores millions of potential learning objects that can be triggered through the interface. The essence of all instruction is to guide learners into interactive flow, by helping them to actively explore grammar through the corpus and to comprehend the categories of the grammar through the interface. For Hebrew words, the interface offers the choice to explore information on the forms used in the texts, lexical information, and morphology. For phrases and clauses it provides information on their structure and function as is illustrated by the text display in figure 1 which will later be explained in detail in figure 2. 12\nSecond, all active learning is directed by the learners‟ interests. This is a major contrast to the traditional study of Biblical Hebrew which often deprives students of a motivational curiosity because they first have to spend weeks on learning to read and they often only get to text and interpretation in a following term. In Bible OL, not only is the corpus content available in full displayto be explored at all levels, but new learners can also start with the text in transliteration to study the constituents of the phrases and clauses illustrated in figure 1. 13 Our\n12\nOther figures illustrating display and exercises are published in [Winther-Nielsen, 2014: 83].In the left-hand navigation pane, the learner can select display of word, phrase, clause and sentence level information. A righthand pop-up pane shows all content in the database when hovering the cursor over on a word. The design is responsive, so on smaller displays the grammar selection and navigation is above the text, while the database pop-up shows in a new window in front of the . 13\nTeachers subscribing to the Communicative Language Teaching Method often reject the use of transliteration and instead focus on speaking modern Hebrew detached from the ancient text. Our approach in contrast stress\n7 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\nreason for providing transliteration was not only to help linguists or laymen with no prior training in Hebrew to be able to read the texts of the Hebrew Bible, but first and foremost to support interesting learning activities for task-based language learning right from the start of engaging with the corpus. We are convinced that there is no stronger motivational force than the ability to wrestle with interpretationsof the Hebrew Bible from day one.\nThird, the most essential component in this new approach to corpus-driven learning is the continuous practice of the learners. Corrective feedback came sparse and late in the old translation method, and it is unreliable in an immersion method, but here the instant feedback from an authentic and authoritative source is the main formative process. Learners can practice forms and train skills for analysis as long they want, to the depth they want, and for the tasks they like. No language skill isacquired without extended training for months. During self-directed training learners can explore the text again and then continue their practice, or use some of the additional teaching material and then resume. Instant and reliable feedback motivates the learner to engage with text and then test and solidify new insights through practice. To support self-directed learning, PLOTLearner offered statistics which could be downloaded and emailed to the facilitator. The learner could also visualize their own progress on a graph which was projected on an image with a wonderful view into the mountains from Mount Sinai. A graph would then show the learning progress as a pathway into the mountains where the first alphabet was used by Semitic workers in the mines on the Sinai Peninsula some 3500 years ago. 14 This is now under development for Bible OL.\nThese three components, the corpus-driven flow, the learner-directed force and the task-based practice can be contextualized by the facilitator. Teachers, instructors or advanced students can scaffold the corpus with other kinds of learning objects like textbooks, pdf-documents or videos. The project uses Moodle, the World‟s largest open and free learning management system, to store learning objects from courses, but any system or web page can be used. The system can also automatically scaffold from a picture database for illustrating a virtual word around the text explored by the learner, if the metadata of the picture has references to the text under scrutiny. 15 The interface is therefore not only be learner-friendly, but also teachereffective, enabling facilitators to improve on their teaching and achieve more efficient outcomes. 16 We now know that one reason that this new technology is not taking on worldwide to a large degree is that many language teachers resist technology.The tool must therefore be able to persuade teachers that they gain from this new kind of textual interactivity, because they can adapt it to their true needs. Also, colleagues can joins us and contribute to development of new content as well as implement their own solutions.Especially Dr. Oliver Glanz from Andrews University has helped us improve on the glosses and provided labels for verb classes, so that Bible OL is currently the only tool in the world which can assist students in practicing irregular Hebrew verbs in the context of the biblical texts. In Madagascar, teachers are now using the system in rural areas without internet. In other countries, colleagues are working on translation of the interface into Spanish and Portugese, to improve on learning in their local language. These are just some examples of how our learning environment can help teachers join forces globally in order to develop a new kind of intertextuality for the learners of their own classrooms.\nauthentic text. We could provide sound files for the corpus, but we believe that providing a transliteration of the Hebrew text according to the reading of the text by Israeli speakers supports the development of pronunciation. 14\nSee the manual at [http7]as well as the short discussion in [Winther-Nielsen, 2013b: 58]. 15\nThe picture database was developed in EuroPLOT, see [http6] and the scaffolding environment described by\n[Winther-Nielsen, 2013a: 27-28). A new project will improve on the database and the scaffolded content. 16\nIn the view of [Winther-Nielsen, 2014: 90], the “tool is unique in supporting this almost unlimited repurposing\non any topic covered by one of the World‟s best databases for the Hebrew Bible”.\n8 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\nIn sum, Bible OL is a tool that invites learners to engage with the corpus, and it can be used long before they are able to read, parse and analyze the Hebrew texts and even before they attend a Hebrew class. Once they engage, Bible OL offers the force and flow for students to learn the language. The tool can also help teachers solve new tasks, and it can inspire learners to lifelong study of the Hebrew Bible for their professional lives. The interface in this way very well implementsa new persuasive modelfor interactive learning from corpora."
    }, {
      "heading" : "1.3 Tasks in the new Global Learning Environment",
      "text" : "Interactivity is not only a pedagogical model for a tool and a basic principle in our design for persuasive learning, but it is something that must happen in real life. In this sense, the success of any software and the models embedded in are just grand concepts at best, if they are not implemented and able to do the task envisioned by designers of learning.\nCountless different factors can slow down or even impede the successful implementation in use, and we have had to discover many unexpected obstacles. We are still at a small scale of implementation, but fortunately we are able to provide evidence for how the system works. The tasks supported by the interface are the basic tasks in any language classroom, such as acquiring skills for vocabulary learning, parsing of morphology and syntactic analysis of phrase, clause and text structure, As described in [Winther-Nielsen, MS]:\nThe interface offers a translation informant for displaying and checking of glosses to assist memorization of vocabulary in context. The strength of this feature is that glosses can be selected according to frequency of occurrence for exercises, and thus improve on text-driven vocabulary acquisition. As a typist helper, the interface will check the learner‟s writing, reading, and spelling skills. Typing Hebrew text helps learners observe the details in the foreign script and scrutinize the exact visual shape of the writing system. The most important function is the syntax visualization which shows the hierarchical layers of words, phrases, clauses and sentences in the text and then allows for practice of this knowledge.\nIn the EU project, we gathered and analyzed considerable quantitative and qualitative data from learners who tested PLOTLearner during prototyping and piloting of the tool in Denmark, Sweden and Madagascar as part of our agile development of an effective persuasive technology. The best data came out of the Lutheran Graduate School of Theology (SALT) in Fianarantsoa in Madagascar where PLOTLearner was implemented as a core learning technology in our effort to improve the education of the Hebrew Bible in the Malagassy Lutheran church. 17 After the EU project ended in 2013, we decided to move all repurposing of the technology and new projects into a newly founded Global Learning Initiative [http8],our goal is to implement open persuasive learning solutions all over the world, and especially in countries low on financial and technological resources, but with high demands for Biblical Studies. In this way, our learning technology is now being scaled-up after the EU project and carried on in a new project, Global Learning of Bible and Languages (GLOBAL), which in 2015-2017 is funded by Danmission which also funded the initial work in Madagascar. The goal of the new project is to disseminate the results obtained there and provide support for implementation of a similar project at a university in East Africa, for a start. A major goal of this project is to implement a similar solution for learning of New Testament Greek. 18\n17\nThese data are presented in [Winther-Nielsen, 2013b: 58-59], with further references to the evaluation reports\nwith all the details on the prototyping and piloting 2010-2013. 18\nClaus Tøndering had by late 2014 implemented the open source corpus of Nestle 1904, Dobson Glosses and syntactic analysis provided by Global Learning Initiative. Harold Kime offered his e-learning Moodle course for New Testament Greek and also offers to serve as facilitator online and overseas. Judith Gottschalk is the\n9 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\nAs part of this project, I taught a course at SALT in October 5-17 2015. The goal was to assist the local associate professor, Olivier Randrianjaka, in taking ownership of the project and the technology. I was asked to teach all 120 students in the mornings, and in the afternoons, I offered lab-sessions for advanced students, supervising their practice. This kind of full schedule worked well as a facilitation of learner-directed practice. All 120 students were introduced to my new guidelines for how to parse a Hebrew verb, but the level of the students‟knowledge of Hebrew and English varied enormously. Assisted by my Malagassy colleague, I used Bible OL to support collaborative learning through student discussions in groups, promoting fun and competition through persuasive learning. We practised the flipped classroom and had good results from turning learners into peer-instructors and teachers into facilitators. Corpus-generated exercises were projected on the wall of the lecture hall and were discussed in the groups and then commented on by students. This kind of co-teaching for interactivce learning is an advantage for supervision of corpus-driven learning for large groups of diverse learners in global settings. It promotes co-teaching and student-directed collaboration fostered by the corpus, and tasks delegated to the groups could be used for training of teaching assistants. 19 My vision is that learner groups are supervised by advanced students, but this kind of intertextuality requires a fundamental change of traditional education.\nEven more important are the statistics. My PhD student Judith Gottschalk for her dissertation is working on how we can collect statistical data on the learning outcomes. All practice results are logged as big data and can then be displayed in various ways in order to plot the performance of students and optimize learning experience. In [Gottschalk and WintherNielsen, 2013]we presented a pilot version of Learning Journey (LJ) which is now used for experiment and testing in agile development by Judith Gottschalk under supervision by Claus Tøndering. Table 1 shows what kind of information is available for a particular kind of exercise (Filename), performed at a certain time (Start at), and how long time it took in terms\nprimary researcher working on developing the corpus-based learning of New Testament Greek for Global Learning Initiative, and Jean de Dieu is responsible for Greek in Madagascar. 19\nVideos document the fun, motivation and ability for skill acquisition among students learning with little or no previous knowledge of Hebrew grammar. I expect that the learner-centered teaching approach will help many students to learn better, but a two week course cannot work miracles.\n10 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\nof duration in minutes:seconds (Duration(min:sec)). The information on how many seconds it took to produce a right answer (Seconds per right) is a very helpful indicator of the speed, and it goes without saying that it is also useful to see the exact number of correct answers (Correct) and mistakes (Wrong). We also experimented with accuracy and proficiency, but these numbers are less easy to use. 20 The table finally shows how a learner can perform the same exercise several times all over, and finally get it right. The proficiency is clearly highest when he gets all five questions right in only 41 seconds.\nTest October 15 2015 October 24 2015 - March 3 2016\nLJ allows the facilitator to monitor the progress of learners. Some of the best students volunteered to do a final competition as a test on October 15 2016 and they were asked to parse verbs for between 20 and 30 minutes. This competition gave very helpful results and was easy to arrange. The six best students scored results that would qualify them very well to become assistant teachers according to the data in table 2. One was exceptional, achieving a score of 6,4 seconds per right, five were excellent at 9-11 seconds per right and four were good at 12-15 seconds per right. I then checked the data for all learners from SALT four and half month later, measuring the persistence and progress between October 23 2015 and March 1 2016. The exceptional student (N01) had only practiced for 5 hours, and he was now only ranking third among all users in the world, measured according to total points. The second best (N07) had practiced only for an hour and was now way down at rank 24 among all students in the world. This was in contrast to the student who had rank 4 (N10). He had been away for part of the course, but had in the meantime practiced for 116 hours and now had jumped ahead to the second best rank among world students. The most surprising result, however, is that the person who was only number 10 in the test (N04), and clearly at the bottom, had used the intervening months very well and practiced for some 54 hours altogether, and he has went straight to the top as the best in the world. Table 1 therefore exemplifies the ability of corpus-driven technology to take a user all the way to the top, provided that he uses Bible Online Learner for extensive practice and become almost “fluent”\n20\nIn [Gottschalk, 2014: 17], the degree of automatization is measured as proficiency, calculated as “sum of right\nanswers / right answers per minute.” Accuracy is an attempt to measure to what extent some students will achieve a high speed, but also submit a very high number of wrong answers and this is calculated as “(sum of right answers + sum of wrong answers) / sum of wrong answers”, i.e. it measures the degree with which learners have responded correctly in comparison to right answers. Further experiment will show how much statistical data facilitators and learners need and especially how this can be visualized in a persuasive manner.\n11 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\nin his internalization of the corpus. In contrast, four other students who were in the lower half at the test did not practice much afterwards and they now rank lowerin comparison with other learners in the world.This system in fact allows not only learners, but also facilitators to direct the learners practice because all learning processes are plotted.\nLJ is still in a prototype version, but it is used by facilitators at[http9]. The developer and coordinator of LJ, Judith Gottschalk, will in 2016 reprogram Learning Journey and test it on learners of Greek and Hebrew.21Currently we are looking at how facilitators can use these data and how LJ could be optimized.All wrong answers are registered as error responses for inspection and analysis which can help facilitators improve their instruction of individuals and differentiate their teaching. Data like those harvested in Madagascar can help facilitators keep track of scores and plotthe outcomes of ongoing learner practice in class or online and they can measure results in relation to global outcomes. 22 Tests, user-interests and resources will determine how far a new corpus-based paradigm for datamining and interactivity can support individualized journeysenhancing performance and persuasion though a corpus.\nWe plan to offer this tool for many more global users, offering access to thousands of learners. We hope in this way to be able to build much better profiles of learners and to be able to predict persuasive force and flow from global data. As we go ahead, the tasks and the feedback by users hopefully will help us formulate even better models and improve the technology. Because Bible OL is completely without license restrictions of any kind, we hope that programmers will join us in designing better solutions in the years ahead, and more global learners will use the interface in their mother-tongue. We hope to build a global community of facilitators, and we will look for funding for new projects in Africa, Asia and Latin America."
    }, {
      "heading" : "II TOOLS FOR TEXTUAL CRITICISM",
      "text" : "From this vison of how facilitators directing learning driven by an open access database and learners actively engaged in inquiry and practice with, in and around the corpus I will now explore the tools for textual criticism as one of the crucial tasks in the study of texts from the world of the Ancient Middle East. Emmanuel Tov,a world expert on the textual criticism of the Hebrew Bible, has recently completely revised and expanded his textbook The TextCritical Use of the Septuagint in Biblical Research, now published in its third edition in 2015. He explains that a revision was warranted not only by new developments in the study of the Hebrew manuscripts from the Judean Dessert and a better understanding of the Greek translation, but also by “the computerized approach” [Tov, 2015: xi], the topic of the task under discussion.\nIf we had linguistically annotated open access corpora similar to the ETCBC for all resources for textual criticism, we would be able to support a new kind of textual criticism. $Wido van Peursen has already described what has been achieved in research on Syriac in Amsterdam and Leiden….. $$ . The goal here is to describe what tools learners need for specific tasks, and what resources are already now available, first in general, then for Hebrew manuscripts and finally for translations of the Hebrew Bible. I will discuss Logos as the scholarly software which currently offer the best information architecture and offer the widest range of 21The goals is for Judith Gottschalk to integrate LJ into Bible OL with menu points giving access to 1) International Ranking 2) Logbook 3) Learning Graph 4) Badges (personal communication in document for her doctoral dissertation). 22\nLJ is not (yet) a full-fledged intelligent tutoring system or machine-learning; for now we use the statistics for experiment and development. In the dissertation project, we plan for Judith Gottschalk to explore support for gamification and even collaboration.\n12 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\ntechnological support for learners studying the original languages, giving access to specialist resources in a user-friendly interface. This discussion will prepare for the discussion of corpora for textual criticism in the third and final section."
    }, {
      "heading" : "2.1 Resources for textual criticism",
      "text" : "Most students and teachers at our modern teaching university these days rarely get the primary training in philology and textual criticism which was required in the good old elitist university. Whether we like it or not, the modern curriculum must therefore teach and train students on textual criticism in a very different pedagogical and practical manner, if indeed the Biblical languages are still taught for the study of the Bible.At the core of my proposal for textual criticism is the conviction that not only is the availability of the resources crucial for the study of the ancient texts, but they can also fosterskills that will beneeded in the work places for our knowledge workers. Because textual criticism is not supported by Bible OL and SHEBANQ, the goal is to describe how open corpora can integrate with existing tools which are currently available for the study of other textual resources bearing on the Hebrew Bible.\nResources for textual criticism are still published primarily in the older way of commercial book-printing which is less interesting for Western students using digital media, primarily or solely, and are not within reach of global learners who cannot afford copyright material without donations. 23 The standard scholarly treatment on textual criticism by Emanuel Tov, the Textual Crticism of the Hebrew Bible,was first published in 1992, appeared in its is second version in 2001, and is now exist in its third revised and expanded edition as [Tov 2012]. This technical work will not work for our average students, and the Hebrew language and exegesis curriculum will need pedagogical introductions like the completely up-to-date revised versions of [Würthwein and Fischer, 2009/2014] or [Brotzman and Tully, 2016]. 24\nThere has been many projects in the past for textual criticism, but two projects currently seem to emerge for the future. 25 For the Textual History of the Bible (THB),the claim of [Lange, 2016: 1] is that it offers “several noticeable paradigm shifts in the field of text criticism”, chiefly because textual witnesses are now “studied as texts and traditions in their own right”, instead of as isolated variants. However, it also amply illustrates the problem with the increasing costs of commercial corpora which is bound to reduce their value even for students in the West. 26 The THB furthermore raises another issue because it takes for granted that there is a plurality of biblical texts. For this reason, scholars no longer attempt to reconstruct a “supposed biblical Urtext, but aim as much to reconstruct the entire textual histories of the biblical texts.” In this sense, the THB blurs the old distinction between Higher and Lower Textual Criticism, and textual criticism turns into a redaction history of the Hebrew Bible.\nThe second and apparently even much larger project, The Hebrew Bible: Critical Edition (HBCE) aims to produce an entirely new text of the Hebrew Bible based on modern scholarship with a critical text and extensive text-critical introduction and commentary is probably going to be even more inaccessible than the THB for the average student. 27\n23\nIn due time hopefully projects will offer open access to high-quality scholarly corpora online following the new\ntrend of copyright-free access to books and resources in the humanities. 24\nFor other introductions on textual criticism, see [Tov, 2015: 1-2], [Wolters, 1999: 19-20 n 1], and [Wegner,\n2006]. 25\nFor other projects and resources se [Tov, 2003], and for the use of computers in general, see [Tov, 2008]. 26\nBrill is setting the price for access to the online version at 2.700 Euro in 2015 prices, see the Brill site at\n[http10] 27\nThe project was the Oxford Hebrew Bible, and [Heidel, 2013] is the general editor of the critical Bible. Each book will be published in a separate volume, except for single volumesof Minor Prophets, Megillot, and EzraNehemiah. See further information at [http11]. The price of so many specialist volumes will be high.\n13 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\nBoth new projects illustrate two trends and challenges facing the student of textual criticism of tomorrow. The first problem is that these new online resources are not moving in the direction of open corpus-driven data, and in this sense we cannot expect learners to be able to use any of those online resources. A more important problem is that the paradigm shift to redactional criticism in the THB is a belief to be tested in terms a choice between diachronic and literary readings of the Hebrew Bible. It will be even more far-reaching when in years from now we get an entirely new hypothetical Urtext in the HBCE. These trends inevitable raise the question of the scholars‟ assumptions and approaches to the texts.\nThis is issue an important issue for the intertextuality of the ancient texts. If textual criticism turns into redactional criticism, the notion of a stable canonical corpus vanishes. How to solve this challenge will be one of the tasksthat needs to be addressed in a proposal for a new TCC, and it can only be meaningfully discussed as part of the wider discussion of exegesis and in concrete corpus-driven text-analysis which we will illustrate for Joshua in the end (section 3, sub-section 3)."
    }, {
      "heading" : "2.2 Tools for the study of Hebrew manuscripts",
      "text" : "Given the challenge of the costs of printed and even online resources, my main interest is to address the issues raised by [Tov, 2011] on the pros and cons of electronic tools. I will proceed in an eclectic manner, based on my own personal experience with digital resources for the PC. I have since 2003 been a dedicated user of Logos Bible Software, and especially resources published by the German Bible Society, and I leave it to others to extoll the merits of Accordance, Bible Works and other popular resources. 28 I will first address the resources for the study of the manuscripts in Hebrew which are the Hebrew Masoretic Text (MT), Dead Sea Scrolls (DSS), and Samaritan Pentateuch (SP).\nThe primary aim of textual criticism is to help learners work with the earliest fully extant manuscript of the Hebrew Bible, the Codex Leningradiensis from 1008 AD, which is available in the printed editions of the Biblia Hebraica Stuttgartensia (BHS) from 1977, and now printed in its fifth edition as [Elliger, Rudolph and Schenker, 1997]. Learners have open access to this texts in Bible Online Learner and SHEBANQ. Even if this edition is the sole scientific edition available, [Tov, 2011: 248] rejects its apparatus “as unsatisfactory for textcritical analysis since it provides far too little information and is much too subjective.” However, the printed scholarly BHS edition is not only a reliable reproduction of our primary Hebrew manuscript, but its critical apparatus does provide manageable information to get a student started in textual criticism without too many scholarly filters. The BHS gives access to the MT, so named after the Massoretes, or tradents, who studied, copied and presented us with the Hebrew text 500-1100 AD, and gave us our present text in Tiberian Hebrew. 29 Adolf Schenker initiated a new project for the German Bible Society in 2004, the Biblia Hebraica Quinta (BHQ), which will give access to earlier pre-Tiberian witnesses and include references to the Aleppo Codex where it survives, as well as the the Cambridge Add. Ms. 1753 and fragments from Qumran and the Judean Desert. Even this edition is rejected by Tov as “merely a selection of textual data” [ibid]. 30\nComputer-literate students have a helpful solution for getting access to the BHS thanks to the important contribution of the German Bible Society. From 2004 to 2012,it marketed three\n28\n[Tov, 2015: 35] lists products which are by now out of the market (SESB) or of marginal relevance (e.g. Gramcord and WordSearch); see further references on [ibid: 37] and his excursus on CATSS [ibid: 110-111]. For a review, see [htpp12]. 29\nHence Anstey (2006) more precisely establishes the phonology and grammar of Tiberian Hebrew. 30\nSeveral fascimille editions have been published, see [http13]. The goal is to complete the BHQ by 2020, one\nhundred years after the first edition was published by Rudolph Kittel, see [http14].\n14 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\nversions of Stuttgart Electronic Bible Study (SESB) which are introduced in [Hardmeier, Talstra and Salzman, 2009]. Logos Bible Software now offers some of the tools in a small product containing the indispensable critical apparatus of the SESB edition alongside the apparatus for the Greek New Testament UBS edition. 31 This interactive access to the study of the BHS with its text critical apparatus gives learners a viable alternative to the costs and inconveniences of printed editions. Students can also benefit from digital integration with other scholarly resources for textual criticism from Logos in a state of the art user interface which greatly enhances the intertextuality for the Hebrew Bible. Last, but not least, it uses the ETCBC database and therefore is a helpful expansion to learning and research through open access resources like Bible OL and SHEBANQ.\nThe challenge for the student of textual criticism is of course that not only do we not have the first manuscript of the original authors (the autographs), but the gap between the original compositions and the final editions may span up to two thousand years or more. Because our scholarly BHS/BHQ editions of the codices are from the tenth Century AD and later, our problem is how we bridge the gap back to the earlier and potentially more reliable evidence on the text, and how this evidence is accessible.\nThe task of textual criticism is initially to evaluate the reading variants that the experts have assembled and classified, but this evidence mostly confirms the dominance of the MT tradition from around 100 AD. The real challenge of textual criticism starts with the earlier Hebrew manuscript evidence emerging out of the Judean Desert from 250 BC to 135 AD, which were found primarily during the period 1947-1961. Among the DSS manuscripts were some 200 samples of the Hebrew Bible, and after some initial delay virtually all have been published by the mid-1990s. The standard study edition by [Martinez and Tigchelaar, 1998] is available for Logos, but not the translation and comments on the scrolls in [Abegg et al. 1999]. 32 The evidence from these finds varies greatly, and the early excitement over confirmation of the MT-text is long gone because some manuscripts confirm the MT, while others confirm the SP, or other ancient translations. The Hebrew text of the SP is in general considered to be a sectarian expansion in support of Samaritan theology, yet eight of the DSS scrolls supported these harmonizations. 33\nThis kind of evaluation of the Hebrew witnesses is a second task that must be integrated into a new TCC. The question is to what extent deviations in the Hebrew texts are evidence of revisions in earlier stages of the text, or whether alternative theories on the formation of the text would explain these data better."
    }, {
      "heading" : "2.3 Tools for the study of the translations",
      "text" : "For the study of the text of the Hebrew Bible we also rely on ancient translations of the Hebrew Bible, which are the Greek Septuagint (LXX), the Syriac Peshitta (S), the Latin Vulgate (V), and the Aramaic targum fragments (T).Studying an ancient text through the lenses of translations is an indirect approach which represents a kind of mediated textuality for ancient texts. Translations testify to the fact that the Hebrew Bible attains to a very special status as a canonical and holy text for the future and in very different cultures.\n31\nThe Core Bundle of the Stuttgart Scholarly Editions would be competitive if it not only offered the SESB 2.0 with Apparatus, WIVU Introduction and Constituency Trees, but also the Nestle Aland 28 with apparatus, but the latter is missing, see [http15]. In this case Logos‟ Academic Discount Programs minimizes the expenses for students at Western institutions, and outside the West only donations or subsidized resources work. providing a somewhat competitive solution for learners in Western societies 32\nFor references to the DJD series, see [Wolters, 1999: 20 n. 2] 33\nThe SP is reprinted in [von Gall, 1993] and now translated in [Tsedaka and Sullivan, 2013], and recently\ndiscussed by [Anderson and Giles, 2013], but it is not available in a Logos resource.\n15 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\nThe evidence from translations is very diverse, and the LXX is the really challenging version. The worst case is the Greek translation of the book of Jeremiah which is roughly one-seventh shorter than the MT. Furthermore, two fragmentary Hebrew DSS manuscripts, the 4QJer b,d , confirm the shorter text of the LXX against the MT, while other scrolls confirm details of the LXX. This fact of course pushes evidence from the LXX version to the forefront of textual criticism. As for resources, the standard study edition of [Ralf and Hanhart, 2005] is available in Logos, but not the English translation of [Pietersma and Wright, 2007]. There are almost limitless scholarly resources for the study of the LXX, 34 but the most important are the 24 volumes of the Göttingen Septuagint 1931-2004 which is available for Logos.35 It is also of great help that Logos has published Tov‟s The Parallel Aligned Hebrew-Aramaic and Greek Texts of Jewish Scripture (2003). This work is an interesting case for a resource that started as a database and never has been printed, but now is available as an integrated digital resource. Other later and less challenging evidence can be found in the Syriac and Latin translations as well as in the Aramaic paraphrases. 36\nThese translations defines a third task for a new TCC proposal: are translations free dynamic equivalent translations or do they testify to the transmission of a more original text, and how can we know?\nThis overview of essential digital resources in projects, manuscripts and translations only scratches the surface. Among thousands of resources learners with sufficient means will be able to use great scholarly tools in Logos for their education or research projects, and what is not easily accessible as software will probably also be out of reach as printed versions. The disadvantage of commercial programs is that they are not available for multiple use in contratst to printed editionswhich can be used by many students in libraries and retain their antiquarian value as a commodity. 37 Tov (2011) may have a point in his critique of the BHS/Q, but this is the only commercial tool for all platforms, for good and for worse. At least for any foreseeable future, commercial corpus-applications are bound to set the standard for our tools and they will determine the goals for open, globally accessible next generation tools for Biblical Studies."
    }, {
      "heading" : "3. TASKS FOR TEXTUAL CORPUS CRITICISM",
      "text" : "So far I have described the ideal of open global access to interactive corpus-driven learning as well as the intertextual value in commercial resources for textual criticism published by Logos. It is now possible to describe the tasks of textual criticism as a target of design for interactivity in next-generation corpus-technology for learning and research on our corpus of the Hebrew Bible. I will outline goals for a new TCC based on digital technology developed along the lines and principles implemented in Bible OL and SHEBANQ for the ETCBC corpus, but expanded for corpus-driven textual criticism.\n34\nSee most recently [Tov, 2015] for LXX lexica (p. 33-34), grammar(p. 34-35), translations (p. 35), editions (p.\n35-36) and concordances (107-108). 35\nSee the references to the publications at [http16]. It provides the most authoritative critical apparatuses to date and the volumes include evidence from contemporary Jewish and Christian sources. It was initiated by Ralf in the 1920s and has for the last decades been edited by scholars like John William Wever. 36\nScientific publication of the Peshitta has been ongoing for almost half a century (Romeny 1972-), but Logos also publishes S by the Peshitta Institute Leiden (2006). The Latin Vulgate is published as Weber and Gryson (2007) and also available for Logos. Finally, there are translations of the targums by McNamar et al (1987- 1997). Note that BHQ, LXX and V is included in the Stuttgart Scholarly Editions: Old and New Testament at [http17]. 37\nThe single user restriction is imposed by publishers; perhaps rental software at [http18] will be an option in\nsome pedagogical curricula.\n16 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\nThe Logos tools we have considered so far must set the standards for designers of new open learning software demanded for our next generation Biblical Studies, and in turn these tools may inspire software companies. The tasks set for the new tools for the next generation textual corpus criticism is how to handle Hebrew variants, Greek translations and the earlier editorial stages of the texts, and what kind of corpus-based technology these tasks calls for. Or to be more precise:\n1. Can variant readings bear on the formation of the Hebrew Bible? 2. How can a Greek translation prove a more original Hebrew text? 3. Should textual criticism be used for redaction criticism?"
    }, {
      "heading" : "3.1 Variant Readings in the Oral Transmission of Written Texts",
      "text" : "The first task for the learner using Bible OL, SHEBANQ, Logos or any other interactive application or software is to learn how to evaluate variant readings from other Hebrew codices or scrolls. If all variants are not equal, how do we tell which are, and do they have any bearing on the formation of earlier stages of the texts?\nOnce facilitators have introduced learners to the tools for textual criticism and the views expressed in the textbooks of the experts, they start the real task of learning to practice the tasks of textual criticism. This is often a very perplexing challenge and it is hard to decide between two or more different explanations. When presented with a shorter variant in a particular case, the learner has an informed choice between Shorter-is-Earlier or Less-isMore, and how can we know? 38\nIn this sense, textual criticism has to face a common trap pointed out by [Tov, 2012: 170] for Biblical scholarship that “too often, scholars take abstract assumptions and preconceived ideas unrelated to the Scripture texts as their point of departure.” 39 He assumes that the biblical books were written over many generations and underwent processes of revisions in the case of Joshua-Kings or different literary stages in the case of Jeremiah and Ezekiel [ibid: 166]. The final copy in his view is therefore probably preceded by literary crystallizations and this would allow for consecutive editions at the beginning. But even if earlier compositional stages could not be eradicated, he still believs that “the original text(s) remains an evasive entity that cannot be reconstructed” [167].\nThe challenge posed by such assumptions are addressed in Carr‟s recent study The formation of the Hebrew Bible (2011). His aim is to formulate a “methodological modest” form of transmission historywith full control and repeatability according to standard empirical procedures. 40 At the core of the proposal of [Carr, 2011: 65] is an endeavor to pay “more attention to the tendencies of individual manuscript traditions and the ideological-theological and lexico-grammatical dynamics of each given case.”The whole argument in Carr‟s new approach hangs on the evidence for his assumption that the scribes employed a writingsupported oral memorization in their transmission of the Hebrew texts. The best explanation\n38\nTo illustrate, [Carr, 2011: 70-71] as many others argue that the longer Hebrew text of Jeremiah, Samuel and the Proto-Samaritan Pentateuch must be later than the earlier variant texts in Hebrew and Greek. However, when Chronicles has minuses in comparison with Samuel and Kings, the shorter text is not earlier, but it used other and shorter sources different from Kings [77]. 39\n[Tov, 2012: 163] insists that scholars “cannot afford themselves the “luxury” of not having an opinion on the\noriginal text of the Hebrew Scriptures”. He first surveys two alternative models, but discharges the proposals of Kahle, Barthélemy and Goshen-Gottsten of multiple pristine texts at the beginning [163-165], and instead argues for “an original text or a series of determinative (original) texts” [165; cf 167-169]. 40\n[Carr, 2011: 36] rejects Biblical scholarship which tries to “reconstruct highly precise differentiations of potential precursor literary strata,” and instead of hypothetical dependencies and secondary additions he wants to “see in our various editions of Hebrew Scriptural texts the distillate of a transmission-historical process” shaped by memory and performance [ibid].\n17 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\nfor the variants in the Hebrew manuscripts is “a mix of oral and written dynamics” [17]. He develops a tripartite characterization of variants. The first two kinds are aural variants caused by mistakes in hearing or dictation and graphical variants involving the confusion of letters or the skipping of lines. The third category are memory variants caused “when a tradent modifies elements of text in the process of citing or otherwise reproducing it from memory, altering elements of the text, yet producing a meaningful whole” [ibid]. These variants are not garbled due to mistakes made by scribes in copying, but “good variants” in the sense that both variants makes sense in their individual contexts.\nCarr argues his case from Gilgagmesh, the Tempe Scroll, dual traditions and similar. The empirical evidence Carr brings up for these variants are variation of events in different order and different words [59-61]. They can involve word order shifts, semantic shifts involving lexical or synonymous variants, different designations for figures and grammatical changes in prepositions and minor particles, in short “[s]maller scale shifts in a single word, particle, or grammatical expression” [62]. He furthermore argues that shifts go in both directions and therefore are hardly evidence that one of the two texts was “systematically updated or otherwise revised a precursor” [ibid]. This empirical analysis of memory variants leads him to conclude that the transmission process was dominated by three broad tendencies: The trend toward expansion [65], particularly with additions in the beginning and at the end [66], usually elimination is restricted to contradictions [70]. The second trend was an abbreviation of parts of the tradition [88]. The third trend is harmonization or coordination, as he calls it [90].\nThis model has the potential to offer a far more empirical basis for a corpus-driven study of variants. Carr‟s point of departure is to a lesser degree unproven assumptions of hypothetical stages which are postulated in order to explain the growth of the tradition. 41 Be that as it may, [Dershowitz et al. 2015] discuss a computerized source criticism of Biblical texts which we suppose could be used for collecting evidence for memory variants rather than putative sources, utilizing cutting edge technologies in the field of computational linguistics. At SBL Atlanta in 2015, Joshua Berman and Moshe Koppel presented their Tiberias Project, a webbased tool for text categorization and authorship attribution of the Hebrew Scriptures. This tool is expected to be released for open access in the early Summer of 2016, and it will enable scholars to conduct their own experiments on text-categorization, using the ETCBC database. It remains to be seen through experiment whether this application can help us evaluate the sources and test the evidence for memory variants."
    }, {
      "heading" : "3.2 The Data from Analysis of Translation Shifts",
      "text" : "The next task for a TCC is to help students decide on how far a variant in the Greek translation is also a witness for a more original text in Hebrew. Do we just pick blindfolded or based on our prior assumptions or best guesses, or can we gain more solid ground for an evaluation of the value of translations?\nAgain Tov is our expert as well as our challenge, assuming that we can use the LXX as a tool in Biblical criticism. 42 According to[Tov, 2015: 236] the contribution of the LXX is clearly seen in the fact that what researchers used to see as scribal changes, glosses and\n41\n[Carr, 2011: 65).recommends the analysis of a “process that is betrayed by extensive verbatim agreement between traditions combined with occasional variation between expressions of similar or virtually identical semantic content.” 42\nSee [Tov, 2012: 37 n. 42, 38-39].He wants to combine Lagarde‟s Urtext theory and Kahle‟s “multiple\ntranslations” theory but then go beyond to formulate a theory of “multiple textual traditions” (p. 11).\n18 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\ninterpolations, are now interpreted as a part of the “presumed history of the biblical books and manuscripts”, attesting to different stages in the literary development of the books. 43\nThe challenge for a corpus-based approach is how to deal with retroversion of variants from Greek into Hebrew. Any difference from MT in a translation is not necessarily a variant, “because translators introduced many such details without relation to the Hebrew text before them” [ibid: 9]. The main criteria Tov uses in his attempt to reconstruct aHebrew Vorlageis whether the Greek text is evidence of a literal or a free translation 18] assuming that a literal translation is also a witness to a more faithful translation [19]. In this sense it is a matter of grasping an individual translator‟s technique in order to define what is literal [21]. 44\nA new technological solution has been presented by the promising young co-author of the new second edition of [Brotzman and Tully, 2016]. The dissertation by [Tully, 2012] on the Peshitta version of Hosea gives him the necessary first-hand expertise for developing a model which can distinguish textual variants from translation variants. To overcome the challenge of retroversion, Tully uses modern theory on translations shifts, and from these he deduces the operational norms of the translator and ultimately the translator‟s overall approach. Modern translation studies help him identify shifts as formal correspondences rather than deduce them from putative sources. When norms are identified through categorizations of consistent patterns, the analysis based on translation theory will work its way back from data to norms and then to shifts, and in this way provides an informed analysis of textual criticism.Tully has implemented this model in a program that reads the Hebrew and Greek texts and aligns them side by side. The recursion involved in his method allows the program to learn from previous solutions functioning as a substitution for the next case, but not as a presupposition for the analysis, and the program gradually accumulates all previous decisions in the end.\nTully‟s approach clearly defines the second task for a new TCC. Ideally, we will have a corpus of the LXX developed to the same scholarly level as the ETCBC database and then we use an application for semi-automated analysis of translation shifts which measures the correspondences and calculates regularities. Unfortunately, we are years away from an LXX produced to the high standards of the ETCBC. However, a true corpus approach based on data patterns will eventually provide a more solid ground than dubious presuppositions on growth of texts, and it should proceed case to case rather than from one theory to another."
    }, {
      "heading" : "3.3 The Task of Text-analysis and Joshua in the End",
      "text" : "The final task emerging from the survey of resources concerns the question whether textual criticism should be turned into redaction criticism or kept completely separate from the issue of redaction. How do we ultimately use this evidence in our interpretations of the Hebrew Bible?\nIn [Winther-Nielsen, 1995: 21], I worked with the ETCBC database for the entire book of Joshua. The evidence suggested to me that the MT text in general is uncorrupted, with only minor scribal errors, in contrast to the deviations in the LXX which “mostly contains abbreviations and simplifications of the MT.” Nevertheless, a number of scholars and most recently and rigorously Graeme Auld, have claimed that the LXX is superior to the MTof\n43\n[Tov, 2015: 12] assumes that there was one Greek translation behind most of the LXX, but it was “not long preserved in a pure form”. It split into several secondary textual traditions in four from the original to corrections and then a stabilization in 1-2 nd\nCE, but new textual groups emerging in Origenes and Lucian (p. 11-12). 44\n[Tov, 2015: 22-25] defines 5 criteria for literal renderings: α internal consistency. β the representation of constituents of Hebrew words by separate Greek equivalents. γ word-order δ quantative representation. ε. linguistic adequacy of lexical choices.\n19 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\nJoshua. 45 However, I not only rejected the replacement of the MT for the analysis of the literary structure of Joshua, but I also made the more fundamental claim for my discourse grammar that “it should not even attempt the common practice of reconstructing a more original text … prior to textual analysis” [ibid: 22]. 46 Only when a competent Greek scholar has done a functional discourse grammar of the LXX text of Joshua can we compare and evaluate whether the Hebrew text should be rejected as inferior.In the ensuing discussion, Auld‟s position has not met with much approval. 47 However, the dissertation of [den Braber, 2010] defends Auld‟s approach to Joshua along similar lines, even if she also endorses a grammatical analysis based on the ETCBC. 48 The price she pays is that there are no authentic data and only a community of faith which left “a tradition … embodied in subsequent revisions” [ibid: 236].\nWe have argued with Carr, that Biblical scholarship should work with documented trends in the transmission history of the text. I will therefore test the case Tov [2008] makes for a more original LXX text in Josh 24:30, 33. 49 The LXX has a longer text which adds information from Judges 2:6–10, 13; 3:7, 12, 14 and is used to reverse the order of Josh 24:29–31. Joshua is buried with flint knives imported from Joshua 5:2–3. After narrating the death of Joshua and Eleazar (24:33), the LXX 24:33b adds information from Judges 3:12, thus bypassing the two introductions in Judg 1:1-3:6, as well as Othniel who in the MT is the short the ideal role model for a judge. The LXX addition is translated back into Hebrew by [Tov, 2008: 49-50]: 50\nAnd it happened after these things that Eleazar son of Aaron, the high priest, died, and was buried in Gabaath of Phinees his son, which he gave him in Mount Ephraim. + On that day the sons of Israel took the ark of God and carried it around in their midst. (cf v. 33 and Judg 20:28) And\nPhinees served as priest in the place of Eleazar his father until he died, and he was interred in Gabaath, which was his town. (Cf v. 28.) And the sons of Israel departed each to their place and to their own city. (Cf. Judg. 2:6, 12-13; 3:12-14.) And the sons of Israel worshiped\nAstarte, and Ashtaroth, and the gods of nations around them. And the Lord delivered them into the hands of Eglon, the king of Moab and he dominated them eighteen years.\nThe themes of the framework were discussed in [Winther-Nielsen, 195: 293-294], but no\ndisplay like figure 2 was provided for these verses. In a new TCC, we would first exploit the\ntext-level information contained in the ETCBC corpus. We would notice, from codes like 477\nthat perfective wayyiqtol forms (conjunction (4**) and yiqtol (*7*) continues similar\n45\nSee the details in [Winther-Nielsen, 1995: 21 n. 32]: The main scholar in my discussion is Graeme Auld who believe that in some chapters the additions in the MT were as high as five times as many as additions in the LXX as well as Tov who assumes that the LXX has important additions in 16:10, 19:47, 21:42 and 24:30, 33 and concludes that there existed a shorter Vorlage of Joshua in the third or second Century BC 46\nI was building on [Rabe. 1990]who calls for a synchronic textual criticism, and especially [Rabe, 1992: 292] claims that we need to do our analysis on a verifiable existing text which is analysed as a material and literary unit, only removing scribal errors. 47\nSome scholars, e.g. [Carr, 2011: 74 n. 66] reject Auld‟s radical reconstruction that the late Book of Chronicles served as the basis for Joshua. Carr also rejects the assumption that Joshua 21 depends on 1 Chron 6:39-66 [ibid: 77-78 n. 71]. 48\nThe strongest critique of [den Braber, 2010: 185-187]is that a rhetorical description of interclausal relation cannot be carried out successfully, and implicitly she overlooks the division of labor between the structural descriptions by the computer and the further work on functional grammar and interclausal grammar rhetorical structure theory. 49\nFor discussion see [Nelson, 1997: 280–83], and especially [Butler, 2014: 335-336] who in discussion with\ncurrent literature in detail argues that LXX harmonizes the MT. 50\nIn the view of Tov [2008: 49], the beginning of Judges was missing in the Urtext, and such additions “point to the existence of a combined book of Joshua-Judges.” One DSS witness lumps the ark, the death of Eleazar, Joshua and the elders together with worship of Ashtaroth, thus indirectly confirming the Greek translation.\n20 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\nwayyiqtol forms (**7) in clause (1)-(3). In Josh 24:33 the code 427 would then indicate that\nthe conjunction (4**) is used before a qatal form (*2*) which continues the preceding wayyiqtol (**7), and in turn is continued by wayyiqtol (47*). 51 From this display it is clear\nthat the last three clauses in the MT are usual run-of-the-mill closure information in Hebrew.\nIn contrast, the LXXopens with a repetition ofwayhî ʔaḥᵃrê haddᵊvārîm hāʔēlleʰ from the\nHebrew of Josh 24:29 which is a superfluous repetition, and without parallel in the discourse\ntechniques for opening and closure segments in discourse in the Hebrew Bible. Furthermore,\nthe MT of Josh 24:33a works well as a final wrap-up of the person gallery in the book, simply\nnoting the death of the contemporary priest at from the time of Joshua. In contrast to this, the\nAstharoth gods in the Greek do not fit very well into the preceding account in Joshua after the\ncovenant renewal, nor have they been mentioned before. It would also be difficult to explain\nthe removal of the ideal judge Othniel with his family ties to Caleb. There is simply no need\nfor a surgery of the Hebrew text, while the Greek ending can be explained as memory variants\nfrom a translator. He even recalls from memory the puzzling presence of the ark in Judges 20.\nOn the background of this discussion, there are no sufficient reasons for inventing a new\nending for the book of Joshua form the Greek translation. By the end of the day, however, we\nwill have to consider each case of deviation, one at a time, while we wait for better tools like\nTiberias or for analysis of translation shifts. When put to the test, the argument that we need to\ndo a good discourse-pragmatic work on both the Hebrew manuscripts and on the Greek\ntranslation in my view still holds, especially when we allow for the evidence from memory\nvariants.\nFor a new TCC, the corpus-driven work enabled by the ETCBC database remains the most\nimportant model and corpus technology will be much more helpful for students that an\nartificial Urtext or a redaction historical replacement. I would personally not want to give up\nthe text of the Hebrew Bible on such fragile basis. However, corpus criticism and everything\n51\nOther sigla like Way0 indicates a wayyiqtol without explicit subject, while WayX indicates the form has a subject. WXQt indicates a qatal verb form with conjunction and subject. 10 is a relative clause, of the NmCl variety (nominal clause or verbless clause), while 12 is a relative clause with qatal.\n21 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\nelse boils down to a question of ultimate beliefs and the validity of the assumptions in our\nmethods.\nConclusion The intertexuality of an ancient text has been explored from three different perspectives.The point of departure for a new kind of persuasive intertextuality is the corpus created by the ETCBC and a presentation of our work since 2008 to develop a corpus-driven learning environment. In this case, intertextuality means directing one‟s personal learning project through a persuasive interface of linguistically annotated ancient text and using the force and flow of autonomy and mastery for accessing a socially relevant professional context. The review of this work gave me the opportunity to argue for extending this framework to a similar area of computer-assisted study of ancient texts. Selecting textual criticism as a related topic, I first looked at the advantages of using the commercially available Logos tools for teaching of textual criticism, and this kind of intertextuality is typical for using a superb, but more traditional information technology. My last move was to look at ways to envision a new kind of corpus-based textual criticism. I suggest that there is great potential in exploring memory variants in a new application for the ETCBC-database and that we need a tool for analysis of translation shifts for the Greek. In the end I looked at Joshua to explore how the corpus works in a discussion of pros and cons for a very different ending in the Greek translation of Joshua. This last kind of intertextuality is the closest we can come to the use of our advanced tools for the highly scholarly tasks.\nIn the end I conclude that new open and persuasive technology has potential to gradually find its way around the globe, supporting a new kind of textual corpus criticism of the Hebrew Bible as well as all other tasks on cultural history, interpretation, theology and education in the churches. Advanced modern commercial software like Logos offers first rate information architecture for a learner-friendly textual criticism integrating with many resources. However, this software system like any other system or print can only increase the gap between the rich students in the West and students in the Majority World who cannot afford textual criticism in print or digitally. Without open-minded donors or new publishing solutions, books at libraries will continue to be the only solution for a while. The future lies with developing application for corpora like the ETCBC and open them for global access, so that the shortage of resources doesnot determine theological education. Finally, we can only hope that similar tools are developed for Greek and Latin and theological works and archives past and present.\nReferences 1: editions and digital resources\nMT ElligerK., Rudolph W., and Schenker A. Biblia Hebraica Stuttgartensia.5 th edition. Deutsche Bibelgesellschaft\n(Stuttgart), 1997 (=BHS).\nLogos edition 2006:SESB 2.0 with Apparatus and WIVUIntroduction,prepared by Talstra E, Hardmeier C.and\nDeusche Bibelgesellschaft https://www.logos.com/resources/LLS_1.0.204/biblia-hebraica-stuttgartensiasesb-20-version\nBeck A.B and Freedman D, eds.The Leningrad codex: a facsimile edition. Eerdmans (Grand Rapids), 1998. DSS Martínez F. and Tigchelaar E. J. C. The Dead Sea Scrolls study edition vols. 1,2.Vol. I: 1Q1–4Q273, vol. II:\n4Q274–11Q31. Brill (Leiden), 1998\nLogos edition: https://www.logos.com/product/4241/the-dead-sea-scrolls-study-edition-vol-i-1q1-4q273-vol-ii-\n4q274-11q31\nAbegg M.G., Flint P.W. and UlrichE.The Dead Sea Scrolls Bible. English translation and composite of biblical\nscrolls at Qumran. T & T Clark (Edinburgh), 1999.\nLXX\n22 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\nRahlfs A. and Hanhart R. Septuaginta id est Vetus Testamentum graece iuxta LXX interpretes. Deutsche\nBibelgesellschaft (Stuttgart), 2005.\nLogos edition 2006: https://www.logos.com/product/55086/stuttgart-scholarly-editions-old-and-new-\ntestament#011\nWever J. W. Göttingen Septuagint Vandenhoeck & Ruprecht (Göttingen),1931-2006. Logos edition: https://www.logos.com/product/4951/gottingen-septuagint Tov E.The Parallel Aligned Hebrew-Aramaic and Greek Texts of Jewish Scripture.\nLogos edition2003: https://www.logos.com/product/2209/the-parallel-aligned-hebrew-aramaic-andgreek-texts-of-jewish-scripture.\nPietersma A. and Wright B. A new English translation of the Septuagint and other Greek translations\ntraditionally included under that title. Oxford University Press (Oxford), 2007.\nSP von Gall A. ed.Der hebräische Pentateuch der Samaritaner; Berlin 1966 (photomechanical reprint of Gießen\n1914–1918), reprint. Walther de Gruyter (Berlin),1993.\nTsedaka B. and Sullivan S. eds.The Israelite Samaritan Version of the Torah: First English Translation\nCompared with the Masoretic Version. Eerdmans (Grand Rapids),2013.\nT\nMcNamara M. ed.The Aramaic Bible Series, 22 volumes. Liturgical Press (Collegeville, Mn.), 1987-1997.\nLogos edition: https://www.logos.com/product/31386/the-aramaic-bible-series S Romeny R.B. ter Haar.Monographs of the Peshitta Institute Leiden, 22 volumes. Brill (Leiden), 1972-. Peshitta Institute Leiden. Logos edition2006:https://www.logos.com/product/4642/the-leiden-peshitta V Weber R. and Gryson R., eds.Biblia Sacra iuxta vulgatam versionem. 5 th edition. Deutsche Bibelgesellschaft\n(Stuttgart), 2007.\nLogos version (editio minor, or 4 th edition from 1994): https://www.logos.com/product/55086/stuttgart-\nscholarly-editions-old-and-new-testament#014\nBibliography 2: references\nAnderson R. and Giles T. The Samaritan Pentateuch: an introduction to its origin, history, and significance for\nbiblical studies. Resources for Biblical study, 72.Society of Biblical Literature (Atlanta, Ga.).2013.\nAnstey M. Towards a Functional Discourse Analysis of Tiberian Hebrew. AddColour Digital Pty Ltd (Canberra,\nAustralia), 2006.\nBehringer R. and SinclairG., ed. 2013. IWEPLET 2013 Proceedings. EuroPLOT\n(http://www.iweplet2013.eu/http://www.lulu.com/shop/reinhold-behringer-and-georgina-sinclair/ iweplet2013-proceedings/paperback/product-21189131.html).\nBraber, M. E. J. den.Built from Many Stones: An analysis of N. Winther-Nielsen and A. G. Auld on Joshua with Focus on Joshua 5:1-6:26, ACEBT Supplement Series 8. 2VM (Amsterdam),2010. Butler, T. C. Joshua 13-24. 2nd edition Word Biblical commentary, 7B. Zondervan (Grand Rapids), 2014. Carr, D. (2011) The formation of the Hebrew Bible : a new reconstruction.Oxford: Oxford University Press. BrotzmanE. R. and TullyE. J.Old Testament Textual Criticism. Baker (Grand Rapids), 2016\nhttp://bakerpublishinggroup.com/books/old-testament-textual-criticism-2nd-edition/143703\nFlowerdew L. Corpora and Language Education. Palgrave MacMillan (New York and Houndmills,\nBasingstoke). 2012\nFogg B.J.Persuasive Technology. Using Computers to Change What We Think and Do. Morgan Kaufmann(San\nFrancisco), 2003.\nGottschalk J. and Winther-Nielsen N. Persuasive skill development: On computational surveillance strategies for\nmodeling learning statistics with PLOTLearner. InBehringer R. and SinclairG., ed. 2013. IWEPLET 2013 Proceedings., 2013;109-116.\nGottschalk J., Tøndering C., Andriamisarisoa M., and Winther-Nielsen N. Sustainable corpus-driven computer-\nassisted language learning in Madagascar. MS.\nGottschalk, J.Corpus-driven vocabulary learning! - On the design, implementation and evaluation of persuasive\ntools for computer-assisted vocabulary learning using Role and Reference Grammar. Information Science, Master, Aalborg University, 2014.\nHardmeier C., TalstraE. and SalzmannB.SESB: Stuttgart Electronic Study Bible 3.0.Deutsche Bibelgesellschaft\n(Stuttgart), 2009.\n23 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\nHart J.Social Learning Handbook– 2014.With a chapter by Harold Jarche. Centre for Learning & Performance\nTechnologies (London). 2014.\nHendel R. The Oxford Hebrew Bible: Its Aims and a Response to Criticisms. Hebrew Bible and Ancient\nIsrael2013;2:63-99.\nhttp1 http://c4lpt.co.uk/directory/top-100-tools http2 http://paradigmsmasterpro.com/ http3 http://eplot.3bmoodle.dk/. http4 http://shebanq.ancient-data.org/ http5 http://bibleol.3bmoodle.dk/ http6 http://resources.3bmoodle.dk/img.php) http7 http://www.ezer.dk/3ETusersguide/PL-2.0.1/en/statistics.php http8 http://global-learning.org http9 http://statdb.3bmoodle.dk http10 http://www.brill.com/products/online-resources/textual-history-bible-online http11 http://ohb.berkeley.edu/ http12 https://abramkj.com/2012/10/08/bhs-the-gottingen-septuagint-and-other-critical-editions-a-basic-\norientation-to-what-they-are/\nhttp13 https://www.academic-bible.com/en/home/current-projects/biblia-hebraica-quinta-bhq/ http14 https://www.dbg.de/navi/themen/jubilaeum-2012/200-jahre-deutsche-bibelgesellschaft.html) http15 https://www.logos.com/product/55088/stuttgart-scholarly-editions-core-bundle http16 http://adw-goe.de/forschung/forschungsprojekte-akademienprogramm/septuaginta-\nunternehmen/veroeffentlichungen/.\nhttp17 https://www.logos.com/product/55086/stuttgart-scholarly-editions-old-and-new-testament http18 https://www.logos.com/rentals http19 http://bibleol.3bmoodle.dk/text/show_text/ETCBC4-translit/Josua/24/29/33 Hutton J. Optimality in the \"Grammars\" of Ancient Translations. Journal of Hebrew Scriptures.2015; 15(7). LangeA. Textual History of the Bible: Preview.Brill (Leiden),2016[http://www.brill.com/sites/default/files/\npreview.pdf]\nLaurillard D.. Teaching as a Design Science: Building Pedagogical Patterns for Learning and Technology.\nRoutledge (London), 2012.\nMarissa D. N. Intertextuality, identity works, and second language literacy development in the digital media: An\nethnographic case study of two Indonesian college students' literacy practice on Twitter. PhD University of Maryland, College Park,2013.\nNelson R. Joshua: a commentary. The Old Testament library. Westminster John Knox Press (Louisville, Ky),\n1997.\nNesbit J. C. and Belfer K. Collaborative evaluation of learning objects. In McGreal R., ed.Online education\nusing learning objects RoutledgeFalmer (New York), 2004;138–153.\nRabe N. Zur synchron definierten alttestamentliche Textkritik. Biblische Notizen.1990;52:64-97 – .On the Scope of Old Testament Textual Criticism. InCIB Maredsous.Actes du troisième Colloque\nInternational Bible Et Informatique: Interpretation, Hermeneutique, Competence Informatique.Tübingen, 26-30. August 1991. Champion-Slatkine (Paris and Genève), 1992.\nSandborg-Petersen U. On Biblical Hebrew and Computer Science: Inspiration, Models, Tools, and Cross-\nFertilization. In van Peursen W. T. and Dyk J. W., eds.Tradition and Innovation in Biblical Interpretation. Studies Presented to Professor Eep Talstra on the Occasion of his Sixty-Fifth Birthday. Brill(Leiden), 2011;261-276.\nTovE. Electronic Resources Relevant to the Textual Criticism of Hebrew Scripture.TC: A Journal of Biblical\nTextual Criticism, 2003;8[http://rosetta.reltech.org/TC/v08/Tov2003.html]\n– .The Use of Computers in Biblical Research. In idem,Hebrew Bible, Greek Bible and Qumran – Collected\nEssays, Mohr Siebeck(Tübingen),2008; 228-246.\n– .Computer-assisted Tools for Textual Crticism. In van Peursen W. T. and Dyk J. W., eds.Tradition and\nInnovation in Biblical Interpretation. Studies Presented to Professor Eep Talstra on the Occasion of his Sixty-Fifth Birthday. Brill(Leiden), 2011;245-260.\n– .Textual Criticism of the Hebrew Bible. 3rd Revised and Expand edition. Fortress Press and Van Gorcum\n(Mineapolis and Assen), 2012.\n– .The Text-Critical Use of the Septuagint in Biblical Research. 3 rd Edition, Completely Revised and Expanded.\nEisenbraus (Winona Lake, In), 2015.\nTully E. J. The Translation and Translator of the Peshitta of Hosea. Brill (Leiden), 2012 – . A Model for distinguishing Between Textual Variansts and Translation shifts in Old Testament Textual\nCriticism. Paper at Evangelical Theological Society Annual Meeting in Atlanta, 2015\nTøndering C. 3ET – An Automatic Tool for Grammar Training. Hiphil, 2009;6\n24 Journal of Data Mining and Digital Humanities http://jdmdh.episciences.org ISSN 2416-5999, an open-access journal\nWegner P. D. A student's guide to textual criticism of the Bible : its history, methods and results. IVP Academic\n(Downers Grove, Ill.), 2006.\nWinther-Nielsen N.A Functional Discourse Grammar of Joshua. A computer-assisted Rhetorical Structure\nAnalysis. (CBOTS 40). Almquist and Wiksell (Uppsala), 1995.\n– .Persuasive Hebrew exercises: The wit of technology enhanced language learning. In van Peursen W. T. and\nDyk J. W., eds.Tradition and Innovation in Biblical Interpretation. Studies Presented to Professor Eep Talstra on the Occasion of his Sixty-Fifth Birthday. Brill(Leiden), 2011; 277-298\n– . Stones on Display in Joshua 6: The Linguistic Tree-Constructor as a „PLOT‟ Tool. Journal of Hebrew\nScriptures, 2012. 12(17):1-29[http://www.jhsonline.org/JHS/Articles/article_179.pdf]\n– . PLOTLearner as Persuasive Technology: Tool, Simulation and Virtual World for Language Learning.\nInBehringer R. and SinclairG., ed. 2013. IWEPLET 2013 Proceedings., 2013a;21-28\n– . PLOTLearner for a Corpus of the Hebrew Bible: The Case for Repurposing in Language Learning,\nInBehringer R. and SinclairG., ed. 2013. IWEPLET 2013 Proceedings., 2013b; 53-60.\n– .PLOTLearner‟s Persuasive Achievement: Force, Flow and Context in Technology for Language Learning\nfrom the Hebrew Bible.HIPHIL Novum, 2014; 1(2): 78-94 [http://hiphil.org/index.php/hiphil/article/view/57],\n– . The Corpus as Tutor: Data-driven Persuasive Language Learning. MS, submitted 2012.\nWolters A, The Text of the Old Testament. InBaker D.The face of Old Testament studies: A survey of\ncontemporary approaches. Apollos (Leicester),1999;19-37\nWürthweinE. and Fischer A. AThe Text of the Old Testament: An Introduction to Biblia Hebraica, Third edition\ntranslated by Erroll F. Rhodes. Eerdmans (Grand Rapids), 2014."
    } ],
    "references" : [ {
      "title" : "The Samaritan Pentateuch: an introduction to its origin, history, and significance for biblical studies. Resources for Biblical study, 72.Society of Biblical Literature (Atlanta, Ga.).2013",
      "author" : [ "R. Anderson", "T. Giles" ],
      "venue" : null,
      "citeRegEx" : "Anderson and Giles,? \\Q2013\\E",
      "shortCiteRegEx" : "Anderson and Giles",
      "year" : 2013
    }, {
      "title" : "Towards a Functional Discourse Analysis of Tiberian Hebrew",
      "author" : [ "M. Anstey" ],
      "venue" : "AddColour Digital Pty Ltd (Canberra,",
      "citeRegEx" : "Anstey,? \\Q2006\\E",
      "shortCiteRegEx" : "Anstey",
      "year" : 2006
    }, {
      "title" : "den.Built from Many Stones: An analysis of N. Winther-Nielsen and A",
      "author" : [ "M.E.J. Braber" ],
      "venue" : "G. Auld on Joshua with Focus on Joshua",
      "citeRegEx" : "Braber,? \\Q2010\\E",
      "shortCiteRegEx" : "Braber",
      "year" : 2010
    }, {
      "title" : "2nd edition Word Biblical commentary, 7B",
      "author" : [ "Butler", "T.C. Joshua" ],
      "venue" : "Zondervan (Grand Rapids),",
      "citeRegEx" : "Butler and 13.24.,? \\Q2014\\E",
      "shortCiteRegEx" : "Butler and 13.24.",
      "year" : 2014
    }, {
      "title" : "The formation of the Hebrew Bible : a new reconstruction.Oxford",
      "author" : [ "D. Carr" ],
      "venue" : null,
      "citeRegEx" : "Carr,? \\Q2011\\E",
      "shortCiteRegEx" : "Carr",
      "year" : 2011
    }, {
      "title" : "J.Old Testament Textual Criticism",
      "author" : [ "BrotzmanE. R", "TullyE" ],
      "venue" : "Baker (Grand Rapids),",
      "citeRegEx" : "R. and TullyE.,? \\Q2016\\E",
      "shortCiteRegEx" : "R. and TullyE.",
      "year" : 2016
    }, {
      "title" : "Corpora and Language Education. Palgrave MacMillan (New York and Houndmills, Basingstoke)",
      "author" : [ "L. Flowerdew" ],
      "venue" : null,
      "citeRegEx" : "Flowerdew,? \\Q2012\\E",
      "shortCiteRegEx" : "Flowerdew",
      "year" : 2012
    }, {
      "title" : "Persuasive skill development: On computational surveillance strategies for modeling learning statistics with PLOTLearner",
      "author" : [ "J. Gottschalk", "N. Winther-Nielsen" ],
      "venue" : "InBehringer R. and SinclairG.,",
      "citeRegEx" : "Gottschalk and Winther.Nielsen,? \\Q2013\\E",
      "shortCiteRegEx" : "Gottschalk and Winther.Nielsen",
      "year" : 2013
    }, {
      "title" : "On the design, implementation and evaluation of persuasive tools for computer-assisted vocabulary learning using Role and Reference Grammar",
      "author" : [ "Gottschalk", "J.Corpus-driven" ],
      "venue" : null,
      "citeRegEx" : "Gottschalk and J.Corpus.driven,? \\Q2014\\E",
      "shortCiteRegEx" : "Gottschalk and J.Corpus.driven",
      "year" : 2014
    }, {
      "title" : "TalstraE. and SalzmannB.SESB: Stuttgart Electronic Study Bible 3.0.Deutsche Bibelgesellschaft (Stuttgart)",
      "author" : [ "C. Hardmeier" ],
      "venue" : null,
      "citeRegEx" : "Hardmeier,? \\Q2009\\E",
      "shortCiteRegEx" : "Hardmeier",
      "year" : 2009
    }, {
      "title" : "Learning Handbook– 2014.With a chapter by Harold Jarche",
      "author" : [ "Hart J.Social" ],
      "venue" : "Centre for Learning & Performance",
      "citeRegEx" : "J.Social,? \\Q2014\\E",
      "shortCiteRegEx" : "J.Social",
      "year" : 2014
    }, {
      "title" : "Optimality in the \"Grammars\" of Ancient Translations",
      "author" : [ "J. Hutton" ],
      "venue" : "Journal of Hebrew Scriptures.2015; 15(7). LangeA. Textual History of the Bible: Preview.Brill",
      "citeRegEx" : "Hutton,? \\Q2016\\E",
      "shortCiteRegEx" : "Hutton",
      "year" : 2016
    }, {
      "title" : "Intertextuality, identity works, and second language literacy development in the digital media",
      "author" : [ "Routledge (London", "2012. Marissa D. N" ],
      "venue" : null,
      "citeRegEx" : ".London. and N.,? \\Q2012\\E",
      "shortCiteRegEx" : ".London. and N.",
      "year" : 2012
    }, {
      "title" : "Joshua: a commentary",
      "author" : [ "Maryland", "College Park", "2013. Nelson R" ],
      "venue" : null,
      "citeRegEx" : "Maryland et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Maryland et al\\.",
      "year" : 2013
    }, {
      "title" : "Electronic Resources Relevant to the Textual Criticism of Hebrew Scripture.TC: A Journal of Biblical",
      "author" : [ "261-276. TovE" ],
      "venue" : null,
      "citeRegEx" : "2011 and TovE.,? \\Q2011\\E",
      "shortCiteRegEx" : "2011 and TovE.",
      "year" : 2011
    }, {
      "title" : "Computer-assisted Tools for Textual Crticism",
      "author" : [ "Essays", "Mohr" ],
      "venue" : "In van Peursen W. T. and Dyk J. W.,",
      "citeRegEx" : "Essays and Mohr,? \\Q2008\\E",
      "shortCiteRegEx" : "Essays and Mohr",
      "year" : 2008
    }, {
      "title" : "A student's guide to textual criticism of the Bible : its history, methods and results",
      "author" : [ "D. Wegner P" ],
      "venue" : "IVP Academic (Downers Grove, Ill.),",
      "citeRegEx" : "P.,? \\Q2006\\E",
      "shortCiteRegEx" : "P.",
      "year" : 2006
    }, {
      "title" : "eds.Tradition and Innovation in Biblical Interpretation",
      "author" : [ "W. Dyk J" ],
      "venue" : "Studies Presented to Professor Eep Talstra on the Occasion of his Sixty-Fifth Birthday. Brill(Leiden),",
      "citeRegEx" : "J.,? \\Q2011\\E",
      "shortCiteRegEx" : "J.",
      "year" : 2011
    }, {
      "title" : "The Text of the Old Testament. InBaker D.The face of Old Testament studies: A survey of contemporary approaches",
      "author" : [ "A Wolters" ],
      "venue" : "Apollos",
      "citeRegEx" : "Wolters,? \\Q1999\\E",
      "shortCiteRegEx" : "Wolters",
      "year" : 1999
    }, {
      "title" : "AThe Text of the Old Testament: An Introduction to Biblia Hebraica, Third edition translated by Erroll F. Rhodes",
      "author" : [ "WürthweinE", "Fischer A" ],
      "venue" : "Eerdmans (Grand Rapids),",
      "citeRegEx" : "WürthweinE. and A.,? \\Q2014\\E",
      "shortCiteRegEx" : "WürthweinE. and A.",
      "year" : 2014
    } ],
    "referenceMentions" : [ {
      "referenceID" : 6,
      "context" : "As a substitute for the missing communication partner who disappeared thousands of years ago, we can still learn from their texts, and [Flowerdew, 2012] shows the great potential of corpora for language learning.",
      "startOffset" : 135,
      "endOffset" : 152
    }, {
      "referenceID" : 1,
      "context" : "29 Hence Anstey (2006) more precisely establishes the phonology and grammar of Tiberian Hebrew.",
      "startOffset" : 9,
      "endOffset" : 23
    }, {
      "referenceID" : 0,
      "context" : "discussed by [Anderson and Giles, 2013], but it is not available in a Logos resource.",
      "startOffset" : 13,
      "endOffset" : 39
    }, {
      "referenceID" : 16,
      "context" : "As for resources, the standard study edition of [Ralf and Hanhart, 2005] is available in Logos, but not the English translation of [Pietersma and Wright, 2007]. There are almost limitless scholarly resources for the study of the LXX, 34 but the most important are the 24 volumes of the Göttingen Septuagint 1931-2004 which is available for Logos. It is also of great help that Logos has published Tov‟s The Parallel Aligned Hebrew-Aramaic and Greek Texts of Jewish Scripture (2003). This work is an interesting case for a resource that started as a database and never has been printed, but now is available as an integrated digital resource.",
      "startOffset" : 132,
      "endOffset" : 482
    }, {
      "referenceID" : 16,
      "context" : "36 Scientific publication of the Peshitta has been ongoing for almost half a century (Romeny 1972-), but Logos also publishes S by the Peshitta Institute Leiden (2006). The Latin Vulgate is published as Weber and Gryson",
      "startOffset" : 33,
      "endOffset" : 168
    }, {
      "referenceID" : 4,
      "context" : "The challenge posed by such assumptions are addressed in Carr‟s recent study The formation of the Hebrew Bible (2011). His aim is to formulate a “methodological modest” form of transmission historywith full control and repeatability according to standard empirical procedures.",
      "startOffset" : 57,
      "endOffset" : 118
    }, {
      "referenceID" : 4,
      "context" : "We have argued with Carr, that Biblical scholarship should work with documented trends in the transmission history of the text. I will therefore test the case Tov [2008] makes for a more original LXX text in Josh 24:30, 33.",
      "startOffset" : 20,
      "endOffset" : 170
    } ],
    "year" : 2016,
    "abstractText" : "Ancient texts can support intertextuality in different ways through digital tools for databases and for tasks that scholars and studentsdo, when they interactwith the texts in new ways. This contribution explores how the corpus of the Hebrew Bible created and maintained by the Eep Talstra Center for Bible and Computer has potential for redefining the way we learn from our ancient texts as modern knowledge workers. It first describes how the corpus was used for development of Bible Online Learner as a persuasive technologyto enhance language learning with, in and around a databasethat drivesinteractive tasks for learners.The achievements obtained through so far are very promising, and it can help us explore textual criticism as another target for interactive study of the Hebrew Biblethrough corpus-technology. Because textual criticism is an increasingly specialized area of research which depends on digital resources. The commercial solution from Logos Bible Software offers advanced scholarly resources from the German Bible Society as a model for how affluent Westernscholars can use technology for the Hebrew corpus. The achievements in corpus-driven learning and the potential of commercial resources can help us suggest new tasks in textual criticism based on online applications which use corpora for a new kind of textual corpus criticism. Some promising tools for text categorization, analysis of translation shifts and interpretation are recommended as potential models for the future. The main goal in the future must be more open global access for the new tools.",
    "creator" : "Microsoft® Office Word 2007"
  }
}