{
  "name" : "1605.08889.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Beyond Majority Voting: Generating Evaluation Scales using Item Response Theory",
    "authors" : [ "John Lalor", "Hao Wu", "Hong Yu" ],
    "emails" : [ "lalor@cs.umass.edu", "hao.wu.5@bc.edu", "hong.yu@umassmed.edu" ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "Advances in artificial intelligence have made it possible to compare computer performance directly with human intelligence (Campbell et al., 2002; Ferrucci et al., 2010; Silver et al., 2016). In most cases, a common approach to evaluating performance is to compare the system against an unseen gold-standard dataset (GS items). GS items are often annotated by humans and confirmed through majority voting. Accuracy, recall, precision and F1 scores are commonly used to evaluate an NLP application. The assumptions with these evaluation metrics are that GS items have equal weight for evaluating performance. However item difficulty may vary. Some GS items may be harder than the others, with most if not all NLP systems answering incorrectly. The opposite may also be\ntrue: some GS items may be so easy that every NLP system answers them correctly, providing no meaningful information about the performance of a given NLP system. Therefore, two NLP systems with equal acc./R/P/F1 scores may not be equal in their ability to compare with human intelligence.\nIn this paper we introduce Item Response Theory (IRT) from psychometrics and demonstrate its application to NLP. IRT is a theory of evaluation for characterizing test items and estimating human ability from their performance on such tests. IRT assumes that individual test questions (referred to as “items” in IRT) have unique characteristics such as difficulty and discriminating power. These characteristics can be identified by fitting a model based on human response patterns to the test items. An IRT model takes a set of items and determines how well those items act as a measuring scale for human ability. The model is fit to a large number of human responses for a set of items to estimate characteristics of these items. Some items are found to fit the model poorly or are otherwise not suitable in a measurement scale and are excluded from the final set. The underlying assumptions of IRT are that the probability of a correct answer is associated with both item characteristics and individual ability, and therefore a collection of items of varying characteristics can determine an individual’s ability overall.\nThis paper applies the methodology of IRT to generating an evaluation gold standard for an NLP task. IRT can be used to learn more about datasets for NLP tasks, and can generate evaluation sets to measure system performance. With an IRT model, item characteristics such as difficulty and discrimination power are estimated and a set of items are identified as a test set that can effectively measure the ability of an NLP system. We apply IRT to a Recognizing Textual Entailment (RTE) dataset, where each text-hypothesis-label triple from the\nar X\niv :1\n60 5.\n08 88\n9v 1\n[ cs\n.C L\n] 2\n8 M\nay 2\n01 6\ntraining examples is considered an “item.” Our motivation is to build an intelligent model that can be used to scale performance on the given task. With IRT we can identify items that can be used as an evaluation set to appropriately measure ability in relation to the overall population as scored by an IRT model. This process can serve two purposes: (i) to test whether individual items are appropriate for a test set that measures an individual’s ability for a particular task, and (ii) the resulting set of items can be administered as an evaluation set in its own right, to measure the ability of future subjects (or NLP models) for the same task. These evaluation sets can measure the ability of an NLP system without relying on a large number of testing examples.\nOur contributions are as follows: First, we introduce the concept of Item Response Theory and describe its benefits generally. Second, we apply IRT to an RTE dataset and show that evaluation sets consisting of a small number of sampled items can provide meaningful information about the RTE task. The IRT models show that different items exhibit varying degrees of difficulty and discrimination power. By fitting our IRT model for RTE, we found that 31% of the sampled examples from GSRTE were not included in GSIRT as they fit the model poorly or are otherwise not adequate to be on an evaluation scale. Finally, we show that reliance on majority voting as quality control may not be sufficient to ensure that generated labels can be relied upon. An evaluation of the human responses gathered to fit our IRT model showed that 28% of selected GSRTE items did not have supermajority agreement from our annotators. This demonstrates the high degree of uncertainty in selecting the correct label, which is indicative of the difficulty of the RTE task. Moving forward, we hope to use IRT to introduce new scales for the evaluation of NLP methods for a variety of tasks."
    }, {
      "heading" : "2 Background and Related Work",
      "text" : ""
    }, {
      "heading" : "2.1 Item Response Theory",
      "text" : "IRT is one of the most widely used methodologies in scale construction and evaluation. It is typically used to analyze human responses (graded as right or wrong) to a set of questions (called “items”). IRT employs a statistical model that links these responses to the person’s ability and the items’ characteristics (Baker and Kim, 2004). This statistical model usually assumes: (a) People differ from\neach other on an unobserved latent trait dimension of interest (called “ability” or “factor”); (b) The probability of correctly answering an item is a function of the person’s ability. This function is called item characteristic curve (ICC) and involves item characteristics as parameters; (c) Responses to different items are independent of each other for a given ability level of the person (“local independence assumption”); (d) Responses from different individuals are independent of each other.\nTwo popular IRT models are the two- (2PL) and three-parameter logistic (3PL) models. In a 3PL model, the ICC follows a logistic function with a non-zero lower asymptote as follows:\npij(θj) = ci + 1− ci\n1 + e−ai(θj−bi) (1)\nIn this equation, pij is the probability for person j to answer item i correctly and θj is the ability of individual j, assumed to be a random effect with a standard normal distribution. There are also three item parameters: the guessing parameter ci is the lower asymptote of the ICC and represents the probability of guessing correctly, the difficulty parameter bi is the level of ability that produces a chance of correct response equal to the average of the upper and lower asymptotes, and the slope or discrimination parameter ai is related to the steepness of the curve. A 2PL model assumes that the guessing parameter is equal to 0.\nFigure 1 shows an example of an ICC. The ICC of a good item should have a relatively steep positive slope between -3 and 3 (where most people are located), for the item to have appropriate power to differentiate different levels of ability.\nDescribed above is a one factor IRT model where ability is uni-dimensional. A multi-factor IRT model would involve two or more latent trait dimensions and will not be elaborated here.\nAfter data are collected, a model is fit to estimate the item parameters. The number of factors can be established by comparing IRT models with different numbers of latent trait dimensions. The local independence assumption can be checked using the residuals of marginal response probabilities of item pairs (Chen and Thissen, 1997). The fit of the ICC for each item can be checked with item fit statistics (Orlando and Thissen, 2000). If all tests above are passed and all items have proper discrimination power, then the set of items is considered a calibrated measurement scale and the estimated item parameters can be further used to estimate an individual person’s ability level.\nIRT is able to account for differences among items when estimating a person’s ability. In addition, ability estimates from IRT are on the ability scale of the population used to estimate item parameters. For example, an estimated ability of 1.2 can be interpreted as 1.2 standard deviations above the average ability in this population. The traditional total number of correct responses generally does not have such quantitative meaning.\nIRT has been widely used in educational testing. For example, it plays an instrumental role in the construction, evaluation or scoring of standardized tests such as Test of English as a Foreign Language (TOEFL), Graduate Record Examinations (GRE) and SAT. To our knowledge, we are the first group to apply IRT for creating a gold standard with the intention of comparing NLP applications to human intelligence."
    }, {
      "heading" : "2.1.1 IRT Terminology",
      "text" : "This section outlines common IRT terminology in terms of RTE. An item refers to a pair of sentences to which humans or NLP systems assign a label (entailment, contradiction or neutral). A set of responses to all items (each graded as correct or incorrect) is a response pattern. An evaluation scale is a set of items that can be administered as a test set to an NLP system and assigns an ability score (or theta score) to the system as its performance."
    }, {
      "heading" : "2.2 Gold Standard Generation",
      "text" : "There are a variety of methods to generate goldstandard datasets, among them web crawling (Guo et al., 2013), automatic and semi-automatic generation (An et al., 2003), and expert (Roller and Stevenson, 2015) and non-expert human annotation (Bowman et al., 2015; Wiebe et al., 1999). In each case some validation is required to ensure\nthat the data collected is appropriate and usable for the required task. Automatically generated data can be refined with visual inspection or postcollection processing. Human annotated data usually involves more than one annotator, so that comparison metrics such as Cohen’s or Fleiss’ κ can be used to determine how much they agree. If there is a disagreement between annotators, it is either resolved by the intervention of the researcher or by taking a majority vote of the responses. If there is a majority for a given item from the dataset, it is retained in the final gold-standard version. This process often involves three to five individuals, due to time and resource constraints."
    }, {
      "heading" : "2.3 Recognizing Textual Entailment",
      "text" : "RTE was introduced to standardize the challenge of accounting for semantic variation when building models for a number of NLP applications (Dagan et al., 2006). RTE defines a directional relationship between a pair of sentences, the text (T) and the hypothesis (H). T entails H if a human that has read T would infer that H is true. If a human would infer that H is false, then H contradicts T. If the two sentences are unrelated, then the pair are said to be neutral. Table 1 shows examples of T-H pairs and their respective classifications. Recent state-of-the-art systems for RTE require a large amount of feature engineering and specialization to achieve high performance (Beltagy et al., 2015; Lai and Hockenmaier, 2014; Jimenez et al., 2014)."
    }, {
      "heading" : "2.4 Stanford SNLI Dataset",
      "text" : "Many gold-standard datasets are publicly available, including a number of datasets to test RTE models (Marelli et al., 2014; Young et al., 2014; Levy et al., 2014). A recently introduced dataset for RTE is the Stanford Natural Language Inference (SNLI) dataset (Bowman et al., 2015). SNLI examples were generated using only humangenerated sentences in order to mitigate the problem of poor data that was being used to build models for RTE. Amazon Mechanical Turk (AMT) users were shown a caption that was taken from the Flickr30k corpus (Young et al., 2014) and told that the caption was associated with a photo. The users were not shown the corresponding photo. They were then asked to write three alternate captions that could describe the photo: (i) one that is definitely true, (ii) one that might be true, and (iii) one that is definitely false. These newly generated sentences were then combined with the original\ncaption to create entailment, neutral, and contradiction sentence pairs, respectively.\nTo ensure the quality of the data that was generated, about 10% of the SNLI dataset (56,951 sentence pairs) was sampled and subjected to a quality control assessment. This data was provided to 4 additional AMT users, who were asked to supply a label (entailment, contradiction, neutral) for the sentence pairs. A gold-standard label was then applied to the sentence pair if one of the labels was selected by at least 3 of the 5 annotators (the original annotator and 4 additional annotators). The authors found that most of the items received a goldstandard label, with only 2% of pairs not receiving a gold-standard label (Bowman et al., 2015)."
    }, {
      "heading" : "3 Methods",
      "text" : "We collected and evaluated a random selection from the SNLI dataset (GSRTE) to build IRT models and to determine the effectiveness of the majority-vote quality control methodology. We first randomly selected a subset of GSRTE , and then used the sample in an AMT Human Intelligence Task (HIT) to collect more labels for each text-hypothesis pair. We then applied IRT to evaluate the quality of the examples and used the final IRT models to create evaluation sets (GSIRT ) to measure ability for RTE."
    }, {
      "heading" : "3.1 Item Selection",
      "text" : "We identified a subset of GSRTE to use as an examination set according to the following steps: (1) Identify all of the “quality-control” items from GSRTE , where four additional annotations were obtained to confirm that the label provided by the first AMT user was appropriate, (2) Split this section of the data according to the number of users that agreed on the eventual gold standard label, (3) Randomly select 30 entailment sentence pairs, 30 neutral sentence pairs, and 30 contradiction sentence pairs from each of the 4-annotator gold standard (4GS) and 5-annotator gold standard (5GS) sets to obtain two sets of 90 sentence pairs.\n90 sentence pairs for 4GS and 5GS were sampled so that the annotation (supplying 90 labels) could be completed in a reasonably short amount of time during which users remained engaged and did not lose focus. We selected items from 4GS and 5GS because both groups are considered high quality for RTE. We evaluated the selected 180 sentence pairs using the model provided with the original dataset (Bowman et al., 2015) and found that accuracy scores were similar compared to performance on the SNLI test set."
    }, {
      "heading" : "3.2 AMT Annotation",
      "text" : "To maintain consistency in generating labels, we designed our AMT HIT to match the process used\nto validate the SNLI quality control items (Bowman et al., 2015), which was based on the process used to generate labels for the SICK dataset, another gold standard RTE dataset (Marelli et al., 2014). Each AMT HIT required that a user choose the appropriate label for each of the 90 premisehypothesis sentence pairs, either the 5GS set or the 4GS set. Each user was presented with the full set, as opposed to one-label subsets (e.g. just the entailment pairs) in order to avoid a user simply answering with the same label for each item. Users were shown one sentence-pair at a time and asked to choose a label for each pair.\nFor each 90 sentence-pair set (5GS and 4GS), we collected annotations from 1000 AMT users, resulting in 1000 label annotations for each of the 180 sentence pairs. While there is no set standard for sample sizes in 2PL and 3PL IRT models, this sample size satisfies the standards based on a noncentral χ2 distribution (MacCallum et al., 1996), the distribution of the test statistic when comparing two multidimensional IRT models. This sample size is also appropriate for tests of item fit and local dependence that are based on small contingency tables. Attention check questions were included in the HIT, to ensure that users were paying attention and answering to the best of their ability. Responses where the attention-check questions were answered incorrectly were not included in the analysis. After removing individuals that failed the attention-check, we retained 976 labels for each example in the 4GS set and 983 labels for each example in the 5GS set. Average time spent for both tasks was roughly 30 minutes, a reasonable amount for AMT users."
    }, {
      "heading" : "3.3 Statistical Analysis",
      "text" : "We used a standard R package (Chalmers et al., 2015) for our analyses. The collected data were analyzed separately for 4GS and 5GS items. For both sets of items, the number of latent traits was identified by a plot of eigenvalues of the 90 by 90\ntetrachoric correlation matrix and a further comparison between IRT models with different factors. A target rotation (Browne, 2001) was then used to identify a meaningful loading pattern that associates the factors and the items. Each factor could then be interpreted as the ability of a user to recognize the correct relationship between the sentence pairs associated with that factor.\nWe built a unidimensional IRT model for each set of items associated with a single factor. We fit and compared one- and two-factor 3PL models to confirm the unidimensional structure underlying these items, assuming the possible presence of guessing in people’s responses. We further tested the guessing parameter of each item in the one factor 3PL model. If it was not significantly different from 0, a 2PL ICC was used for that particular item.\nOnce an appropriate model structure was determined, individual items were evaluated for goodness of fit within the model. If an item was deemed to fit the ICC poorly or to give rise to local dependence, it was removed for violating model assumptions. Furthermore, if the ICC of an item was too flat, it was removed for low discriminating power between ability levels. The model was then refit with the remaining items. This iterative process continued until no item could be removed. The number of iterations varied from 2 to 6 depending on how many items were removed from each set. The remaining items were considered a calibrated scale of ability to correctly identify the relationship between the two sentence pairs and are referred to as GSIRT . Parameters of these items were estimated as part of the IRT model and the set of items can be used as an evaluation scale to estimate ability of test-takers or RTE systems."
    }, {
      "heading" : "4 Results",
      "text" : ""
    }, {
      "heading" : "4.1 Response Statistics",
      "text" : "Table 2 lists key statistics that we obtained as a result of our AMT HITs. Most of the sampled sentence pairs resulted in a gold standard label be-\ning identified via a majority vote. Due to the large number of individuals providing labels during the HIT, we also wanted to see if a gold standard label could be determined via a two-thirds supermajority vote, to see if more than just half of the annotators agreed on a label. We found that 28.3% of the sentence pairs did not have a supermajority gold label. In addition, for 12% of the sampled sentence pairs the gold label that was generated did not match the gold label from the original dataset. These items do not have a clear label as annotated by humans, and therefore should be reconsidered as part of a final RTE dataset. They highlight the ambiguity associated with RTE in general, and indicate that care is needed when defining entailment and determining gold-standard labels.\nAlthough our results were taken from a sample of the original 56,000 quality control items, we believe that they are representative of the larger population in that we chose high-quality items, where at least 4 annotators selected the same label, indicating a strong level of agreement (Section 3.1). We argue that our sample is a high-quality portion of the dataset, and further analysis of items where the gold-standard label was only selected by 3 annotators originally would result in lower levels of agreement. Table 3 shows that the level of agreement as measured by the Fleiss’ κ score is much lower when the number of annotators is increased, particularly for the 4GS set of sentence pairs, as compared to scores noted in (Bowman et al., 2015). The decrease in agreement is particularly large with regard to contradiction. This could occur for a number of reasons. Recognizing entailment is an inherently difficult task, and classifying a correct label, particularly for contradiction and neutral, can be difficult due to an individual’s interpretation of the sentences and assumptions that an individual makes about the key facts of each sentence (e.g. coreference). It may also be the case that the individuals tasked with creating the sentence pairs on AMT created sentences that appeared to contradict a premise text, but can be interpreted differently given a different context.\nBefore we fit the IRT models we performed a visual inspection of the 180 sentence pairs to determine if any were clearly not suitable for an evaluation scale, due to syntactic or semantic discrepancies. If an item was ambiguous, or was too general to be considered a good test item for the task, it was removed before the IRT evaluation. One\nsuch pair was removed from the 5GS contradiction set (Table 1, item 10) for semantic reasons. While many people would agree that the statement is a contradiction due to the difference between football and soccer, individuals from outside the U.S. would possible consider the two to be synonyms and classify this as entailment. Six such pairs were identified and removed from the set of 180 items, leaving 174 items for IRT model-fitting."
    }, {
      "heading" : "4.2 IRT Evaluation",
      "text" : "We used the methods described in Section 3.3 to build IRT models to scale performance according to the RTE task. For both 4GS and 5GS items three separate latent traits were identified and they were each related to items for each GSRTE label. This result suggests that items with the same GSRTE label within each set defines a separate ability. In the subsequent steps, items with different labels were analyzed separately. After analysis, we were left with a subset of the 180 originally selected items. Refer to Table 1 for examples of the retained and removed items based on the IRT analysis. We retained 124 of the 180 items (68.9%). We were able to retain more items from the 5GS datasets (76 out of 90 - 84%) than from the 4GS datasets (48 out of 90 - 53.5%). Items that measure contradiction were retained at the lowest rate for both 4GS and 5GS datasets (66% in both cases). For the 4GS entailment items, our analysis found that a one-factor model did not fit the data, and a two-factor model failed to yield an interpretable loading pattern after rotation. We were unable to build an IRT model that accurately modeled ability to recognize entailment with the obtained response patterns. As a result, no items from the 4GS entailment set were retained.\nAs an example, Figure 2 plots the empirical spline-smoothed ICC of one item (Table 1, item\n9) with its estimated response curve. The ICC is not continuously increasing, and therefore a logistic function is not appropriate. This item was spotted for poor item fit and removed.\nAs another example, Figure 3 shows a comparison between the ICC plot of a retained item (Table 1, item 4) and the ICC of a removed item (Table 1, item 8). Notice that the removed item has an ICC that is very flat between -3 and 3. This item cannot discriminate individuals at any common level of ability and therefore is not useful. The items retained for each factor can be considered as an evaluation scale that measures a single ability of an individual test-taker. As the models were split based on the gold-standard label that was tested, each model’s latent trait (θ) is a person’s ability to correctly classify the relationship between the text and hypothesis for one such label (e.g. entailment). Items removed in the course of the statistical analysis should not be included in a test to measure the ability.\nParameter estimates of retained items for each label are summarized in Table 4. All retained items have 2PL ICCs. Difficulty parameters of most items are negative, suggesting that an average AMT user has at least 50% chance to answer these items correctly. This low range of item difficulty (relative to a human population) is appropriate for the evaluation of NLP systems. Items in each scale have a wide range of difficulty and discrimination power.\nIRT is able to discover such heterogeneity of items and properly account for such differences in the estimation of a test-taker’s ability. Figure 4 plots the estimated ability of each AMT user from IRT against their total number of correct responses to the retained items in the 4GS contradiction item set. The two estimates of ability differ in\nmany aspects. First, test-takers with the same total score may differ in their IRT ability estimate because they have different response patterns (i.e. they made mistakes on different items), showing that IRT is able to account for differences among items in scoring. Second, despite a rough monotonic trend between the two scores, people with a higher number of correct responses may have a lower ability estimate from IRT. We can extend this analysis to the case of RTE systems, and use the newly constructed scales to evaluate RTE systems. A system could be trained on an existing dataset and then evaluated using the retained items from the IRT models to estimate a new latent trait score. This score would be a measurement of how well the system performed with respect to the human population used to fit the model. With this approach, larger sections of datasets can be devoted to training, with a small portion held out to build an IRT model that can be used for evaluation.\nAs a demonstration, we used the LSTM model presented in (Bowman et al., 2015) to provide responses to items on our IRT evaluation scales. We also calculated accuracy for all quality control items from GSRTE . The theta scores from IRT in Table 5 show that, compared to AMT users, the system performed well above average for contradiction items compared to human performance, and performed around the average for entailment and neutral items. For both the neutral and contradiction items, the theta scores are similar across the 4GS and 5GS sets, whereas the accuracy of the more difficult 4GS items is consistently lower. This clearly demonstrates the advantage of IRT to account for item characteristics in its ability estimates. In addition, the theta score for 5GS entailment shows that high accuracy does not necessarily mean that performance is above average when compared to human performance."
    }, {
      "heading" : "5 Discussion",
      "text" : "Majority vote validation of a gold standard has been in common use since the inception of NLP. It is easy to implement and evaluate, and allows for disagreements between annotators as long as one choice hits a certain threshold, usually 50% agreement. However, many factors may contribute to a majority vote. For example, an “easy” item with a majority vote may not be useful for separating the performance of NLP systems. By using a limited number of annotators there is a risk of bias or uncertainty influencing the evaluation. As NLP systems have become more sophisticated, we need more sophisticated methodologies to compare their performance. Expanding the number of annotators, although it can be expensive and time consuming, can indicate which items are of a higher quality and which items should possibly be reconsidered for inclusion. Items that receive a majority label with a small number of annotators may have that label changed when the number of annotators is increased. This disparity could have effects on NLP systems that are trained with the data, as they may learn according to ambiguous samples and come to incorrect conclusions.\nOne intelligent approach to create a gold standard is to use IRT to build models to scale performance on a small section of items with respect to the tested population. With IRT we can identify dataset items with different difficulty levels and discrimination powers based on human responses, and identify items that are not appropriate as scale items for evaluation. The resulting small set of items can be used as a scale to score an individual or NLP system. This leaves a higher percentage of a dataset to be used in the training of the system, while still having a valuable metric for testing\nfrom a much smaller portion of data. IRT is not without its challenges. A large population is required to provide the initial responses in order to have enough data to fit the models. An alternative methodology is Classical Test Theory; however, it has its own limitations, in particular that it is test-centric, and cannot provide information for individual items.\nOur current study uses the original GSRTE labels as answer keys to define response patterns. A drawback of this is that our analysis depends on the validity of the original GSRTE labels. However, IRT was still able to identify a final set of items and provide their meaningful characteristics, showing the robustness of this approach."
    }, {
      "heading" : "6 Conclusion and Future Work",
      "text" : "In this paper we analyze a recent gold-standard dataset for the RTE task using the psychometric model of Item Response Theory (IRT). We show that by increasing the number of individuals used to evaluate the quality of the dataset items, overall agreement for the gold-standard dataset drops. There are a number of sentence pairs in the dataset that were identified as high-quality in the sense that they could be fit to IRT models representing individuals’ ability to identify a certain RTE label correctly. Future work will adapt this analysis to create an evaluation mechanism for the RTE task and evaluate a number of gold-standard RTE methods using it. The expectation is that methods that perform well using a standard accuracy measure can be stratified based on which types of items they perform well on, and also perform well when the models are used together as an overall test of ability. The hope is that this new method of evaluating RTE models can then be expanded to other NLP tasks, so that instead of gradually incrementing on a classification accuracy metric, new and innovative methods can be tested against a novel benchmark for performance."
    } ],
    "references" : [ {
      "title" : "Automatic Acquisition of Named Entity Tagged Corpus from World Wide Web",
      "author" : [ "An et al.2003] Joohui An", "Seungwoo Lee", "Gary Geunbae Lee" ],
      "venue" : "In Proceedings of the 41st Annual Meeting on Association for Computational Linguistics - Volume",
      "citeRegEx" : "An et al\\.,? \\Q2003\\E",
      "shortCiteRegEx" : "An et al\\.",
      "year" : 2003
    }, {
      "title" : "Item Response Theory: Parameter Estimation Techniques, Second Edition",
      "author" : [ "Baker", "Kim2004] Frank B. Baker", "Seock-Ho Kim" ],
      "venue" : null,
      "citeRegEx" : "Baker et al\\.,? \\Q2004\\E",
      "shortCiteRegEx" : "Baker et al\\.",
      "year" : 2004
    }, {
      "title" : "Representing Meaning with a Combination of Logical Form and Vectors",
      "author" : [ "Stephen Roller", "Pengxiang Cheng", "Katrin Erk", "Raymond J. Mooney" ],
      "venue" : null,
      "citeRegEx" : "Beltagy et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Beltagy et al\\.",
      "year" : 2015
    }, {
      "title" : "A large annotated corpus for learning natural language inference. arXiv:1508.05326 [cs",
      "author" : [ "Gabor Angeli", "Christopher Potts", "Christopher D. Manning" ],
      "venue" : null,
      "citeRegEx" : "Bowman et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Bowman et al\\.",
      "year" : 2015
    }, {
      "title" : "An overview of analytic rotation in exploratory factor analysis",
      "author" : [ "Michael W Browne" ],
      "venue" : "Multivariate Behavioral Research,",
      "citeRegEx" : "Browne.,? \\Q2001\\E",
      "shortCiteRegEx" : "Browne.",
      "year" : 2001
    }, {
      "title" : "mirt: Multidimensional Item Response Theory, November",
      "author" : [ "Joshua Pritikin", "Alexander Robitzsch", "Mateusz Zoltak" ],
      "venue" : null,
      "citeRegEx" : "Chalmers et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Chalmers et al\\.",
      "year" : 2015
    }, {
      "title" : "Local Dependence Indexes for Item Pairs Using Item Response Theory",
      "author" : [ "Chen", "Thissen1997] Wen-Hung Chen", "David Thissen" ],
      "venue" : "Journal of Educational and Behavioral Statistics,",
      "citeRegEx" : "Chen et al\\.,? \\Q1997\\E",
      "shortCiteRegEx" : "Chen et al\\.",
      "year" : 1997
    }, {
      "title" : "The PASCAL Recognising Textual Entailment Challenge",
      "author" : [ "Dagan et al.2006] Ido Dagan", "Oren Glickman", "Bernardo Magnini" ],
      "venue" : "In Machine Learning Challenges",
      "citeRegEx" : "Dagan et al\\.,? \\Q2006\\E",
      "shortCiteRegEx" : "Dagan et al\\.",
      "year" : 2006
    }, {
      "title" : "Building watson: An overview of the deepqa project",
      "author" : [ "Eric Brown", "Jennifer Chu-Carroll", "James Fan", "David Gondek", "Aditya A Kalyanpur", "Adam Lally", "J William Murdock", "Eric Nyberg", "John Prager" ],
      "venue" : null,
      "citeRegEx" : "Ferrucci et al\\.,? \\Q2010\\E",
      "shortCiteRegEx" : "Ferrucci et al\\.",
      "year" : 2010
    }, {
      "title" : "Linking Tweets to News: A Framework to Enrich Short Text Data in Social Media",
      "author" : [ "Guo et al.2013] Weiwei Guo", "Hao Li", "Heng Ji", "Mona T. Diab" ],
      "venue" : null,
      "citeRegEx" : "Guo et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Guo et al\\.",
      "year" : 2013
    }, {
      "title" : "Illinois-LH: A Denotational and Distributional Approach to Semantics",
      "author" : [ "Lai", "Hockenmaier2014] Alice Lai", "Julia Hockenmaier" ],
      "venue" : "SemEval",
      "citeRegEx" : "Lai et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Lai et al\\.",
      "year" : 2014
    }, {
      "title" : "Focused entailment graphs for open IE propositions",
      "author" : [ "Levy et al.2014] Omar Levy", "Ido Dagan", "Jacob Goldberger" ],
      "venue" : null,
      "citeRegEx" : "Levy et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Levy et al\\.",
      "year" : 2014
    }, {
      "title" : "Power analysis and determination of sample size for covariance structure modeling",
      "author" : [ "Michael W Browne", "Hazuki M Sugawara" ],
      "venue" : "Psychological methods,",
      "citeRegEx" : "MacCallum et al\\.,? \\Q1996\\E",
      "shortCiteRegEx" : "MacCallum et al\\.",
      "year" : 1996
    }, {
      "title" : "A SICK cure for the evaluation of compositional distributional semantic models",
      "author" : [ "Marelli et al.2014] M. Marelli", "S. Menini", "M. Baroni", "L. Bentivogli", "R. Bernardi", "R. Zamparelli", "Fondazione Bruno Kessler" ],
      "venue" : null,
      "citeRegEx" : "Marelli et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Marelli et al\\.",
      "year" : 2014
    }, {
      "title" : "Likelihood-Based Item-Fit Indices for Dichotomous Item Response Theory Models",
      "author" : [ "Orlando", "Thissen2000] Maria Orlando", "David Thissen" ],
      "venue" : "Applied Psychological Measurement,",
      "citeRegEx" : "Orlando et al\\.,? \\Q2000\\E",
      "shortCiteRegEx" : "Orlando et al\\.",
      "year" : 2000
    }, {
      "title" : "Held-out versus Gold Standard: Comparison of Evaluation Strategies for Distantly Supervised Relation Extraction from Medline abstracts",
      "author" : [ "Roller", "Stevenson2015] Roland Roller", "Mark Stevenson" ],
      "venue" : "In Sixth International Workshop on Health",
      "citeRegEx" : "Roller et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Roller et al\\.",
      "year" : 2015
    }, {
      "title" : "Mastering the game of go",
      "author" : [ "Silver et al.2016] David Silver", "Aja Huang", "Chris J Maddison", "Arthur Guez", "Laurent Sifre", "George van den Driessche", "Julian Schrittwieser", "Ioannis Antonoglou", "Veda Panneershelvam", "Marc Lanctot" ],
      "venue" : null,
      "citeRegEx" : "Silver et al\\.,? \\Q2016\\E",
      "shortCiteRegEx" : "Silver et al\\.",
      "year" : 2016
    }, {
      "title" : "Development and use of a gold-standard data set for subjectivity classifications",
      "author" : [ "Rebecca F. Bruce", "Thomas P. O’Hara" ],
      "venue" : "In Proceedings of the 37th annual meeting of the Association",
      "citeRegEx" : "Wiebe et al\\.,? \\Q1999\\E",
      "shortCiteRegEx" : "Wiebe et al\\.",
      "year" : 1999
    }, {
      "title" : "From image descriptions to visual denotations: New similarity metrics for semantic inference over event descriptions",
      "author" : [ "Young et al.2014] Peter Young", "Alice Lai", "Micah Hodosh", "Julia Hockenmaier" ],
      "venue" : null,
      "citeRegEx" : "Young et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Young et al\\.",
      "year" : 2014
    } ],
    "referenceMentions" : [ {
      "referenceID" : 8,
      "context" : "Advances in artificial intelligence have made it possible to compare computer performance directly with human intelligence (Campbell et al., 2002; Ferrucci et al., 2010; Silver et al., 2016).",
      "startOffset" : 123,
      "endOffset" : 190
    }, {
      "referenceID" : 16,
      "context" : "Advances in artificial intelligence have made it possible to compare computer performance directly with human intelligence (Campbell et al., 2002; Ferrucci et al., 2010; Silver et al., 2016).",
      "startOffset" : 123,
      "endOffset" : 190
    }, {
      "referenceID" : 9,
      "context" : "There are a variety of methods to generate goldstandard datasets, among them web crawling (Guo et al., 2013), automatic and semi-automatic generation (An et al.",
      "startOffset" : 90,
      "endOffset" : 108
    }, {
      "referenceID" : 0,
      "context" : ", 2013), automatic and semi-automatic generation (An et al., 2003), and expert (Roller and Stevenson, 2015) and non-expert human annotation (Bowman et al.",
      "startOffset" : 49,
      "endOffset" : 66
    }, {
      "referenceID" : 3,
      "context" : ", 2003), and expert (Roller and Stevenson, 2015) and non-expert human annotation (Bowman et al., 2015; Wiebe et al., 1999).",
      "startOffset" : 81,
      "endOffset" : 122
    }, {
      "referenceID" : 17,
      "context" : ", 2003), and expert (Roller and Stevenson, 2015) and non-expert human annotation (Bowman et al., 2015; Wiebe et al., 1999).",
      "startOffset" : 81,
      "endOffset" : 122
    }, {
      "referenceID" : 7,
      "context" : "RTE was introduced to standardize the challenge of accounting for semantic variation when building models for a number of NLP applications (Dagan et al., 2006).",
      "startOffset" : 139,
      "endOffset" : 159
    }, {
      "referenceID" : 13,
      "context" : "Many gold-standard datasets are publicly available, including a number of datasets to test RTE models (Marelli et al., 2014; Young et al., 2014; Levy et al., 2014).",
      "startOffset" : 102,
      "endOffset" : 163
    }, {
      "referenceID" : 18,
      "context" : "Many gold-standard datasets are publicly available, including a number of datasets to test RTE models (Marelli et al., 2014; Young et al., 2014; Levy et al., 2014).",
      "startOffset" : 102,
      "endOffset" : 163
    }, {
      "referenceID" : 11,
      "context" : "Many gold-standard datasets are publicly available, including a number of datasets to test RTE models (Marelli et al., 2014; Young et al., 2014; Levy et al., 2014).",
      "startOffset" : 102,
      "endOffset" : 163
    }, {
      "referenceID" : 3,
      "context" : "A recently introduced dataset for RTE is the Stanford Natural Language Inference (SNLI) dataset (Bowman et al., 2015).",
      "startOffset" : 96,
      "endOffset" : 117
    }, {
      "referenceID" : 18,
      "context" : "Amazon Mechanical Turk (AMT) users were shown a caption that was taken from the Flickr30k corpus (Young et al., 2014) and told that the caption was associated with a photo.",
      "startOffset" : 97,
      "endOffset" : 117
    }, {
      "referenceID" : 3,
      "context" : "The authors found that most of the items received a goldstandard label, with only 2% of pairs not receiving a gold-standard label (Bowman et al., 2015).",
      "startOffset" : 130,
      "endOffset" : 151
    }, {
      "referenceID" : 3,
      "context" : "original dataset (Bowman et al., 2015) and found that accuracy scores were similar compared to performance on the SNLI test set.",
      "startOffset" : 17,
      "endOffset" : 38
    }, {
      "referenceID" : 3,
      "context" : "to validate the SNLI quality control items (Bowman et al., 2015), which was based on the process used to generate labels for the SICK dataset, another gold standard RTE dataset (Marelli et al.",
      "startOffset" : 43,
      "endOffset" : 64
    }, {
      "referenceID" : 13,
      "context" : ", 2015), which was based on the process used to generate labels for the SICK dataset, another gold standard RTE dataset (Marelli et al., 2014).",
      "startOffset" : 120,
      "endOffset" : 142
    }, {
      "referenceID" : 12,
      "context" : "While there is no set standard for sample sizes in 2PL and 3PL IRT models, this sample size satisfies the standards based on a noncentral χ2 distribution (MacCallum et al., 1996), the distribution of the test statistic when comparing two multidimensional IRT models.",
      "startOffset" : 154,
      "endOffset" : 178
    }, {
      "referenceID" : 5,
      "context" : "We used a standard R package (Chalmers et al., 2015) for our analyses.",
      "startOffset" : 29,
      "endOffset" : 52
    }, {
      "referenceID" : 4,
      "context" : "A target rotation (Browne, 2001) was then",
      "startOffset" : 18,
      "endOffset" : 32
    }, {
      "referenceID" : 3,
      "context" : "As a demonstration, we used the LSTM model presented in (Bowman et al., 2015) to provide responses to items on our IRT evaluation scales.",
      "startOffset" : 56,
      "endOffset" : 77
    } ],
    "year" : 2016,
    "abstractText" : "We introduce Item Response Theory (IRT) from psychometrics as an alternative to majority voting to create an IRT gold standard (GSIRT ). IRT describes characteristics of individual items in GSIRT their difficulty and discriminating power and is able to account for these characteristics in its estimation of human intelligence or ability for an NLP task. In this paper, we evaluated IRT’s model-fitting of a majority vote gold standard designed for Recognizing Textual Entailment (RTE), denoted as GSRTE . By collecting human responses and fitting our IRT model, we found that up to 31% of GSRTE were not useful in building GSIRT for RTE. In addition, we found low inter-annotator agreement for some items in GSRTE suggesting that more work is needed for creating intelligent gold-standards.",
    "creator" : "LaTeX with hyperref package"
  }
}