{
  "name" : "1606.02821.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Cultural Shift or Linguistic Drift? Comparing Two Computational Measures of Semantic Change",
    "authors" : [ "William L. Hamilton", "Jure Leskovec", "Dan Jurafsky" ],
    "emails" : [ "wleif@stanford.edu", "jure@stanford.edu", "jurafsky@stanford.edu" ],
    "sections" : [ {
      "heading" : null,
      "text" : "Words shift in meaning for many reasons, including cultural factors like new technologies and regular linguistic processes like subjectification. Understanding the evolution of language and culture requires disentangling these underlying causes. Here we show how two different distributional measures can be used to detect two different types of semantic change. The first measure, which has been used in many previous works, analyzes global shifts in a word’s distributional semantics; it is sensitive to changes due to regular processes of linguistic drift, such as the semantic generalization of promise (“I promise.”→“It promised to be exciting.”). The second measure, which we develop here, focuses on local changes to a word’s nearest semantic neighbors; it is more sensitive to cultural shifts, such as the change in the meaning of cell (“prison cell” → “cell phone”). Comparing measurements made by these two methods allows researchers to determine whether changes are more cultural or linguistic in nature, a distinction that is essential for work in the digital humanities and historical linguistics."
    }, {
      "heading" : "1 Introduction",
      "text" : "Distributional methods of embedding words in vector spaces according to their co-occurrence statistics are a promising new tool for diachronic semantics (Sagi et al., 2011; Wijaya and Yeniterzi, 2011; Gulordava and Baroni, 2011; Jatowt and Duh, 2014; Kulkarni et al., 2014; Xu and Kemp, 2015; Hamilton et al., 2016). Previous work, however, does not\nconsider the underlying causes of semantic change or how to distentangle different types of change.\nWe show how two computational measures can be used to distinguish between semantic changes caused by cultural shifts (e.g., technological advancements) and those caused by more regular processes of semantic change (e.g., grammaticalization or subjectification). This distinction is essential for research on linguistic and cultural evolution. Detecting cultural shifts in language use is crucial to computational studies of history and other digital humanities projects. By contrast, for advancing historical linguistics, cultural shifts amount to noise and only the more regular shifts matter.\nOur work builds on two intuitions: that distributional models can highlight syntagmatic versus paradigmatic relations with neighboring words (Schütze and Pedersen, 1993) and that nouns are more likely to undergo changes due to irregular cultural shifts while verbs more readily participate in regular processes of semantic change (Gentner and France, 1988; Traugott and Dasher, 2001). We use this noun vs. verb mapping as a proxy to compare our two measures’ sensitivities to cultural vs. linguistic shifts. The first measure is based upon changes to a word’s local semantic neighborhood; we show that it is more sensitive to changes in the nominal domain and captures changes due to unpredictable cultural shifts. Our second measure relies on a more traditional global notion of change; we show that it better captures changes, like those in verbs, that are the result of regular linguistic drift.\nOur analysis relies on a large-scale statistical study of six historical corpora in multiple lan-\nar X\niv :1\n60 6.\n02 82\n1v 1\n[ cs\n.C L\n] 9\nJ un\n2 01\nguages, along with case-studies that illustrate the fine-grained differences between the two measures."
    }, {
      "heading" : "2 Methods",
      "text" : "We use the diachronic word2vec embeddings constructed by Hamilton et al. (2016) to measure how word meanings change between consecutive decades.1 In these representations each word wi has a vector representation w(t) (Turney and Pantel, 2010) at each time point, which captures its co-occurrence statistics for that time period. The vectors are constructed using the skip-gram with negative sampling (SGNS) algorithm (Mikolov et al., 2013) and post-processed to align the semantic spaces between years. Measuring the distance between word vectors for consecutive decades allows us to compute the rate at which the different words change in meaning (Gulordava and Baroni, 2011; Hamilton et al., 2016).\nWe analyzed the decades from 1800 to 1990 using vectors derived from the Google N-gram datasets (Lin et al., 2012) that have large amounts of historical text (English, French, German, and English Fiction). We also used vectors derived from the COHA dataset, which is smaller than Google Ngrams but was carefully constructed to be genre balanced and contains word lemmas as well as surface forms (Davies, 2010). We examined all decades\n1http://nlp.stanford.edu/projects/histwords/\nfrom 1850 through 2000 using the COHA dataset."
    }, {
      "heading" : "2.1 Measuring semantic change",
      "text" : "We examine two different ways to measure semantic change (Figure 1).\nGlobal measure The first measure analyzes global shifts in a word’s vector semantics and is identical to the measure used in most previous works (Gulordava and Baroni, 2011; Jatowt and Duh, 2014; Kim et al., 2014; Hamilton et al., 2016). We simply take a word’s vectors for two different decades and measure the cosine distance between them, i.e.\ndG(w (t) i , w (t+1) i ) = cos-dist(w (t) i ,w (t+1) i ). (1)\nLocal neighborhood measure The second measure is novel and based on the intuition that only a word’s nearest semantic neighbors are relevant. For this measure, we first find word wi’s set of k nearest-neighbors (according to cosine-similarity) within each decade, which we denote by the ordered set Nk(w (t) i ). Next, to measure the change between decades t and t + 1, we compute a “second-order” similarity vector for w(t)i from these neighbor sets with entries defined as\ns(t)(j) = cos-sim(w(t)i ,w (t) j )\n∀wj ∈ Nk(w (t) i ) ∪Nk(w (t+1) i ), (2)\nand we compute an analogous vector for w(t+1)i . Finally, we compute the local neighborhood change as\ndL(w (t) i , w (t+1) i ) = cos-dist(s (t) i , s (t+1) i ). (3)\nThis measures the extent to which wi’s similarity with its nearest neighbors has changed. This measure captures strong shifts in a word’s paradigmatic relations but is less sensitive to global shifts in syntagmatic contexts (Schütze and Pedersen, 1993). We used k = 25 in all experiments (though we found the results to be consistent for k ∈ [10, 50])."
    }, {
      "heading" : "2.2 Statistical methodology",
      "text" : "To test whether nouns or verbs change more according to our two measures of change, we follow Hamilton et al. (2016) and used a linear mixed model approach. This approach essentially amounts to a linear regression but the model also includes “random” effects to account for the fact that the measurements for individual words will be correlated across time (McCulloch and Neuhaus, 2001).\nWe ran two regressions per datatset: one with the global dG values as the dependent variables (DVs) and one with the local neighborhood dL values. In both cases, we examined the change between all consecutive decades and normalized the DVs to zero-mean and unit variance. We examined nouns/verbs within the top-10000 words by frequency rank and removed all words that occurred <500 times in the smaller COHA dataset. The independent variables are word frequency, the decade of the change (represented categorically), and variable indicating whether a word is a noun or a verb (proper nouns are excluded, as in Hamilton et al., 2016).2\n2Frequency was included since it is known to strongly influ-"
    }, {
      "heading" : "3 Results",
      "text" : "Our results show that the two seemingly related measures actually result in drastically different notions of semantic change."
    }, {
      "heading" : "3.1 Nouns vs. verbs",
      "text" : "The local neighborhood measure assigns far higher rates of semantic change to nouns across all languages and datasets while the opposite is true for the global distance measure, which tends to assigns higher rates of change to verbs (Figure 2).\nWe focused on verbs vs. nouns since they are the two major parts-of-speech and previous research has shown that verbs are more semantically mutable than nouns and thus more likely to undergo linguistic drift (Gentner and France, 1988), while nouns are far more likely to change due to cultural shifts (e.g., new technologies) (Traugott and Dasher, 2001). The differences shown in Figure 2 also hold when adverbs are included along with the verbs, which fits with previous research showing that adverbs are often the target of regular linguistic changes like subjectification (ibid.)."
    }, {
      "heading" : "3.2 Case studies",
      "text" : "We examined six case-study words grouped into two sets. These case studies show that three examples of well-attested regular linguistic shifts (set A) changed more according to the global measure, while three well-known examples of cultural changes (set B) are more prevalent with the local neighborhood measure. Table 1 lists these words with some representative historical contexts (Davies, 2010).\nence the distributional measures (Hamilton et al., 2016).\nSet A contains three words that underwent attested regular linguistic shifts detailed in Traugott and Dasher (2001): actually, must, and promise. These three words represent three different types of regular linguistic shifts: actually is a classic case of subjectification (detailed in Figure 1); must shifted from a deontic/obligation usage (“you must do X”) to a epistemic one (“X must be the case”), exemplifying a regular pattern of change common to many modal verbs; and promise represents the class of shifting “performative speech acts” that undergo rich changes due to their pragmatic uses and subjectification (Traugott and Dasher, 2001). The contexts listed in Table 1 exemplify these shifts.\nSet B contains three words that were selected because they underwent well-known cultural shifts over the last 150 years: gay, virus, and cell. These words gained new meanings due to uses in community-specific vernacular (gay) or technological advances (virus, cell). The cultural shifts underlying these changes in usage — e.g., the development of the mobile “cell phone” — were unpredictable in the sense that they were not the result of regularities in human linguistic systems.\nFigure 3 shows how much the meaning of these word changed from the 1850s to the 1990s according\nto the two different measures on the English Google data. We see that the words in set A changed more when measurements were made using the global measure, while the opposite holds for set B."
    }, {
      "heading" : "4 Discussion",
      "text" : "Our results show that our novel local neighborhood measure of semantic change is more sensitive to changes in nouns, while the global measure is more sensitive to changes in verbs. This mapping aligns with the traditional distinction between irregular cultural shifts in nominals and more regular cases of linguistic drift (Traugott and Dasher, 2001) and is further reinforced by our six case-studies.\nThis finding emphasizes that researchers must develop and use measures of semantic change that are tuned to specific tasks. For example, a cultural change-point detection framework would be more successful using our local-neighborhood measure, while an empirical study of grammaticalization would be better off using the traditional global distance approach. Comparing measurements made by these two approaches also allows researchers to assess the extent to which semantic changes are linguistic or cultural in nature."
    }, {
      "heading" : "Acknowledgements",
      "text" : "The authors thank C. Manning and V. Prabhakaran for their helpful comments. This research has been supported in part by NSF CNS-1010921, IIS1149837, IIS-1514268 NIH BD2K, ARO MURI, DARPA XDATA, DARPA SIMPLEX, Stanford Data Science Initiative, SAP Stanford Graduate Fellowship, NSERC PGS-D, Boeing, Lightspeed, SAP, and Volkswagen."
    } ],
    "references" : [ {
      "title" : "The Corpus of Historical American English: 400 million words, 1810-2009",
      "author" : [ "Mark Davies" ],
      "venue" : null,
      "citeRegEx" : "Davies.,? \\Q2010\\E",
      "shortCiteRegEx" : "Davies.",
      "year" : 2010
    }, {
      "title" : "The verb mutability effect: Studies of the combinatorial semantics of nouns and verbs. Lexical ambiguity resolution: Perspectives from psycholinguistics, neuropsychology, and artificial intelligence",
      "author" : [ "Gentner", "France1988] Dedre Gentner", "Ilene M. France" ],
      "venue" : null,
      "citeRegEx" : "Gentner et al\\.,? \\Q1988\\E",
      "shortCiteRegEx" : "Gentner et al\\.",
      "year" : 1988
    }, {
      "title" : "A distributional similarity approach to the detection of semantic change in the Google Books Ngram corpus",
      "author" : [ "Gulordava", "Baroni2011] Kristina Gulordava", "Marco Baroni" ],
      "venue" : "In Proc. GEMS 2011 Workshop on Geometrical Models of Natural",
      "citeRegEx" : "Gulordava et al\\.,? \\Q2011\\E",
      "shortCiteRegEx" : "Gulordava et al\\.",
      "year" : 2011
    }, {
      "title" : "Diachronic word embeddings reveal statistical laws of semantic change",
      "author" : [ "Jure Leskovec", "Dan Jurafsky" ],
      "venue" : "In Proceedings of the ACL. arXiv:1605.09096",
      "citeRegEx" : "Hamilton et al\\.,? \\Q2016\\E",
      "shortCiteRegEx" : "Hamilton et al\\.",
      "year" : 2016
    }, {
      "title" : "A framework for analyzing semantic change of words across time",
      "author" : [ "Jatowt", "Duh2014] Adam Jatowt", "Kevin Duh" ],
      "venue" : "In Proc. 14th ACM/IEEE-CS Conf. on Digital Libraries,",
      "citeRegEx" : "Jatowt et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Jatowt et al\\.",
      "year" : 2014
    }, {
      "title" : "Temporal analysis of language through neural language models. arXiv preprint arXiv:1405.3515",
      "author" : [ "Kim et al.2014] Yoon Kim", "Yi-I. Chiu", "Kentaro Hanaki", "Darshan Hegde", "Slav Petrov" ],
      "venue" : null,
      "citeRegEx" : "Kim et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Kim et al\\.",
      "year" : 2014
    }, {
      "title" : "Statistically significant detection of linguistic change",
      "author" : [ "Rami Al-Rfou", "Bryan Perozzi", "Steven Skiena" ],
      "venue" : "In Proc. 24th WWW Conf.,",
      "citeRegEx" : "Kulkarni et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Kulkarni et al\\.",
      "year" : 2014
    }, {
      "title" : "Syntactic annotations for the google books ngram corpus",
      "author" : [ "Lin et al.2012] Yuri Lin", "Jean-Baptiste Michel", "Erez Lieberman Aiden", "Jon Orwant", "Will Brockman", "Slav Petrov" ],
      "venue" : "In Proceedings of the ACL 2012 system demonstrations,",
      "citeRegEx" : "Lin et al\\.,? \\Q2012\\E",
      "shortCiteRegEx" : "Lin et al\\.",
      "year" : 2012
    }, {
      "title" : "Generalized linear mixed models",
      "author" : [ "McCulloch", "Neuhaus2001] Charles E McCulloch", "John M Neuhaus" ],
      "venue" : null,
      "citeRegEx" : "McCulloch et al\\.,? \\Q2001\\E",
      "shortCiteRegEx" : "McCulloch et al\\.",
      "year" : 2001
    }, {
      "title" : "Distributed representations of words and phrases and their compositionality",
      "author" : [ "Ilya Sutskever", "Kai Chen", "Greg S. Corrado", "Jeff Dean" ],
      "venue" : "In Advances in Neural Information Processing Systems,",
      "citeRegEx" : "Mikolov et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Mikolov et al\\.",
      "year" : 2013
    }, {
      "title" : "Tracing semantic change with latent semantic analysis",
      "author" : [ "Sagi et al.2011] Eyal Sagi", "Stefan Kaufmann", "Brady Clark" ],
      "venue" : "Current Methods in Historical Semantics,",
      "citeRegEx" : "Sagi et al\\.,? \\Q2011\\E",
      "shortCiteRegEx" : "Sagi et al\\.",
      "year" : 2011
    }, {
      "title" : "A vector model for syntagmatic and paradigmatic relatedness",
      "author" : [ "Schütze", "Pedersen1993] Hinrich Schütze", "Jan Pedersen" ],
      "venue" : "In Proceedings of the 9th Annual Conference of the UW Centre for the New OED and Text Research,",
      "citeRegEx" : "Schütze et al\\.,? \\Q1993\\E",
      "shortCiteRegEx" : "Schütze et al\\.",
      "year" : 1993
    }, {
      "title" : "Regularity in Semantic Change",
      "author" : [ "Traugott", "Richard B Dasher" ],
      "venue" : null,
      "citeRegEx" : "Traugott et al\\.,? \\Q2001\\E",
      "shortCiteRegEx" : "Traugott et al\\.",
      "year" : 2001
    }, {
      "title" : "From frequency to meaning: Vector space models of semantics",
      "author" : [ "Turney", "Pantel2010] Peter D. Turney", "Patrick Pantel" ],
      "venue" : "J. Artif. Intell. Res.,",
      "citeRegEx" : "Turney et al\\.,? \\Q2010\\E",
      "shortCiteRegEx" : "Turney et al\\.",
      "year" : 2010
    }, {
      "title" : "Understanding semantic change of words over centuries",
      "author" : [ "Wijaya", "Reyyan Yeniterzi" ],
      "venue" : "In Proceedings of the 2011 International Workshop on Detecting and Exploiting Cultural Diversity on the Social Web,",
      "citeRegEx" : "Wijaya et al\\.,? \\Q2011\\E",
      "shortCiteRegEx" : "Wijaya et al\\.",
      "year" : 2011
    }, {
      "title" : "A computational evaluation of two laws of semantic change",
      "author" : [ "Xu", "Kemp2015] Yang Xu", "Charles Kemp" ],
      "venue" : "In Proc. 37th Annu. Conf. Cogn. Sci. Soc",
      "citeRegEx" : "Xu et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Xu et al\\.",
      "year" : 2015
    } ],
    "referenceMentions" : [ {
      "referenceID" : 10,
      "context" : "Distributional methods of embedding words in vector spaces according to their co-occurrence statistics are a promising new tool for diachronic semantics (Sagi et al., 2011; Wijaya and Yeniterzi, 2011; Gulordava and Baroni, 2011; Jatowt and Duh, 2014; Kulkarni et al., 2014; Xu and Kemp, 2015; Hamilton et al., 2016).",
      "startOffset" : 153,
      "endOffset" : 315
    }, {
      "referenceID" : 6,
      "context" : "Distributional methods of embedding words in vector spaces according to their co-occurrence statistics are a promising new tool for diachronic semantics (Sagi et al., 2011; Wijaya and Yeniterzi, 2011; Gulordava and Baroni, 2011; Jatowt and Duh, 2014; Kulkarni et al., 2014; Xu and Kemp, 2015; Hamilton et al., 2016).",
      "startOffset" : 153,
      "endOffset" : 315
    }, {
      "referenceID" : 3,
      "context" : "Distributional methods of embedding words in vector spaces according to their co-occurrence statistics are a promising new tool for diachronic semantics (Sagi et al., 2011; Wijaya and Yeniterzi, 2011; Gulordava and Baroni, 2011; Jatowt and Duh, 2014; Kulkarni et al., 2014; Xu and Kemp, 2015; Hamilton et al., 2016).",
      "startOffset" : 153,
      "endOffset" : 315
    }, {
      "referenceID" : 9,
      "context" : "The vectors are constructed using the skip-gram with negative sampling (SGNS) algorithm (Mikolov et al., 2013) and post-processed to align the semantic spaces between years.",
      "startOffset" : 88,
      "endOffset" : 110
    }, {
      "referenceID" : 3,
      "context" : "Measuring the distance between word vectors for consecutive decades allows us to compute the rate at which the different words change in meaning (Gulordava and Baroni, 2011; Hamilton et al., 2016).",
      "startOffset" : 145,
      "endOffset" : 196
    }, {
      "referenceID" : 3,
      "context" : "We use the diachronic word2vec embeddings constructed by Hamilton et al. (2016) to measure how word meanings change between consecutive decades.",
      "startOffset" : 57,
      "endOffset" : 80
    }, {
      "referenceID" : 7,
      "context" : "We analyzed the decades from 1800 to 1990 using vectors derived from the Google N-gram datasets (Lin et al., 2012) that have large amounts of historical text (English, French, German, and English Fiction).",
      "startOffset" : 96,
      "endOffset" : 114
    }, {
      "referenceID" : 0,
      "context" : "We also used vectors derived from the COHA dataset, which is smaller than Google Ngrams but was carefully constructed to be genre balanced and contains word lemmas as well as surface forms (Davies, 2010).",
      "startOffset" : 189,
      "endOffset" : 203
    }, {
      "referenceID" : 5,
      "context" : "The first measure analyzes global shifts in a word’s vector semantics and is identical to the measure used in most previous works (Gulordava and Baroni, 2011; Jatowt and Duh, 2014; Kim et al., 2014; Hamilton et al., 2016).",
      "startOffset" : 130,
      "endOffset" : 221
    }, {
      "referenceID" : 3,
      "context" : "The first measure analyzes global shifts in a word’s vector semantics and is identical to the measure used in most previous works (Gulordava and Baroni, 2011; Jatowt and Duh, 2014; Kim et al., 2014; Hamilton et al., 2016).",
      "startOffset" : 130,
      "endOffset" : 221
    }, {
      "referenceID" : 3,
      "context" : "To test whether nouns or verbs change more according to our two measures of change, we follow Hamilton et al. (2016) and used a linear mixed model approach.",
      "startOffset" : 94,
      "endOffset" : 117
    }, {
      "referenceID" : 0,
      "context" : "Table 1 lists these words with some representative historical contexts (Davies, 2010).",
      "startOffset" : 71,
      "endOffset" : 85
    }, {
      "referenceID" : 3,
      "context" : "ence the distributional measures (Hamilton et al., 2016).",
      "startOffset" : 33,
      "endOffset" : 56
    }, {
      "referenceID" : 0,
      "context" : "Contexts are from the COHA data (Davies, 2010).",
      "startOffset" : 32,
      "endOffset" : 46
    } ],
    "year" : 2016,
    "abstractText" : "Words shift in meaning for many reasons, including cultural factors like new technologies and regular linguistic processes like subjectification. Understanding the evolution of language and culture requires disentangling these underlying causes. Here we show how two different distributional measures can be used to detect two different types of semantic change. The first measure, which has been used in many previous works, analyzes global shifts in a word’s distributional semantics; it is sensitive to changes due to regular processes of linguistic drift, such as the semantic generalization of promise (“I promise.”→“It promised to be exciting.”). The second measure, which we develop here, focuses on local changes to a word’s nearest semantic neighbors; it is more sensitive to cultural shifts, such as the change in the meaning of cell (“prison cell” → “cell phone”). Comparing measurements made by these two methods allows researchers to determine whether changes are more cultural or linguistic in nature, a distinction that is essential for work in the digital humanities and historical linguistics.",
    "creator" : "LaTeX with hyperref package"
  }
}