{
  "name" : "1607.08898.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Personalized Emphasis Framing for Persuasive Message Generation",
    "authors" : [ "Tao Ding", "Shimei Pan" ],
    "emails" : [ "taoding01@umbc.edu", "shimei@umbc.edu" ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "Persuasion is an integral part of our personal and professional lives. The topic of generating persuasive messages has been investigated in different fields with varied focuses. Psychologists focus on the cognitive, social and emotional processes of a persuader and a persuadee to understand what makes a communication persuasive (Hovland et al., 1953; Petty and Cacioppo, 1986; Smith and Petty, 1996). Marketing researchers are interested in applying theories of persuasion in promoting consumer products (Szybillo and Heslin, 1973; Han and Shavitt, 1994; Campbell and Kirmani, 2000; Kirmani and Campbell, 2004; Ford, 2005; Hirsh et al., 2012). Natural Language Generation (NLG) researchers are interested in studying the relations between language usage and persuasion in order to build automated systems that produce persuasive messages (Guerini et al., 2011; Reiter et al., 2003).\nIt is also generally believed that persuasion is more effective when it is custom-tailored to reflect the interests and concerns of the intended audience (Noar et al., 2007; Dijkstra, 2008; Hirsh et al., 2012). A proven tailoring tactic commonly used by politicians, marketing executives, as well as public health advocators is content framing (Meyerowitz and Chaiken, 1987; Maheswaran and Meyers-Levy,\n1990; Grewal et al., 1994; Rothman and Salovey, 1997). Previous framing research has mainly focused on two types of framing strategies: emphasis frames and equivalence frames. To emphasis frame a message is to simplify reality by focusing on a subset of the aspects of a situation or an issue and make them more salient in a communication to promote certain definition, causal interpretation and moral evaluation (Entman and Rojecki, 1993). For example, in political debating, nuclear energy can be framed as an economic development issue, a safety issue or an environmental issue. In marketing, the same car can be framed as a low cost car, a performance car, or a green car. With different framing strategies, the authors try to appeal to individuals with different beliefs and concerns. In contrast, equivalence framing focuses on presenting content as either loss-framed or gain-framed messages. For example, a smoking cessation message can employ a gain-frame like “You will live longer if you quit smoking”, or a loss-frame such as “You will die sooner if you do not quit smoking”. Even though the messages are equivalent factually, the frames can influence a receiver’s behavior either to encourage a desirable outcome or to avoid an outcome that is unwanted (Tversky and Kahneman, 1981).\nIn this study, we focus on personalized emphasis framing which selects a subset of the aspects of an entity (e.g., a car) to enhance its appeal to a given receiver. In a car advertisement scenario, an emphasis framing model decides which aspects of a car to emphasize to encourage certain user behaviors. Thus, the communicative goal of emphasis framing is not to simply convey information, but to influence the opinion or behavior of a receiver.\nUsing emphasis framing as the framework for personalized content selection, we can take advantage of rich findings in prior framing research that link content selection decisions to a set of psychologically-motivated domain-independent personal traits. This has made our work more gen-\nar X\niv :1\n60 7.\n08 89\n8v 1\n[ cs\n.A I]\n2 9\nJu l 2\n01 6\neralizable than those relying on application-specific user characteristics (e.g., use an individual’s smoking habit to tailor a smoke cessation message). Since content framing is a part of the content determination process, the model we propose is a part of the content planner in a Natural Language Generation (NLG) system (Reiter and Dale, 1997).\nThere are three main contributions of this work.\n1. To the best of our knowledge, this is the first effort in building an automated model of emphasis framing for personalized persuasive message generation.\n2. We made content selection decisions based on a set of psychologically-motivated applicationindependent user traits, such as personality and basic human values, which makes our work more generalizable than the existing works that rely on domain-specific user characteristics and preferences.\n3. We propose a cascade content selection model that integrates personalized content selection patterns uncovered in our analysis in automated persuasive message generation."
    }, {
      "heading" : "2 Related Work",
      "text" : "In the following, we summarize the research that is most relevant to our work including prior psychology and communication studies that link emphasis framing with personal traits. Since building computational models of emphasis framing was not the primary goal in these studies, we also include literature on personalized Natural Language Generation."
    }, {
      "heading" : "2.1 Emphasis Framing and Personal Traits",
      "text" : "There is a large body of social, marketing and communication theories on framing effects. Tversky and Kahneman (1981) state that human decisions are controlled partly by the formulation of the problem and partly by the norms, habits, and personal characteristics of the decision-maker. (Zaller, 1992; Zaller and Feldman, 1992) point out that framing essentially reorganizes information to increase accessibility of an issue dimension by highlighting one cognitive path that had previously been in the dark. Others argue that the framing effect is due to a change\nin the rank order of the values associated with different aspects through the interaction with the content found within a message (Nelson et al., 1997; Chong and Druckman, 2007; Jacoby, 2000). Although most research agrees that the characteristics of a receiver play an important role in framing effectiveness, there is a significant disagreement in what characteristics of a receiver result in framing effects. For example, (Anderson, 2010) states that people with prior attitudes toward an issue can be influenced by frames, while Slothuus (Slothuus, 2008) and Tabor et al. (Taber et al., 2009) did not find a framing effect for those with strong values associated with the issue prior to exposure to the frame. The mixed results may be due to the fact that many of these studies did not take into account that people with different traits (e.g., different personality) may react to framing strategies differently.\nRecently, personalized framing, especially personality-based framing research has become a hot topic. Among them, Hirsh (2012) investigates whether a persuasive appeal’s effectiveness can be increased by aligning message framing with a recipient’s personality profile. In this study, for a given mobile phone, they constructed five advertisements, each designed to target one of the five major personality traits. Their results indicate that advertisements were evaluated more positively when they cohered with participants’ personality. In a separate study, (Conroy et al., 2012) found that certain personality traits, particularly openness, agreeableness, and conscientiousness mediate framing effects when participants were presented with different frames of political and health issues such as civil liberties, medical treatments, energy, affirmative action, and gun control.\nInspired by the above research, we also employ psychologically-motivated trait models to capture individual characteristics. In addition to personality, we also incorporate basic human values since framing effects are linked to personal beliefs and motivations. As a result, we have significantly increased the scope of our study over prior research. Moreover, unlike prior research where only messages hand-crafted by experts were used, we are interested in building computational models to automatically select a subset of the aspects based on personal traits."
    }, {
      "heading" : "2.2 Personalized NLG",
      "text" : "There is also a large body of work on personalized Natural Language Generation (NLG). For example, STOP is a Natural Language Generation (NLG) system that generates tailored smoking cessation letters based on responses to a four-page smoking questionnaire (Reiter et al., 2003); PERSIVAL customizes the content of search summaries based on its relevance to a given patient’s health record (McKeown et al., 2003); MATCH is a multimodal dialogue system that tailors the content of its responses based on a user’s restaurant preferences; M-PIRO tailors the words and complexity of museum object descriptions for different audiences (e.g. adults, children, and experts); PERSONAGE (Biewen and Weiser, 2011) and CRAG 2 (Gill et al., 2012) vary linguistic styles to project intended personality in spoken utterances. Among them, STOP, PERSIVAL and MATCH use domain-specific user models while MPIRO, PERSONAGE and GRAG2 employ domain independent user properties, such as expertise and personality. For PERSONAGE and GRAG2, personality traits are mainly used to adapt linguistic styles. So far, there has not been much work focusing on using domain-independent user traits to automatically adapt message content to improve its persuasive appeal."
    }, {
      "heading" : "3 Acquiring Personal Traits",
      "text" : "Since prior study often links framing effects to individual characteristics, such as personality and individual motivations and beliefs, here we focus on two widely-accepted trait models in psychology: the Big5 personality model (Goldberg, 1993) and Schwartz’s basic human value model (Schwartz, 2003). Figure 1 shows the description of each of the Big5 personality traits along with each of the five basic human value traits.\nTo acquire the personality and value traits of a person, traditionally, psychometric tests, such as the IPIP test for Big 5 personality (Yarkoni, 2010a) and the PVQ survey for values (Schwartz, 2003), were used. Recent research in the field of psycholinguistics has shown that it is possible to automatically infer personal traits from one’s linguistic footprint, such as tweets, Facebook posts and blogs (Yarkoni, 2010b; Celli and Polonio, 2013; Chen et al., 2014).\nUnlike psychometric tests, automated trait analysis allows us to infer personal traits for a large number of people, which makes it possible to scale up automated personal persuasion for a very large population (e,g., millions of social media users)."
    }, {
      "heading" : "4 Acquiring Author Framing Strategy",
      "text" : "Framing effects are often subtle and may be influenced by many factors, such as the characteristics of the authors, the characteristics of the receivers and the context of the communication. In the first study, we investigate whether it is feasible to build a personalized content selection model based on a writer’s (a.k.a. an author’s) content framing strategies.\nTo investigate this, we first randomly generated ten cars, each include eight aspects: safety, fuel economy, quality, style, price, luxury, performance and durability. The aspects were selected because similar features were used in prior automobilerelated studies (Atkinson and Halvorsen, 1984; Malcolm Beynon and Marshall, 2001). The value of each aspect was randomly generated on a 5-point Likert scale: “1 (very bad)”, “2 (bad)”, “3 (average)”, “4 (good)”, and “5 (excellent)”. We also conducted a large-scale personality and basic hu-\nman value survey on Amazon Mechanical Turk (AMT). We used the 50-item IPIP survey (Goldberg, 1993) to obtain a Amazon Mechanical Turk worker (a.k.a. Turker)’s personality scores and the 21-item PVQ survey (Schwartz, 2003) to obtain his/her basic value scores. To ensure the quality of the data from AMT, we added two qualification criteria. A qualified Turker must (1) have submitted over 5000 tasks (2) with an acceptance rate over 95%. The survey also included several validation questions. The validation questions are pairs of questions that are paraphrases of each other. If the answers to a pair of validation questions are significantly different, the user data were excluded from our analysis. After removing invalid data, we collected the traits of 836 Turkers. Raw personality scores, ranging from 10 to 50, and raw value scores, ranging from 1 to 6, were computed directly from the survey answers. The normalized trait scores, ranging from 0 to 1, were computed using their rank percentiles in this population.\nIn addition, we designed two Human Intelligence Tasks (HITs) on AMT: a content customization task and a validation task. In the content customization task (a.k.a. Task 1), a Turker was asked to select one car aspect to emphasize in his campaign message for a receiver. The validation task (a.k.a. Task 2) was used to validate whether a receiver prefers the message customized for her or not.\nSpecifically, in Task 1, the Turkers were asked to imagine that they work for a marketing firm on a campaign to promote a new car. Each Turker was given the specification of a car ( randomly selected from the 10 randomly generated cars) and a receiver (randomly selected from the 836 Turkers whose trait scores were known to us). The Turker was asked to write a campaign message to persuade the receiver to buy the car. But the Turker can only select one of the eight car aspects to include in his message. For comparison, for the same car, we also asked the same writer to select a car aspect for a different receiver who has an opposite trait profile. The opposite trait profile is defined as the one that is most dissimilar to the given trait profile (with the lowest cosine similarity) in our data. After the writer selected a car aspect, he also wrote a campaign message using the selected aspect. Overall, after removing invalid data, we collected 490 pairs of messages\nfor 131 pairs of receivers.\nTo validate the framing effect, in Task 2, we asked a new set of Turkers (receivers) to first complete an IPIP personality survey and a PVQ human value survey. Based on the survey results, we computed the trait profile for each of them. In addition, for each Turker (receiver) in Task 2, we matched his/her trait profile with the 131 pairs of trait profiles collected in Task 1. The profile with the highest matching score (computed based on cosine similarity) was selected and its associated message pair was also retrieved.\nThen we presented the Turker with a pair of messages, one created for someone with matching trait profile, the other for someone with the opposite trait profile. We randomized the order of the messages. Finally, we asked the Turker to rate which message they prefer more. If the framing strategies used by the Turkers (authors) in Task 1 were effective, then the Turkers (receivers) in Task 2 will prefer the messages tailored for them more than the ones tailored for someone with the opposite trait profile. Overall, after filtering out invalid data, we have collected the results from 145 Turkers. Among the 145 Turkers (receivers) in Task 2, 77 of them prefer the messages written for them while 68 prefer the messages written for someone with the opposite traits. We performed a sign test to determine whether the difference is statistically significant and the result was negative (p < 0.2).\nAlthough moderate personalization effects were found in previous framing research, only expertcrafted messages were used (Hirsh et al., 2012). Here, when Turkers (mostly non-experts) were asked to customize the messages based on a receiver’s traits, no significant effects were found. In the next, since authors’ emphasis framing strategies were not effective, we present several experiments designed to automatically derive emphasis framing strategies based on a receiver’s traits and his/her aspect selection decisions."
    }, {
      "heading" : "5 Learning Emphasis Framing Strategies",
      "text" : "The goal of this study is to derive emphasis framing patterns based on a receiver’s traits and his/her aspect selection decisions."
    }, {
      "heading" : "5.1 Data Collection",
      "text" : "We designed another HIT (Task 3) on AMT to collect the data needed for the study. In Task 3, each Turker was asked to take the IPIP and PVQ surveys so that we can obtain their Big5 personality and value scores. In addition, we also asked them to rank all eight car aspects based on their importance to them. To control the influence of the value of a car aspect on a user’s aspect selection decision (e.g., if the value of “safety” is “poor” and the value of “fuel economy” is “good”, to promote the car, people almost always describe it as ”a car with good fuel economy”, not “an unsafe car”, regardless of a receiver’s personality). In this study, we kept the values of all car aspects unspecified. After removing the invalid data, our dataset has 594 valid responses, each contains a Turker’s personality and value scores as well as his rank of the eight car aspects. In the following, we describe how we analyze the relationship between aspect rank and personal traits."
    }, {
      "heading" : "5.2 Pattern Discovery with Regression",
      "text" : "In our first study, we employed regression analysis to identify significant correlations between personal traits and aspect ranks. Specifically, we trained eight linear regression models, one for each of the eight car aspects. The dependent variable in each model is the rank of an aspect (from 1 to 8) and the independent variables are the ten user traits. Here we only focused on the main effects since a full interaction model of ten traits will require more data to train. Since the raw scores of the personality and the value traits use different scales, we normalized these scores so that they are all from 0 to 1. Table 1 shows the regression results. Several interesting patterns were discovered in this analysis: (a) a positive correlation between the rank of “luxury” and “selfenhancement”, a trait often associated with people who pursue self-interests and value social status, prestige and personal success (p < 0.0001). This pattern suggests that to promote a car to someone who scores high on “self-enhancement”, we need to highlight the “luxury” aspect of a car. (b) the importance rank of “safety” is positively correlated with “conservation”, a trait associated with people who conform to tradition and pursue safety, har-\nmony, and stability (p < 0.005). This result suggests that for someone values “conservation”, it is better to emphasize “car safety” in a personalized sales message. (c) “self-transcendence”, a trait often associated with people who pursue the protection of the welfare of others and the nature, is positively correlated with the rank of “fuel economy” (p < 0.005) but negatively correlated with the rank of “style” (p < 0.005). This suggests that for someone who values “self-transcendence”, it is better to emphasize “fuel economy”, but not so much on “style”. Other significant correlations uncovered in this analysis include a negative correlation between car “price” and “conservation” (p < 0.005), a negative correlation between car “safety” and “conscientiousness” (p < 0.05), and a positive correlation between “openness to change” and car “performance” (p < 0.05)."
    }, {
      "heading" : "5.3 Pattern Discovery with Constrained Clustering",
      "text" : "In the regression analysis, we have only considered the main effects. In order to discover high-order interaction patterns with limited data, we used clustering to group people who share similar traits together. In addition, we also wanted the people within a cluster to share similar aspect preferences. Otherwise, we won’t be able to link the trait patterns discovered in a cluster with aspect preferences. Thus, we employed constrained clustering in this analysis. With constrained clustering, we can ensure the homogeneity of the aspect preferences within each resulting cluster. To facilitate this analysis, first we mapped the aspect ranks obtained in Task 3 into discrete categories. Specifically, for a complete rank of eight car aspects, we mapped the top three ranked aspects to an “Important” class, bottom three to a “Not-Important” class, and the middle two to a “Neutral” class. In addition, we encoded the aspect homogeneity requirement as additional constraints. Typically, constrained clustering incorporates either a set of must-link constraints, cannot-link constraints, or both. Both a must-link and a cannot-link constraint define a relationship between two data instances. A must-link constraint is used to specify that the two instances in the mustlink relation should be placed in the same cluster. A cannot-link constraint is used to specify that the\ntwo instances in the cannot-link relation should not be put in the same cluster. These constraints act as a guide for which a constrained clustering algorithm will use to find clusters that satisfy these constraints. To encode the homogeneity requirement, for each car aspect (e.g. car safety), we can simply add must-links between every pair of Turkers if they share the same aspect preference (e.g., both consider “safety” important) and add cannotlinks for every pair of Turkers who do not share the same aspect preferences (e.g., one Turker considers “safety” “Important”, the other considers it “Not-Important”). But this encoding is not ideal since with both must-links and cannot-links, it is very likely we will get three big clusters for each aspect, each is related to one of the three categories: Important, Neutral and Not-Important. Although the resulting clusters satisfy the homogeneity of the aspect preference requirement, they fail to group people with similar traits together. As a result, in this analysis, we only used cannot-links, which not only guarantees the homogeneity of aspect preferences, but also creates smaller clusters that group people with similar traits together. We employed the Metric Pairwise Constrained KMeans algorithm (MPCKMEANS) (Bilenko et al., 2004) to incorporate the aspect preference homogeneity requirement. The optimal cluster numberK for each aspect was determined empirically by running MPCK-MEANS with different Ks, K ∈ [3, 20] (3 is the minimum number of clusters since we have 3 different aspect preference categories). To determine whether the resulting clusters capture any significant patterns, we used two pattern selection criteria (a) a homogeneity criterion which requires that there is at least one trait whose values in the cluster is relatively homogeneous; (b) a distinctiveness criterion which requires that for the traits identified in (a), their cluster means need to be significantly different from the population means. For (a), we used the coefficient of variation (CV) as the homogeneity measure. CV, also known as relative standard deviation (RSD), is a standardized measure of dispersion of a probability or count distribution. It is often expressed as a percentage and is defined as the ratio of the standard deviation σ to the mean |µ|. In the study, we required that\nall the CVs of homogeneous traits to be lower than 0.12. For (b) we required that the differences of the means need to be significant based on an independent sample t-test with p < 0.001 and the difference of means is greater than 0.2. Table 2 highlights some of the patterns discovered using this approach. In this table, we list the cluster id, cluster label (Important, Not-Important, Neutral), clustering accuracy, and significant traits in the cluster (“+” indicates that the cluster mean is higher than population mean, “- ” means the opposite). For example, based on the Safety-1 pattern, people who are more extraverted (extrave (+)) and more neurotic (neurotic (+)) tend to consider “car safety” important. Similarly, based on pattern Safety-3, people who are more conscientious (conscie(+)) but less open (open(-)) tend to consider “safety” important. Other interesting patterns include: people who are less open (open(-)) and do not value hedonism (hedomis (-)) don’t consider performance very important (performance-3), and people who are more extraverted (extrave(+)), value hedonism and self-enhancement (hedonis(+), self-en(+)) do not think durability important (durability-1)."
    }, {
      "heading" : "6 Apply Emphasis Framing in NLG",
      "text" : "The patterns derived in the previous section can be used in personalized content selection for Natural Language Generation. In general, to promote a car, people tend to highlight the good aspects and avoid the bad aspects, regardless of a receiver’s personality. For example, people will likely to highlight the fuel economy aspect if a car is very fuel efficient while de-highlight the same aspect if a car is not fuel efficient. Thus, during content selection, to take the value of an aspect into consideration, we employ a cascade NLG model that integrates value-based content selection with trait-based personalization. The input to the cascade content selection model includes: (1) the values of all the aspects; (2) the trait scores of a given receiver; (3) the eight linear-regression models learned in Section 5.2, one for each aspect; (4) the interaction rules learned in Section 5.3; (5) n, the number of aspects needed in the output; (6) the value difference threshold δ1 that determines whether the values of two or more aspects are significantly different; (7) the rank difference threshold δ2 that determines whether the ranks of two or more aspects predicted by the linear regression models are significantly different. To select n features to emphasize, our system first ranks all the aspects based on their values. If the value of the n-th aspect vn is significantly better than that of the (n+1)-th aspect vn+1 (their difference is greater than δ1), we output the top n aspects directly. Otherwise, for all the aspects whose values are either the same or not significantly worse than vn, their ranks will be determined by the trait-based linear regression models. Moreover, after re-ranking relevant aspects based on the predicted ranks from the regression models, if the predicted rank of the n-th aspect (rn) is significantly better than that of the (n+1)-th aspect rn+1 (the rank difference is greater than δ2), we just output the top n aspects in this list. Otherwise, for those aspects whose ranks predicted by the linear regression models are not significantly lower than rn, we use the interaction rules discovered in Section 5.3 to adjust their ranking scores (increase the rank by δ2 if “Important”, decrease by δ2 if “Not-Important”). For each aspect, if more than one interaction rule applies, more accurate rules take precedence over less accurate rules. Finally, the system will output top n aspects in the final list. Figure 2 shows an example. In this example, we assume n=3, δ1=1 and δ2=0.5. We first sorted all the aspects based on their values. Since the values of “Fuel Economy” and “Luxury” are significantly better than the 3rd-ranked aspect “Price”, their ranks are not affected by personalized aspect selection. Similarly, since the values of “Performance” and “Style” are significantly lower than that of the 3rd-ranked aspect, their ranks are also not affected. Since the value differences among the rest 4 aspects, “Price”, “Durability”, “Quality” and “Safety” are all equal or not significant worse than v3, we used trait-based personalized ranks from the regression models to re-rank them (the output ranks from the regression models are shown in the parentheses in the column “Regression-based Re-Ranking”). After re-ranking these aspects based on the predicted ranks, since the rank of the 3rd-ranked aspect “Price” (2.2) and that of “Safety” (2.5) is within δ2, we use the learned interaction rules to adjust their ranks. Since the predicted ranks of “Durability” and “Quality” are much worse than that of “Price”, their ranks are not af-\nfected by the interaction rules. To apply the interaction rules, assume for a given receiver, both his extraversion and neuroticism scores are much higher than the population average, the Safety-1, Quality1 and Performance-1 rules are applicable. Since the Safety-1 rule predicts that “Safety” is “Important” to the receiver while none of the rules affects “Price”, the predicted rank for “Safety” is increased by 0.5. After this adjustment, the ranks of all the aspects are shown in the “Final Rank” column. The top 3 aspects based on the final ranks are selected as the output (marked with a *).\nTo evaluate the performance of the cascade content selection model, we conducted an additional AMT study. Given the specifications of the ten cars in Task1, we asked each AMT participant to select the top-n aspects to emphasize. Here n=1 and 3. In this task, aspect selection not only depends on the importance of an aspect to a receiver, but also the values of the aspects of a given car. We also acquired the personality and value scores of each Turker based on the IPIP personality and PVQ value survey. Finally, we compared the output of our model with the aspects selected by the Turkers. We used top-n overlapping percentage as the evaluation metrics. Overall, we collected the aspect selection results from 38 Turkers, each on ten different cars. In total, we collected 380 data instances in our ground truth dataset. We have tested different δ1 and δ2, the best results were obtained when δ1 = 0 and δ2 = 0.5. We compared our model with a baseline which purely relies on the values of aspects to determine their ranks. If two or more aspects have the same value (e.g., the values of both “Price” and “Durability” are “3(Average)”, their ranks were determined randomly. Table 3 shows the evaluation results, which demonstrate a clear advantage of using the proposed cascade content-selection model. The Top-1 agreement is 62% for the cascade model ver-\nsus the baseline’s 54%. Similarly, if three aspects are needed in the output, the Top-3 agreement is 87% versus the baseline’s 46%. All the differences are statistically significant based on the paired-t test (p ≤ 0.05)."
    }, {
      "heading" : "7 Discussion: Domain Generalization",
      "text" : "In general, there are two main challenges in adapting a personalized content selection model trained in one domain to another domain: (1) adapting the data model from one domain (e.g., restaurant data) to another (e.g., movie data); (2) adapting a domain-specific user model (e.g., a user’ preferences of restaurant features such as ”cuisine type”) to a different domain (e.g., a user’s preferences of movie features such as ”movie genre”). Although our current model is trained in the automobile domain, we adopted a domain-independent user model motivated by psychological theories(e.g., personality and basic human values), instead of using domain-dependent user preference models (e.g, a user’s preferences of ”fuel economy”). This has made our work much more generalizable than systems that rely on domain-dependent user properties. Moreover, to make our current findings more generalizable, we can apply typical domain adaptation methods such as instance-based (Zadrozny, 2004) or feature-based transfer learning (John Blitzer and Pereira, 2006) to further adapt the current results."
    }, {
      "heading" : "8 Conclusions",
      "text" : "In this study, we analyzed the relationship between an individual’s traits and his/her perceived aspect importance. Our analysis has uncovered interesting patterns that can be used to automatically customize a message’s content to enhance its appeal to an individual. We also proposed a cascade content selection model to automatically incorporate the analysis results in automated persuasive message generation. Our evaluation results have demonstrated the effectiveness of this approach."
    } ],
    "references" : [ {
      "title" : "Framing traits: The role of personality in framing effects",
      "author" : [ "Kristen D Anderson" ],
      "venue" : null,
      "citeRegEx" : "Anderson.,? \\Q2010\\E",
      "shortCiteRegEx" : "Anderson.",
      "year" : 2010
    }, {
      "title" : "A new hedonic technique for estimating attribute demand: An application to the demand for automobile fuel efficiency",
      "author" : [ "Atkinson", "Halvorsen1984] Scott Atkinson", "Rovert Halvorsen" ],
      "venue" : "The Review of Economics and Statistics,",
      "citeRegEx" : "Atkinson et al\\.,? \\Q1984\\E",
      "shortCiteRegEx" : "Atkinson et al\\.",
      "year" : 1984
    }, {
      "title" : "A new approach to testing marginal productivity theory",
      "author" : [ "Biewen", "Weiser2011] Martin Biewen", "Constantin Weiser" ],
      "venue" : null,
      "citeRegEx" : "Biewen et al\\.,? \\Q2011\\E",
      "shortCiteRegEx" : "Biewen et al\\.",
      "year" : 2011
    }, {
      "title" : "Integrating constraints and metric learning in semi-supervised clustering",
      "author" : [ "Sugato Basu", "Raymond J Mooney" ],
      "venue" : "In Proceedings of the twenty-first international conference on Machine learning,",
      "citeRegEx" : "Bilenko et al\\.,? \\Q2004\\E",
      "shortCiteRegEx" : "Bilenko et al\\.",
      "year" : 2004
    }, {
      "title" : "Consumers’ use of persuasion knowledge: The effects of accessibility and cognitive capacity on perceptions of an influence agent",
      "author" : [ "Campbell", "Kirmani2000] Margaret C Campbell", "Amna Kirmani" ],
      "venue" : "journal of Consumer Research,",
      "citeRegEx" : "Campbell et al\\.,? \\Q2000\\E",
      "shortCiteRegEx" : "Campbell et al\\.",
      "year" : 2000
    }, {
      "title" : "Relationships between personality and interactions in facebook",
      "author" : [ "Celli", "Polonio2013] Fabio Celli", "Luca Polonio" ],
      "venue" : "Social Networking: Recent Trends, Emerging Issues and Future Outlook,",
      "citeRegEx" : "Celli et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Celli et al\\.",
      "year" : 2013
    }, {
      "title" : "Understanding individuals’ personal values from social media word use",
      "author" : [ "Chen et al.2014] Jilin Chen", "Gary Hsieh", "Jalal U Mahmud", "Jeffrey Nichols" ],
      "venue" : "In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing,",
      "citeRegEx" : "Chen et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Chen et al\\.",
      "year" : 2014
    }, {
      "title" : "Maternal psychopathology and infant development at 18 months: the impact of maternal personality disorder",
      "author" : [ "Conroy et al.2012] Susan Conroy", "Carmine M Pariante", "Maureen N Marks", "Helen A Davies", "Simone Farrelly", "Robin Schacht", "Paul Moran" ],
      "venue" : null,
      "citeRegEx" : "Conroy et al\\.,? \\Q2012\\E",
      "shortCiteRegEx" : "Conroy et al\\.",
      "year" : 2012
    }, {
      "title" : "The psychology of tailoring-ingredients in computer-tailored persuasion",
      "author" : [ "Arie Dijkstra" ],
      "venue" : "Social and personality psychology compass,",
      "citeRegEx" : "Dijkstra.,? \\Q2008\\E",
      "shortCiteRegEx" : "Dijkstra.",
      "year" : 2008
    }, {
      "title" : "Speak no evil: targeting a population’s neutrality to defeat an insurgency. Parameters: The US Army War College Quarterly, Summer",
      "author" : [ "Christopher M Ford" ],
      "venue" : null,
      "citeRegEx" : "Ford.,? \\Q2005\\E",
      "shortCiteRegEx" : "Ford.",
      "year" : 2005
    }, {
      "title" : "Perceptions of alignment and personality in generated dialogue",
      "author" : [ "Gill et al.2012] Alastair J Gill", "Carsten Brockmann", "Jon Oberlander" ],
      "venue" : "In Proceedings of the Seventh International Natural Language Generation Conference,",
      "citeRegEx" : "Gill et al\\.,? \\Q2012\\E",
      "shortCiteRegEx" : "Gill et al\\.",
      "year" : 2012
    }, {
      "title" : "The structure of phenotypic personality traits",
      "author" : [ "Lewis R. Goldberg" ],
      "venue" : null,
      "citeRegEx" : "Goldberg.,? \\Q1993\\E",
      "shortCiteRegEx" : "Goldberg.",
      "year" : 1993
    }, {
      "title" : "The moderating effects of message framing and source credibility on the priceperceived risk relationship",
      "author" : [ "Grewal et al.1994] Dhruv Grewal", "Jerry Gotlieb", "Howard Marmorstein" ],
      "venue" : "Journal of consumer research,",
      "citeRegEx" : "Grewal et al\\.,? \\Q1994\\E",
      "shortCiteRegEx" : "Grewal et al\\.",
      "year" : 1994
    }, {
      "title" : "Approaches to verbal persuasion in intelligent user",
      "author" : [ "Oliviero Stock", "Massimo Zancanaro", "Daniel J OKeefe", "Irene Mazzotta", "Fiorella de Rosis", "Isabella Poggi", "Meiyii Y Lim", "Ruth Aylett" ],
      "venue" : null,
      "citeRegEx" : "Guerini et al\\.,? \\Q2011\\E",
      "shortCiteRegEx" : "Guerini et al\\.",
      "year" : 2011
    }, {
      "title" : "Persuasion and culture: Advertising appeals in individualistic and collectivistic societies",
      "author" : [ "Han", "Shavitt1994] Sang-Pil Han", "Sharon Shavitt" ],
      "venue" : "Journal of experimental social psychology,",
      "citeRegEx" : "Han et al\\.,? \\Q1994\\E",
      "shortCiteRegEx" : "Han et al\\.",
      "year" : 1994
    }, {
      "title" : "Personalized persuasion tailoring persuasive appeals to recipients personality traits",
      "author" : [ "Hirsh et al.2012] Jacob B Hirsh", "Sonia K Kang", "Galen V Bodenhausen" ],
      "venue" : "Psychological science,",
      "citeRegEx" : "Hirsh et al\\.,? \\Q2012\\E",
      "shortCiteRegEx" : "Hirsh et al\\.",
      "year" : 2012
    }, {
      "title" : "Communication and persuasion; psychological studies of opinion change",
      "author" : [ "Irving L Janis", "Harold H Kelley" ],
      "venue" : null,
      "citeRegEx" : "Hovland et al\\.,? \\Q1953\\E",
      "shortCiteRegEx" : "Hovland et al\\.",
      "year" : 1953
    }, {
      "title" : "Issue framing and public opinion on government spending",
      "author" : [ "William G Jacoby" ],
      "venue" : "American Journal of Political Science,",
      "citeRegEx" : "Jacoby.,? \\Q2000\\E",
      "shortCiteRegEx" : "Jacoby.",
      "year" : 2000
    }, {
      "title" : "Domain adaptation with structural correspondence learning",
      "author" : [ "McDonald John Blitzer", "Fernando Pereira." ],
      "venue" : "EMNLP, pages 120–128.",
      "citeRegEx" : "Blitzer and Pereira.,? 2006",
      "shortCiteRegEx" : "Blitzer and Pereira.",
      "year" : 2006
    }, {
      "title" : "Goal seeker and persuasion sentry: How consumer targets respond to interpersonal marketing persuasion",
      "author" : [ "Kirmani", "Campbell2004] Amna Kirmani", "Margaret C Campbell" ],
      "venue" : "Journal of Consumer Research,",
      "citeRegEx" : "Kirmani et al\\.,? \\Q2004\\E",
      "shortCiteRegEx" : "Kirmani et al\\.",
      "year" : 2004
    }, {
      "title" : "The influence of message framing and issue involvement",
      "author" : [ "Maheswaran", "Joan Meyers-Levy" ],
      "venue" : "Journal of Marketing research,",
      "citeRegEx" : "Maheswaran et al\\.,? \\Q1990\\E",
      "shortCiteRegEx" : "Maheswaran et al\\.",
      "year" : 1990
    }, {
      "title" : "An expert system for multi-criteria decision making using dempster shafer theory",
      "author" : [ "Malcolm Beynon", "David Marshall" ],
      "venue" : "Expert Systems with Applications,",
      "citeRegEx" : "Beynon et al\\.,? \\Q2001\\E",
      "shortCiteRegEx" : "Beynon et al\\.",
      "year" : 2001
    }, {
      "title" : "The effect of message framing on breast self-examination attitudes, intentions, and behavior",
      "author" : [ "Meyerowitz", "Chaiken1987] Beth E Meyerowitz", "Shelly Chaiken" ],
      "venue" : "Journal of personality and social psychology,",
      "citeRegEx" : "Meyerowitz et al\\.,? \\Q1987\\E",
      "shortCiteRegEx" : "Meyerowitz et al\\.",
      "year" : 1987
    }, {
      "title" : "Toward a psychology of framing effects",
      "author" : [ "Zoe M Oxley", "Rosalee A Clawson" ],
      "venue" : "Political behavior,",
      "citeRegEx" : "Nelson et al\\.,? \\Q1997\\E",
      "shortCiteRegEx" : "Nelson et al\\.",
      "year" : 1997
    }, {
      "title" : "Does tailoring matter? meta-analytic review of tailored print health behavior change interventions",
      "author" : [ "Noar et al.2007] Seth M Noar", "Christina N Benac", "Melissa S Harris" ],
      "venue" : "Psychological bulletin,",
      "citeRegEx" : "Noar et al\\.,? \\Q2007\\E",
      "shortCiteRegEx" : "Noar et al\\.",
      "year" : 2007
    }, {
      "title" : "The elaboration likelihood model of persuasion",
      "author" : [ "Petty", "Cacioppo1986] Richard E Petty", "John T Cacioppo" ],
      "venue" : null,
      "citeRegEx" : "Petty et al\\.,? \\Q1986\\E",
      "shortCiteRegEx" : "Petty et al\\.",
      "year" : 1986
    }, {
      "title" : "Building applied natural language generation systems",
      "author" : [ "Reiter", "Dale1997] Ehud Reiter", "Robert Dale" ],
      "venue" : "Natural Language Engineering,",
      "citeRegEx" : "Reiter et al\\.,? \\Q1997\\E",
      "shortCiteRegEx" : "Reiter et al\\.",
      "year" : 1997
    }, {
      "title" : "Lessons from a failure: Generating tailored smoking cessation letters",
      "author" : [ "Reiter et al.2003] Ehud Reiter", "Roma Robertson", "Liesl M Osman" ],
      "venue" : "Artificial Intelligence,",
      "citeRegEx" : "Reiter et al\\.,? \\Q2003\\E",
      "shortCiteRegEx" : "Reiter et al\\.",
      "year" : 2003
    }, {
      "title" : "A proposal for measuring value orientations across nations",
      "author" : [ "Shalom H Schwartz" ],
      "venue" : "Questionnaire Package of the European Social Survey,",
      "citeRegEx" : "Schwartz.,? \\Q2003\\E",
      "shortCiteRegEx" : "Schwartz.",
      "year" : 2003
    }, {
      "title" : "Message framing and persuasion: A message processing analysis",
      "author" : [ "Smith", "Petty1996] Stephen M Smith", "Richard E Petty" ],
      "venue" : "Personality and Social Psychology Bulletin,",
      "citeRegEx" : "Smith et al\\.,? \\Q1996\\E",
      "shortCiteRegEx" : "Smith et al\\.",
      "year" : 1996
    }, {
      "title" : "Resistance to persuasion: Inoculation theory in a marketing context",
      "author" : [ "Szybillo", "Heslin1973] George J Szybillo", "Richard Heslin" ],
      "venue" : "Journal of Marketing Research,",
      "citeRegEx" : "Szybillo et al\\.,? \\Q1973\\E",
      "shortCiteRegEx" : "Szybillo et al\\.",
      "year" : 1973
    }, {
      "title" : "The motivated processing of political arguments",
      "author" : [ "Damon Cann", "Simona" ],
      "venue" : "Kucsova",
      "citeRegEx" : "Taber et al\\.,? \\Q2009\\E",
      "shortCiteRegEx" : "Taber et al\\.",
      "year" : 2009
    }, {
      "title" : "The abbreviation of personality, or how to measure 200 personality scales with 200 items",
      "author" : [ "Tal Yarkoni" ],
      "venue" : "Journal of Research in Personality,",
      "citeRegEx" : "Yarkoni.,? \\Q2010\\E",
      "shortCiteRegEx" : "Yarkoni.",
      "year" : 2010
    }, {
      "title" : "Personality in 100,000 words: A large-scale analysis of personality and word use among bloggers",
      "author" : [ "Tal Yarkoni" ],
      "venue" : "Journal of research in personality,",
      "citeRegEx" : "Yarkoni.,? \\Q2010\\E",
      "shortCiteRegEx" : "Yarkoni.",
      "year" : 2010
    }, {
      "title" : "Learning and evaluating classifiers under sample selection bias",
      "author" : [ "Bianca Zadrozny" ],
      "venue" : "In ICML",
      "citeRegEx" : "Zadrozny.,? \\Q2004\\E",
      "shortCiteRegEx" : "Zadrozny.",
      "year" : 2004
    }, {
      "title" : "A simple theory of the survey response: Answering questions versus revealing preferences",
      "author" : [ "Zaller", "Feldman1992] John Zaller", "Stanley Feldman" ],
      "venue" : "American journal of political science,",
      "citeRegEx" : "Zaller et al\\.,? \\Q1992\\E",
      "shortCiteRegEx" : "Zaller et al\\.",
      "year" : 1992
    }, {
      "title" : "The nature and origins of mass opinion",
      "author" : [ "John Zaller" ],
      "venue" : null,
      "citeRegEx" : "Zaller.,? \\Q1992\\E",
      "shortCiteRegEx" : "Zaller.",
      "year" : 1992
    } ],
    "referenceMentions" : [ {
      "referenceID" : 9,
      "context" : "Marketing researchers are interested in applying theories of persuasion in promoting consumer products (Szybillo and Heslin, 1973; Han and Shavitt, 1994; Campbell and Kirmani, 2000; Kirmani and Campbell, 2004; Ford, 2005; Hirsh et al., 2012).",
      "startOffset" : 103,
      "endOffset" : 241
    }, {
      "referenceID" : 15,
      "context" : "Marketing researchers are interested in applying theories of persuasion in promoting consumer products (Szybillo and Heslin, 1973; Han and Shavitt, 1994; Campbell and Kirmani, 2000; Kirmani and Campbell, 2004; Ford, 2005; Hirsh et al., 2012).",
      "startOffset" : 103,
      "endOffset" : 241
    }, {
      "referenceID" : 13,
      "context" : "Natural Language Generation (NLG) researchers are interested in studying the relations between language usage and persuasion in order to build automated systems that produce persuasive messages (Guerini et al., 2011; Reiter et al., 2003).",
      "startOffset" : 194,
      "endOffset" : 237
    }, {
      "referenceID" : 27,
      "context" : "Natural Language Generation (NLG) researchers are interested in studying the relations between language usage and persuasion in order to build automated systems that produce persuasive messages (Guerini et al., 2011; Reiter et al., 2003).",
      "startOffset" : 194,
      "endOffset" : 237
    }, {
      "referenceID" : 24,
      "context" : "It is also generally believed that persuasion is more effective when it is custom-tailored to reflect the interests and concerns of the intended audience (Noar et al., 2007; Dijkstra, 2008; Hirsh et al., 2012).",
      "startOffset" : 154,
      "endOffset" : 209
    }, {
      "referenceID" : 8,
      "context" : "It is also generally believed that persuasion is more effective when it is custom-tailored to reflect the interests and concerns of the intended audience (Noar et al., 2007; Dijkstra, 2008; Hirsh et al., 2012).",
      "startOffset" : 154,
      "endOffset" : 209
    }, {
      "referenceID" : 15,
      "context" : "It is also generally believed that persuasion is more effective when it is custom-tailored to reflect the interests and concerns of the intended audience (Noar et al., 2007; Dijkstra, 2008; Hirsh et al., 2012).",
      "startOffset" : 154,
      "endOffset" : 209
    }, {
      "referenceID" : 12,
      "context" : "politicians, marketing executives, as well as public health advocators is content framing (Meyerowitz and Chaiken, 1987; Maheswaran and Meyers-Levy, 1990; Grewal et al., 1994; Rothman and Salovey, 1997).",
      "startOffset" : 90,
      "endOffset" : 202
    }, {
      "referenceID" : 36,
      "context" : "(Zaller, 1992; Zaller and Feldman, 1992) point out that framing essentially reorganizes information to increase accessibility of an issue dimension by highlighting one cogni-",
      "startOffset" : 0,
      "endOffset" : 40
    }, {
      "referenceID" : 23,
      "context" : "Others argue that the framing effect is due to a change in the rank order of the values associated with different aspects through the interaction with the content found within a message (Nelson et al., 1997; Chong and Druckman, 2007; Jacoby, 2000).",
      "startOffset" : 186,
      "endOffset" : 247
    }, {
      "referenceID" : 17,
      "context" : "Others argue that the framing effect is due to a change in the rank order of the values associated with different aspects through the interaction with the content found within a message (Nelson et al., 1997; Chong and Druckman, 2007; Jacoby, 2000).",
      "startOffset" : 186,
      "endOffset" : 247
    }, {
      "referenceID" : 0,
      "context" : "For example, (Anderson, 2010) states that people with prior attitudes toward an issue can be influ-",
      "startOffset" : 13,
      "endOffset" : 29
    }, {
      "referenceID" : 31,
      "context" : "(Taber et al., 2009) did not find a framing effect for those with strong values associated with the issue prior to exposure to the frame.",
      "startOffset" : 0,
      "endOffset" : 20
    }, {
      "referenceID" : 7,
      "context" : "In a separate study, (Conroy et al., 2012) found that certain personality traits, particularly openness, agreeableness, and conscientiousness mediate framing effects when participants were presented",
      "startOffset" : 21,
      "endOffset" : 42
    }, {
      "referenceID" : 27,
      "context" : "based on responses to a four-page smoking questionnaire (Reiter et al., 2003); PERSIVAL customizes the content of search summaries based on its relevance to a given patient’s health record (McKeown et al.",
      "startOffset" : 56,
      "endOffset" : 77
    }, {
      "referenceID" : 10,
      "context" : "2011) and CRAG 2 (Gill et al., 2012) vary linguistic styles to project intended personality in spoken utterances.",
      "startOffset" : 17,
      "endOffset" : 36
    }, {
      "referenceID" : 11,
      "context" : "dividual characteristics, such as personality and individual motivations and beliefs, here we focus on two widely-accepted trait models in psychology: the Big5 personality model (Goldberg, 1993) and Schwartz’s basic human value model (Schwartz, 2003).",
      "startOffset" : 178,
      "endOffset" : 194
    }, {
      "referenceID" : 28,
      "context" : "dividual characteristics, such as personality and individual motivations and beliefs, here we focus on two widely-accepted trait models in psychology: the Big5 personality model (Goldberg, 1993) and Schwartz’s basic human value model (Schwartz, 2003).",
      "startOffset" : 234,
      "endOffset" : 250
    }, {
      "referenceID" : 28,
      "context" : "To acquire the personality and value traits of a person, traditionally, psychometric tests, such as the IPIP test for Big 5 personality (Yarkoni, 2010a) and the PVQ survey for values (Schwartz, 2003), were used.",
      "startOffset" : 183,
      "endOffset" : 199
    }, {
      "referenceID" : 6,
      "context" : "such as tweets, Facebook posts and blogs (Yarkoni, 2010b; Celli and Polonio, 2013; Chen et al., 2014).",
      "startOffset" : 41,
      "endOffset" : 101
    }, {
      "referenceID" : 11,
      "context" : "We used the 50-item IPIP survey (Goldberg, 1993) to obtain a Amazon Mechanical Turk worker (a.",
      "startOffset" : 32,
      "endOffset" : 48
    }, {
      "referenceID" : 28,
      "context" : "PVQ survey (Schwartz, 2003) to obtain his/her basic value scores.",
      "startOffset" : 11,
      "endOffset" : 27
    }, {
      "referenceID" : 15,
      "context" : "Although moderate personalization effects were found in previous framing research, only expertcrafted messages were used (Hirsh et al., 2012).",
      "startOffset" : 121,
      "endOffset" : 141
    }, {
      "referenceID" : 3,
      "context" : "We employed the Metric Pairwise Constrained KMeans algorithm (MPCKMEANS) (Bilenko et al., 2004) to incorporate the aspect preference homogeneity requirement.",
      "startOffset" : 73,
      "endOffset" : 95
    }, {
      "referenceID" : 34,
      "context" : "methods such as instance-based (Zadrozny, 2004) or feature-based transfer learning (John Blitzer and Pereira, 2006) to further adapt the current results.",
      "startOffset" : 31,
      "endOffset" : 47
    } ],
    "year" : 2016,
    "abstractText" : "In this paper, we present a study on personalized emphasis framing which can be used to tailor the content of a message to enhance its appeal to different individuals. With this framework, we directly model content selection decisions based on a set of psychologically-motivated domainindependent personal traits including personality (e.g., extraversion and conscientiousness) and basic human values (e.g., selftranscendence and hedonism). We also demonstrate how the analysis results can be used in automated personalized content selection for persuasive message generation.",
    "creator" : "LaTeX with hyperref package"
  }
}