{
  "name" : "1608.04917.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Cohesion and Coalition Formation in the European Parliament: Roll-Call Votes and Twitter Activities",
    "authors" : [ "Darko Cherepnalkoski", "Andreas Karpf", "Igor Mozetič", "Miha Grčar" ],
    "emails" : [ "Darko.Cherepnalkoski@ijs.si" ],
    "sections" : [ {
      "heading" : null,
      "text" : "ar X\niv :1\n60 8.\n04 91\n7v 1\n[ cs\n.C L\n] 1\n7 A\nug 2\nWe study the cohesion within and the coalitions between political groups in the Eighth European Parliament (2014–2019) by analyzing two entirely different aspects of the behavior of the Members of the European Parliament (MEPs) in the policy-making processes. On one hand, we analyze their co-voting patterns and, on the other, their retweeting behavior. We make use of two diverse datasets in the analysis. The first one is the roll-call vote dataset, where cohesion is regarded as the tendency to co-vote within a group, and a coalition is formed when the members of several groups exhibit a high degree of co-voting agreement on a subject. The second dataset comes from Twitter; it captures the retweeting (i.e., endorsing) behavior of the MEPs and implies cohesion (retweets within the same group) and coalitions (retweets between groups) from a completely different perspective.\nWe employ two different methodologies to analyze the cohesion and coalitions. The first one is based on Krippendorff’s Alpha reliability, used to measure the agreement between raters in data-analysis scenarios, and the second one is based on Exponential Random Graph Models, often used in social-network analysis. We give general insights into the cohesion of political groups in the European Parliament, explore whether coalitions are formed in the same way for different policy areas, and examine to what degree the retweeting behavior of MEPs corresponds to their co-voting patterns. A novel and interesting aspect of our work is the relationship between the co-voting and retweeting patterns."
    }, {
      "heading" : "1 Introduction",
      "text" : "Social-media activities often reflect phenomena that occur in other complex systems. By observing social networks and the content propagated through these networks, we can describe or even predict the interplay between the observed social-media activities and another complex system that is more difficult, if not impossible, to monitor. There are numerous studies reported in the literature that successfully correlate social-media activities to phenomena like election outcomes [1, 2] or stock-price movements [3, 4].\nIn this paper we study the cohesion and coalitions exhibited by political groups in the Eighth European Parliament (2014–2019). We analyze two entirely different aspects of how the Members of the European Parliament (MEPs) behave in policy-making processes. On one hand, we analyze their co-voting patterns and, on the other, their retweeting (i.e., endorsing) behavior.\nWe use two diverse datasets in the analysis: the roll-call votes and the Twitter data. A roll-call vote (RCV) is a vote in the parliament in which the names of the MEPs are recorded along with their votes. The RCV data is available as part of the minutes of the parliament’s plenary sessions. From this perspective, cohesion is seen as the tendency to co-vote (i.e., cast the same vote) within a group, and a coalition is formed when members of two or more groups exhibit a high degree of co-voting on a subject. The second dataset comes from Twitter. It captures the retweeting behavior of MEPs and implies cohesion (retweets within the same group) and coalitions (retweets between the groups) from a completely different perspective. With over 300 million monthly active users and 500 million tweets posted daily, Twitter is one of the most popular social networks. Twitter allows its users to post short messages (tweets) and to follow other users. A user who\nfollows another user is able to read his/her public tweets. Twitter also supports other types of interaction, such as user mentions, replies, and retweets. Of these, retweeting is the most important activity as it is used to share and endorse content created by other users. When a user retweets a tweet, the information about the original author as well as the tweet’s content are preserved, and the tweet is shared with the user’s followers. In general, users retweet content that they agree with and thus endorse the views expressed by the original tweeter.\nWe apply two different methodologies to analyze the cohesion and coalitions. The first one is based on Krippendorff’s Alpha coefficient [5], which is a measure of the agreement among observers, raters, or measuring instruments assigning values to items or phenomena. The second one is based on Exponential Random Graph Models (ERGM) [6]. In contrast to the former, ERGM is a network-based approach and is often used in social-network analyses. It can be employed to investigate to what degree certain factors, internal (e.g., node in- and out-degree) or external (e.g., political group membership), govern the network-generation process. Even though these two methodologies come with two different sets of techniques and are based on different assumptions, they provide consistent results.\nThe main contributions of this paper are as follows: (i) We give general insights into the cohesion of political groups in the Eighth European Parliament, both\noverall and across different policy areas. (ii) We explore whether coalitions are formed in the same way for different policy areas. (iii) We explore to what degree the retweeting behavior of MEPs corresponds to their co-voting patterns. (iv) We employ two statistically sound methodologies and examine the extent to which the results are sensitive to the choice of methodology. The most novel and interesting aspect of our work is the relationship between the co-voting and the retweeting patterns. The increased use of Twitter by MEPs on days with a roll-call vote session (see Fig 1) is an indicator that these two processes are related. In addition, the force-based layouts of the co-voting network and the retweet network reveal a very similar structure on the left-to-center side of the political spectrum (see Fig 2). They also show a discrepancy on the far-right side of the spectrum, which calls for a more detailed analysis."
    }, {
      "heading" : "1.1 Related work",
      "text" : "In this paper we study and relate two very different aspects of how MEPs behave in policy-making processes. First, we look at their co-voting behavior, and second, we examine their retweeting patterns. Thus, we draw related work from two different fields of science. On one hand, we look at how co-voting behavior is analyzed\nin the political-science literature and, on the other, we explore how Twitter is used to better understand political and policy-making processes. The latter has been more thoroughly explored in the field of data mining (specifically, text mining and network analysis).\nTo the best of our knowledge, this is the first paper that studies legislative behavior in the Eighth European Parliament. The legislative behavior of the previous parliaments was thoroughly studied by Hix, Attina, and others [7–12]. These studies found that voting behavior is determined to a large extent—and when viewed over time, increasingly so—by affiliation to a political group, as an organizational reflection of the ideological position. The authors found that the cohesion of political groups in the parliament has increased, while nationality has been less and less of a decisive factor [13]. The literature also reports that a split into political camps on the left and right of the political spectrum has recently replaced the ‘grand coalition’ between the two big blocks of Christian Conservatives (EPP) and Social Democrats (S&D) as the dominant form of finding majorities in the parliament. The authors conclude that coalitions are to a large extent formed along the left-to-right axis [13].\nIn this paper we analyze the roll-call vote data published in the minutes of the parliament’s plenary sessions. For a given subject, the data contains the vote of each MEP present at the respective sitting. The roll-call vote data has already been extensively studied by other authors, most notably by Hix et al. [11,12,14]. To be able to study the cohesion and coalitions, authors like Hix, Attina, and Rice [7, 14, 15] defined and employed a variety of agreement measures. The most prominent measure is the Agreement Index proposed by Hix et al. [14]. This measure computes the agreement score from the size of the majority class for a particular vote. The Agreement Index, however, exhibits two drawbacks: (i) it does not account for co-voting by chance, and (ii) without a proper adaptation, it does not accommodate the scenario in which the agreement is to be measured between two different political groups.\nWe employ two statistically sound methodologies developed in two different fields of science. The first one is based on Krippendorff’s Alpha [5]. Alpha is a measure of the agreement among observers, coders, or measuring instruments that assign values to items or phenomena. It compares the observed agreement to the agreement expected by chance. Alpha is used to measure the inter- and self-annotator agreement of human experts when labeling data, and the performance of classification models in machine-learning scenarios [16]. In addition to Alpha, we employ Exponential Random Graph Models (ERGM) [6]. In contrast to the former, ERGM is a network-based approach, often used in social-network analyses. ERGM can be employed to investigate how different network statistics or external factors govern the network-formation process.\nThe second important aspect of our study is related to analyzing the behavior of participants in social networks, specifically Twitter. Twitter is studied by researchers to better understand different political processes, and in some cases to predict their outcomes. Eom et al. [2] consider the number of tweets by a\nparty as a proxy for the collective attention to the party, explore the dynamics of the volume, and show that this quantity contains information about an election’s outcome. Other studies [17] reach similar conclusions. Conover et al. [18] predicted the political alignment of Twitter users in the run-up to the 2010 US elections based on content and network structure. They analyzed the polarization of the retweet and mention networks for the same elections [19]. Borondo et al. [20] analyzed user activity during the Spanish presidential elections. They additionally analyzed the 2012 Catalan elections, focusing on the interplay between the language and the community structure of the network [21]. Most existing research, as Larsson points out [22], focuses on the online behavior of leading political figures during election campaigns.\nThis paper continues our research on communities that MEPs (and their followers) form on Twitter [23]. The goal of our research was to evaluate the role of Twitter in identifying communities of influence when the actual communities are known. We represent the influence on Twitter by the number of retweets that MEPs “receive”. We construct two networks of influence: (i) core, which consists only of MEPs, and (ii) extended, which also involves their followers. We compare the detected communities in both networks to the groups formed by the political, country, and language membership of MEPs. The results show that the detected communities in the core network closely match the political groups, while the communities in the extended network correspond to the countries of residence. This provides empirical evidence that analyzing retweet networks can reveal real-world relationships and can be used to uncover hidden properties of the networks.\nLazer [24] highlights the importance of network-based approaches in political science in general by arguing that politics is a relational phenomenon at its core. Some researchers have adopted the network-based approach to investigate the structure of legislative work in the US Congress, including committee and sub-committee membership [25], bill co-sponsoring [26], and roll-call votes [27]. More recently, Dal Maso et al. [28] examined the community structure with respect to political coalitions and government structure in the Italian Parliament. Scherpereel et al. [29] examined the constituency, personal, and strategic characteristics of MEPs that influence their tweeting behavior. They suggested that Twitter’s characteristics, like immediacy, interactivity, spontaneity, personality, and informality, are likely to resonate with political parties across Europe. By fitting regression models, the authors find that MEPs from incohesive groups have a greater tendency to retweet.\nIn contrast to most of these studies, we focus on the Eighth European Parliament, and more importantly, we study and relate two entirely different behavioral aspects, co-voting and retweeting. The goal of this research is to better understand the cohesion and coalition formation processes in the European Parliament."
    }, {
      "heading" : "2 Results and Discussion",
      "text" : "In this section we provide an overview of the data and present the results on cohesion within and coalitions between the political groups in the European Parliament."
    }, {
      "heading" : "2.1 Data",
      "text" : "We collected the results of the roll-call votes (RCVs) from the website of the European Parliament [30]. The RCV data is available in the form of XMLs. From the same website, we also obtained the register of active MEPs [31]. This register, even though it is available as XML data, presents a challenge when integrated with the RCV documents. The reason lies in the IDs of MEPs in the registry, which differ from the IDs of the same MEPs in the RCV documents. We used a name-matching technique based on Jaccard distance to establish the missing mappings. Moreover, we linked each MEP to her/his Twitter ID and thus established an explicit link between the MEP and her/his tweeting activities.\nThe European Parliament consists of 751 members. Within the period of our study, from October 1, 2014 to February 29, 2016, 36 MEPs left the European Parliament and were substituted by 36 new MEPs. This gives a total of 787 MEPs that participated in the work of the parliament during this period. In total, 79% of the MEPs have Twitter accounts and 67% have retweeted or been retweeted by another MEP. The distribution of MEPs by political groups, with their Twitter accounts, and retweeting activity is given in Table 1.\nPolitical groups are ordered by their seating positions in the European Parliament, from the left to the right wing. On the left, there are the Nordic Greens (GUE-NGL) and the Social Democrats (S&D). On the\nTable 1. Distribution of Members of the European Parliament (MEPs) by political groups.\nThere is the number of MEPs in each group, the number of MEPs with Twitter accounts, and the number of MEPs in the retweet network.\nPolitical EP Twitter Nodes in the group seats accounts retweet network GUE-NGL 61 43 41 S&D 193 162 135 Greens-EFA 51 48 44 ALDE 77 62 54 EPP 223 166 141 ECR 82 64 48 EFDD 45 39 34 ENL 38 29 27 NI 17 9 6 Total 787 622 530\nright there are the conservatives (EPP and ECR), the right-wing populist groups (EFDD and ENL), and the non-aligned (Non-Inscrits NI ). The European Green Party (Greens-EFA) and liberal ALDE are placed between the left and right wings. A detailed description of all the political groups in the European Parliament is in “The European Parliament” section.\nIn the time frame of this study, the MEPs voted in 2535 roll-call votes. Of these, 2358 RCVs contain information about the policy area (referred to as subject in the RCV metadata) they are part of. The distribution of RCVs by policy area is given in Table 2.\nThe retweet network of the parliament consists of 530 nodes corresponding to the MEPs that are active on Twitter, and 4723 edges corresponding to the pairs of MEPs who have retweeted each other. The weight of the link between two MEPs represents the number of times these MEPs have retweeted each other. The total weight of edges in the network, corresponding to the total number of retweets between the MEPs, is 26133."
    }, {
      "heading" : "2.2 Cohesion of political groups",
      "text" : "In this section we first analyze the level of cohesion of the European Parliament’s groups by looking at co-voting as an agreement and network formation. Next, we explore two important policy areas, namely Economic and monetary system and State and evolution of the Union. Finally, we analyze the cohesion of the European Parliament’s groups on Twitter."
    }, {
      "heading" : "2.2.1 Co-voting cohesion",
      "text" : "Existing research by Hix et al. [11, 12, 14] shows that the cohesion of the European political groups has been rising since the 1990s, and the level of cohesion remained high even after the EU’s enlargement in 2004, when the number of MEPs increased from 626 to 732.\nWe measure the co-voting cohesion of the European Parliament’s groups in the Eighth European Parliament using Krippendorff’s Alpha—the results are shown in Fig 3 (panel Overall). The Greens-EFA have the highest cohesion of all groups. This finding is in line with an analysis of previous compositions of the Fifth and Sixth European Parliaments by Hix and Noury [12], and the Seventh by VoteWatch [32]. They are closely followed by the S&D and EPP. Hix and Noury reported on the high cohesion of S&D in the Fifth and Sixth European Parliaments, and we also observe this in the current composition. They also reported a slightly less cohesive EPP-ED. This group split in 2009 into EPP and ECR. VoteWatch reports EPP to have cohesion on a par with Greens-EFA and S&D in the Seventh European Parliament. The cohesion level we observe in the current European Parliament is also similar to the level of Greens-EFA and S&D.\nThe catch-all group of the non-aligned (NI ) comes out as the group with the lowest cohesion. In addition, among the least cohesive groups in the European Parliament are the Eurosceptics EFDD, which include the British UKIP led by Nigel Farage, and the ENL whose largest party are the French National Front, led by Marine Le Pen. Similarly, Hix and Noury found that the least cohesive groups in the Seventh European Parliament are the nationalists and Eurosceptics. The Eurosceptic IND/DEM, which participated in the Sixth European Parliament, transformed into the current EFDD, while the nationalistic UEN was dissolved in 2009.\nWe also measure the voting cohesion of the European Parliament groups using an ERGM, a network-based method—the results are shown in Fig 4 (panel Overall). The details of building the model are given in the “A network-based measure of co-voting” section. The cohesion results obtained with ERGM are comparable to the results based on agreement. In this context, the parameters estimated by the ERGM refer to the matching of MEPs who belong to the same political group (one parameter per group). The parameters measure the homophilous matching between MEPs who have the same political affiliation. A positive value for the estimated parameter indicates that the co-voting of MEPs from that group is greater than what is expected by chance, where the expected number of co-voting links by chance in a group is taken to be uniformly random.\nA negative value indicates that there are fewer co-voting links within a group than expected by chance. Even though Alpha and ERGM compute scores relative to what is expected by chance, they refer to different interpretations of chance. Alpha’s concept of chance is based on the number of expected pair-wise co-votes between MEPs belonging to a group, knowing the votes of these MEPs on all RCVs. ERGM’s concept of chance is based on the number of expected pair-wise co-votes between MEPs belonging to a group on a given RCV, knowing the network-related properties of the co-voting network on that particular RCV.\nAgain, Greens-EFA, S&D, and EPP exhibit the highest cohesion, even though their ranking is permuted when compared to the ranking obtained with Alpha . At the other end of the scale, we observe the same situation as with Alpha . The non-aligned members NI have the lowest cohesion, followed by EFDD and ENL.\nThe only place where the two methods disagree is the level of cohesion of GUE-NGL. The Alpha attributes GUE-NGL a rather high level of cohesion, on a par with ALDE, whereas the ERGM attributes them a much lower cohesion. This is the only discrepancy between the two methods, and we do not investigate it further.\nIn addition to the overall cohesion, we also focus on two selected policy areas. A detailed description of all the areas is in the “Roll-call voting in the European Parliament” section. The cohesion of the political groups related to these two policy areas is shown in the first two panels in Fig 3 (Alpha) and Fig 4 (ERGM).\nThe most important observation is that the level of cohesion of the political groups is very stable across different policy areas. These results are corroborated by both methodologies. Similar to the overall cohesion, the most cohesive political groups are the S&D, Greens-EFA, and EPP. The least cohesive group is the NI, followed by the ENL and EFDD. The two methodologies agree on the level of cohesion for all the political groups, except for GUE-NGL."
    }, {
      "heading" : "2.2.2 Cohesion on Twitter",
      "text" : "We determine the cohesion of political groups on Twitter by using the average number of retweets between MEPs within the same group. The results are shown in Fig 5. The right-wing ENL and EFDD come out as the most cohesive groups, with an average of over 230 retweets. All the other groups have a far lower average number of retweets, in the range between 46 and 91. MEPs from ENL and EFDD post by far the largest number of retweets (over 240), and at the same time over 94% of their retweets are directed to MEPs from the same group. Moreover, these two groups stand out in the way the retweets are distributed within the group. A large portion of the retweets of EFDD (1755) go to Nigel Farage, the leader of the group. Likewise, a very\nlarge portion of retweets of ENL (2324) go to Marine Le Pen, the leader of the group. Farage and Le Pen are by far the two most retweeted MEPs, with the third one having 666 retweets.\nThese results are in contrast to the observed voting cohesion of the political groups. When it comes to voting, these groups are, after NI, the least cohesive groups. This shows that these groups do not have a unifying platform across all policy areas, which is reflected in their low voting cohesion, but they clearly have a set of issues on which they have common opinion and they pursue these issues on social media."
    }, {
      "heading" : "2.3 Coalitions in the European Parliament",
      "text" : "Coalition formation in the European Parliament is largely determined by ideological positions, reflected in the degree of cooperation of parties at the national and European levels. The observation of ideological inclinations in the coalition formation within the European Parliament was already made by other authors [12] and is confirmed in this study. The basic patterns of coalition formation in the European Parliament can already be seen in the co-voting network in Fig 2A. It is remarkable that the degree of attachment between the European political groups, which indicates the degree of cooperation in the European Parliament, nearly exactly corresponds to the seating order. In line with Western parliamentary traditions, political groups in the European Parliament are seated from the Nordic Greens (GUE-NGL) and the Social Democrats (S&D) on the left, to the conservative and right-wing populist groups (EPP, ECR, EFDD, ENL, and NI ) on the right.\nLooking at the degree of cooperation between the different groups, the liberal ALDE seems to have an intermediator role between the left and right parts of the spectrum in the parliament. Between the extreme (GUE-NGL) and center left (S&D) groups, this function seems to be occupied by the European Green Party (Greens-EFA). The non-aligned members of the European Parliament, as well as the Eurosceptic EFFD and ENL, seem to alternately tip the balance on both poles of the political spectrum. Being ideologically more inclined to vote with other conservative and right-wing groups (EPP, ECR), they sometimes also cooperate with the extreme left-wing group (GUE-NGL) with which they share their Euroscepticism as a common denominator."
    }, {
      "heading" : "2.3.1 Co-voting coalitions",
      "text" : "Figs 6 and 7 give a more detailed understanding of the coalition formation in the European Parliament. Fig 6 displays the degree of agreement or cooperation between political groups measured by Krippendorff’s Alpha , whereas Fig 7 is based on the result from the ERGM. We first focus on the overall results displayed in the right-hand plots of Figs 6 and 7.\nThe strongest degrees of cooperation are observed, with both methods, between the two major parties (EPP and S&D) on the one hand, and the liberal ALDE on the other. Furthermore, we see a strong propensity for the Greens to vote with the Social Democrats (5th strongest coalition by Alpha, and 3rd by ERGM) and the Nordic Greens (GUE-NGL) (3rd strongest coalition by Alpha, and 5th by ERGM). These results underline the role of ALDE and Greens-EFA as intermediaries for the larger groups to achieve a majority. Although the two largest groups together have 405 seats and thus significantly more than the 376 votes needed for a simple majority, the degree of cooperation between the two major groups is ranked only as the fourth strongest by both methods. This suggests that these two political groups find it easier to negotiate deals with smaller counterparts than with the other large group. This observation was also made by Hix et al. [13], who noted that alignments on the left and right of the political spectrum have in recent years replaced the “Grand Coalition” between the two large blocks of Christian Conservatives (EPP) and Social Democrats (S&D) as the dominant form of finding majorities in the parliament.\nA )* + ,"
    }, {
      "heading" : "2.3.2 Coalitions within individual policy areas",
      "text" : "Next, we focus on the coalition formation within the two selected policy areas. The area State and Evolution of the Union is dominated by cooperation between the two major groups, S&D and EPP, as well as ALDE. Furthermore, we observe a high degree of cooperation between groups that are generally regarded as integration friendly, like Greens-EFA and GUE-NGL. We also see, particularly in Fig 6, a relatively high degree of cooperation between groups considered as Eurosceptic, like ECR, EFFD, ENL, and the group of non-aligned members.\nThe dichotomy between supporters and opponents of European integration is even more pronounced within the policy area Economic and Monetary System. In fact, we are taking a closer look specifically at these two\nareas as they are, at the same time, both controversial and of high significance. Our results reflect how contentious this area is. Again, both methods rank the cooperation between S&D and EPP on the one hand, and ALDE on the other, as the strongest.\nWe also observe a certain degree of unanimity among the eurosceptic and right-wing groups (EFDD, ENL, and NI ) in this policy area. This seems plausible, as these groups were (especially in the aftermath of the global financial crisis and the subsequent European debt crisis) in fierce opposition to further payments to financially troubled Member States. However, we also observe a number of strong coalitions that might, at first glance, seem unusual, specifically involving the left-wing group GUE-NGL on the one hand, and the right-wing EFDD, ENL, and NI on the other. These links also show up in the network plot in Fig 2A. This might be attributable to a certain degree of Euroscepticism on both sides: rooted in criticism of capitalism on the left, and at least partly a raison d’être on the right. Hix et al. [12, p. 168] discovered this pattern as well, and proposed an additional explanation—these coalitions also relate to a form of government-opposition dynamic that is rooted at the national level, but is reflected in voting patterns at the European level."
    }, {
      "heading" : "2.3.3 Coalitions on Twitter",
      "text" : "The first insight into coalition formation on Twitter can be observed in the retweet network in Fig 2B. The ideological left to right alignment of the political groups is reflected in the retweet network. Fig 8 shows the strength of the coalitions on Twitter, as estimated by the number of retweets between MEPs from different groups. The strongest coalitions are formed between the right-wing groups EFDD and ECR, as well as ENL and NI. At first, this might come as a surprise, since these groups do not form strong coalitions in the European Parliament, as can be seen in Figs 6 and 7. On the other hand, the MEPs from these groups are very active Twitter users. As previously stated, MEPs from ENL and EFDD post the largest number of retweets. Moreover, 63% of the retweets outside of ENL are retweets of NI. This effect is even more pronounced with MEPs from EFDD, whose retweets of ECR account for 74% of their retweets from other groups.\nIn addition to these strong coalitions on the right wing, we find coalition patterns to be very similar to the voting coalitions observed in the European Parliament, seen in Figs 6 and 7. The strongest coalitions, which come immediately after the right-wing coalitions, are between Greens-EFA on the one hand, and GUE-NGL and S&D on the other, as well as ALDE on the one hand, and EPP and S&D on the other. These results\ncorroborate the role of ALDE and Greens-EFA as intermediaries in the European Parliament, not only in the legislative process, but also in the debate on social media."
    }, {
      "heading" : "2.3.4 Formation of coalitions",
      "text" : "To better understand the formation of coalitions in the European Parliament and on Twitter, we examine the strongest cooperation between political groups at three different thresholds. For co-voting coalitions in the European Parliament we choose a high threshold of Alpha > 0.75, a medium threshold of Alpha > 0.25, and a negative threshold of Alpha < −0.25 (which corresponds to strong oppositions). In this way we observe the overall patterns of coalition and opposition formation in the European Parliament and in the two specific policy areas. For cooperation on Twitter, we choose a high threshold of RT > 10, a medium threshold of RT > 1, and a very low threshold of RT < 0.001.\nThe strongest cooperations in the European Parliament over all policy areas are shown in Fig 9G. It comes as no surprise that the strongest cooperations are within the groups (in the diagonal). Moreover, we again observe GUE-NGL, S&D, Greens-EFA, ALDE, and EPP as the most cohesive groups. In Fig 9H, we observe coalitions forming along the diagonal, which represents the seating order in the European Parliament. Within this pattern, we observe four blocks of coalitions: on the left, between GUE-NGL, S&D, and Greens-EFA; in the center, between S&D, Greens-EFA, ALDE, and EPP ; on the right-center between ALDE, EPP, and ECR; and finally, on the far-right between ECR, EFDD, ENL, and NI. Fig 9I shows the strongest opposition between groups that systematically disagree in voting. The strongest disagreements are between left- and right-aligned groups, but not between the left-most and right-most groups. In particular, between GUE-NGL and ECR, but also between S&D and Greens-EFA on one side, and ENL and NI on the other.\nIn the area of Economic and monetary system we see a strong cooperation between EPP and S&D (Fig 9A), which is on a par with the cohesion of the most cohesive groups (GUE-NGL, S&D, Greens-EFA, ALDE, and EPP), and is above the cohesion of the other groups. As pointed out in the section “Coalitions within individual policy areas”, there is a strong separation in two blocks between supporters and opponents of European integration, which is even more clearly observed in Fig 9B. On one hand, we observe cooperation between S&D, ALDE, EPP, and ECR, and on the other, cooperation between GUE-NGL, Greens-EFA, EFDD, ENL, and NI. This division in blocks is seen again in Fig 9C, which shows the strongest\nc d e 4 f g h 8 i\nj k l 4 m n o 8 p\nq r s 4 t u v 8 w\nx z { 4 | } ~ 8\n4\n8\n4 8\n4\n8\n4 8\n4\n  ¡ 8 ¢\n£ ¤ ¥ 4 ¦ § ¨ 8 ©\nª « ¬ 4  ® ¯ 8 °\n± ² ³ 4 ´ µ ¶ 8 ·\n¸ ¹ º 4 » ¼ ½ 8 ¾\n¿ À Á 4 Â Ã Ä 8 Å\nÆ Ç È 4 É Ê Ë 8 Ì\nÍ Î Ï 4 Ð Ñ Ò 8 Ó\nÔ Õ Ö 4 × Ø Ù 8 Ú\nÛ Ü Ý 4 Þ ß à 8 á\nâ ã ä 4 å æ ç 8 è\né ê ë 4 ì í î 8 ï\nð ñ ò 4 ó ô õ 8 ö\n÷ ø ù 4 ú û ü 8 ý\nþ ÿ 3 4 5 6 7 8 9\n1 2 4 8\n(A) Alpha > 0.75 (B) Alpha > 0.25 (C) Alpha < -0.25\n(D) Alpha > 0.75 (E) Alpha > 0.25 (F) Alpha < -0.25\n(G) Alpha > 0.75 (H) Alpha > 0.25 (I) Alpha < -0.25\n(J) RT > 10 (K) RT > 1 (L) RT < 0.001\nG L\nS&D\nA\n4 ALDE\nEPP\nECR\nEFDD\n8 ENL\nNI\nRCV Economic and monetary system\nRCV State and evolution of the Union\nRCV All policy areas\nTwitter All policy areas\nFig 9. Formation of coalitions (Alpha > 0) and oppositions (Alpha < 0) in terms of the co-voting agreement. In the case of Twitter, coalitions are indicated by higher average retweets (RT ), and oppositions by lower average retweets.\ndisagreements. Here, we observe two blocks composed of S&D, EPP, and ALDE on one hand, and GUE-NGL, EFDD, ENL, and NI on the other, which are in strong opposition to each other.\nIn the area of State and Evolution of the Union we again observe a strong division in two blocks, Fig 9E.\nUnlike the Economic and monetary system, however, where we observe a far-left and far-right cooperation, where the division is along the traditional left-right axis.\nThe patterns of coalitions forming on Twitter closely resemble those in the European Parliament. In Fig 9J we see that the strongest degrees of cooperation on Twitter are within the groups. The only group with low cohesion is the NI, whose members have only seven retweets between them. The coalitions on Twitter follow the seating order in the European Parliament remarkably well, Fig 9K. What is striking is that the same blocks form on the left, center, and on the center-right, both in the European Parliament and on Twitter. The biggest difference between the coalitions in the European Parliament and on Twitter is on the far-right, where we observe ENL and NI as isolated blocks."
    }, {
      "heading" : "2.3.5 Relation between co-voting and retweeting",
      "text" : "The results shown in Fig 10 quantify the extent to which communication in one social context (Twitter) can explain cooperation in another social context (co-voting in the European Parliament). A positive value indicates that the matching behavior in the retweet network is similar to the one in the co-voting network, specific for an individual policy area. On the other hand, a negative value implies a negative “correlation” between the retweeting and co-voting of MEPs in the two different contexts.\nThe bars in Fig 10 correspond to the coefficients from the edge covariate terms of the ERGM, describing the relationship between the retweeting and co-voting behavior of MEPs. The coefficients are aggregated for individual policy areas by means of a meta-analysis. A detailed description of the methodology is in the section “A network-based measure of co-voting”.\nOverall, we observe a positive correlation between retweeting and co-voting, which is significantly different from zero. The strongest positive correlations are in the areas Area of freedom, security and justice, External relations of the Union, and Internal markets. Weaker, but still positive, correlations are observed in the areas Economic, social and territorial cohesion, European citizenship, and State and evolution of the Union. The only exception, with a significantly negative coefficient, is the area Economic and monetary system. This implies that in the area Economic and monetary system we observe a significant deviation from the usual co-voting patterns. Recalling the results from section “Coalitions within individual policy areas”, we see that\nthis is indeed the case. Especially noteworthy are the coalitions between GUE-NGL and Greens-EFA on the left wing, and EFDD and ENL on the right wing. In the section “Coalitions within individual policy areas” we interpret these results as a combination of Euroscepticism on both sides, motivated on the left by a skeptical attitude towards the market orientation of the EU, and on the right by a reluctance to give up national sovereignty."
    }, {
      "heading" : "3 Conclusions",
      "text" : "We study cohesion and coalitions in the Eighth European Parliament by analyzing, on one hand, MEPs’ co-voting tendencies and, on the other, their retweeting behavior.\nWe reveal that the most cohesive political group in the European Parliament, when it comes to co-voting, is Greens-EFA, closely followed by S&D and EPP. This is consistent with what VoteWatch [32] reported for the Seventh European Parliament. The non-aligned (NI ) come out as the least cohesive group, followed by the Eurosceptic EFDD. Hix and Noury [12] also report that nationalists and Eurosceptics form the least cohesive groups in the Sixth European Parliament. We reaffirm most of these results with both of the two employed methodologies. The only point where the two methodologies disagree is in the level of cohesion for the left-wing GUE-NGL, which is portrayed by ERGM as a much less cohesive group. The reason for this needs to be further investigated. The level of cohesion of the political groups is quite stable across different policy areas and similar conclusions apply.\nOn Twitter we can see results that are consistent with the RCV results for the left-to-center political spectrum. The exception, which clearly stands out, is the right-wing groups ENL and EFDD that seem to be the most cohesive ones. This is the direct opposite of what was observed in the RCV data. We speculate that this phenomenon is the result of a well-designed propaganda apparatus that the right-wing leaders (Nigel Farage and Marine Le Pen) put in place to spread their anti-EU messages across social media. We observed the same phenomenon recently during the Brexit campaign [33]. We speculate that Brexit was “won” to some extent due to this apparatus, which is practically non-existent among the pro-EU political groups. The fact that ENL and EFDD are the least cohesive groups in the European Parliament can be attributed to their political focus. It seems more important for the group to agree on its anti-EU stance and to call for independence and sovereignty, and much less important to agree on other issues put forward in the parliament.\nThe basic pattern of coalition formation, with respect to co-voting, can already be seen in Fig 2A: the force-based layout almost completely corresponds to the seating order in the European Parliament (from the left- to the right-wing groups). A more thorough examination shows that the strongest cooperation can be observed, for both methodologies, between EPP, S&D, and ALDE, where EPP and S&D are the two largest groups, while the liberal ALDE plays the role of an intermediary in this context. On the other hand, the role of an intermediary between the far-left GUE-NGL and its center-left neighbor, S&D, is played by the European Green Party (Greens-EFA). These three parties also form a strong coalition in the European Parliament. On the far right of the spectrum, the non-aligned, EFDD, and ENL form another coalition. This behavior was also observed by Hix et al. [13], stating that alignments on the left and right have in recent years replaced the “Grand Coalition” between the two large blocks of Christian Conservatives (EPP) and Social Democrats (S&D) as the dominant form of finding majorities in the European Parliament. When looking at the policy area Economic and monetary system, we see the same coalitions. However, interestingly, EFDD, ENL, and NI often co-vote with the far-left GUE-NGL. This can be attributed to a certain degree of Euroscepticism on both sides: as a criticism of capitalism, on one hand, and as the main political agenda, on the other. This pattern was also discovered by Hix et al. [13], who argued that these coalitions emerge from a form of government-opposition dynamics, rooted at the national level, but also reflected at the European level.\nWhen studying coalitions on Twitter, the strongest coalitions can be observed on the right of the spectrum (between EFDD, ECR, ENL, and NI ). This is, yet again, in contrast to what was observed in the RCV data. The reason lies in the anti-EU messages they tend to collectively spread (retweet) across the network. This behavior forms strong retweet ties, not only within, but also between, these groups. For example, MEPs of EFDD mainly retweet MEPs from ECR (with the exception of MEPs from their own group). In contrast to these right-wing coalitions, we find the other coalitions to be consistent with what is observed in the RCV data. The strongest coalitions on the left-to-center part of the axis are those between GUE-NGL, Greens-EFA,\nand S&D, and between S&D, ALDE, and EPP. These results reaffirm the role of Greens-EFA and ALDE as intermediaries, not only in the European Parliament but also in the debates on social media.\nLast, but not least, with the ERGM methodology we measure the extent to which the retweet network can explain the co-voting activities in the European Parliament. We compute this for each policy area separately and also over all RCVs. We conclude that the retweet network indeed matches the co-voting behavior, with the exception of one specific policy area. In the area Economic and monetary system, the links in the (overall) retweet network do not match the links in the co-voting network. Moreover, the negative coefficients imply a radically different formation of coalitions in the European Parliament. This is consistent with our results in Figs 6 and 7, and is also observed in Fig 9. From these figures we see that in this particular case, the coalitions are also formed between the right-wing groups and the far-left GUE-NGL. As already explained, we attribute this to the degree of Euroscepticism that these groups share on this policy issue."
    }, {
      "heading" : "4 Background and Methods",
      "text" : ""
    }, {
      "heading" : "4.1 Data availability",
      "text" : "All the data about the roll-call votes and retweets of the Members of the Eighth European Parliament are available in a public language resource repository CLARIN.SI at http://hdl.handle.net/11356/1071."
    }, {
      "heading" : "4.2 The European Parliament",
      "text" : ""
    }, {
      "heading" : "4.2.1 Historical and legal framework",
      "text" : "The European Parliament is the only directly elected institution on the supranational level of the European Union. It occupies the legislative function in the political system of the EU. Since 1976 it is elected every 5 years by universal suffrage, which extends to every citizen of the EU, regardless of their country of residence. The parliament currently has 751 members, representing roughly 500 million citizens, corresponding to an electorate of roughly 375 million. The electorate is, in terms of size, second only to India. It is the largest supranational parliamentary body in the world [34].\nAlthough the European Parliament for a long time had the reputation of being a toothless institution, its competences were successively extended in the recent years. The most important treaties in this respect were the Maastricht Treaty of 1993 and the Lisbon Treaty of 2009. The former granted the parliament veto rights for legislation coming from the council, putting it at eye level in the legislative procedure. The latter extended its competences to crucial policy areas, such as agriculture, immigration as well justice and internal affairs. Furthermore, the European Parliament now has the final word on the EU budget and has to approve the conclusion of international treaties, like trade agreements, in which the EU is a party [35, 36]. Since 2014 the parliament also has the right to nominate the head of the European Commission, which is considered to be the executive branch of the European political system [37].\nThe elections for the European Parliament are organized at the national level. Voters elect, depending on their country of residence, a national political group or list. The numbers of MEPs of each member state is roughly proportional to its population. Although larger countries in terms of population have more MEPs than smaller countries, the number of MEPs per inhabitant is higher for smaller countries. For example, while Germany, the most populous country elects 96 MEPs to the European Parliament, smaller countries like Slovenia or Luxembourg have 6 MEPs each. Along the definition of universal suffrage, European elections are therefore considered to be “free”, “direct” and “secret”; however, they are not considered “equal”. Since 2004 the electoral rules for European elections prescribe proportional representation for the elected MEPs [37, 38]."
    }, {
      "heading" : "4.2.2 Political groups in the Eighth European Parliament",
      "text" : "The voting data analyzed in this study corresponds to all 2535 roll-call votes conducted during the 8th European Parliament up to the end of February 2016. Currently, the parliament has 751 members. Most MEPs belong to one of the eight European political groups:\nGUE-NGL: The European United Left–Nordic Green Left unite radical left wing, socialist and communist parties from 14 European member states. Being generally integration friendly, the GUE-NGL wants to influence the integration process in the direction of a social union with the stronger protection of workers and a higher degree of wealth redistribution [12]. The Greek Syriza party, the Irish Sinn Féin, the German Die Linke and the French Front de gauche (of which the French Communist Party, PCF is a stake holder) are part of this group.\nS&D: The Socialists & Democrats is second largest group in the European Parliament with 190 seats. It consists of social democratic, socialist and labour parties from most European Member States. In the literature it is described as having a balanced stance between workers protection and market economy, and to be integration friendly [12]. This group, for example, contains the French PS (Parti socialiste), the German SPD (Sozialdemokratische Partei Deutschlands), and, for the time being, the British Labour Party.\nGreens-EFA: The Group of the Greens and European Free Alliance is the political home to green (The Greens) and regionalist/separatist political parties (EFA) from 22 Member States. At the moment, it holds 50 seats in the European Parliament. Being considered as favorable to European integration, this group strives for a more ecological and social union [12]. Apart from various green parties from all over Europe, the Greens-EFA group also summons different political movements with a separatist agenda. Better known national parties of this group are the Scottish National Party, the Valencian National Bloc, the Republican Left of Catalonia, and Basque Solidarity (all Spain).\nALDE: The Alliance of Liberals and Democrats for Europe summons liberal political groups from 20 European countries. Together with the EPP and the S&D it holds the majority in the European Parliament. It occupies 70 seats and is thus the fourth-largest group in the European Parliament. The literature describes them as cooperation and integration friendly, with a stance against overregulation and bureaucratization [12].\nEPP: The European People’s Party is the strongest group in the European Parliament with 215 seats. This group unites christian democrats, conservatives and center-right parties from most European Member States. Hix et. al [12] describe them as “integration-friendly and [...] strong supporter[s] of the European Constitution”. The ruling German CDU/CSU (Christian Democratic Union / Christian Social Union) and the French Les Reṕublicains (former UMP, under former president Nicolas Sarkozy) are parts of the EPP.\nECR: European Conservatives and Reformists hold 74 seats and are the third largest group in the parliament. Originally being a split-off from the EPP over an argument about the Lisbon treaty, it provides a political home to conservative and Eurosceptic parties from eighteen EU member states [39]. The ruling Polish Law and Justice Party (PiS) and the British Conservative Party are parts of the ECR.\nEFDD: The Europe of Freedom and Direct Democracy holds 46 seats, uniting extreme right-wing and Eurosceptic parties from eight countries [12, 39]. Part of this group are, for example, the Italian Five Star Movement (Movimento 5 Stelle), the Sweden Democrats, and the UK Independence Party (UKIP).\nENL: The Europe of Nations and Freedom is the smallest group in the European Parliament with 39 seats. Its extreme right-wing member organizations come from nine different countries. The biggest are the French Front National, the Italian Lega Nord, and the Austrian Freedom Party (FPÖ).\nNI: Apart from the eight groups described above, there are currently sixteen non-aligned (Non-Inscrits NI) members in the European Parliament. These MEPs are partly split-offs from national lists organized in one of the above groups (like Bruno Gollnisch from the FN), or are part of other minoritarian extreme-right wing political movements, like the Hungarian Jobbik, the German National Democratic Party (NPD), or the Greek Golden Dawn (XA). In our analysis we treat the group of non-aligned MEPs as one political group.\nIn the European Parliament a simple majority corresponds to 376 votes. A coalition between the two major groups, EPP and S&D could theoretically ensure 404 votes. Coalitions on the left with S&D, Greens-EFA and GUE-NGL (all together 291 seats), or on the right with EPP, ECR, EFDD and ENL (all together 374 seats) would, however, stay below the 376 vote margin. The majority ratios leave the liberal ALDE with the role of natural intermediary between both sides of the political spectrum. In general, especially taking into account the ideological provenience of most MEPs in the NI group, the majority in the European Parliament consists of the right-side of the political spectrum."
    }, {
      "heading" : "4.2.3 Roll-call voting in the European Parliament",
      "text" : "Following parliamentary traditions, voting in the EP is mainly carried out via a show of hands. The president of the session then decides by visual judgment whether the majority is for or against the proposal in question. This method represents a fast and simple way to determine majorities in votes were only a simple majority is necessary. In certain cases, however, the votes are undertaken using roll-call votes [40]:\n1. For tight decision or if MEPs believe the president’s judgment is wrong, the decision can be contested. The president then has the possibility to decide to hold the vote again, this time using the electronic voting system (Rule 181).\n2. Roll-call votes are used at the request of at least 40 members of the parliament, at the latest on the evening prior to the parliamentary session (Rule 180). A request for a secret vote formed by the same number, however, overrules the roll-call vote request.\n3. The election of the European Commission (Rule 118). A motion of no confidence in the members of the European Commission. In reference to rule 180, if the vote is based on a report and concerns an amendment thereof (Rules 173, 179).\n4. The final decision of the budgetary conciliation process is taken via a roll-call vote (Rule 90).\n5. In committees of the European Parliament if requested so by at least one quarter of its members.\nRoll-call voting in the historical sense comprises calling each individual EP member alphabetically by name, who then expresses a “yes”, “no”, or “abstain” with regard to the vote in question. While the procedural rules of the European Parliament still foresee this oral approach of establishing majorities (Rule 180), most of the roll-call votes today are held using electronic voting. Therefore, MEPs are required to identify themselves using an electronic identification card. In any case, the results of roll-call votes, indicating how each individual MEP who was present had voted (Rule 181), are recorded in the minutes of the parliamentary session. Data from this session’s minutes form the basis of our analysis."
    }, {
      "heading" : "4.2.4 Policy areas",
      "text" : "The roll-call voting data covers eight policy areas. In what follows, a short description of the different policy areas is given [41, 42]:\nArea of freedom, security and justice: This policy area concerns home affairs and policies with regard to justice and the freedom of movement within the EU. It also covers the harmonization of legal systems and cooperation at the level of police and justice between Member States. Well known projects attributed to this policy area are the Schengen Area, the European Arrest Warrant and Frontex patrols.\nCommunity policies: Concerns European political parties and the European Parliament’s interaction with other institutions, on the European and national levels. It also covers the implementation of European treaties and all general issues with regard to the EU institutions.\nEconomic and monetary system: This policy area covers all matters concerning the economic and monetary system of the EU and regulations with regard to financial regulations, taxation, competition, and the free movement of capital and payments. It also comprises the relationship to the European Central Bank (which is accountable to the European Parliament).\nEconomic, social and territorial cohesion: Questions with regard to employment and social, but also infrastructural policies, which should promote the economic, social and territorial cohesion of the EU are covered by this policy area.\nEuropean citizenship: Concerns matters of citizenship, migration and asylum. External relations of the Union: Covers policies regulating the relationship of the EU with third\ncountries. Decisions concerning the accession process to the EU, associations, and the European neighbourhood policy fall in this category. Security, defence, development policy, and human-rights matters are in also this policy area.\nInternal market: This policy area deals with internal market regulations, competition and consumer rights. It also covers standards for products, public subsidies and the mutual recognition of degrees and qualifications.\nState and evolution of the Union: This policy area covers seminal decisions with regard to the European integration process and concerns the power balance between the EU institutions on the one side and the Member States on the other side."
    }, {
      "heading" : "4.3 Co-voting measured by agreement",
      "text" : "In this section we show how the co-voting behaviour of MEPs can be quantified by a measure of the agreement between them. We treat individual RCVs as observations, and MEPs as independent observers or raters. When they cast the same vote, there is a high level of agreement, and when they vote differently, there is a high level of disagreement. We define cohesion as the level of agreement within a political group, a coalition as a voting agreement between political groups, and opposition as a disagreement between different groups.\nThere are many well-known measures of agreement in the literature. We selected Krippendorff’s Alpha-reliability (Alpha) [5], which is a generalization of several specialized measures. It works for any number of observers, and is applicable to different variable types and metrics (e.g., nominal, ordered, interval, etc.). In general, Alpha is defined as follows:\nAlpha = 1− Do\nDe ,\nwhere Do is the actual disagreement between observers (MEPs), and De is disagreement expected by chance. When observers agree perfectly, Alpha = 1, when the agreement equals the agreement by chance, Alpha = 0, and when the observers disagree systematically, Alpha < 0.\nThe two disagreement measures are defined as follows:\nDo = 1\nN\n∑\nc,c′\nN(c, c′) · δ2(c, c′) ,\nDe = 1\nN(N − 1)\n∑\nc,c′\nN(c) ·N(c′) · δ2(c, c′) .\nThe arguments N,N(c, c′), N(c), and N(c′) are defined below and refer to the values in the coincidence matrix that is constructed from the RCVs data. In roll-call votes, c (and c′) is a nominal variable with two possible values: yes and no. δ(c, c′) is a difference function between the values of c and c′, defined as:\nδ(c, c′) =\n{\n0 iff c = c′ 1 iff c 6= c′ c, c′ ∈ {yes, no} .\nThe RCVs data has the form of a reliability data matrix:\nRoll-call votes 1 2 . . . u . . . n 1 c11 c12 . . . c1u . . . c1n\nIndividual . . . . . . . . . . . MEPs voting i ci1 ci2 . . . ciu . . . cin\n. . . . . . . . . . .\nm cm1 cm2 . . . cmu . . . cmn No. of MEPs voting m1 m2 . . . mu . . . mn\nwhere n is the number of RCVs, m is the number of MEPs, mu is the number of votes cast in the voting u, and ciu is the actual vote of an MEP i in voting u (yes or no).\nA coincidence matrix is constructed from the reliability data matrix, and is in general a k-by-k square matrix, where k is the number of possible values of c. In our case, where only yes/no votes are relevant, the\ncoincidence matrix is a 2-by-2 matrix of the following form:\nc′ ∑\n. . .\nc . N(c, c′) N(c) ∑\n. N(c′) N\nA cell N(c, c′) accounts for all coincidences from all pairs of MEPs in all RCVs where one MEP has voted c and the other c′. N(c) and N(c′) are the totals for each vote outcome, and N is the grand total. The coincidences N(c, c′) are computed as:\nN(c, c′) = ∑\nu\nNu(c, c ′)\nmu − 1 c, c′ ∈ {yes, no}\nwhere Nu(c, c ′) is the number of (c, c′) pairs in vote u, and mu is the number of MEPs that voted in u. When computing Nu(c, c ′), each pair of votes is considered twice, once as a (c, c′) pair, and once as a (c′, c) pair. The coincidence matrix is therefore symmetrical around the diagonal, and the diagonal contains all the equal votes. The Alpha agreement is used to measure the agreement between two MEPs or within a group of MEPs. When applied to a political group, Alpha corresponds to the cohesion of the group. The closer Alpha is to 1, the higher the agreement of the MEPs in the group, and hence the higher the cohesion of the group.\nWe propose a modified version of Alpha to measure the agreement between two different groups, A and B. In the case of a voting agreement between political groups, high Alpha is interpreted as a coalition between the groups, whereas negative Alpha indicates political opposition.\nSuppose A and B are disjoint subsets of all the MEPs, A,B ⊂ {1, . . . ,m}. The respective number of votes cast by both group members in vote u is mu(A) and mu(B). The coincidences are then computed as:\nN(c, c′) = ∑\nu\nNu(c, c ′) · (mu(A) +mu(B))\n2 ·mu(A) ·mu(B) c, c′ ∈ {yes, no}\nwhere the (c, c′) pairs come from different groups, A and B. The total number of such pairs in vote u is mu(A) ·mu(B). The actual number Nu(c, c ′) of the pairs is multiplied by mu(A)+mu(B)2·mu(A)·mu(B) so that the total contribution of vote u to the coincidence matrix is mu(A) +mu(B)."
    }, {
      "heading" : "4.4 A network-based measure of co-voting",
      "text" : "In this section we describe a network-based approach to analyzing the co-voting behavior of MEPs. The nodes in the network are MEPs, and an undirected edge between two MEPs is formed when they cast the same vote in a roll-call vote. We are interested in the factors that determine the coalition formation within the European Parliament as well as the cohesion within political groups. Furthermore, we investigate to what extent communication in a different social context, i.e., the retweeting behavior of MEPs, can explain the co-voting of MEPs. For this purpose we apply an Exponential Random Graph Model [6] to individual roll-call vote networks, and aggregate the results by means of the meta-analysis."
    }, {
      "heading" : "4.4.1 Exponential Random Graph Model (ERGM)",
      "text" : "ERGMs allow us to investigate the factors relevant for the network-formation process. Network metrics, as described in the abundant literature, serve to gain information about the structural properties of the observed network. A model investigating the processes driving the network formation, however, has to take into account that there can be a multitude of alternative networks. If we are interested in the parameters influencing the network formation we have to consider all possible networks and measure their similarity to the originally observed networks. The family if ERGMs builds upon this idea.\nAssume a random graph Y made up of a set of n nodes and e edges {Yij : i = 1, . . . , n; j = 1, . . . , n} where, similar to a binary choice model, Yij = 1 if the nodes (i, j) are connected and Yij = 0 if not. Since the network\ndata is by definition relational and thus violates assumptions of independence, classical binary choice models cannot be applied in this context. Within an ERGM, the given network is modelled by\nP (Y = y|θ) = exp(θT · g(y))\nc(θ) ,\nwhere θ and g(y) are the vectors of parameters and network statistics, respectively, and c(θ) = ∑ exp(θt · g(y)) is a normalizing constant corresponding to all possible networks. Evaluating the above expression allows us to make assertions if and how specific nodal attributes influence the network-formation process. These nodal attributes can be endogenous (dyad-dependent parameters) to the network, like the in- and out-degrees of a node, or exogenous (dyad-independent parameters), as the party affiliation, or the country of origin, in the case of the co-voting network in the European Parliament. Since the number of possible outcomes vastly exceeds the number of constraining parameters, the evaluation of the objective function is usually done by Gibbs sampling [43]. In our study we used the “ergm” library from the statistical software package R [6]."
    }, {
      "heading" : "4.4.2 Meta-analysis",
      "text" : "Considering the number of roll-call votes, it seems straightforward to interpret the different roll-call vote networks as multiplex networks and collapse them into one weighted network. This could then be analyzed by an ERGM adapted for valued networks [44]. However, there are two reasons to choose a different approach. First, aggregating the roll-call vote data results into an extremely dense network, leading to severe convergence problems for the ERGM. Second, the roll-call vote data contains information about the different policy areas the individual votes were about. Since we are interested in how the coalition formation in the European Parliament differs over different areas, a method is needed that allows for an ex-post analysis of the corresponding results. We therefore opted for a meta-analysis approach as described by Snijders et al. [45] and Lubbers [46]. This approach allows us to summarize the results by decomposing the coefficients into average effects and (class) area-specific deviations. The meta-regression model corresponds to:\nθm = µθ + Em .\nHere θm is a parameter estimate for class m, and µθ is the average coefficient. Em denotes the deviation of the class m with a mean of 0 and a variance of σ2. Em is the estimation error of the parameter value θm from the ERGM. The meta-analysis model is fitted by an iterated, weighted, least-squares model in which the observations are weighted by the inverse of their variances. In our study, the meta-analysis was performed using the RSiena library [47], which implements the method employed by Snijders et al. and Lubbers [45, 46]."
    }, {
      "heading" : "4.4.3 Specification of the ERGM",
      "text" : "Corresponding to our research question, namely, to evaluate the factors which drive the network formation process in the roll-call co-voting network, the ERGM is specified with the following parameters:\n1. edges : This parameter can be understood as an intercept accounting for the number of edges in the network.\n2. nodematch country: This parameter adds one network statistic to the model, i.e., the number of edges (i, j) where countryi = countryj . The coefficient indicates the homophilious mixing behavior of MEPs with respect to their country of origin. In other words, this coefficient indicates how relevant are nationalities in the formation of edges in the co-voting network.\n3. nodematch national party: This parameter adds one network statistic to the model: the number of edges (i, j) with national.partyi = national.partyj. The coefficient indicates the homophilious mixing behavior of the MEPs with regard to their party affiliation at the national level. In the context of this study, this coefficient can be interpreted as an indicator for within-party cohesion at the national level.\n4. nodemix EP group: This parameter adds one network statistic for each possible pairing of the node attribute describing the affiliation to the European Parliament group. These coefficients shed light on the degree of coalitions between different European groups as well as the within group cohesion at the European level. Given that there are nine European Parliament groups, this coefficient adds in total 81 statistics to the model. In order to compute overall cohesion values for different areas we used the nodemix coefficients of political groups with themselves, and in the meta-analysis additionally weighted by group size.\n5. edge covariate Twitter: This parameter corresponds to a square matrix with the dimension of the adjacency matrix of the network, which corresponds to the number of mutual retweets between the MEPs. It provides an insight about the extent to which communication in one social context (Twitter), can explain cooperation in another social context (co-voting in RCVs).\nThe whole model comprises the estimation of the total of 2535 ERGMs of the individual roll-call vote networks. The results are then agreggated and analyzed by the meta-analysis method, as proposed by Lubbers et al. [45, 46]."
    }, {
      "heading" : "4.5 Measuring cohesion and coalitions on Twitter",
      "text" : "The retweeting behavior of MEPs is captured by their retweet network. Each MEP active on Twitter is a node in this network. An edge in the network between two MEPs exists when one MEP retweeted the other. The weight of the edge is the number of retweets between the two MEPs. The resulting retweet network is an undirected, weighted network.\nWe measure the cohesion of a political group A as the average retweets, i.e., the ratio of the number of retweets between the MEPs in the group retweets(A) to the number of MEPs in the group |A|. The higher the ratio, the more each MEP (on average) retweets the MEPs from the same political group, hence, the higher the cohesion of the political group. The definition of the average retweeets (RT ) of a group A is:\nRT(A) = retweets(A)\n|A| .\nThis measure of cohesion captures the aggregate retweeting behavior of the group. If we consider retweets as endorsements, a larger number of retweets within the group is an indicator of agreement between the MEPs in the group. It does not take into account the patterns of retweeting within the group, thus ignoring the social sub-structure of the group. This is a potentially interesting direction and we leave it for future work.\nWe employ an analogous measure for the strength of coalitions in the retweet network. The coalition strength between two groups A and B is the ratio of the number of retweets from one group to the other (but not within groups) retweets(A,B) to the total number of MEPs in both groups, |A|+ |B|. The definition of the average retweeets (RT ) between groups A and B is:\nRT(A,B) = retweets(A,B)\n|A|+ |B| ."
    }, {
      "heading" : "Acknowledgments",
      "text" : "This work was supported in part by the EC projects SIMPOL (no. 610704) and DOLFINS (no. 640772), and by the Slovenian ARRS programme Knowledge Technologies (no. P2-103)."
    } ],
    "references" : [ {
      "title" : "Limits of electoral predictions using Twitter",
      "author" : [ "D Gayo-Avello", "PT Metaxas", "E. Mustafaraj" ],
      "venue" : "Proc. 5th Intl. AAAI Conf. on Weblogs and Social Media;",
      "citeRegEx" : "1",
      "shortCiteRegEx" : "1",
      "year" : 2011
    }, {
      "title" : "Twitter-based analysis of the dynamics of collective attention to political parties",
      "author" : [ "YH Eom", "M Puliga", "J Smailović", "I Mozetič", "G. Caldarelli" ],
      "venue" : "PLoS ONE",
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 2015
    }, {
      "title" : "Twitter mood predicts the stock market",
      "author" : [ "J Bollen", "H Mao", "X. Zeng" ],
      "venue" : "Journal of Computational Science",
      "citeRegEx" : "3",
      "shortCiteRegEx" : "3",
      "year" : 2011
    }, {
      "title" : "The effects of Twitter sentiment on stock price returns",
      "author" : [ "G Ranco", "D Aleksovski", "G Caldarelli", "M Grčar", "I. Mozetič" ],
      "venue" : "PLoS ONE",
      "citeRegEx" : "4",
      "shortCiteRegEx" : "4",
      "year" : 2015
    }, {
      "title" : "Content Analysis, An Introduction to Its Methodology",
      "author" : [ "K. Krippendorff" ],
      "venue" : "3rd ed. Thousand Oaks, CA: Sage Publications;",
      "citeRegEx" : "5",
      "shortCiteRegEx" : "5",
      "year" : 2012
    }, {
      "title" : "ergm: A Package to Fit, Simulate and Diagnose Exponential-Family Models for Networks",
      "author" : [ "DR Hunter", "MS Handcock", "CT Butts", "SM Goodreau", "Morris", "Martina" ],
      "venue" : "Journal of Statistical Software",
      "citeRegEx" : "6",
      "shortCiteRegEx" : "6",
      "year" : 2008
    }, {
      "title" : "The voting behaviour of the European Parliament members and the problem of the Europarties",
      "author" : [ "F. Attina" ],
      "venue" : "European Journal of Political Research",
      "citeRegEx" : "7",
      "shortCiteRegEx" : "7",
      "year" : 1990
    }, {
      "title" : "Coalition formation in the European Parliament",
      "author" : [ "A Kreppel", "G. Tsebelis" ],
      "venue" : "Comparative Political Studies",
      "citeRegEx" : "8",
      "shortCiteRegEx" : "8",
      "year" : 1999
    }, {
      "title" : "Growing cohesion in the European Parliament",
      "author" : [ "M Quanjel", "M. Wolters" ],
      "venue" : "Annual Joint Sessions of the European Consortium for Political Research",
      "citeRegEx" : "9",
      "shortCiteRegEx" : "9",
      "year" : 1993
    }, {
      "title" : "Political group cohesion in the European Parliament, 1989-1994",
      "author" : [ "Brzinski JB" ],
      "venue" : "The state of the European Union",
      "citeRegEx" : "10",
      "shortCiteRegEx" : "10",
      "year" : 1995
    }, {
      "title" : "Parliamentary behavior with two principals: preferences, parties, and voting in the European Parliament",
      "author" : [ "S. Hix" ],
      "venue" : "American Journal of Political Science",
      "citeRegEx" : "11",
      "shortCiteRegEx" : "11",
      "year" : 2002
    }, {
      "title" : "After enlargement: voting patterns in the sixth European Parliament",
      "author" : [ "S Hix", "A. Noury" ],
      "venue" : "Legislative Studies Quarterly",
      "citeRegEx" : "12",
      "shortCiteRegEx" : "12",
      "year" : 2009
    }, {
      "title" : "Democratic politics in the European Parliament",
      "author" : [ "S Hix", "AG Noury", "G. Roland" ],
      "venue" : null,
      "citeRegEx" : "13",
      "shortCiteRegEx" : "13",
      "year" : 2007
    }, {
      "title" : "Power to the parties: cohesion and competition in the European Parliament, 1979–2001",
      "author" : [ "S Hix", "A Noury", "G. Roland" ],
      "venue" : "British Journal of Political Science",
      "citeRegEx" : "14",
      "shortCiteRegEx" : "14",
      "year" : 2005
    }, {
      "title" : "Quantitative methods in politics",
      "author" : [ "Rice SA" ],
      "venue" : null,
      "citeRegEx" : "15",
      "shortCiteRegEx" : "15",
      "year" : 1928
    }, {
      "title" : "Multilingual Twitter sentiment classification: The role of human annotators",
      "author" : [ "I Mozetič", "M Grčar", "J. Smailović" ],
      "venue" : "PLoS ONE",
      "citeRegEx" : "16",
      "shortCiteRegEx" : "16",
      "year" : 2016
    }, {
      "title" : "Monitoring the Twitter sentiment during the Bulgarian elections",
      "author" : [ "J Smailović", "J Kranjc", "M Grčar", "M Žnidaršič", "I. Mozetič" ],
      "venue" : "Proc. IEEE Intl. Conf. on Data Science and Advanced Analytics;",
      "citeRegEx" : "17",
      "shortCiteRegEx" : "17",
      "year" : 2015
    }, {
      "title" : "Predicting the Political Alignment of Twitter Users",
      "author" : [ "M Conover", "B Gonçalves", "J Ratkiewicz", "A Flammini", "F. Menczer" ],
      "venue" : "Proc. 3rd IEEE Conf. on Social Computing;",
      "citeRegEx" : "18",
      "shortCiteRegEx" : "18",
      "year" : 2011
    }, {
      "title" : "Characterizing and modeling an electoral campaign in the context of Twitter: 2011 Spanish Presidential election as a case study",
      "author" : [ "J Borondo", "AJ Morales", "JC Losada", "RM. Benito" ],
      "venue" : null,
      "citeRegEx" : "20",
      "shortCiteRegEx" : "20",
      "year" : 2012
    }, {
      "title" : "Mapping the online communication patterns of political conversations",
      "author" : [ "J Borondo", "AJ Morales", "RM Benito", "JC. Losada" ],
      "venue" : "Physica A: Statistical Mechanics and its Applications",
      "citeRegEx" : "21",
      "shortCiteRegEx" : "21",
      "year" : 2014
    }, {
      "title" : "The EU Parliament on Twitter—Assessing the Permanent Online Practices of Parliamentarians",
      "author" : [ "Larsson AO" ],
      "venue" : "Journal of Information Technology & Politics",
      "citeRegEx" : "22",
      "shortCiteRegEx" : "22",
      "year" : 2014
    }, {
      "title" : "Retweet networks of the European Parliament: Evaluation of the community structure",
      "author" : [ "D Cherepnalkoski", "I. Mozetič" ],
      "venue" : "Applied Network Science",
      "citeRegEx" : "23",
      "shortCiteRegEx" : "23",
      "year" : 2016
    }, {
      "title" : "Networks in Political Science: Back to the Future",
      "author" : [ "D. Lazer" ],
      "venue" : "PS: Political Science & Politics",
      "citeRegEx" : "24",
      "shortCiteRegEx" : "24",
      "year" : 2011
    }, {
      "title" : "A network analysis of committees in the U.S. House of Representatives",
      "author" : [ "MA Porter", "PJ Mucha", "MEJ Newman", "CM. Warmbrand" ],
      "venue" : "Proceedings of the National Academy of Science",
      "citeRegEx" : "25",
      "shortCiteRegEx" : "25",
      "year" : 2005
    }, {
      "title" : "Community structure in Congressional cosponsorship networks",
      "author" : [ "Y Zhang", "AJ Friend", "AL Traud", "MA Porter", "JH Fowler", "PJ. Mucha" ],
      "venue" : "Physica A: Statistical Mechanics and its Applications",
      "citeRegEx" : "26",
      "shortCiteRegEx" : "26",
      "year" : 2008
    }, {
      "title" : "Party Polarization in Congress: A Network",
      "author" : [ "AS Waugh", "L Pei", "JH Fowler", "PJ Mucha", "MA. Porter" ],
      "venue" : "Science Approach;",
      "citeRegEx" : "27",
      "shortCiteRegEx" : "27",
      "year" : 2009
    }, {
      "title" : "Voting Behavior, Coalitions and Government Strength through a Complex Network Analysis",
      "author" : [ "C Dal Maso", "G Pompa", "M Puliga", "G Riotta", "A. Chessa" ],
      "venue" : "PLoS ONE",
      "citeRegEx" : "28",
      "shortCiteRegEx" : "28",
      "year" : 2014
    }, {
      "title" : "The Adoption and Use of Twitter as a Representational Tool among Members of the European Parliament",
      "author" : [ "JA Scherpereel", "J Wohlgemuth", "M. Schmelzinger" ],
      "venue" : "European Politics and Society",
      "citeRegEx" : "29",
      "shortCiteRegEx" : "29",
      "year" : 2016
    }, {
      "title" : "Roll-call votes data; 2016",
      "author" : [ "European Parliament" ],
      "venue" : "[Online; accessed 29-January-2016]. Available from: http://www.europarl.europa.eu/RegistreWeb/search/typedoc.htm?codeTypeDocu=PPVD&leg=8",
      "citeRegEx" : "30",
      "shortCiteRegEx" : "30",
      "year" : 2016
    }, {
      "title" : "Twitter sentiment in relation to political issues; 2016",
      "author" : [ "M Grčar", "S Rutar", "J Smailović", "D Cherepnalkoski", "I. Mozetič" ],
      "venue" : "Poster at Conference on Complex Systems",
      "citeRegEx" : "33",
      "shortCiteRegEx" : "33",
      "year" : 2016
    }, {
      "title" : "Empowerment of the European parliament",
      "author" : [ "S Hix", "B. Høyland" ],
      "venue" : "Annual Review of Political Science",
      "citeRegEx" : "35",
      "shortCiteRegEx" : "35",
      "year" : 2013
    }, {
      "title" : "Development of the Parliament’s Legislative Role. 2016;Available from: http://www.europarl.europa.eu/us/en/about_eu_parliament/parliament_info_articles/legislative_development.htmlhttp;jsessionid=73FE06549FDAC456DA707C5E838641C1",
      "author" : [ "European Parliament" ],
      "venue" : null,
      "citeRegEx" : "36",
      "shortCiteRegEx" : "36",
      "year" : 2016
    }, {
      "title" : "Europe, a Political Profile: An American Companion to European Politics",
      "author" : [ "H. Slomp" ],
      "venue" : "ABC-CLIO;",
      "citeRegEx" : "39",
      "shortCiteRegEx" : "39",
      "year" : 2011
    }, {
      "title" : "Political ambition and legislative behavior in the European Parliament",
      "author" : [ "SA Meserve", "D Pemstein", "WT. Bernhard" ],
      "venue" : "The Journal of Politics",
      "citeRegEx" : "41",
      "shortCiteRegEx" : "41",
      "year" : 2009
    }, {
      "title" : "An introduction to exponential random graph (p*) models for social networks",
      "author" : [ "G Robins", "P Pattison", "Y Kalish", "D. Lusher" ],
      "venue" : "Social Networks",
      "citeRegEx" : "43",
      "shortCiteRegEx" : "43",
      "year" : 2007
    }, {
      "title" : "Exponential-family random graph models for valued networks",
      "author" : [ "Krivitsky PN" ],
      "venue" : "Electronic Journal of Statistics",
      "citeRegEx" : "44",
      "shortCiteRegEx" : "44",
      "year" : 2012
    }, {
      "title" : "A multilevel network study of the effects of delinquent behavior on friendship evolution",
      "author" : [ "TA Snijders", "C. Baerveldt" ],
      "venue" : "Journal of Mathematical Sociology",
      "citeRegEx" : "45",
      "shortCiteRegEx" : "45",
      "year" : 2003
    }, {
      "title" : "Group composition and network structure in school classes: a multilevel application of the p* model",
      "author" : [ "Lubbers MJ" ],
      "venue" : "Social Networks",
      "citeRegEx" : "46",
      "shortCiteRegEx" : "46",
      "year" : 2003
    }, {
      "title" : "Manual for RSIENA",
      "author" : [ "RM Ripley", "TA Snijders", "P Preciado" ],
      "venue" : "University of Oxford, Department of Statistics, Nuffield College",
      "citeRegEx" : "47",
      "shortCiteRegEx" : "47",
      "year" : 2011
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "There are numerous studies reported in the literature that successfully correlate social-media activities to phenomena like election outcomes [1, 2] or stock-price movements [3, 4].",
      "startOffset" : 142,
      "endOffset" : 148
    }, {
      "referenceID" : 1,
      "context" : "There are numerous studies reported in the literature that successfully correlate social-media activities to phenomena like election outcomes [1, 2] or stock-price movements [3, 4].",
      "startOffset" : 142,
      "endOffset" : 148
    }, {
      "referenceID" : 2,
      "context" : "There are numerous studies reported in the literature that successfully correlate social-media activities to phenomena like election outcomes [1, 2] or stock-price movements [3, 4].",
      "startOffset" : 174,
      "endOffset" : 180
    }, {
      "referenceID" : 3,
      "context" : "There are numerous studies reported in the literature that successfully correlate social-media activities to phenomena like election outcomes [1, 2] or stock-price movements [3, 4].",
      "startOffset" : 174,
      "endOffset" : 180
    }, {
      "referenceID" : 4,
      "context" : "The first one is based on Krippendorff’s Alpha coefficient [5], which is a measure of the agreement among observers, raters, or measuring instruments assigning values to items or phenomena.",
      "startOffset" : 59,
      "endOffset" : 62
    }, {
      "referenceID" : 5,
      "context" : "The second one is based on Exponential Random Graph Models (ERGM) [6].",
      "startOffset" : 66,
      "endOffset" : 69
    }, {
      "referenceID" : 6,
      "context" : "The legislative behavior of the previous parliaments was thoroughly studied by Hix, Attina, and others [7–12].",
      "startOffset" : 103,
      "endOffset" : 109
    }, {
      "referenceID" : 7,
      "context" : "The legislative behavior of the previous parliaments was thoroughly studied by Hix, Attina, and others [7–12].",
      "startOffset" : 103,
      "endOffset" : 109
    }, {
      "referenceID" : 8,
      "context" : "The legislative behavior of the previous parliaments was thoroughly studied by Hix, Attina, and others [7–12].",
      "startOffset" : 103,
      "endOffset" : 109
    }, {
      "referenceID" : 9,
      "context" : "The legislative behavior of the previous parliaments was thoroughly studied by Hix, Attina, and others [7–12].",
      "startOffset" : 103,
      "endOffset" : 109
    }, {
      "referenceID" : 10,
      "context" : "The legislative behavior of the previous parliaments was thoroughly studied by Hix, Attina, and others [7–12].",
      "startOffset" : 103,
      "endOffset" : 109
    }, {
      "referenceID" : 11,
      "context" : "The legislative behavior of the previous parliaments was thoroughly studied by Hix, Attina, and others [7–12].",
      "startOffset" : 103,
      "endOffset" : 109
    }, {
      "referenceID" : 12,
      "context" : "The authors found that the cohesion of political groups in the parliament has increased, while nationality has been less and less of a decisive factor [13].",
      "startOffset" : 151,
      "endOffset" : 155
    }, {
      "referenceID" : 12,
      "context" : "The authors conclude that coalitions are to a large extent formed along the left-to-right axis [13].",
      "startOffset" : 95,
      "endOffset" : 99
    }, {
      "referenceID" : 10,
      "context" : "[11,12,14].",
      "startOffset" : 0,
      "endOffset" : 10
    }, {
      "referenceID" : 11,
      "context" : "[11,12,14].",
      "startOffset" : 0,
      "endOffset" : 10
    }, {
      "referenceID" : 13,
      "context" : "[11,12,14].",
      "startOffset" : 0,
      "endOffset" : 10
    }, {
      "referenceID" : 6,
      "context" : "To be able to study the cohesion and coalitions, authors like Hix, Attina, and Rice [7, 14, 15] defined and employed a variety of agreement measures.",
      "startOffset" : 84,
      "endOffset" : 95
    }, {
      "referenceID" : 13,
      "context" : "To be able to study the cohesion and coalitions, authors like Hix, Attina, and Rice [7, 14, 15] defined and employed a variety of agreement measures.",
      "startOffset" : 84,
      "endOffset" : 95
    }, {
      "referenceID" : 14,
      "context" : "To be able to study the cohesion and coalitions, authors like Hix, Attina, and Rice [7, 14, 15] defined and employed a variety of agreement measures.",
      "startOffset" : 84,
      "endOffset" : 95
    }, {
      "referenceID" : 13,
      "context" : "[14].",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 4,
      "context" : "The first one is based on Krippendorff’s Alpha [5].",
      "startOffset" : 47,
      "endOffset" : 50
    }, {
      "referenceID" : 15,
      "context" : "Alpha is used to measure the inter- and self-annotator agreement of human experts when labeling data, and the performance of classification models in machine-learning scenarios [16].",
      "startOffset" : 177,
      "endOffset" : 181
    }, {
      "referenceID" : 5,
      "context" : "In addition to Alpha, we employ Exponential Random Graph Models (ERGM) [6].",
      "startOffset" : 71,
      "endOffset" : 74
    }, {
      "referenceID" : 1,
      "context" : "[2] consider the number of tweets by a",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 16,
      "context" : "Other studies [17] reach similar conclusions.",
      "startOffset" : 14,
      "endOffset" : 18
    }, {
      "referenceID" : 17,
      "context" : "[18] predicted the political alignment of Twitter users in the run-up to the 2010 US elections based on content and network structure.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 18,
      "context" : "[20] analyzed user activity during the Spanish presidential elections.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 19,
      "context" : "They additionally analyzed the 2012 Catalan elections, focusing on the interplay between the language and the community structure of the network [21].",
      "startOffset" : 145,
      "endOffset" : 149
    }, {
      "referenceID" : 20,
      "context" : "Most existing research, as Larsson points out [22], focuses on the online behavior of leading political figures during election campaigns.",
      "startOffset" : 46,
      "endOffset" : 50
    }, {
      "referenceID" : 21,
      "context" : "This paper continues our research on communities that MEPs (and their followers) form on Twitter [23].",
      "startOffset" : 97,
      "endOffset" : 101
    }, {
      "referenceID" : 22,
      "context" : "Lazer [24] highlights the importance of network-based approaches in political science in general by arguing that politics is a relational phenomenon at its core.",
      "startOffset" : 6,
      "endOffset" : 10
    }, {
      "referenceID" : 23,
      "context" : "Some researchers have adopted the network-based approach to investigate the structure of legislative work in the US Congress, including committee and sub-committee membership [25], bill co-sponsoring [26], and roll-call votes [27].",
      "startOffset" : 175,
      "endOffset" : 179
    }, {
      "referenceID" : 24,
      "context" : "Some researchers have adopted the network-based approach to investigate the structure of legislative work in the US Congress, including committee and sub-committee membership [25], bill co-sponsoring [26], and roll-call votes [27].",
      "startOffset" : 200,
      "endOffset" : 204
    }, {
      "referenceID" : 25,
      "context" : "Some researchers have adopted the network-based approach to investigate the structure of legislative work in the US Congress, including committee and sub-committee membership [25], bill co-sponsoring [26], and roll-call votes [27].",
      "startOffset" : 226,
      "endOffset" : 230
    }, {
      "referenceID" : 26,
      "context" : "[28] examined the community structure with respect to political coalitions and government structure in the Italian Parliament.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 27,
      "context" : "[29] examined the constituency, personal, and strategic characteristics of MEPs that influence their tweeting behavior.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 28,
      "context" : "We collected the results of the roll-call votes (RCVs) from the website of the European Parliament [30].",
      "startOffset" : 99,
      "endOffset" : 103
    }, {
      "referenceID" : 10,
      "context" : "[11, 12, 14] shows that the cohesion of the European political groups has been rising since the 1990s, and the level of cohesion remained high even after the EU’s enlargement in 2004, when the number of MEPs increased from 626 to 732.",
      "startOffset" : 0,
      "endOffset" : 12
    }, {
      "referenceID" : 11,
      "context" : "[11, 12, 14] shows that the cohesion of the European political groups has been rising since the 1990s, and the level of cohesion remained high even after the EU’s enlargement in 2004, when the number of MEPs increased from 626 to 732.",
      "startOffset" : 0,
      "endOffset" : 12
    }, {
      "referenceID" : 13,
      "context" : "[11, 12, 14] shows that the cohesion of the European political groups has been rising since the 1990s, and the level of cohesion remained high even after the EU’s enlargement in 2004, when the number of MEPs increased from 626 to 732.",
      "startOffset" : 0,
      "endOffset" : 12
    }, {
      "referenceID" : 11,
      "context" : "This finding is in line with an analysis of previous compositions of the Fifth and Sixth European Parliaments by Hix and Noury [12], and the Seventh by VoteWatch [32].",
      "startOffset" : 127,
      "endOffset" : 131
    }, {
      "referenceID" : 11,
      "context" : "The observation of ideological inclinations in the coalition formation within the European Parliament was already made by other authors [12] and is confirmed in this study.",
      "startOffset" : 136,
      "endOffset" : 140
    }, {
      "referenceID" : 12,
      "context" : "[13], who noted that alignments on the left and right of the political spectrum have in recent years replaced the “Grand Coalition” between the two large blocks of Christian Conservatives (EPP) and Social Democrats (S&D) as the dominant form of finding majorities in the parliament.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 11,
      "context" : "Hix and Noury [12] also report that nationalists and Eurosceptics form the least cohesive groups in the Sixth European Parliament.",
      "startOffset" : 14,
      "endOffset" : 18
    }, {
      "referenceID" : 29,
      "context" : "We observed the same phenomenon recently during the Brexit campaign [33].",
      "startOffset" : 68,
      "endOffset" : 72
    }, {
      "referenceID" : 12,
      "context" : "[13], stating that alignments on the left and right have in recent years replaced the “Grand Coalition” between the two large blocks of Christian Conservatives (EPP) and Social Democrats (S&D) as the dominant form of finding majorities in the European Parliament.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 12,
      "context" : "[13], who argued that these coalitions emerge from a form of government-opposition dynamics, rooted at the national level, but also reflected at the European level.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 30,
      "context" : "Furthermore, the European Parliament now has the final word on the EU budget and has to approve the conclusion of international treaties, like trade agreements, in which the EU is a party [35, 36].",
      "startOffset" : 188,
      "endOffset" : 196
    }, {
      "referenceID" : 31,
      "context" : "Furthermore, the European Parliament now has the final word on the EU budget and has to approve the conclusion of international treaties, like trade agreements, in which the EU is a party [35, 36].",
      "startOffset" : 188,
      "endOffset" : 196
    }, {
      "referenceID" : 11,
      "context" : "Being generally integration friendly, the GUE-NGL wants to influence the integration process in the direction of a social union with the stronger protection of workers and a higher degree of wealth redistribution [12].",
      "startOffset" : 213,
      "endOffset" : 217
    }, {
      "referenceID" : 11,
      "context" : "In the literature it is described as having a balanced stance between workers protection and market economy, and to be integration friendly [12].",
      "startOffset" : 140,
      "endOffset" : 144
    }, {
      "referenceID" : 11,
      "context" : "Being considered as favorable to European integration, this group strives for a more ecological and social union [12].",
      "startOffset" : 113,
      "endOffset" : 117
    }, {
      "referenceID" : 11,
      "context" : "The literature describes them as cooperation and integration friendly, with a stance against overregulation and bureaucratization [12].",
      "startOffset" : 130,
      "endOffset" : 134
    }, {
      "referenceID" : 11,
      "context" : "al [12] describe them as “integration-friendly and [.",
      "startOffset" : 3,
      "endOffset" : 7
    }, {
      "referenceID" : 32,
      "context" : "Originally being a split-off from the EPP over an argument about the Lisbon treaty, it provides a political home to conservative and Eurosceptic parties from eighteen EU member states [39].",
      "startOffset" : 184,
      "endOffset" : 188
    }, {
      "referenceID" : 11,
      "context" : "EFDD: The Europe of Freedom and Direct Democracy holds 46 seats, uniting extreme right-wing and Eurosceptic parties from eight countries [12, 39].",
      "startOffset" : 137,
      "endOffset" : 145
    }, {
      "referenceID" : 32,
      "context" : "EFDD: The Europe of Freedom and Direct Democracy holds 46 seats, uniting extreme right-wing and Eurosceptic parties from eight countries [12, 39].",
      "startOffset" : 137,
      "endOffset" : 145
    }, {
      "referenceID" : 33,
      "context" : "In what follows, a short description of the different policy areas is given [41, 42]: Area of freedom, security and justice: This policy area concerns home affairs and policies with regard to justice and the freedom of movement within the EU.",
      "startOffset" : 76,
      "endOffset" : 84
    }, {
      "referenceID" : 4,
      "context" : "We selected Krippendorff’s Alpha-reliability (Alpha) [5], which is a generalization of several specialized measures.",
      "startOffset" : 53,
      "endOffset" : 56
    }, {
      "referenceID" : 5,
      "context" : "For this purpose we apply an Exponential Random Graph Model [6] to individual roll-call vote networks, and aggregate the results by means of the meta-analysis.",
      "startOffset" : 60,
      "endOffset" : 63
    }, {
      "referenceID" : 34,
      "context" : "Since the number of possible outcomes vastly exceeds the number of constraining parameters, the evaluation of the objective function is usually done by Gibbs sampling [43].",
      "startOffset" : 167,
      "endOffset" : 171
    }, {
      "referenceID" : 5,
      "context" : "In our study we used the “ergm” library from the statistical software package R [6].",
      "startOffset" : 80,
      "endOffset" : 83
    }, {
      "referenceID" : 35,
      "context" : "This could then be analyzed by an ERGM adapted for valued networks [44].",
      "startOffset" : 67,
      "endOffset" : 71
    }, {
      "referenceID" : 36,
      "context" : "[45] and Lubbers [46].",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 37,
      "context" : "[45] and Lubbers [46].",
      "startOffset" : 17,
      "endOffset" : 21
    }, {
      "referenceID" : 38,
      "context" : "In our study, the meta-analysis was performed using the RSiena library [47], which implements the method employed by Snijders et al.",
      "startOffset" : 71,
      "endOffset" : 75
    }, {
      "referenceID" : 36,
      "context" : "and Lubbers [45, 46].",
      "startOffset" : 12,
      "endOffset" : 20
    }, {
      "referenceID" : 37,
      "context" : "and Lubbers [45, 46].",
      "startOffset" : 12,
      "endOffset" : 20
    }, {
      "referenceID" : 36,
      "context" : "[45, 46].",
      "startOffset" : 0,
      "endOffset" : 8
    }, {
      "referenceID" : 37,
      "context" : "[45, 46].",
      "startOffset" : 0,
      "endOffset" : 8
    } ],
    "year" : 2017,
    "abstractText" : "We study the cohesion within and the coalitions between political groups in the Eighth European Parliament (2014–2019) by analyzing two entirely different aspects of the behavior of the Members of the European Parliament (MEPs) in the policy-making processes. On one hand, we analyze their co-voting patterns and, on the other, their retweeting behavior. We make use of two diverse datasets in the analysis. The first one is the roll-call vote dataset, where cohesion is regarded as the tendency to co-vote within a group, and a coalition is formed when the members of several groups exhibit a high degree of co-voting agreement on a subject. The second dataset comes from Twitter; it captures the retweeting (i.e., endorsing) behavior of the MEPs and implies cohesion (retweets within the same group) and coalitions (retweets between groups) from a completely different perspective. We employ two different methodologies to analyze the cohesion and coalitions. The first one is based on Krippendorff’s Alpha reliability, used to measure the agreement between raters in data-analysis scenarios, and the second one is based on Exponential Random Graph Models, often used in social-network analysis. We give general insights into the cohesion of political groups in the European Parliament, explore whether coalitions are formed in the same way for different policy areas, and examine to what degree the retweeting behavior of MEPs corresponds to their co-voting patterns. A novel and interesting aspect of our work is the relationship between the co-voting and retweeting patterns.",
    "creator" : "LaTeX with hyperref package"
  }
}