{
  "name" : "1611.06933.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Unsupervised Learning for Lexicon-Based Classification",
    "authors" : [ "Jacob Eisenstein" ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : null,
      "text" : "ar X\niv :1\n61 1.\n06 93\n3v 1\n[ cs\n.L G\n] 2\n1 N\nov 2"
    }, {
      "heading" : "Introduction",
      "text" : "Lexicon-based classification refers to a classification rule in which documents are assigned labels based on the count of words from lexicons associated with each label (Taboada et al. 2011). For example, suppose that we have opposed labels Y ∈ {0, 1}, and we have associated lexicons W0 and W1. Then for a document with a vector of word counts x, the lexicon-based decision rule is,\n(1) ∑\ni ∈W0\nxi ≷ ∑\nj ∈W1\nxj ,\nwhere the ≷ operator indicates a decision rule. Put simply, the rule is to select the label whose lexicon matches the most word tokens.\nLexicon-based classification is widely used in industry and academia, with applications ranging from sentiment classification and opinion mining (Pang and Lee 2008; Liu 2015) to the psychological and ideological analysis of texts (Laver and Garry 2000; Tausczik and Pennebaker 2010). The popularity of this approach can be explained by its relative simplicity and ease of use: for domain experts, creating lexicons is intuitive, and, in comparison with labeling instances, it may offer a faster path towards a reasonably\naccurate classifier (Settles 2011). Furthermore, classification errors can be iteratively debugged by refining the lexicons.\nHowever, from a machine learning perspective, there are a number of drawbacks to lexicon-based classification. First, while intuitively reasonable, lexicon-based classification lacks theoretical justification: it is not clear what conditions are necessary for it to work. Second, the lexicons may be incomplete, even for designers with strong substantive intuitions. Third, lexicon-based classification assigns an equal weight to each word, but some words may be more strongly predictive than others.1 Fourth, lexiconbased classification ignores multi-word phenomena, such as negation (e.g., not so good) and discourse (e.g., the movie would be watchable if it had better acting). Supervised classification systems, which are trained on labeled examples, tend to outperform lexicon-based classifiers, even without accounting for multi-word phenomena (Liu 2015; Pang and Lee 2008).\nSeveral researchers have proposed methods for lexicon expansion, automatically growing lexicons from an initial seed set (Hatzivassiloglou and McKeown 1997; Qiu et al. 2011). There is also work on handling multi-word phenomena such as negation (Wilson, Wiebe, and Hoffmann 2005; Polanyi and Zaenen 2006), and discourse (Somasundaran, Wiebe, and Ruppenhofer 2008; Bhatia, Ji, and Eisenstein 2015). However, the theoretical foundations of lexiconbased classification remain poorly understood, and we lack principled means for automatically assigning weights to lexicon items without resorting to labeled instances.\nThis paper elaborates a set of assumptions under which lexicon-based classification is equivalent to Naı̈ve Bayes classification. I then derive expected error rates under these assumptions. These expected error rates are not matched by observations on real data, suggesting that the underlying assumptions are invalid. Of key importance is the assumption that each lexicon item is equally predictive. To relax this assumption, I derive a principled method for estimating word probabilities under each label, using a method-of-moments estimator on cross-lexical co-occurrence counts.\n1Some lexicons attach coarse-grained predefined weights to each word. For example, the OpinionFinder Subjectivity lexicon labels words as “strongly” or “weakly” subjective (Wilson, Wiebe, and Hoffmann 2005). This poses an additional burden on the lexicon creator.\nOverall, this paper makes the following contributions:\n• justifying lexicon-based classification as a special case of multinomial Naı̈ve Bayes;\n• mathematically analyzing this model to compute the expected performance of lexicon-based classifiers;\n• extending the model to justify a popular variant of lexicon-based classification, which incorporates word presence rather than raw counts;\n• deriving a method-of-moments estimator for the parameters of this model, enabling lexicon-based classification with unique weights per word, without labeled data;\n• empirically demonstrating that this classifier outperforms lexicon-based classification and alternative approaches."
    }, {
      "heading" : "Lexicon-Based Classification as Naı̈ve Bayes",
      "text" : "I begin by showing how the lexicon-based classification rule shown in (1) can be derived as a special case of Naı̈ve Bayes classification. Suppose we have a prior probability PY for the label Y , and a likelihood function PX|Y , where X is a random variable corresponding to a vector of word counts. The conditional label probability can be computed by Bayesian inversion,\n(2)P (y | x) = P (x | y)P (y)∑ y′ P (x | y′)P (y′) .\nAssuming that the costs for each type of misclassification error are identical, then the minimum Bayes risk classification rule is,\n(3)log Pr(Y = 0) + logP (x | Y = 0) ≷ log Pr(Y = 1) + logP (x | Y = 1),\nmoving to the log domain for simplicity of notation. I now show that lexicon-based classification can be justified under this decision rule, given a set of assumptions about the probability distributions.\nLet us introduce some assumptions about the likelihood function, PX|Y . The random variable X is defined over vectors of counts, so a natural choice for the form of this likelihood is the multinomial distribution, corresponding to a multinomial Naı̈ve Bayes classifier. For a specific vector of counts X = x, write P (x | y) , Pmultinomial(x; θy, N), where θy is a probability vector associated with label y, and N = ∑V\ni=1 xi is the total count of tokens in x, and xi is the count of word i ∈ {1, 2, . . . , V }. The multinomial likelihood is proportional to a product of likelihoods of categorical variables corresponding to individual words (tokens),\nPr(W = i | Y = y; θ) = θy,i, (4)\nwhere the random variable W corresponds to a single token, whose probability of being word type i is equal to θy,i in a document with label y. The multinomial log-likelihood can be written as,\nlogP (x | y) = logPmultinomial(x; θy, N)\n=K(x) +\nV ∑\ni=1\nxi log Pr(W = i | Y = y; θ)\n=K(x) +\nV ∑\ni=1\nxi log θy,i, (5)\nwhere K(x) is a function of x that is constant in y. The first necessary assumption about the likelihood function is that the lexicons are complete: words that are in neither lexicon have identical probability under both labels. Formally, for any word i /∈ W0 ∪W1, we assume,\nPr(W = i | Y = 0) = Pr(W = i | Y = 1), (6)\nwhich implies that these words are irrelevant to the classification boundary.\nNext, we must assume that each in-lexicon word is equally predictive. Specifically, for words that are in lexicon y,\nPr(W = i | Y = y) Pr(W = i | Y = ¬y) = 1 + γ 1− γ , (7)\nwhere ¬y is the opposite label from y. The parameter γ controls the predictiveness of the lexicon: for example, if γ = 0.5 in a sentiment classification problem, this would indicate that words in the positive sentiment lexicon are three times more likely to appear in documents with positive sentiment than in documents with negative sentiment, and vice versa. The word atrocious might be less likely overall than good, but still three times more likely in the negative class than in the positive class. In the limit, γ = 0 implies that the lexicons do not distinguish the classes at all, and γ = 1 implies that the lexicons distinguish the classes perfectly, so that the observation of a single in-lexicon word would completely determine the document label.\nThe conditions enumerated in (6) and (7) are ensured by the following definition,\nθy,i =\n\n\n (1 + γ)µi, i ∈ Wy (1− γ)µi, i ∈ W¬y µi, i /∈ Wy ∪W¬y,\n(8)\nwhere ¬y is the opposite label from y, and µ is a vector of baseline probabilities, which are independent of the label.\nBecause the probability vectors θ0 and θ1 must each sum to one, we require an assumption of equal coverage,\n∑\ni∈W0\nµi = ∑\nj∈W1\nµj . (9)\nFinally, assume that the labels have equal prior likelihood, Pr(Y = 0) = Pr(Y = 1). It is trivial to relax this assumption by adding a constant term to one side of the decision rule in (1).\nWith these assumptions in hand, it is now possible to simplify the decision rule in (3). Thanks to the assumption of\nequal prior probability, we can drop the priors P (Y ), so that the decision rule is a comparison of the likelihoods,\nlogP (x | Y = 0) ≷ logP (x | Y = 1) (10) K(x) + ∑\ni\nxi log θ0,i ≷ K(x) + ∑\ni\nxi log θ1,i. (11)\nCanceling K(x) and applying the definition from (8),\n(12)\n∑\ni ∈W0\nxi log((1 + γ)µi) + ∑\ni ∈W1\nxi log((1− γ)µi)\n≷ ∑\ni ∈W0\nxi log((1 − γ)µi) + ∑\ni ∈W1\nxi log((1 + γ)µi).\nThe µi terms cancel after distributing the log, leaving, ∑\ni∈W0\nxi log 1 + γ 1− γ ≷ ∑\ni∈W1\nxi log 1 + γ\n1− γ . (13)\nFor any γ ∈ (0, 1), the term log 1+γ1−γ is a finite and positive constant. Therefore, (13) is identical to the counting-based classification rule in (1). In other words, lexicon-based classification is minimum Bayes risk classification in a multinomial probability model, under the assumptions of equal prior likelihood, lexicon completeness, equal predictiveness of words, and equal coverage."
    }, {
      "heading" : "Analysis of Lexicon-Based Classification",
      "text" : "One advantage of deriving a formal foundation for lexiconbased classification is that it is possible to analyze its expected performance. For a label y, let us write the count of in-lexicon words as my = ∑\ni∈Wy xi, and the count of\nopposite-lexicon words as m¬y = ∑\ni∈W¬y xi. Lexicon-\nbased classification makes a correct prediction whenever my > m¬y for the correct label y. To assess the likelihood that my > m¬y , it is sufficient to compute the expectation and variance of the difference my −m¬y; under the central limit theorem, we can treat this difference as approximately normally distributed, and compute the probability that the difference is positive using the Gaussian cumulative distribution function (CDF).\nLet us use the convenience notation sµ,\nsµ , ∑\ni∈W0\nµi = ∑\ni∈W1\nµi. (14)\nRecall that we have already taken the assumption that the sums of baseline word probabilities for the two lexicons are equal. Under the multinomial probability model, given a document with N tokens, the expected counts are,\nE[my] =N ∑\ni∈Wy\nθy,i = N(1 + γ)sµ (15)\nE[m¬y] =N ∑\ni∈W¬y\nθ¬y,i = N(1− γ)sµ (16)\nE[my −m¬y] =2Nγsµ. (17) Next we compute the variance of this margin,\nV [my −m¬y] =V [my] + V [m¬y] + Cov(my ,m¬y). (18)\nEach of these terms is the variance of a sum of counts. Under the multinomial distribution, the variance of a single count is V [xi] = Nθi(1− θi). The variance of the sum my is,\nV [my] = ∑\ni∈Wy\nNθi(1− θi)− ∑\nj∈Wy,j 6=i\nNθiθj\n= ∑\ni∈Wy\nNθi −Nθ2i − ∑\nj∈Wy ,j 6=i\nNθiθj (19)\n≤N ∑\ni∈Wy\nθi = N ∑\ni∈Wy\n(1 + γ)µi\n=N(1 + γ)sµ. (20)\nAn equivalent upper bound can be computed for the variance of the count of opposite lexicon words,\nV [m¬y] ≤ N(1− γ)sµ. (21) These bounds are fairly tight because the products of probabilities θ2i and θiθj are nearly always small, due to the fact that most words are rare. Because the covariance Cov(my,m¬y) is negative (and also involves a product of word probabilities), we can further bound the variance of the margin, obtaining the upper bound,\nV [my−m¬y] ≤ N(1+γ)sµ+N(1−γ)sµ = 2Nsµ. (22)\nBy the central limit theorem, the margin my − m¬y is approximately normally distributed, with mean 2Nγsµ and variance upper-bounded by 2Nsµ. The probability of making a correct prediction (which occurs when my > m¬y) is then equal to the cumulative density of a standard normal distribution Φ(z), where the z-score is equal to the ratio of the expectation and the standard deviation,\nz = E[my −m¬y] √ V [my −m¬y] ≥ 2Nγsµ√ 2Nsµ = γ √ 2Nsµ. (23)\nNote that by upper-bounding the variance, we obtain a lower bound on the z-score, and thus a lower bound on the expected accuracy.\nAccording to this approximation, accuracy is expected to increase with the predictiveness γ, the document length N , and the lexicon coverage sµ. This helps to explain a dilemma in lexicon design: as more words are added, the coverage increases, but the average predictiveness of each word decreases (assuming the most predictive words are added first). Thus, increasing the size of a lexicon by adding marginal words may not improve performance.\nThe analysis also predicts that longer documents should be easier to classify. This is because the expected size of the gap my − m¬y grows with N , while its standard deviation grows only with √ N . This prediction can be tested empirically, and on all four datasets considered in this paper, it is false: longer documents are harder to classify accurately. This is a clue that the underlying assumptions are not valid. The decreased accuracy for especially long reviews may be due to these reviews being more complex, perhaps requiring modeling of the discourse structure (Somasundaran, Wiebe, and Ruppenhofer 2008)."
    }, {
      "heading" : "Justifying the Word-Appearance Heuristic",
      "text" : "An alternative heuristic to lexicon-based classification is to consider only the presence of each word type, and not its count. This corresponds to the decision rule,\n(24) ∑\ni ∈W0\nδ(xi > 0) ≷ ∑\nj ∈W1\nδ(xj > 0),\nwhere δ(·) is a delta function that returns one if the Boolean condition is true, and zero otherwise. In the context of supervised classification, Pang, Lee, and Vaithyanathan (2002) find that word presence is a more predictive feature than word frequency. By ignoring repeated mentions of the same word, heuristic (24) emphasizes the diversity of ways in which a document covers a lexicon, and is more robust to document-specific idiosyncrasies — such as a review of The Joy Luck Club, which might include the positive words joy and luck many times even if the review is negative.\nThe word-appearance heuristic can also be explained in the framework defined above. The multinomial likelihood PX|Y can be replaced by a Dirichlet-compound multinomial (DCM) distribution, also known as a multivariate Polya distribution (Madsen, Kauchak, and Elkan 2005). This distribution is written Pdcm(x;αy), where αy is a vector of parameters associated with label y, with αy,i > 0 for all i ∈ {1, 2, . . . , V }. The DCM is a “compound” distribution because it treats the parameter of the multinomial as a latent variable to be marginalized out,\nPdcm(x;αy) =\n∫\nν\nPmultinomial(x | ν)PDirichlet(ν | αy)dν. (25)\nIntuitively, one can think of the DCM distribution as encoding a model in which each document has its own multinomial distribution over words; this document-specific distribution is itself drawn from a prior that depends on the class label y.\nSuppose we set the DCM parameter α = τθ, with θ as defined in (8). The constant τ > 0 is then the concentration of the distribution: as τ grows, the probability distribution over α is more closely concentrated around the prior expectation θ. Because ∑V\ni θi = 1, the likelihood function under this model is,\nPdcm(x | y) = Γ(τ)\nΓ(N + τ)\n∏\ni\nΓ(xi + τθy,i)\nΓ(τθy,i) , (26)\nwhere Γ(·) is the gamma function. Minimum Bayes risk classification in this model implies the decision rule:\n∑\ni∈W0\nlog rin(xi)\nrout(xi) ≷\n∑\ni∈W1\nlog rin(xt,i)\nrout(xi) (27)\nwhere,\nrin(xi) , Γ(xi + τ(1 + γ)µi)\nΓ(τ(1 + γ)µi) (28)\nrout(xi) , Γ(xi + τ(1 − γ)µi)\nΓ(τ(1 − γ)µi) . (29)\nAs τ → ∞, the prior on ν is tightly linked to θ, so that the model reduces to the multinomial defined above. Another\nway to see this is to apply the equality Γ(x + 1) = xΓ(x) to (28) and (29) when τµi ≫ xi. As τ → 0, the prior on ν becomes increasingly diffuse. Repeated counts of any word are better explained by document-specific variation from the prior, than by properties of the label. This situation is shown in Figure 1, which plots the “effective counts” implied by the classification rule (27) for a range of values of the concentration parameter τ , holding the other parameters constant (µ = 10−3, γ = 0.5). For high values of τ , the effective counts track the observed counts linearly, as in the multinomial model; for low values of τ , the effective counts barely increase beyond 1.\nMinka (2012) presents a number of estimators for the concentration parameter τ from a corpus of text. When the label y is unknown, we cannot apply these estimators directly. However, as described above, out-of-lexicon words are assumed to have identical probability under both labels. This assumption can be exploited to estimate τ exclusively from the first and second moments of these out-of-lexicon words. Analysis of the expected accuracy of this model is left to future work."
    }, {
      "heading" : "Estimating Word Predictiveness",
      "text" : "A crucial simplification made by lexicon-based classification is that all words in each lexicon are equally predictive. In reality, words may be more or less predictive of class labels, for reasons such as sense ambiguity (e.g., well) and degree (e.g., good vs flawless). By introducing a per-word predictiveness factor γi into (8), we arrive at a model that is a restricted form of Naı̈ve Bayes. (The restriction is that the probabilities of non-lexicon words are constrained to be identical across classes.) If labeled data were available, this model could be estimated by maximum likelihood. This section shows how to estimate the model without labeled data, using the method of moments.\nFirst, note that the baseline probabilities µi can be estimated directly from counts on an unlabeled corpus; the challenge is to estimate the parameters γi for all words in the two lexicons. The key intuition that makes this possible is that highly predictive words should rarely appear with words in the opposite lexicon. This idea can be formalized\nin terms of cross-label counts: the cross-label count ci is the co-occurrence count of word i with all words in the opposite lexicon,\nci = T ∑\nt=1\n∑\nj∈W¬y\nx (t) i x (t) j , (30)\nwhere x(t) is the vector of word counts for document t, with t ∈ {1 . . . T }. Under the multinomial model defined above, for a single document with N tokens, the expected product of counts for a word pair (i, j) is equal to,\nE[xixj ] =E[xi]E[xj ] + Cov(xi, xj)\n=NθiNθj −Nθiθj =N(N − 1)θiθj . (31)\nLet us focus on the expected products of counts for crosslexicon word pairs (i ∈ W0, j ∈ W1). The parameter θ depends on the document label y, as defined in (8). As a result, we have the following expectations,\nE[xixj | Y = 0] =N(N − 1)µi(1 + γi)µj(1− γj)\n=N(N − 1)µiµj(1 + γi − γj − γiγj) (32)\nE[xixj | Y = 1] =N(N − 1)µi(1− γi)µj(1 + γj)\n=N(N − 1)µiµj(1− γi + γj − γiγj) (33)\nE[xixj ] =P (Y = 0)E[xixj | Y = 0]\n+ P (Y = 1)E[xixj | Y = 1]\n=N(N − 1)µiµj(1− γiγj). (34)\nSumming over all words j ∈ W1 and all documents t,\n(35)\nE[ci] =\nT ∑\nt=1\n∑\nj∈W1\nE[x (t) i x (t) j ]\n=\nT ∑\nt=1\nNt(Nt − 1)µi ∑\nj∈W1\nµj(1− γiγj)\nLet us write γ(1) to indicate the vector of γj parameters for all j ∈ W1, and γ(0) for all i ∈ W0. The expectation in (35) is a linear function of γi, and a linear function of the vector γ(1). Analogously, for all j ∈ W1, E[cj ] is a linear function of γj and γ(1). Our goal is to choose γ so that the expectations E[ci] closely match the observed counts ci. This can be viewed as form of method of moments estimation, with the following objective,\nJ = 1\n2\n∑\ni∈W0\n(ci − E[ci])2 + 1\n2\n∑\nj∈W1\n(cj − E[cj ])2, (36)\nwhich can be minimized in terms of γ(0) and γ(1). However, there is an additional constraint: the probability distributions θ0 and θ1 must still sum to one. We can express this as a linear constraint on γ(0) and γ(1),\nµ(0) · γ(0) − µ(1) · γ(1) = 0, (37)\nwhere µ(y) is the vector of baseline probabilities for words i ∈ Wy , and µ(0) · γ(0) indicates a dot product.\nWe therefore formulate the following constrained optimization problem,\nmin γ(0),γ(1)\n1\n2\n∑\ni∈W0\n(ci − E[ci])2 + 1\n2\n∑\nj∈W1\n(cj − E[cj ])2\ns.t. µ(0) · γ(0) − µ(1) · γ(1) = 0 ∀i ∈ (W0 ∪W1), γi ∈ [0, 1). (38)\nThis problem can be solved by alternating direction method of multipliers (Boyd et al. 2011). The equality constraint can be incorporated into an augmented Lagrangian,\nLρ(γ (0),γ(1)) =\n1\n2\n∑\ni∈W0\n(ci − E[ci])2 + 1\n2\n∑\nj∈W1\n(cj − E[cj ])2\n+ ρ\n2 (µ(0) · γ(0) − µ(1) · γ(1))2, (39)\nwhere ρ > 0 is the penalty parameter. The augmented Lagrangian is biconvex in γ(0) and γ(1), which suggests an iterative solution (Boyd et al. 2011, page 76). Specifically, we hold γ(1) fixed and solve for γ(0), subject to γi ∈ [0, 1) for all i ∈ W0. We then solve for γ(1) under the same conditions. Finally, we update a dual variable u, representing the extent to which the equality constraint is violated. These updates are iterated until convergence. The unconstrained local updates to γ(0) and γ(1) can be computed by solving a system of linear equations, and the result can be projected back onto the feasible region. The penalty parameter ρ is initialized at 1, and then dynamically updated based on the primal and dual residuals (Boyd et al. 2011, pages 20-21). More details are available in the appendix, and in the online source code.2"
    }, {
      "heading" : "Evaluation",
      "text" : "An empirical evaluation is performed on four datasets in two languages. All datasets involve binary classification problems, and performance is quantified by the area-under-thecurve (AUC), a measure of classification performance that is robust to unbalanced class distributions. A perfect classifier achieves AUC = 1; in expectation, a random decision rule gives AUC = 0.5.\nDatasets The proposed method relies on co-occurrence counts, and therefore is best suited to documents containing at least a few sentences each. With this in mind, the following datasets are used in the evaluation: Amazon English-language product reviews across four do-\nmains; of these reviews, 8000 are labeled and another 19677 are unlabeled (Blitzer, Dredze, and Pereira 2007).\nCornell 2000 English-language film reviews (version 2.0), labeled as positive or negative (Pang and Lee 2004).\nCorpusCine 3800 Spanish-language movie reviews, rated on a scale of one to five (Vilares, Alonson, and GómezRodrı́guez 2015). Ratings of four or five are considered as positive; ratings of one and two are considered as negative. Reviews with a rating of three are excluded. 2https://github.com/jacobeisenstein/ probabilistic-lexicon-classification\nIMDB 50,000 English-language film reviews (Maas et al. 2011). This evaluation includes only the test set of 25,000 reviews, of which half are positive and half are negative.\nLexicons Preliminary evaluation compared several English-language sentiment lexicons. The Liu lexicon (Liu 2015) consistently obtained the best performance on all three English-language datasets, so it was made the focus of all subsequent experiments. Ribeiro et al. (2016) also found that the Liu lexicon is one of the strongest lexicons for review analysis. For the Spanish data, the ISOL lexicon was used (Molina-González et al. 2013). It is a modified translation of the Liu lexicon.\nClassifiers The evaluation compares the following unsupervised classification strategies: LEXICON basic word counting, as in decision rule (1); LEX-PRESENCE counting word presence rather than fre-\nquency, as in decision rule (24);\nPROBLEX-MULT probabilistic lexicon-based classification, as proposed in this paper, using the multinomial likelihood model;\nPROBLEX-DCM probabilistic lexicon-based classification, using the Dirichlet Compound Multinomial likelihood to reduce effective counts for repeated words;\nPMI An alternative approach, discussed in the related work, is to impute document labels from a seed set of words, and then compute “sentiment scores” for individual words from pointwise mutual information between the words and imputed labels (Turney 2002). The implementation of this method is based on the description from Kiritchenko, Zhu, and Mohammad (2014), using the lexicons as the seed word sets. As an upper bound, a supervised logistic regression classifier is also considered. This classifier is trained using fivefold cross validation. It is the only classifier with access to training data. For the PROBLEX-MULT and PROBLEXDCM methods, lexicon words which co-occur with the opposite lexicon at greater than chance frequency are eliminated from the lexicon in a preprocessing step.\nResults Results are shown in Table 1. The superior performance of the logistic regression classifier confirms the principle that supervised classification is far more accurate than lexicon-based classification. Therefore, supervised classification should be preferred when labeled data is available. Nonetheless, the probabilistic lexicon-based classifiers developed in this paper (PROBLEX-MULT and PROBLEXDCM) go a considerable way towards closing the gap, with improvements in AUC ranging from less than 1% on the CorpusCine data to nearly 8% on the IMDB data. The PMI approach performs poorly, improving over the simpler lexicon-based classifiers on only one of the four datasets. The word presence heuristic offers no consistent improvements, and the Bayesian adjustment to the classification rule (PROBLEX-DCM) offers only modest improvements on two of the four datasets."
    }, {
      "heading" : "Related work",
      "text" : "Turney (2002) uses pointwise mutual information to estimate the “semantic orientation” of all vocabulary words from co-occurrence with a small seed set. This approach has later been extended to the social media domain by using emoticons as the seed set (Kiritchenko, Zhu, and Mohammad 2014). Like the approach proposed here, the basic intuition is to leverage co-occurrence statistics to learn weights for individual words; however, PMI is a heuristic score that is not justified by a probabilistic model of the text classification problem. PMI-based classification underperforms PROBLEX-MULT and PROBLEX-DCM on all four datasets in our evaluation.\nThe method-of-moments has become an increasingly popular estimator in unsupervised machine learning, with applications in topic models (Anandkumar et al. 2014), sequence models (Hsu, Kakade, and Zhang 2012), and more elaborate linguistic structures (Cohen et al. 2014). Of particular relevance are “anchor word” techniques for learning latent topic models (Arora, Ge, and Moitra 2012). In these methods, each topic is defined first by a few keywords, which are assumed to be generated only from a single topic. From these anchor words and co-occurrence statistics, the topic-word probabilities can be recovered. A key difference is that the strong anchor word assumption is not required in this work: none of the words are assumed to be perfectly predictive of either label. We require only the much weaker assumption that words in a lexicon tend to co-occur less frequently with words in the opposite lexicon."
    }, {
      "heading" : "Conclusion",
      "text" : "Lexicon-based classification is a popular heuristic that has not previously been analyzed from a machine learning perspective. This analysis yields two techniques for improving unsupervised binary classification: a method-of-moments estimator for word predictiveness, and a Bayesian adjustment for repeated counts of the same word. The method-ofmoments estimator yields substantially better performance than conventional lexicon-based classification, without requiring any additional annotation effort. Future work will consider the generalization to multi-class classification, and more ambitiously, the extension to multiword units.\nAcknowledgment This research was supported by the National Institutes of Health under award number R01GM112697-01, and by the Air Force Office of Scientific Research."
    }, {
      "heading" : "Supplementary Material: Estimation Details",
      "text" : "This supplement describes the estimation procedure in more detail. The paper uses the method of moments to derive the following optimization problem,\nmin γ(0),γ(1)\n1\n2\n∑\ni∈W0\n(ci − E[ci])2 + 1\n2\n∑\nj∈W1\n(cj − E[cj ])2\ns.t. µ(0) · γ(0) − µ(1) · γ(1) = 0 ∀i∈W00 ≤ γ (0) i < 1\n∀j∈W10 ≤ γ (1) j < 1. (40)\nThis problem is biconvex in the parameters γ(0),γ(1). We optimize using the alternating direction method of multipliers (ADMM; Boyd et al. 2011). In the remainder of this document, x · y is used to indicate a dot product between x and y, and x⊙ y is used to indicate an elementwise product."
    }, {
      "heading" : "ADMM for biconvex problems",
      "text" : "In general, suppose that the function F (x, z) is biconvex in x and z, and that the constraint G(x, z) = 0 is affine in x and z,\nmin x,z F (x, z) (41)\ns.t.G(x, z) = 0. (42)\nWe can optimize via ADMM by the following updates (Boyd et al 2011, section 9.2),\nxk+1 ←argminxF (x, z) + (ρ/2)||G(x, zk) + uk||22 (43) zk+1 ←argminzF (x, z) + (ρ/2)||G(xk+1, z) + uk||22\n(44)\nuk+1 ←uk +G(xk+1, zk+1). (45)\nNow suppose we have a more general constrained optimization problem,\nmin x,z F (x, z) (46)\ns.t. G(x, z) = 0\nx ∈ Cx z ∈ Cz,\nwhere Cx and Cz are convex sets. We can solve via the updates,\nxk+1 ←argminx∈CxF (x, z) + (ρ/2)||G(x, z k) + uk||22 (47) zk+1 ←argminz∈CzF (x, z) + (ρ/2)||G(x k+1, z) + uk||22 (48) uk+1 ←uk +G(xk+1, zk+1), (49)\nwhere u is a dual variable and ρ > 0 is a hyperparameter."
    }, {
      "heading" : "Application to moment-matching",
      "text" : "In the application to moment-matching estimation, we have:\nx ,γ(0) (50)\nz ,γ(1) (51)\nG(x, z) ,µ(0) · γ(0) − µ(1) · γ(1) (52) Cx = Cz ,[0, 1) (53)\nF (x, z) , 1\n2\n∑\ni∈W0\n(ci − E[ci])2 + 1\n2\n∑\nj∈W1\n(cj − E[cj ])2\n(54)\nE[ci] = ∑\nj∈W1\nE[ci,j ] = sµi ∑\nj∈W1\nµj(1− γiγj)\n=sµi ∑\nj∈W1\nµj − sµiγi ∑\nj∈W1\nµjγj (55)\nE[cj ] = ∑\ni∈W0\nE[ci,j ] = sµj ∑\ni∈W0\nµi(1− γiγj)\n=sµj ∑\ni∈W0\nµi − sµjγj ∑\ni∈W0\nµiγi (56)\ns , ∑\nt\nNt(Nt − 1). (57)\nWe now consider how to perform the updates to xk+1 as a quadratic closed-form expression (an identical derivation applies to zk+1). Specifically, if the overall objective for x can be written in the form,\nJ(x) = 1\n2 xTPx+ q · x+ r, (58)\nthen the optimal value of x is found at,\nx̂ =− P−1q. (59) We will obtain this form by converting the objective F and the tersm relating to the equality constraint G the boundary constraint H into quadratic forms.\nObjective We define helper notation,\nri =ci − sµi ∑\nj∈W1\nµj (60)\nrj =cj − sµj ∑\ni∈W0\nµi, (61)\nrepresenting the residuals from a model in which γi = γj = 0 for all i and j. Using these residuals, we rewrite the objective from Equation 54,\nF (γ(0),γ(1)) = 1\n2\n∑\ni∈W0\n(ci − E[ci]) 2 +\n1\n2\n∑\nj∈W1\n(cj − E[cj ]) 2\n(62)\n= 1\n2\n∑\ni∈W0\n(ri + sµi\n(\n∑\nj∈W1\nµjγj\n)\nγi) 2\n+ 1\n2\n∑\nj∈W1\n(rj + sµj\n(\n∑\ni∈W0\nµiγi\n)\nγj) 2. (63)\nSolving first for γ(0), we can rewrite the left term as a quadratic function,\n1\n2\n∑\ni∈W0\n(ci −E[ci]) 2 =\n1 2 (γ(0))TP0γ (0) + q0 · γ (0) + 1 2 ∑\ni∈W0\nr2i\n(64)\n(P0)ii =(s 2( ∑\nj∈W1\nµjγj)µ 2 i ) (65)\n(P0)i6=j =0 (66)\nq0 =s( ∑\nj∈W1\nµjγj)(r (0) ⊙ µ(0)), (67)\nwhere the matrix P0 is diagonal. We can also rewrite the second term as a quadratic function of γ(0),\n1\n2\n∑\nj∈W1\n(cj − E[cj ]) 2 =\n1 2 (γ(0))TP1γ (0) + q1 · γ (0) + 1 2 ∑\nj∈W1\nr2j\n(68)\nP1 =s 2( ∑\nj\nµ2jγ 2 j )µ (0)(µ(0))T (69)\nq1 =s( ∑\nj\nrjµjγj)µ (0), (70)\nwhere the matrix P1 is rank one. To summarize the terms from the objective,\nPF =Diag\n( s2 [ ∑\nj∈W1\nµjγj\n]\nµ (0) ⊙ µ(0)\n)\n+ s2( ∑\nj∈W1\nµ2jγ 2 j )µ (0)(µ(0))T (71)\nqF =s( ∑\nj∈W1\nµjγj)(r (0) ⊙ µ(0)) + s(\n∑\nj∈W1\nrjµjγj)µ (0) (72)\nWe get an analogous set of terms when solving for γ(1), meaning that we can use the same code, with a change over arguments.\nEquality constraint The constraint G requires that equal weight be assigned to the two lexicons,\nG(γ(0),γ(1)) =µ(0) · γ(0) − µ(1) · γ(1) (73) Thus, the augmented Lagrangian term (ρ/2)||G(γ(0),γ(1)) + uk||22 can be written as a quadratic function of γ(0),\n(ρ/2)||G(γ(0),γ(1)) + uk||22 = (ρ/2)(µ(0) · γ(0) − µ(1) · γ(1) + uk)2 (74)\n= 1\n2 (γ(0))TPGγ (0) + qG · γ(0) + . . . . (75)\nThis quadratic form for γ(0) has the parameters,\nP (0) G =ρµ (0)(µ(0))T (76)\nq (0) G =ρ(u k − µ(1) · γ(1))µ(0). (77)\nWhen solving for γ(1), we have,\n(ρ/2)||G(γ(0),γ(1)) + uk||22 (78) = (ρ/2)(µ(0) · γ(0) − µ(1) · γ(1) + uk)2 (79)\n= 1\n2 (γ(1))TP (1) G γ (1) + q (1) G · γ(1) + . . . , (80)\nso that,\nP (1) G =ρµ (1)(µ(1))T (81)\nq (1) G =− ρ(uk + µ(0) · γ(0))µ(1) (82)\n=ρ(−uk − µ(0) · γ(0))µ(1), (83)\nmeaning that we can use the same code, but plug in −uk instead of uk.\nUnconstrained solution The augmented Lagrangian for γ(0) can be written as,\nJ(γ(0)) = 1\n2 (γ(0))TP (0)γ(0) + q(0) · γ(0) + r (84)\nP (0) =P (0) diag + P (0) low-rank (85)\nP (0) Diag =Diag\n\ns2\n\n\n∑\nj∈W1\nµjγj\n µ(0) ⊙ µ(0)   (86)\nP (0) Low-rank =(s 2( ∑\nj∈W1\nµ2jγ 2 j ) + ρ)µ (0)(µ(0))T (87)\nq(0) =s( ∑\nj∈W1\nµjγj)(r (0) ⊙ µ(0))\n+ s( ∑\nj∈W1\nrjµjγj)µ (0)\n+ ρ(uk − µ(1) · γ(1))µ(0) (88)\nIgnoring the constraint set Cx, the solution for γ(0) is given by,\nγ(0) ←− (P (0)diag + P (0) low-rank) −1q(0). (89)\nThe solution can be computed using the Woodbury identity.\nConstrained solution Each update to γ(0) and γ(1) must lie within the constraint sets Cx and Cz . One way to ensure this is to apply boundary-constrained L-BFGS to the augmented Lagrangian in Equation 84. This solution requires the gradient, which is simply Pγ(0) + q(0). A slightly faster (and more general) solution is to apply ADMM again, using the following iterative updates (Boyd et al. 2011, page 33):\nγ (0) ←− (P (0) diag + P (0) low-rank + ρ2I) −1(q(0) + ρ2(v − a)) (90)\na ←ΠCx(γ (0)) (91)\nv ←v + γ(0) − a, (92)\nwhere ΠCx projects on to the set Cx, and v is an additional dual variable. This requires only a minor change to the quadratic solution in Equation 89: we add ρ2 to the diagonal of P , and we add ρ2(v − a) to the vector q.\nAlgorithm 1 ADMM optimization for unsupervised lexicon-based classification\nwhile global primal and dual residuals are above threshold do\nP (0), q(0) ← ComputeQuadraticForm(γ(0),γ(1), u) a ← 0, v ← 0 while local primal and dual residuals are above thresh-\nold do γ(0) ← (P (0) + ρ2I)−1(q(0) + ρ2(v − a)) a ← ΠCx(γ(0) + v) v ← v + γ(0) − a\nγ(0) ← ΠCx(γ(0)) P (1), q(1) ← ComputeQuadraticForm(γ(1),γ(0),−u) b ← 0, w ← 0 while local primal and dual residuals are above thresh-\nold do γ(1) ← (P (1) + ρ2I)−1(q(1) + ρ2(w − b)) b ← ΠCz (γ(1) + w) w ← w + γ(1) − b\nγ(1) ← ΠCz (γ(1)) u ← u+ µ(0) · γ(0) − µ(1) · γ(1)\nThe overall algorithm is listed in Algorithm 1. Each loop terminates when the primal and dual residuals fall below a threshold (Boyd et al 2011, pages 19-20). We also use these residuals to dynamically adapt the penalties ρ and ρ2 (Boyd et al 2011, pages 20-21)."
    }, {
      "heading" : "Computer and System Sciences 78(5):1460–1480.",
      "text" : "Kiritchenko, S.; Zhu, X.; and Mohammad, S. M. 2014. Sentiment analysis of short informal texts. Journal of Artificial Intelligence Research 50:723–762.\nLaver, M., and Garry, J. 2000. Estimating policy positions from political texts. American Journal of Political Science 619–634.\nLiu, B. 2015. Sentiment Analysis: Mining Opinions, Sentiments, and Emotions. Cambridge University Press.\nMaas, A. L.; Daly, R. E.; Pham, P. T.; Huang, D.; Ng, A. Y.; and Potts, C. 2011. Learning word vectors for sentiment analysis. In Proceedings of the Association for Computational Linguistics (ACL).\nMadsen, R. E.; Kauchak, D.; and Elkan, C. 2005. Modeling word burstiness using the dirichlet distribution. In Proceedings of the 22nd international conference on Machine learning, 545–552. ACM.\nMinka, T. 2012. Estimating a dirichlet distribution. http://research.microsoft.com/ en-us/um/people/minka/papers/dirichlet/ minka-dirichlet.pdf.\nMolina-González, M. D.; Martı́nez-Cámara, E.; Martı́nValdivia, M.-T.; and Perea-Ortega, J. M. 2013. Semantic orientation for polarity classification in spanish reviews. Expert Systems with Applications 40(18):7250–7257.\nPang, B., and Lee, L. 2004. A sentimental education: Sentiment analysis using subjectivity summarization based on minimum cuts. In Proceedings of the Association for Computational Linguistics (ACL), 271–278.\nPang, B., and Lee, L. 2008. Opinion mining and sentiment analysis. Foundations and trends in information retrieval 2(1-2):1–135.\nPang, B.; Lee, L.; and Vaithyanathan, S. 2002. Thumbs up?: sentiment classification using machine learning techniques."
    }, {
      "heading" : "In Proceedings of Empirical Methods for Natural Language",
      "text" : "Processing (EMNLP), 79–86.\nPolanyi, L., and Zaenen, A. 2006. Contextual valence shifters. In Computing attitude and affect in text: Theory and applications. Springer.\nQiu, G.; Liu, B.; Bu, J.; and Chen, C. 2011. Opinion word expansion and target extraction through double propagation. Computational linguistics 37(1):9–27.\nRibeiro, F. N.; Araújo, M.; Gonçalves, P.; Gonçalves, M. A.; and Benevenuto, F. 2016. Sentibench-a benchmark comparison of state-of-the-practice sentiment analysis methods. EPJ Data Science 5(1):1–29.\nSettles, B. 2011. Closing the loop: Fast, interactive semi-supervised annotation with queries on features and instances. In Proceedings of the Conference on Empirical Methods in Natural Language Processing, 1467–1478. Association for Computational Linguistics.\nSomasundaran, S.; Wiebe, J.; and Ruppenhofer, J. 2008. Discourse level opinion interpretation. In Proceedings\nof the 22nd International Conference on Computational Linguistics-Volume 1, 801–808. Association for Computational Linguistics. Taboada, M.; Brooke, J.; Tofiloski, M.; Voll, K.; and Stede, M. 2011. Lexicon-based methods for sentiment analysis. Computational linguistics 37(2):267–307. Tausczik, Y. R., and Pennebaker, J. W. 2010. The psychological meaning of words: LIWC and computerized text analysis methods. Journal of Language and Social Psychology 29(1):24–54. Turney, P. 2002. Thumbs up or thumbs down? semantic orientation applied to unsupervised classification of reviews. In Proceedings of the Association for Computational Linguistics (ACL), 417–424. Vilares, D.; Alonson, M. A.; and Gómez-Rodrı́guez, C. 2015. A syntactic approach for opinion mining on spanish reviews. Natural Language Engineering 21:139–163. Wilson, T.; Wiebe, J.; and Hoffmann, P. 2005. Recognizing contextual polarity in phrase-level sentiment analysis. In Proceedings of Empirical Methods for Natural Language Processing (EMNLP), 347–354."
    } ],
    "references" : [ {
      "title" : "Tensor decompositions for learning latent variable models",
      "author" : [ "A. Anandkumar", "R. Ge", "D. Hsu", "S.M. Kakade", "M. Telgarsky" ],
      "venue" : "The Journal of Machine Learning Research 15(1):2773–2832.",
      "citeRegEx" : "Anandkumar et al\\.,? 2014",
      "shortCiteRegEx" : "Anandkumar et al\\.",
      "year" : 2014
    }, {
      "title" : "Learning topic models - going beyond SVD",
      "author" : [ "S. Arora", "R. Ge", "A. Moitra" ],
      "venue" : "FOCS, 1–10.",
      "citeRegEx" : "Arora et al\\.,? 2012",
      "shortCiteRegEx" : "Arora et al\\.",
      "year" : 2012
    }, {
      "title" : "Better documentlevel sentiment analysis from rst discourse parsing",
      "author" : [ "P. Bhatia", "Y. Ji", "J. Eisenstein" ],
      "venue" : "Proceedings of Empirical Methods for Natural Language Processing (EMNLP).",
      "citeRegEx" : "Bhatia et al\\.,? 2015",
      "shortCiteRegEx" : "Bhatia et al\\.",
      "year" : 2015
    }, {
      "title" : "Biographies, bollywood, boom-boxes and blenders: Domain adaptation for sentiment classification",
      "author" : [ "J. Blitzer", "M. Dredze", "F. Pereira" ],
      "venue" : "Proceedings of the Association for Computational Linguistics (ACL), 440–447.",
      "citeRegEx" : "Blitzer et al\\.,? 2007",
      "shortCiteRegEx" : "Blitzer et al\\.",
      "year" : 2007
    }, {
      "title" : "Distributed optimization and statistical learning via the alternating direction method of multipliers",
      "author" : [ "S. Boyd", "N. Parikh", "E. Chu", "B. Peleato", "J. Eckstein" ],
      "venue" : "Foundations and Trends R",
      "citeRegEx" : "Boyd et al\\.,? 2011",
      "shortCiteRegEx" : "Boyd et al\\.",
      "year" : 2011
    }, {
      "title" : "Spectral learning of latent-variable PCFGs: Algorithms and sample complexity",
      "author" : [ "S.B. Cohen", "K. Stratos", "M. Collins", "D.P. Foster", "L. Ungar" ],
      "venue" : "Journal of Machine Learning Research 15:2399–2449.",
      "citeRegEx" : "Cohen et al\\.,? 2014",
      "shortCiteRegEx" : "Cohen et al\\.",
      "year" : 2014
    }, {
      "title" : "Predicting the semantic orientation of adjectives",
      "author" : [ "V. Hatzivassiloglou", "K.R. McKeown" ],
      "venue" : "Proceedings of the Association for Computational Linguistics (ACL), 174–181.",
      "citeRegEx" : "Hatzivassiloglou and McKeown,? 1997",
      "shortCiteRegEx" : "Hatzivassiloglou and McKeown",
      "year" : 1997
    }, {
      "title" : "A spectral algorithm for learning hidden markov models",
      "author" : [ "D. Hsu", "S.M. Kakade", "T. Zhang" ],
      "venue" : "Journal of Computer and System Sciences 78(5):1460–1480.",
      "citeRegEx" : "Hsu et al\\.,? 2012",
      "shortCiteRegEx" : "Hsu et al\\.",
      "year" : 2012
    }, {
      "title" : "Sentiment analysis of short informal texts",
      "author" : [ "S. Kiritchenko", "X. Zhu", "S.M. Mohammad" ],
      "venue" : "Journal of Artificial Intelligence Research 50:723–762.",
      "citeRegEx" : "Kiritchenko et al\\.,? 2014",
      "shortCiteRegEx" : "Kiritchenko et al\\.",
      "year" : 2014
    }, {
      "title" : "Estimating policy positions from political texts",
      "author" : [ "M. Laver", "J. Garry" ],
      "venue" : "American Journal of Political Science 619–634.",
      "citeRegEx" : "Laver and Garry,? 2000",
      "shortCiteRegEx" : "Laver and Garry",
      "year" : 2000
    }, {
      "title" : "Sentiment Analysis: Mining Opinions, Sentiments, and Emotions",
      "author" : [ "B. Liu" ],
      "venue" : "Cambridge University Press.",
      "citeRegEx" : "Liu,? 2015",
      "shortCiteRegEx" : "Liu",
      "year" : 2015
    }, {
      "title" : "Learning word vectors for sentiment analysis",
      "author" : [ "A.L. Maas", "R.E. Daly", "P.T. Pham", "D. Huang", "A.Y. Ng", "C. Potts" ],
      "venue" : "Proceedings of the Association for Computational Linguistics (ACL).",
      "citeRegEx" : "Maas et al\\.,? 2011",
      "shortCiteRegEx" : "Maas et al\\.",
      "year" : 2011
    }, {
      "title" : "Modeling word burstiness using the dirichlet distribution",
      "author" : [ "R.E. Madsen", "D. Kauchak", "C. Elkan" ],
      "venue" : "Proceedings of the 22nd international conference on Machine learning, 545–552. ACM.",
      "citeRegEx" : "Madsen et al\\.,? 2005",
      "shortCiteRegEx" : "Madsen et al\\.",
      "year" : 2005
    }, {
      "title" : "Estimating a dirichlet distribution",
      "author" : [ "T. Minka" ],
      "venue" : null,
      "citeRegEx" : "Minka,? \\Q2012\\E",
      "shortCiteRegEx" : "Minka",
      "year" : 2012
    }, {
      "title" : "Semantic orientation for polarity classification in spanish reviews. Expert Systems with Applications 40(18):7250–7257",
      "author" : [ "M.D. Molina-González", "E. Martı́nez-Cámara", "M.-T. Martı́nValdivia", "J.M. Perea-Ortega" ],
      "venue" : null,
      "citeRegEx" : "Molina.González et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Molina.González et al\\.",
      "year" : 2013
    }, {
      "title" : "A sentimental education: Sentiment analysis using subjectivity summarization based on minimum cuts",
      "author" : [ "B. Pang", "L. Lee" ],
      "venue" : "Proceedings of the Association for Computational Linguistics (ACL), 271–278.",
      "citeRegEx" : "Pang and Lee,? 2004",
      "shortCiteRegEx" : "Pang and Lee",
      "year" : 2004
    }, {
      "title" : "Opinion mining and sentiment analysis",
      "author" : [ "B. Pang", "L. Lee" ],
      "venue" : "Foundations and trends in information retrieval 2(1-2):1–135.",
      "citeRegEx" : "Pang and Lee,? 2008",
      "shortCiteRegEx" : "Pang and Lee",
      "year" : 2008
    }, {
      "title" : "Thumbs up?: sentiment classification using machine learning techniques",
      "author" : [ "B. Pang", "L. Lee", "S. Vaithyanathan" ],
      "venue" : "Proceedings of Empirical Methods for Natural Language Processing (EMNLP), 79–86.",
      "citeRegEx" : "Pang et al\\.,? 2002",
      "shortCiteRegEx" : "Pang et al\\.",
      "year" : 2002
    }, {
      "title" : "Contextual valence shifters",
      "author" : [ "L. Polanyi", "A. Zaenen" ],
      "venue" : "Computing attitude and affect in text: Theory and applications. Springer.",
      "citeRegEx" : "Polanyi and Zaenen,? 2006",
      "shortCiteRegEx" : "Polanyi and Zaenen",
      "year" : 2006
    }, {
      "title" : "Opinion word expansion and target extraction through double propagation",
      "author" : [ "G. Qiu", "B. Liu", "J. Bu", "C. Chen" ],
      "venue" : "Computational linguistics 37(1):9–27.",
      "citeRegEx" : "Qiu et al\\.,? 2011",
      "shortCiteRegEx" : "Qiu et al\\.",
      "year" : 2011
    }, {
      "title" : "Sentibench-a benchmark comparison of state-of-the-practice sentiment analysis methods",
      "author" : [ "F.N. Ribeiro", "M. Araújo", "P. Gonçalves", "M.A. Gonçalves", "F. Benevenuto" ],
      "venue" : "EPJ Data Science 5(1):1–29.",
      "citeRegEx" : "Ribeiro et al\\.,? 2016",
      "shortCiteRegEx" : "Ribeiro et al\\.",
      "year" : 2016
    }, {
      "title" : "Closing the loop: Fast, interactive semi-supervised annotation with queries on features and instances",
      "author" : [ "B. Settles" ],
      "venue" : "Proceedings of the Conference on Empirical Methods in Natural Language Processing, 1467–1478. Association for Computational Linguistics.",
      "citeRegEx" : "Settles,? 2011",
      "shortCiteRegEx" : "Settles",
      "year" : 2011
    }, {
      "title" : "Discourse level opinion interpretation",
      "author" : [ "S. Somasundaran", "J. Wiebe", "J. Ruppenhofer" ],
      "venue" : "Proceedings",
      "citeRegEx" : "Somasundaran et al\\.,? 2008",
      "shortCiteRegEx" : "Somasundaran et al\\.",
      "year" : 2008
    }, {
      "title" : "Lexicon-based methods for sentiment analysis",
      "author" : [ "M. Taboada", "J. Brooke", "M. Tofiloski", "K. Voll", "M. Stede" ],
      "venue" : "Computational linguistics 37(2):267–307.",
      "citeRegEx" : "Taboada et al\\.,? 2011",
      "shortCiteRegEx" : "Taboada et al\\.",
      "year" : 2011
    }, {
      "title" : "The psychological meaning of words: LIWC and computerized text analysis methods",
      "author" : [ "Y.R. Tausczik", "J.W. Pennebaker" ],
      "venue" : "Journal of Language and Social Psychology 29(1):24–54.",
      "citeRegEx" : "Tausczik and Pennebaker,? 2010",
      "shortCiteRegEx" : "Tausczik and Pennebaker",
      "year" : 2010
    }, {
      "title" : "Thumbs up or thumbs down? semantic orientation applied to unsupervised classification of reviews",
      "author" : [ "P. Turney" ],
      "venue" : "Proceedings of the Association for Computational Linguistics (ACL), 417–424.",
      "citeRegEx" : "Turney,? 2002",
      "shortCiteRegEx" : "Turney",
      "year" : 2002
    }, {
      "title" : "A syntactic approach for opinion mining on spanish reviews",
      "author" : [ "D. Vilares", "M.A. Alonson", "C. Gómez-Rodrı́guez" ],
      "venue" : "Natural Language Engineering",
      "citeRegEx" : "Vilares et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Vilares et al\\.",
      "year" : 2015
    }, {
      "title" : "Recognizing contextual polarity in phrase-level sentiment analysis",
      "author" : [ "T. Wilson", "J. Wiebe", "P. Hoffmann" ],
      "venue" : "Proceedings of Empirical Methods for Natural Language Processing (EMNLP), 347–354.",
      "citeRegEx" : "Wilson et al\\.,? 2005",
      "shortCiteRegEx" : "Wilson et al\\.",
      "year" : 2005
    } ],
    "referenceMentions" : [ {
      "referenceID" : 23,
      "context" : "Introduction Lexicon-based classification refers to a classification rule in which documents are assigned labels based on the count of words from lexicons associated with each label (Taboada et al. 2011).",
      "startOffset" : 182,
      "endOffset" : 203
    }, {
      "referenceID" : 16,
      "context" : "Lexicon-based classification is widely used in industry and academia, with applications ranging from sentiment classification and opinion mining (Pang and Lee 2008; Liu 2015) to the psychological and ideological analysis of texts (Laver and Garry 2000; Tausczik and Pennebaker 2010).",
      "startOffset" : 145,
      "endOffset" : 174
    }, {
      "referenceID" : 10,
      "context" : "Lexicon-based classification is widely used in industry and academia, with applications ranging from sentiment classification and opinion mining (Pang and Lee 2008; Liu 2015) to the psychological and ideological analysis of texts (Laver and Garry 2000; Tausczik and Pennebaker 2010).",
      "startOffset" : 145,
      "endOffset" : 174
    }, {
      "referenceID" : 9,
      "context" : "Lexicon-based classification is widely used in industry and academia, with applications ranging from sentiment classification and opinion mining (Pang and Lee 2008; Liu 2015) to the psychological and ideological analysis of texts (Laver and Garry 2000; Tausczik and Pennebaker 2010).",
      "startOffset" : 230,
      "endOffset" : 282
    }, {
      "referenceID" : 24,
      "context" : "Lexicon-based classification is widely used in industry and academia, with applications ranging from sentiment classification and opinion mining (Pang and Lee 2008; Liu 2015) to the psychological and ideological analysis of texts (Laver and Garry 2000; Tausczik and Pennebaker 2010).",
      "startOffset" : 230,
      "endOffset" : 282
    }, {
      "referenceID" : 21,
      "context" : "The popularity of this approach can be explained by its relative simplicity and ease of use: for domain experts, creating lexicons is intuitive, and, in comparison with labeling instances, it may offer a faster path towards a reasonably accurate classifier (Settles 2011).",
      "startOffset" : 257,
      "endOffset" : 271
    }, {
      "referenceID" : 10,
      "context" : "Supervised classification systems, which are trained on labeled examples, tend to outperform lexicon-based classifiers, even without accounting for multi-word phenomena (Liu 2015; Pang and Lee 2008).",
      "startOffset" : 169,
      "endOffset" : 198
    }, {
      "referenceID" : 16,
      "context" : "Supervised classification systems, which are trained on labeled examples, tend to outperform lexicon-based classifiers, even without accounting for multi-word phenomena (Liu 2015; Pang and Lee 2008).",
      "startOffset" : 169,
      "endOffset" : 198
    }, {
      "referenceID" : 6,
      "context" : "Several researchers have proposed methods for lexicon expansion, automatically growing lexicons from an initial seed set (Hatzivassiloglou and McKeown 1997; Qiu et al. 2011).",
      "startOffset" : 121,
      "endOffset" : 173
    }, {
      "referenceID" : 19,
      "context" : "Several researchers have proposed methods for lexicon expansion, automatically growing lexicons from an initial seed set (Hatzivassiloglou and McKeown 1997; Qiu et al. 2011).",
      "startOffset" : 121,
      "endOffset" : 173
    }, {
      "referenceID" : 18,
      "context" : "There is also work on handling multi-word phenomena such as negation (Wilson, Wiebe, and Hoffmann 2005; Polanyi and Zaenen 2006), and discourse (Somasundaran, Wiebe, and Ruppenhofer 2008; Bhatia, Ji, and Eisenstein 2015).",
      "startOffset" : 69,
      "endOffset" : 128
    }, {
      "referenceID" : 13,
      "context" : "Minka (2012) presents a number of estimators for the concentration parameter τ from a corpus of text.",
      "startOffset" : 0,
      "endOffset" : 13
    }, {
      "referenceID" : 4,
      "context" : "(38) This problem can be solved by alternating direction method of multipliers (Boyd et al. 2011).",
      "startOffset" : 79,
      "endOffset" : 97
    }, {
      "referenceID" : 15,
      "context" : "0), labeled as positive or negative (Pang and Lee 2004).",
      "startOffset" : 36,
      "endOffset" : 55
    }, {
      "referenceID" : 11,
      "context" : "IMDB 50,000 English-language film reviews (Maas et al. 2011).",
      "startOffset" : 42,
      "endOffset" : 60
    }, {
      "referenceID" : 10,
      "context" : "The Liu lexicon (Liu 2015) consistently obtained the best performance on all three English-language datasets, so it was made the focus of all subsequent experiments.",
      "startOffset" : 16,
      "endOffset" : 26
    }, {
      "referenceID" : 14,
      "context" : "For the Spanish data, the ISOL lexicon was used (Molina-González et al. 2013).",
      "startOffset" : 48,
      "endOffset" : 77
    }, {
      "referenceID" : 10,
      "context" : "The Liu lexicon (Liu 2015) consistently obtained the best performance on all three English-language datasets, so it was made the focus of all subsequent experiments. Ribeiro et al. (2016) also found that the Liu lexicon is one of the strongest lexicons for review analysis.",
      "startOffset" : 4,
      "endOffset" : 188
    }, {
      "referenceID" : 25,
      "context" : "Classifiers The evaluation compares the following unsupervised classification strategies: LEXICON basic word counting, as in decision rule (1); LEX-PRESENCE counting word presence rather than frequency, as in decision rule (24); PROBLEX-MULT probabilistic lexicon-based classification, as proposed in this paper, using the multinomial likelihood model; PROBLEX-DCM probabilistic lexicon-based classification, using the Dirichlet Compound Multinomial likelihood to reduce effective counts for repeated words; PMI An alternative approach, discussed in the related work, is to impute document labels from a seed set of words, and then compute “sentiment scores” for individual words from pointwise mutual information between the words and imputed labels (Turney 2002).",
      "startOffset" : 751,
      "endOffset" : 764
    }, {
      "referenceID" : 25,
      "context" : "Classifiers The evaluation compares the following unsupervised classification strategies: LEXICON basic word counting, as in decision rule (1); LEX-PRESENCE counting word presence rather than frequency, as in decision rule (24); PROBLEX-MULT probabilistic lexicon-based classification, as proposed in this paper, using the multinomial likelihood model; PROBLEX-DCM probabilistic lexicon-based classification, using the Dirichlet Compound Multinomial likelihood to reduce effective counts for repeated words; PMI An alternative approach, discussed in the related work, is to impute document labels from a seed set of words, and then compute “sentiment scores” for individual words from pointwise mutual information between the words and imputed labels (Turney 2002). The implementation of this method is based on the description from Kiritchenko, Zhu, and Mohammad (2014), using the lexicons as the seed word sets.",
      "startOffset" : 752,
      "endOffset" : 871
    }, {
      "referenceID" : 0,
      "context" : "The method-of-moments has become an increasingly popular estimator in unsupervised machine learning, with applications in topic models (Anandkumar et al. 2014), sequence models (Hsu, Kakade, and Zhang 2012), and more elaborate linguistic structures (Cohen et al.",
      "startOffset" : 135,
      "endOffset" : 159
    }, {
      "referenceID" : 5,
      "context" : "2014), sequence models (Hsu, Kakade, and Zhang 2012), and more elaborate linguistic structures (Cohen et al. 2014).",
      "startOffset" : 95,
      "endOffset" : 114
    }, {
      "referenceID" : 23,
      "context" : "Related work Turney (2002) uses pointwise mutual information to estimate the “semantic orientation” of all vocabulary words from co-occurrence with a small seed set.",
      "startOffset" : 13,
      "endOffset" : 27
    }, {
      "referenceID" : 4,
      "context" : "We optimize using the alternating direction method of multipliers (ADMM; Boyd et al. 2011).",
      "startOffset" : 66,
      "endOffset" : 90
    } ],
    "year" : 2016,
    "abstractText" : "In lexicon-based classification, documents are assigned labels by comparing the number of words that appear from two opposed lexicons, such as positive and negative sentiment. Creating such words lists is often easier than labeling instances, and they can be debugged by non-experts if classification performance is unsatisfactory. However, there is little analysis or justification of this classification heuristic. This paper describes a set of assumptions that can be used to derive a probabilistic justification for lexicon-based classification, as well as an analysis of its expected accuracy. One key assumption behind lexicon-based classification is that all words in each lexicon are equally predictive. This is rarely true in practice, which is why lexicon-based approaches are usually outperformed by supervised classifiers that learn distinct weights on each word from labeled instances. This paper shows that it is possible to learn such weights without labeled data, by leveraging co-occurrence statistics across the lexicons. This offers the best of both worlds: light supervision in the form of lexicons, and data-driven classification with higher accuracy than traditional word-counting heuristics. Introduction Lexicon-based classification refers to a classification rule in which documents are assigned labels based on the count of words from lexicons associated with each label (Taboada et al. 2011). For example, suppose that we have opposed labels Y ∈ {0, 1}, and we have associated lexicons W0 and W1. Then for a document with a vector of word counts x, the lexicon-based decision rule is, (1) ∑",
    "creator" : "dvips(k) 5.991 Copyright 2011 Radical Eye Software"
  }
}