{
  "name" : "1611.01783.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "DOMAIN ADAPTATION FOR FORMANT ESTIMATION USING DEEP LEARNING",
    "authors" : [ "Yehoshua Dissen", "Joseph Keshet", "Jacob Goldberger", "Cynthia Clopper" ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : null,
      "text" : "Index Terms— Formant estimation, Neural networks, Transfer learning"
    }, {
      "heading" : "1. INTRODUCTION",
      "text" : "Formant frequency estimation is among the most fundamental problems in speech processing. In our previous work [1] we applied deep learning methods to the tasks of formant estimation and tracking. The network was trained and tested on the Vocal Tract Resonance (VTR) database [2] and we achieved state-of-the art results. However, we experienced a dropoff in performance when the network was presented at test time with other recorded speech databases (e.g. [3] [4]) due to the phenomenon of over-fitting to the speaker and speech domains represented in that database. Our goal is to train a single network that performs well on a variety of different speaker and speech domains. A straightforward approach is to use at training phase not just the VTR dataset but also examples from all other available datasets. However, when incorporating these databases into our training data, the results degraded for all domains of speech including the VTR dataset. These datasets were collected for different research purposes and there is a huge variability among the datasets due to gender, age, dialects, recording conditions, etc. Training a neural-network with a standard architecture based on fully connected layers that will yield good results on a diverse set of speaker domains\n∗This work was supported (in part) by grant from the MAGNET program of the Israeli Innovation Authority.\nis a very difficult task. Apart from formant estimation, the network neurons have to implicitly extract information from the input speech segment that describes the domain that contains this segment.\nIn this paper we present a network architecture and a training procedure that achieve accurate results regardless of the speech domain by introducing an additional domain adaptation layer that is trained separately from the original formant estimation network. The training is performed in two steps. First, we train a fully-connected network using the VTR dataset. Next, we freeze the network and, using all available datasets, train an additional adaptation layer that transforms the network into a formant estimation procedure that can be automatically adapted to the domain of the input speech. We empirically demonstrate that both the proposed network architecture and the proposed training procedure are required to achieve state-of-the-art results on the three datasets used in the study.\nThe paper is organized as follows. The next section describes the speech features set. Section 3 describes the datasets used for training and evaluating the networks. Section 4 presents the domain adaptation deep network along with a training procedure. Section 5 evaluates the proposed method by comparing it to state of the art formant estimation methods. We conclude the paper in Section 6."
    }, {
      "heading" : "2. ACOUSTIC FEATURES",
      "text" : "A key assumption is that in the task of formant estimation the whole segment is considered stationary, which mainly holds for monophthongs (pure vowels). The features are extracted from the whole segment.\nWe use the same sets of features as in our previous work [1]. The first set is based on Linear Predictive Coding (LPC) analysis, while the second is based on the pitch-synchronous spectra. We briefly describe and motivate each set of features."
    }, {
      "heading" : "2.1. LPC-based features",
      "text" : "An LPC model determines the coefficients of a forward linear predictor by minimizing the prediction error in the least\nar X\niv :1\n61 1.\n01 78\n3v 1\n[ cs\n.C L\n] 6\nN ov\n2 01\n6\nsquares sense. The spectrum of the LPC model can be interpreted as the envelop of the speech spectrum. The model order p determines how smooth the spectral envelop will be. Low values of p represent the coarse properties of the spectrum, and as p increases, more of the detailed properties are preserved. Beyond some value of p, the details of the spectrum do not reflect only the spectral resonances of the sound, but also the pitch and some noise. A disadvantage of this method is that if p is not well chosen (i.e., to match the number of resonance present in the speech), then the resulted LPC spectrum is not as accurate as desired [5].\nOur first set of acoustic features are based on the LPC models with a range of model orders between 8 and 17. This way the classifier can combine or filter out information from different model resolutions. Practically, we use the LPC cepstral coefficients of order 30 as Atals method[6] was a better representation for deep learning classifiers than the LPC coefficients themselves [1]."
    }, {
      "heading" : "2.2. Pitch-synchronous spectrum-based features",
      "text" : "The spectrum of a periodic speech signal is known to exhibit an impulse train structure located at multiples of the pitch period. A major concern when using the spectrum directly for locating the formants is that the resonance peaks might fall between two pitch lines, and then they are not “visible”. The LPC model estimates the spectrum envelop to overcome this problem. Another method to estimate the spectrum while eliminating the pitch impulse train is using the pitch synchronous spectrum [7]. According to this method the DFT is taken over frames the size of the instantaneous pitch.\nOne of the main problem of this method is the need of a very accurate pitch estimator. In our previous work [1] we showed that using frames of the size of the median pitch along the segment produces a spectrum, where its picks are not contaminated by the pitch.\nAt the final stage, the resulting quasi pitch-synchronous spectrum is converted to cepstral coefficients by applying log compression and then Discrete Cosine transform (DCT). We use the first 50 DCT coefficients as our second set of features."
    }, {
      "heading" : "3. DATASETS",
      "text" : "For the training and validating our model we used three different datasets.\nThe first being the Vocal Tract Resonance (VTR) corpus [2]. This corpus is composed of 538 utterances selected as a representative subset of the well-known and widely-used TIMIT corpus. These were split into 346 utterances for the training set and 192 utterances for the test set. These utterances were manually annotated for the first 3 formants and their bandwidths for every 10 msec frame. The fourth formant was annotated by the automatic tracking algorithm described in [8], and it is not used here for evaluation.\nThe second dataset [3] contains segments of acoustic signal from 20 female native English speakers aged 18-22 with no history of speech or language deficits. The participants were evenly split between two American English dialects (Northern and Midland). Participants read aloud a list of 991 CVC words. This study focused on 39 target words (777 tokens) which did or did not have a lexical contrast between either /E/ vs. /ae/ (e.g., dead-dad vs. deaf-*daff) or /A/ vs. /O/ (e.g., cot-caught vs. dock-*dawk). We refer to this dataset as the Clopper dataset. In this dataset the first and second formants were extracted using a standard tool (Praat) and then manually corrected.\nThe third dataset consists of data from a laboratory study conducted by Hillenbrand [4]. It contains segments of acoustic signal from 45 men, 48 women, and 46 ten-to 12-year-old children (27 boys and 19 girls). 87% of the participants were raised in Michigan, primarily in the southeastern and southwestern parts of the state. The audio recordings contain 12 different vowels (/i, I, E, ae, A, O, U, u, 2, 3~, e, o/) from the words: heed, hid, head, had, hod, hawed, hood, who’d, hud, heard, hayed, hoed. We refer to this dataset as the Hillenbrand dataset. As in the Clopper dataset, formants were extracted using an LPC-based automatic tool and then manually corrected.\nThe Clopper and Hillenbrand datasets are very different from the VTR dataset: they include young females and chil-\ndren who have a much higher range of formants than average men and women in the VTR dataset."
    }, {
      "heading" : "4. A DOMAIN ADAPTATION NETWORK",
      "text" : "In this section we describe a network architecture and training procedure that jointly form a domain adaptation approach for formant estimation. The network used for formant estimation is a feed-forward network trained in two phases. First we train a network using only the VTR dataset which is small, with a limited set of speakers and the formant annotation is relatively reliable. The network consists of an input layer with 350 features, 3 fully connected hidden layers of 1024, 512 and 256 neurons respectively, and an output linear layer that provides an estimation of the 4 formants. Since the network is trained solely on the VTR dataset we denote it hereafter as the VTR network. The trained VTR network yields good results on the test subset of the VTR dataset. However when it is applied to other datasets there is a significant performance degradation. The goal of this study is to train a single network that can be successfully used on different datasets. Naturally we do not assume that at train or test time the domain identity of a given input is revealed to the network rather we want the network to learn to adapt its predictions based on the original features. The approach we take in this study is to transfer the VTR network originally trained on the VTR dataset into a Domain Adaptation (DA) network. This network adaptation is done by adding two new elements to the VTR network. First we use the VTR formant estimation output layer as input to another linear layer that produces a new formant estimation. We also add a selection neuron s whose input is the same input of the original network. This selection neuron controls the amount of network adaptation that should be applied to each given input. The control element s is a non-linear function of the input feature vector c and is implemented by a linear operation followed by a sigmoid activation function, i.e.:\ns(c) = σ(ws · c+ bs) (1)\nsuch that c is the input vector and ws and bs are network parameters that are learned at training phase. Denote the formant output of the original VTR network by f1, ..., f4. The new formant estimation g1, ..., g4 is computed as follows:\ngi = 4∑ j=1 wijfj + bi + vi · s(c) (2)\nwhere wij and bi are the parameters of the additional linear layer and vi is a multiplicative term that defines the contribution of the dataset control element s(c) to the estimation of the i-th formant. A scheme of the domain adaptation (DA) network is shown in Figure 1.\nWe can use all the available datasets to train the DA network from scratch starting from a random initialization of\nthe network parameters. However, since the network topology is complicated, this yields inferior results (as we show in the next section) . Instead, we train the network in two steps. First we train the VTR sub-network only using only the VTR dataset. Next we freeze the parameters of the VTR network and only train the adaptation parameters (2) (1) using the VTR, Clopper, and Hillenbrand datasets. This two-step training procedure ensures that the VTR sub-network is responsible for the core formant estimation, and the adaptation part of the network is responsible solely for adapting the formant estimation to the conditions of the specific input vector.\nOne of the advantages of training the network in two steps, is that there is only a small number of adaptation parameters so large amounts of data from each dataset are not necessary. Hence, domains with limited labeled data as in our case can still be used to learn a good formant estimator.\nTo better visualize what the network has learned we show the histograms of the domain parameters activation values s for each dataset. The histogram axis are the number of examples in each of the 10 buckets of activations between 0 and 1 (which is the output range of a sigmoid function). As seen in the right-most histograms in Figure 2, the s values for the VTR database are almost exclusively concentrated in the same area showing that the network automatically found that no adaptation is needed for data from the VTR dataset. This coincides with the fact that the original network was trained on VTR dataset. In contrast, predictions from the Hillenbrand dataset needed to be corrected occasionally and predictions from the Clopper dataset consistently needed to be corrected, as seen by the variance in s values."
    }, {
      "heading" : "5. RESULTS",
      "text" : "Here we present the results of the domain adaptation network compared to our previous work [1] that is based on training only on the VTR data and WaveSurfer [9] a popular tool in\nphonetic research. The results of our system, DeepFormant and of WaveSurfer on the three datasets we used are shown in Table 1, where the loss is the mean absolute difference in Hz. Note that the Clopper dataset was annotated for the first and the second formants, hence the third formant was not evaluated.\nAs seen in the table, we achieved better results across the board over WaveSurfer when comparing our respective estimations to the manually annotated reference. The domain adaptation network shows improvement over DeepFormants in both the Clopper and Hillenbrand datasets with no significant drop off in accuracy on the VTR dataset. These results show the advantage of the proposed network architecture over standard networks based on fully connected layers.\nWhen comparing these results to separate networks trained and tested on each of the databases, i.e. training a model with data from the Clopper dataset and then testing on the Clopper test set and another model trained and tested on the Hillenbrand dataset in the same manner and so on for the VTR dataset, we obtained comparable results. Hence, there is no need for multiple models for each domain, this single network can separate between the speaker and speech domains and adjust its estimations accordingly.\nIn the next experiment we demonstrate the need for the two step training procedure proposed in this study. Table 2 shows the formant estimation results of two training strategies of the domain adaptation network. In the table we compare the results of the two step training to the results of a network with the same topology but trained jointly on all three datasets. As can be seen from Table 2, other than for the first formant in the Clopper dataset the accuracy is greatly diminished across all other data. Moreover adding the selection layer doesn’t improve results over training a network identical to the VTR network but using all three datasets during training."
    }, {
      "heading" : "6. CONCLUSIONS",
      "text" : "In this paper we proposed a formant estimation deep-learning architecture that achieves state-of-the-art results across sev-\neral speech and speaker domains that are very different in nature. We also proposed a training scheme that validates the claim that each component of the network is indeed responsible for the task it was designed to do, either formant estimation or domain adaptation. We have demonstrated here automated formant estimation tools that are ready to be added to the methods that sociolinguists use to analyze acoustic data. The tools will be publicly available at https://github. com/MLSpeech/domainadaptation. In future work we plan to evaluate the robustness of our method not only to different datasets but also to noisy environments."
    }, {
      "heading" : "7. REFERENCES",
      "text" : "[1] Yehoshua Dissen and Joseph Keshet, “Formant estimation and tracking using deep learning,” The 17th Annual Conference of the International Speech Communication Association, 2016.\n[2] Li Deng, Xiaodong Cui, Robert Pruvenok, Yanyi Chen, Safiyy Momen, and Abeer Alwan, “A database of vocal tract resonance trajectories for research in speech processing,” in Acoustics, Speech and Signal Processing, 2006. ICASSP 2006 Proceedings. 2006 IEEE International Conference on. IEEE, 2006, vol. 1, pp. I–I.\n[3] Cynthia G Clopper and Terrin N Tamati, “Effects of local\nlexical competition and regional dialect on vowel production,” The Journal of the Acoustical Society of America, vol. 136, no. 1, pp. 1–4, 2014.\n[4] James Hillenbrand, Laura A Getty, Michael J Clark, and Kimberlee Wheeler, “Acoustic characteristics of american english vowels,” The Journal of the Acoustical society of America, vol. 97, no. 5, pp. 3099–3111, 1995.\n[5] Gary E Birch, Peter Lawrence, John C Lind, and Robert D Hare, “Application of prewhitening to ar spectral estimation of EEG,” Biomedical Engineering, IEEE Transactions on, vol. 35, no. 8, pp. 640–645, 1988.\n[6] Bishnu S Atal, “Effectiveness of linear prediction characteristics of the speech wave for automatic speaker identification and verification,” the Journal of the Acoustical Society of America, vol. 55, no. 6, pp. 1304–1312, 1974.\n[7] Yoav Medan and Eyal Yair, “Pitch synchronous spectral analysis scheme for voiced speech,” IEEE Trans. on Acoustics, Speech and Signal Processing, vol. 37, no. 9, pp. 1321–1328, 1989.\n[8] Li Deng, Leo J Lee, Hagai Attias, and Alex Acero, “A structured speech model with continuous hidden dynamics and prediction-residual training for tracking vocal tract resonances,” in Acoustics, Speech, and Signal Processing, 2004. Proceedings.(ICASSP’04). IEEE International Conference on. IEEE, 2004, vol. 1, pp. I–557.\n[9] Kåre Sjölander and Jonas Beskow, “Wavesurfer-an open source speech tool.,” in Interspeech, 2000, pp. 464–467."
    } ],
    "references" : [ {
      "title" : "Formant estimation and tracking using deep learning",
      "author" : [ "Yehoshua Dissen", "Joseph Keshet" ],
      "venue" : "The 17th Annual Conference of the International Speech Communication Association, 2016.",
      "citeRegEx" : "1",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "A database of vocal tract resonance trajectories for research in speech processing",
      "author" : [ "Li Deng", "Xiaodong Cui", "Robert Pruvenok", "Yanyi Chen", "Safiyy Momen", "Abeer Alwan" ],
      "venue" : "Acoustics, Speech and Signal Processing, 2006. ICASSP 2006 Proceedings. 2006 IEEE International Conference on. IEEE, 2006, vol. 1, pp. I–I.",
      "citeRegEx" : "2",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Effects of local  lexical competition and regional dialect on vowel production",
      "author" : [ "Cynthia G Clopper", "Terrin N Tamati" ],
      "venue" : "The Journal of the Acoustical Society of America, vol. 136, no. 1, pp. 1–4, 2014.",
      "citeRegEx" : "3",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Acoustic characteristics of american english vowels",
      "author" : [ "James Hillenbrand", "Laura A Getty", "Michael J Clark", "Kimberlee Wheeler" ],
      "venue" : "The Journal of the Acoustical society of America, vol. 97, no. 5, pp. 3099–3111, 1995.",
      "citeRegEx" : "4",
      "shortCiteRegEx" : null,
      "year" : 1995
    }, {
      "title" : "Application of prewhitening to ar spectral estimation of EEG",
      "author" : [ "Gary E Birch", "Peter Lawrence", "John C Lind", "Robert D Hare" ],
      "venue" : "Biomedical Engineering, IEEE Transactions on, vol. 35, no. 8, pp. 640–645, 1988.",
      "citeRegEx" : "5",
      "shortCiteRegEx" : null,
      "year" : 1988
    }, {
      "title" : "Effectiveness of linear prediction characteristics of the speech wave for automatic speaker identification and verification",
      "author" : [ "Bishnu S Atal" ],
      "venue" : "the Journal of the Acoustical Society of America, vol. 55, no. 6, pp. 1304–1312, 1974.",
      "citeRegEx" : "6",
      "shortCiteRegEx" : null,
      "year" : 1974
    }, {
      "title" : "Pitch synchronous spectral analysis scheme for voiced speech",
      "author" : [ "Yoav Medan", "Eyal Yair" ],
      "venue" : "IEEE Trans. on Acoustics, Speech and Signal Processing, vol. 37, no. 9, pp. 1321–1328, 1989.",
      "citeRegEx" : "7",
      "shortCiteRegEx" : null,
      "year" : 1989
    }, {
      "title" : "A structured speech model with continuous hidden dynamics and prediction-residual training for tracking vocal tract resonances",
      "author" : [ "Li Deng", "Leo J Lee", "Hagai Attias", "Alex Acero" ],
      "venue" : "Acoustics, Speech, and Signal Processing, 2004. Proceedings.(ICASSP’04). IEEE International Conference on. IEEE, 2004, vol. 1, pp. I–557.",
      "citeRegEx" : "8",
      "shortCiteRegEx" : null,
      "year" : 2004
    }, {
      "title" : "Wavesurfer-an open source speech tool",
      "author" : [ "Kåre Sjölander", "Jonas Beskow" ],
      "venue" : "Interspeech, 2000, pp. 464–467.",
      "citeRegEx" : "9",
      "shortCiteRegEx" : null,
      "year" : 2000
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "In our previous work [1] we applied deep learning methods to the tasks of formant estimation and tracking.",
      "startOffset" : 21,
      "endOffset" : 24
    }, {
      "referenceID" : 1,
      "context" : "The network was trained and tested on the Vocal Tract Resonance (VTR) database [2] and we achieved state-of-the art results.",
      "startOffset" : 79,
      "endOffset" : 82
    }, {
      "referenceID" : 2,
      "context" : "[3] [4]) due to the phenomenon of over-fitting to the speaker and speech domains represented in that database.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 3,
      "context" : "[3] [4]) due to the phenomenon of over-fitting to the speaker and speech domains represented in that database.",
      "startOffset" : 4,
      "endOffset" : 7
    }, {
      "referenceID" : 0,
      "context" : "We use the same sets of features as in our previous work [1].",
      "startOffset" : 57,
      "endOffset" : 60
    }, {
      "referenceID" : 4,
      "context" : ", to match the number of resonance present in the speech), then the resulted LPC spectrum is not as accurate as desired [5].",
      "startOffset" : 120,
      "endOffset" : 123
    }, {
      "referenceID" : 5,
      "context" : "Practically, we use the LPC cepstral coefficients of order 30 as Atals method[6] was a better representation for deep learning classifiers than the LPC coefficients themselves [1].",
      "startOffset" : 77,
      "endOffset" : 80
    }, {
      "referenceID" : 0,
      "context" : "Practically, we use the LPC cepstral coefficients of order 30 as Atals method[6] was a better representation for deep learning classifiers than the LPC coefficients themselves [1].",
      "startOffset" : 176,
      "endOffset" : 179
    }, {
      "referenceID" : 6,
      "context" : "Another method to estimate the spectrum while eliminating the pitch impulse train is using the pitch synchronous spectrum [7].",
      "startOffset" : 122,
      "endOffset" : 125
    }, {
      "referenceID" : 0,
      "context" : "In our previous work [1] we showed that using frames of the size of the median pitch along the segment produces a spectrum, where its picks are not contaminated by the pitch.",
      "startOffset" : 21,
      "endOffset" : 24
    }, {
      "referenceID" : 1,
      "context" : "The first being the Vocal Tract Resonance (VTR) corpus [2].",
      "startOffset" : 55,
      "endOffset" : 58
    }, {
      "referenceID" : 7,
      "context" : "The fourth formant was annotated by the automatic tracking algorithm described in [8], and it is not used here for evaluation.",
      "startOffset" : 82,
      "endOffset" : 85
    }, {
      "referenceID" : 2,
      "context" : "The second dataset [3] contains segments of acoustic signal from 20 female native English speakers aged 18-22 with no history of speech or language deficits.",
      "startOffset" : 19,
      "endOffset" : 22
    }, {
      "referenceID" : 3,
      "context" : "The third dataset consists of data from a laboratory study conducted by Hillenbrand [4].",
      "startOffset" : 84,
      "endOffset" : 87
    }, {
      "referenceID" : 8,
      "context" : "VTR WaveSurfer [9] 70 96 154 DeepFormants [1] 48 83 109 Domain Adaptation 50 86 104",
      "startOffset" : 15,
      "endOffset" : 18
    }, {
      "referenceID" : 0,
      "context" : "VTR WaveSurfer [9] 70 96 154 DeepFormants [1] 48 83 109 Domain Adaptation 50 86 104",
      "startOffset" : 42,
      "endOffset" : 45
    }, {
      "referenceID" : 0,
      "context" : "Here we present the results of the domain adaptation network compared to our previous work [1] that is based on training only on the VTR data and WaveSurfer [9] a popular tool in",
      "startOffset" : 91,
      "endOffset" : 94
    }, {
      "referenceID" : 8,
      "context" : "Here we present the results of the domain adaptation network compared to our previous work [1] that is based on training only on the VTR data and WaveSurfer [9] a popular tool in",
      "startOffset" : 157,
      "endOffset" : 160
    } ],
    "year" : 2016,
    "abstractText" : "In this paper we present a domain adaptation technique for formant estimation using a deep network. We first train a deep learning network on a small read speech dataset. We then freeze the parameters of the trained network and use several different datasets to train an adaptation layer that makes the obtained network universal in the sense that it works well for a variety of speakers and speech domains with very different characteristics. We evaluated our adapted network on three datasets, each of which has different speaker characteristics and speech styles. The performance of our method compares favorably with alternative methods for formant estimation.",
    "creator" : "LaTeX with hyperref package"
  }
}