{
  "name" : "1702.02535.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Exploiting Domain Knowledge via Grouped Weight Sharing with Application to Text Categorization",
    "authors" : [ "Ye Zhang", "Matthew Lease", "Byron C. Wallace" ],
    "emails" : [ "yezhang@utexas.edu,", "ml@utexas.edu,", "byron@ccs.neu.edu" ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "Neural models are powerful in part due to their ability to learn good representations of raw textual inputs, mitigating the need for extensive task-specific feature engineering (Collobert et al., 2011). However, a downside of learning from scratch is failing to capitalize on prior linguistic or semantic knowledge, often encoded in existing resources such as ontologies. Such prior knowledge can be particularly valuable when estimating highly flexible models. In this work, we address how to exploit known relationships between words when training neural models for NLP tasks.\nWe propose exploiting the feature-hashing trick, originally proposed as a means of neural network compression (Chen et al., 2015). Here we instead view the partial parameter sharing induced by feature hashing as a flexible mechanism for ty-\ning together network node weights that we believe to be similar a priori. In effect, this acts as a regularizer that constrains the model to learn weights that agree with the domain knowledge codified in external resources like ontologies.\nMore specifically, as external resources we use Brown clusters (Brown et al., 1992), WordNet (Miller, 1995) and the Unified Medical Language System (UMLS) (Bodenreider, 2004). From these we derive groups of words with similar meaning. We then use feature hashing to share a subset of weights between the embeddings of words that belong to the same semantic group(s). This forces the model to respect prior domain knowledge, insofar as words similar under a given ontology are compelled to have similar embeddings.\nOur contribution is a novel, simple and flexible method for injecting domain knowledge into neural models via stochastic weight sharing. Results on seven diverse classification tasks (three sentiment and four biomedical) show that our method consistently improves performance over (1) baselines that fail to capitalize on domain knowledge, and (2) an approach that uses retrofitting (Faruqui et al., 2014) as a preprocessing step to encode do-\nar X\niv :1\n70 2.\n02 53\n5v 1\n[ cs\n.C L\n] 8\nF eb\n2 01\n7\nmain knowledge prior to training."
    }, {
      "heading" : "2 Grouped Weight Sharing",
      "text" : "We incorporate similarity relations codified in existing resources (here derived from Brown clusters, SentiWordNet and the UMLS) as prior knowledge in a Convolutional Neural Network (CNN).1 To achieve this we construct a shared embedding matrix such that words known a priori to be similar are constrained to share some fraction of embedding weights.\nConcretely, suppose we have N groups of words derived from an external resource. Note that one could derive such groups in several ways; e.g., using the synsets in SentiWordNet. We denote groups by {g1, g2, ..., gN}. Each group is associated with an embedding ggi , which we initialize by averaging the pre-trained embeddings of each word in the group.\nTo exploit both grouped and independent word weights, we adopt a two-channel CNN model (Zhang et al., 2016). The embedding matrix of the first channel is initialized with pre-trained word vectors. We denote this input by Ep ∈ RV×d (V is the vocabulary size and d the dimension of the word embeddings). The second channel input matrix is initialized with our proposed weight-sharing embedding Es ∈ RV×d. Es is initialized by drawing from both Ep and the external resource following the process we describe below.\nGiven an input text sequence of length l, we construct sequence embedding representations Wp ∈ Rl×d and Ws ∈ Rl×d using the corresponding embedding matrices. We then apply independent sets of linear convolution filters on these two matrices. Each filter will generate a feature map vector v ∈ Rl−h+1 (h is the filter height). We perform 1-max pooling over each v, extracting one scalar per feature map. Finally, we concatenate scalars from all of the feature maps (from both channels) into a feature vector which is fed to a softmax function to predict the label (Figure 2).\nWe initialize Es as follows. Each row ei ∈ Rd of Es is the embedding of word i. Words may belong to one or more groups. A mapping function G(i) retrieves the groups that word i belongs to, i.e., G(i) returns a subset of {g1, g2, ..., gN}, which we denote by {g(i)1 , g (i) 2 ...g (i) K }, where K is the number of groups that contain word i. To\n1The idea of sharing weights to reflect known similarity is general and could be applied with other neural architectures.\ninitialize Es, for each dimension j of each word embedding ei, we use a hash function hi to map (hash) the index j to one of the K group IDs: hi : N → {g(i)1 , g (i) 2 ...g (i) K }. Following (Weinberger et al., 2009; Shi et al., 2009), we use a second hash function b to remove bias induced by hashing. This is a signing function, i.e., it maps (i, j) tuples to {+1,−1}. We then set ei,j to the product of ghi(j),j and b(i, j). h and b are both approximately uniform hash functions. Algorithm 1 provides the full initialization procedure.\nAlgorithm 1 Initialization of Es\n1: for i in {1, . . . , V } do 2: {g(i)1 , g (i) 2 , . . . , g (i) K } := G(i). 3: for j ∈ {1, . . . , d} do 4: ei,j := ghi(j),j · b(i, j) 5: end for 6: end for\nFor illustration, consider Figure 1. Here g1 contains three words: good, nice and amazing, while g2 has two words: good and interesting. The group embeddings gg1 , gg2 are initialized as averages over the pre-trained embeddings of the words they comprise. Here, embedding parameters e1,1 and e2,1 are both mapped to gg1,1, and thus share this value. Similarly, e1,3 and e2,3 will share value at gg1,3. We have elided the second hash function b\nfrom this figure for simplicity. During training, we update Ep as usual using back-propagation (Rumelhart et al., 1986). We update Es and group embeddings g in a manner similar to Chen et al. (2015). In the forward propagation before each training step (mini-batch), we derive the value of ei,j from g:\nei,j := ghi(j),j ∗ b(i, j) (1)\nWe use this newly updated ei,j to do the forward propagation in CNN.\nDuring backward propagation, we first compute the gradient of Es, and then we use this to derive the gradient w.r.t gs. To do this, for each dimension j in ggk , we aggregate the gradients w.r.t E s whose elements are mapped to this dimension:\n∇ggk,j := ∑ (i,j) ∇Esi,j · δhi(j)=gk · b(i, j) (2)\nwhere δhi(j)=gk = 1 when h i(j) = gk, and 0 otherwise. Each training step involves executing Equations 1 and 2 . Once the shared gradient is calculated, gradient descent proceeds as usual. We update all parameters aside from the shared weights in the standard way."
    }, {
      "heading" : "3 Experimental Setup",
      "text" : ""
    }, {
      "heading" : "3.1 Datasets",
      "text" : "We use three sentiment datasets: a movie review (MR) dataset (Pang and Lee, 2005)2; a customer review (CR) dataset (Hu and Liu, 2004)3; and an opinion dataset (MPQA) (Wiebe et al., 2005)4.\nWe also use four biomedical datasets, which concern systematic reviews. The task here is to classify published articles describing clinical trials as relevant or not to a well-specified clinical question. Articles deemed relevant are included in the corresponding review, which is a synthesis of all pertinent evidence (Wallace et al., 2010). We use data from reviews that concerned: clopidogrel (CL) for cardiovascular conditions (Dahabreh et al., 2013); biomarkers for assessing iron deficiency in anemia (AN) experienced by patients with kidney disease (Chung et al., 2012); statins (ST) (Cohen et al., 2006); and proton beam (PB) therapy (Terasawa et al., 2009).\n2www.cs.cornell.edu/people/pabo/ movie-review-data/\n3www.cs.uic.edu/˜liub/FBS/ sentiment-analysis.html\n4mpqa.cs.pitt.edu/corpora/mpqa_corpus/"
    }, {
      "heading" : "3.2 Implementation Details and Baselines",
      "text" : "We use SentiWordNet (Baccianella et al., 2010)5 for the sentiment tasks. SentiWordNet assigns to each synset of wordnet three sentiment scores: positivity, negativity and objectivity, constrained to sum to 1. We keep only the synsets with positivity or negativity scores greater than 0, i.e., we remove synsets deemed objective. The synsets in SentiWordNet constitute our groups. We also use the Brown clustering algorithm6 on the three sentiment datasets. We generate 1000 clusters and treat each as a group.\nFor the biomedical datasets, we use the Medical Subject Headings (MeSH) terms7 attached to each abstract to classify them. Each MeSH term has a tree number indicating the path from the root in the UMLS. For example, ‘Alagille Syndrome’ has tree number ‘C06.552.150.125’; periods denote tree splits, numbers are nodes. We induce groups comprising MeSH terms that share the same first three parent nodes, e.g., all terms with ‘C06.552.150’ as their tree number prefix constitute one group.\nWe compare our approach to several baselines. All use pre-trained embeddings to initialize Ep, but we explore several approaches to exploiting Es: (1) randomly initialize Es; (2) initialize Es to reflect the group embedding g, but do not share weights thereafter; (3) use the linguistic resources to retro-fit (Faruqui et al., 2014) the pre-trained embeddings, and use these to initialize Es.\nFor the sentiment datasets we use three filter heights (3,4,5) for each of the two CNN channels. For the biomedical datasets, we use only one filter height (1), because the inputs are unstructured MeSH terms.8 In both cases we use 100 filters of each unique height. For the sentiment datasets, we use Google word2vec (Mikolov et al., 2013)9 to\n5sentiwordnet.isti.cnr.it 6github.com/percyliang/brown-cluster 7www.nlm.nih.gov/bsd/disted/ meshtutorial/ 8For this work we are ignoring title and abstract texts. 9code.google.com/archive/p/word2vec/\ninitialize Ep. For the biomedical datasets, we use word2vec trained on biomedical texts (Moen and Ananiadou, 2013)10 to initialize Ep. For parameter estimation, we use Adadelta (Zeiler, 2012).\nWe developed our approach using the MR sentiment dataset, tuning our approach to constructing groups from the available resources – experiments on other sentiment datasets were run after we finalized the model and hyperparameters. Similarly, we used the anemia (AN) review as a development set for the biomedical tasks, especially w.r.t. constructing groups from MeSH terms using UMLS."
    }, {
      "heading" : "4 Results",
      "text" : "We report results (averages from 10-fold cross validation) on the sentiment and biomedical corpora in Tables 211 and 3, respectively. These exploit different external resources to induce the word groupings that in turn inform weight sharing. We report AUC for the biomedical datasets because these are highly imbalanced (see Table 1).\nOur method improves performance compared to all relevant baselines (including an approach that also exploits external knowledge via retrofitting) in six of seven cases. Informing weight initialization using external resources improves performance independently, but additional gains are realized by also enforcing sharing during training.\nWe note that our aim here is not necessarily to achieve state-of-art results on any given dataset,\n10bio.nlplab.org/ 11Sentiment task results are not directly comparable to\nprior work due to different preprocessing steps.\nbut rather to evaluate the proposed method for incorporating external linguistic resources into neural models via weight sharing. We have therefore compared to baselines that enable us to assess this."
    }, {
      "heading" : "5 Related Work",
      "text" : "Neural Models for NLP. Recently there has been enormous interest in neural models for NLP generally (Collobert et al., 2011; Goldberg, 2016). Most relevant to this work, simple CNN based models (which we have built on here) have proven extremely effective for text categorization (Kim, 2014; Zhang and Wallace, 2015). Exploiting Linguistic Resources. A potential drawback to learning from scratch in end-to-end neural models is a failure to capitalize on existing knowledge sources. There have been efforts to exploit such resources specifically to induce better word vectors (Yu and Dredze, 2014; Faruqui et al., 2014; Yu et al., 2016; Xu et al., 2014). But these models do not attempt to exploit external resources jointly during training for a particular downstream task (which uses word embeddings as inputs), as we do here.\nPast work on sparse linear models has shown the potential of exploiting linguistic knowledge in statistical NLP models. For example, Yogatama and Smith (2014) used external resources to inform structured, grouped regularization of loglinear text classification models, yielding improvements over standard regularization approaches. Elsewhere, Doshi-Velez et al. (2015) proposed a variant of LDA that exploits a priori known treestructured relations between tokens (e.g., derived from the UMLS) in topic modeling. Weight-sharing in NNs. Recent work has considered stochastically sharing weights in neural models. Notably, Chen et al. (2015) proposed randomly sharing weights in neural networks. Their primary motivation was compression, whereas here we view the hashing trick as a mechanism to encode domain knowledge."
    }, {
      "heading" : "6 Conclusions",
      "text" : "We have proposed a novel method for incorporating prior semantic knowledge into neural models via stochastic weight sharing. We demonstrated that this generally improves text classification performance, compared to model variants that fail to exploit external resources and to an approach based on retrofitting prior to training.\nIn future work, we hope to generalize the approach beyond classification tasks, and to inform weight sharing using other varieties and sources of linguistic knowledge."
    } ],
    "references" : [ {
      "title" : "Sentiwordnet 3.0: An enhanced lexical resource for sentiment analysis and opinion mining",
      "author" : [ "Stefano Baccianella", "Andrea Esuli", "Fabrizio Sebastiani" ],
      "venue" : "In LREC",
      "citeRegEx" : "Baccianella et al\\.,? \\Q2010\\E",
      "shortCiteRegEx" : "Baccianella et al\\.",
      "year" : 2010
    }, {
      "title" : "The unified medical language system (umls): integrating biomedical terminology",
      "author" : [ "Olivier Bodenreider." ],
      "venue" : "Nucleic acids research 32(suppl 1):D267– D270.",
      "citeRegEx" : "Bodenreider.,? 2004",
      "shortCiteRegEx" : "Bodenreider.",
      "year" : 2004
    }, {
      "title" : "Class-based n-gram models of natural language",
      "author" : [ "Peter F Brown", "Peter V Desouza", "Robert L Mercer", "Vincent J Della Pietra", "Jenifer C Lai." ],
      "venue" : "Computational linguistics 18(4):467–479.",
      "citeRegEx" : "Brown et al\\.,? 1992",
      "shortCiteRegEx" : "Brown et al\\.",
      "year" : 1992
    }, {
      "title" : "Compressing neural networks with the hashing trick",
      "author" : [ "Wenlin Chen", "James T Wilson", "Stephen Tyree", "Kilian Q Weinberger", "Yixin Chen." ],
      "venue" : "ICML. pages 2285–2294.",
      "citeRegEx" : "Chen et al\\.,? 2015",
      "shortCiteRegEx" : "Chen et al\\.",
      "year" : 2015
    }, {
      "title" : "Biomarkers for assessing and managing iron deficiency anemia in late-stage chronic kidney disease",
      "author" : [ "Mei Chung", "Denish Moorthy", "Nira Hadar", "Priyanka Salvi", "Ramon C Iovin", "Joseph Lau" ],
      "venue" : null,
      "citeRegEx" : "Chung et al\\.,? \\Q2012\\E",
      "shortCiteRegEx" : "Chung et al\\.",
      "year" : 2012
    }, {
      "title" : "Reducing workload in systematic review preparation using automated citation classification",
      "author" : [ "Aaron M Cohen", "William R Hersh", "K Peterson", "PoYin Yen." ],
      "venue" : "Journal of the American Medical Informatics Association 13(2):206–219.",
      "citeRegEx" : "Cohen et al\\.,? 2006",
      "shortCiteRegEx" : "Cohen et al\\.",
      "year" : 2006
    }, {
      "title" : "Natural language processing (almost) from scratch",
      "author" : [ "Ronan Collobert", "Jason Weston", "Léon Bottou", "Michael Karlen", "Koray Kavukcuoglu", "Pavel Kuksa." ],
      "venue" : "Journal of Machine Learning Research 12(Aug):2493–2537.",
      "citeRegEx" : "Collobert et al\\.,? 2011",
      "shortCiteRegEx" : "Collobert et al\\.",
      "year" : 2011
    }, {
      "title" : "Testing of cyp2c19 variants and platelet reactivity for guiding antiplatelet treatment",
      "author" : [ "Issa J Dahabreh", "Denish Moorthy", "Jenny L Lamont", "Minghua L Chen", "David M Kent", "Joseph Lau" ],
      "venue" : null,
      "citeRegEx" : "Dahabreh et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Dahabreh et al\\.",
      "year" : 2013
    }, {
      "title" : "Graph-sparse lda: A topic model with structured sparsity",
      "author" : [ "Finale Doshi-Velez", "Byron C Wallace", "Ryan Adams." ],
      "venue" : "AAAI Conference on Artificial Intelligence. pages 2575–2581.",
      "citeRegEx" : "Doshi.Velez et al\\.,? 2015",
      "shortCiteRegEx" : "Doshi.Velez et al\\.",
      "year" : 2015
    }, {
      "title" : "Retrofitting word vectors to semantic lexicons",
      "author" : [ "Manaal Faruqui", "Jesse Dodge", "Sujay K Jauhar", "Chris Dyer", "Eduard Hovy", "Noah A Smith." ],
      "venue" : "arXiv preprint arXiv:1411.4166 .",
      "citeRegEx" : "Faruqui et al\\.,? 2014",
      "shortCiteRegEx" : "Faruqui et al\\.",
      "year" : 2014
    }, {
      "title" : "A primer on neural network models for natural language processing",
      "author" : [ "Yoav Goldberg." ],
      "venue" : "Journal of Artificial Intelligence Research 57:345–420.",
      "citeRegEx" : "Goldberg.,? 2016",
      "shortCiteRegEx" : "Goldberg.",
      "year" : 2016
    }, {
      "title" : "Mining and summarizing customer reviews",
      "author" : [ "Minqing Hu", "Bing Liu." ],
      "venue" : "Proceedings of the tenth ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, pages 168– 177.",
      "citeRegEx" : "Hu and Liu.,? 2004",
      "shortCiteRegEx" : "Hu and Liu.",
      "year" : 2004
    }, {
      "title" : "Convolutional neural networks for sentence classification",
      "author" : [ "Yoon Kim." ],
      "venue" : "arXiv preprint arXiv:1408.5882 .",
      "citeRegEx" : "Kim.,? 2014",
      "shortCiteRegEx" : "Kim.",
      "year" : 2014
    }, {
      "title" : "Efficient estimation of word representations in vector space",
      "author" : [ "Tomas Mikolov", "Kai Chen", "Greg Corrado", "Jeffrey Dean." ],
      "venue" : "arXiv preprint arXiv:1301.3781 .",
      "citeRegEx" : "Mikolov et al\\.,? 2013",
      "shortCiteRegEx" : "Mikolov et al\\.",
      "year" : 2013
    }, {
      "title" : "Wordnet: a lexical database for english",
      "author" : [ "George A Miller." ],
      "venue" : "Communications of the ACM 38(11):39–",
      "citeRegEx" : "Miller.,? 1995",
      "shortCiteRegEx" : "Miller.",
      "year" : 1995
    }, {
      "title" : "Distributional semantics resources for biomedical text processing",
      "author" : [ "SPFGH Moen" ],
      "venue" : null,
      "citeRegEx" : "Moen and Ananiadou.,? \\Q2013\\E",
      "shortCiteRegEx" : "Moen and Ananiadou.",
      "year" : 2013
    }, {
      "title" : "Seeing stars: Exploiting class relationships for sentiment categorization with respect to rating scales",
      "author" : [ "Bo Pang", "Lillian Lee." ],
      "venue" : "Proceedings of the ACL.",
      "citeRegEx" : "Pang and Lee.,? 2005",
      "shortCiteRegEx" : "Pang and Lee.",
      "year" : 2005
    }, {
      "title" : "Learning representations by backpropagating errors",
      "author" : [ "D.E. Rumelhart", "G.E. Hintont", "R.J. Williams." ],
      "venue" : "Nature 323(6088):533–536.",
      "citeRegEx" : "Rumelhart et al\\.,? 1986",
      "shortCiteRegEx" : "Rumelhart et al\\.",
      "year" : 1986
    }, {
      "title" : "Hash kernels for structured data",
      "author" : [ "Qinfeng Shi", "James Petterson", "Gideon Dror", "John Langford", "Alex Smola", "SVN Vishwanathan." ],
      "venue" : "Journal of Machine Learning Research 10(Nov):2615–2637.",
      "citeRegEx" : "Shi et al\\.,? 2009",
      "shortCiteRegEx" : "Shi et al\\.",
      "year" : 2009
    }, {
      "title" : "Charged Particle Radiation Therapy for Cancer: A Systematic Review",
      "author" : [ "T. Terasawa", "T. Dvorak", "S. Ip", "G. Raman", "J. Lau", "T.A. Trikalinos." ],
      "venue" : "Ann. Intern. Med. .",
      "citeRegEx" : "Terasawa et al\\.,? 2009",
      "shortCiteRegEx" : "Terasawa et al\\.",
      "year" : 2009
    }, {
      "title" : "Semi-automated screening of biomedical citations for systematic reviews",
      "author" : [ "Byron C Wallace", "Thomas A Trikalinos", "Joseph Lau", "Carla Brodley", "Christopher H Schmid." ],
      "venue" : "BMC bioinformatics 11(1):55.",
      "citeRegEx" : "Wallace et al\\.,? 2010",
      "shortCiteRegEx" : "Wallace et al\\.",
      "year" : 2010
    }, {
      "title" : "Feature hashing for large scale multitask learning",
      "author" : [ "Kilian Weinberger", "Anirban Dasgupta", "John Langford", "Alex Smola", "Josh Attenberg." ],
      "venue" : "Proceedings of the 26th Annual International Conference on Machine Learning. ACM, pages 1113–",
      "citeRegEx" : "Weinberger et al\\.,? 2009",
      "shortCiteRegEx" : "Weinberger et al\\.",
      "year" : 2009
    }, {
      "title" : "Annotating expressions of opinions and emotions in language",
      "author" : [ "Janyce Wiebe", "Theresa Wilson", "Claire Cardie." ],
      "venue" : "Language resources and evaluation 39(2):165–210.",
      "citeRegEx" : "Wiebe et al\\.,? 2005",
      "shortCiteRegEx" : "Wiebe et al\\.",
      "year" : 2005
    }, {
      "title" : "Rcnet: A general framework for incorporating knowledge into word representations",
      "author" : [ "Chang Xu", "Yalong Bai", "Jiang Bian", "Bin Gao", "Gang Wang", "Xiaoguang Liu", "Tie-Yan Liu." ],
      "venue" : "Proceedings of the 23rd ACM International Conference on Confer-",
      "citeRegEx" : "Xu et al\\.,? 2014",
      "shortCiteRegEx" : "Xu et al\\.",
      "year" : 2014
    }, {
      "title" : "Linguistic structured sparsity in text categorization",
      "author" : [ "Dani Yogatama", "Noah A Smith." ],
      "venue" : "Meeting of the Association for Computational Linguistics. pages 786–796.",
      "citeRegEx" : "Yogatama and Smith.,? 2014",
      "shortCiteRegEx" : "Yogatama and Smith.",
      "year" : 2014
    }, {
      "title" : "Improving lexical embeddings with semantic knowledge",
      "author" : [ "Mo Yu", "Mark Dredze." ],
      "venue" : "ACL. pages 545–550.",
      "citeRegEx" : "Yu and Dredze.,? 2014",
      "shortCiteRegEx" : "Yu and Dredze.",
      "year" : 2014
    }, {
      "title" : "Retrofitting word vectors of mesh terms to improve semantic similarity measures",
      "author" : [ "Zhiguo Yu", "Trevor Cohen", "Elmer V Bernstam", "Byron C Wallace." ],
      "venue" : "International Workshop on Health Text Mining and Information Analysis at EMNLP pages 43–",
      "citeRegEx" : "Yu et al\\.,? 2016",
      "shortCiteRegEx" : "Yu et al\\.",
      "year" : 2016
    }, {
      "title" : "Adadelta: An adaptive learning rate method",
      "author" : [ "Matthew D. Zeiler" ],
      "venue" : null,
      "citeRegEx" : "Zeiler.,? \\Q2012\\E",
      "shortCiteRegEx" : "Zeiler.",
      "year" : 2012
    }, {
      "title" : "MGNC-CNN: A simple approach to exploiting multiple word embeddings for sentence classification pages 1522–1527",
      "author" : [ "Ye Zhang", "Stephen Roller", "Byron C Wallace" ],
      "venue" : null,
      "citeRegEx" : "Zhang et al\\.,? \\Q2016\\E",
      "shortCiteRegEx" : "Zhang et al\\.",
      "year" : 2016
    }, {
      "title" : "A sensitivity analysis of (and practitioners’ guide to) convolutional neural networks for sentence classification",
      "author" : [ "Ye Zhang", "Byron C Wallace." ],
      "venue" : "arXiv preprint arXiv:1510.03820 .",
      "citeRegEx" : "Zhang and Wallace.,? 2015",
      "shortCiteRegEx" : "Zhang and Wallace.",
      "year" : 2015
    } ],
    "referenceMentions" : [ {
      "referenceID" : 6,
      "context" : "Neural models are powerful in part due to their ability to learn good representations of raw textual inputs, mitigating the need for extensive task-specific feature engineering (Collobert et al., 2011).",
      "startOffset" : 177,
      "endOffset" : 201
    }, {
      "referenceID" : 3,
      "context" : "We propose exploiting the feature-hashing trick, originally proposed as a means of neural network compression (Chen et al., 2015).",
      "startOffset" : 110,
      "endOffset" : 129
    }, {
      "referenceID" : 2,
      "context" : "More specifically, as external resources we use Brown clusters (Brown et al., 1992), WordNet (Miller, 1995) and the Unified Medical Language System (UMLS) (Bodenreider, 2004).",
      "startOffset" : 63,
      "endOffset" : 83
    }, {
      "referenceID" : 14,
      "context" : ", 1992), WordNet (Miller, 1995) and the Unified Medical Language System (UMLS) (Bodenreider, 2004).",
      "startOffset" : 17,
      "endOffset" : 31
    }, {
      "referenceID" : 1,
      "context" : ", 1992), WordNet (Miller, 1995) and the Unified Medical Language System (UMLS) (Bodenreider, 2004).",
      "startOffset" : 79,
      "endOffset" : 98
    }, {
      "referenceID" : 9,
      "context" : "Results on seven diverse classification tasks (three sentiment and four biomedical) show that our method consistently improves performance over (1) baselines that fail to capitalize on domain knowledge, and (2) an approach that uses retrofitting (Faruqui et al., 2014) as a preprocessing step to encode doar X iv :1 70 2.",
      "startOffset" : 246,
      "endOffset" : 268
    }, {
      "referenceID" : 28,
      "context" : "To exploit both grouped and independent word weights, we adopt a two-channel CNN model (Zhang et al., 2016).",
      "startOffset" : 87,
      "endOffset" : 107
    }, {
      "referenceID" : 21,
      "context" : "Following (Weinberger et al., 2009; Shi et al., 2009), we use a second hash function b to remove bias induced by hashing.",
      "startOffset" : 10,
      "endOffset" : 53
    }, {
      "referenceID" : 18,
      "context" : "Following (Weinberger et al., 2009; Shi et al., 2009), we use a second hash function b to remove bias induced by hashing.",
      "startOffset" : 10,
      "endOffset" : 53
    }, {
      "referenceID" : 17,
      "context" : "During training, we update Ep as usual using back-propagation (Rumelhart et al., 1986).",
      "startOffset" : 62,
      "endOffset" : 86
    }, {
      "referenceID" : 3,
      "context" : "We update Es and group embeddings g in a manner similar to Chen et al. (2015). In the forward propagation before each training step (mini-batch), we derive the value of ei,j from g:",
      "startOffset" : 59,
      "endOffset" : 78
    }, {
      "referenceID" : 16,
      "context" : "We use three sentiment datasets: a movie review (MR) dataset (Pang and Lee, 2005)2; a customer review (CR) dataset (Hu and Liu, 2004)3; and an opinion dataset (MPQA) (Wiebe et al.",
      "startOffset" : 61,
      "endOffset" : 81
    }, {
      "referenceID" : 11,
      "context" : "We use three sentiment datasets: a movie review (MR) dataset (Pang and Lee, 2005)2; a customer review (CR) dataset (Hu and Liu, 2004)3; and an opinion dataset (MPQA) (Wiebe et al.",
      "startOffset" : 115,
      "endOffset" : 133
    }, {
      "referenceID" : 22,
      "context" : "We use three sentiment datasets: a movie review (MR) dataset (Pang and Lee, 2005)2; a customer review (CR) dataset (Hu and Liu, 2004)3; and an opinion dataset (MPQA) (Wiebe et al., 2005)4.",
      "startOffset" : 166,
      "endOffset" : 186
    }, {
      "referenceID" : 20,
      "context" : "Articles deemed relevant are included in the corresponding review, which is a synthesis of all pertinent evidence (Wallace et al., 2010).",
      "startOffset" : 114,
      "endOffset" : 136
    }, {
      "referenceID" : 7,
      "context" : "We use data from reviews that concerned: clopidogrel (CL) for cardiovascular conditions (Dahabreh et al., 2013); biomarkers for assessing iron deficiency in anemia (AN) experienced by patients with kidney disease (Chung et al.",
      "startOffset" : 88,
      "endOffset" : 111
    }, {
      "referenceID" : 4,
      "context" : ", 2013); biomarkers for assessing iron deficiency in anemia (AN) experienced by patients with kidney disease (Chung et al., 2012); statins (ST) (Cohen et al.",
      "startOffset" : 109,
      "endOffset" : 129
    }, {
      "referenceID" : 5,
      "context" : ", 2012); statins (ST) (Cohen et al., 2006); and proton beam (PB) therapy (Terasawa et al.",
      "startOffset" : 22,
      "endOffset" : 42
    }, {
      "referenceID" : 19,
      "context" : ", 2006); and proton beam (PB) therapy (Terasawa et al., 2009).",
      "startOffset" : 38,
      "endOffset" : 61
    }, {
      "referenceID" : 0,
      "context" : "We use SentiWordNet (Baccianella et al., 2010)5 for the sentiment tasks.",
      "startOffset" : 20,
      "endOffset" : 46
    }, {
      "referenceID" : 9,
      "context" : "All use pre-trained embeddings to initialize Ep, but we explore several approaches to exploiting Es: (1) randomly initialize Es; (2) initialize Es to reflect the group embedding g, but do not share weights thereafter; (3) use the linguistic resources to retro-fit (Faruqui et al., 2014) the pre-trained embeddings, and use these to initialize Es.",
      "startOffset" : 264,
      "endOffset" : 286
    }, {
      "referenceID" : 13,
      "context" : "For the sentiment datasets, we use Google word2vec (Mikolov et al., 2013)9 to",
      "startOffset" : 51,
      "endOffset" : 73
    }, {
      "referenceID" : 15,
      "context" : "word2vec trained on biomedical texts (Moen and Ananiadou, 2013)10 to initialize Ep.",
      "startOffset" : 37,
      "endOffset" : 63
    }, {
      "referenceID" : 27,
      "context" : "For parameter estimation, we use Adadelta (Zeiler, 2012).",
      "startOffset" : 42,
      "endOffset" : 56
    }, {
      "referenceID" : 6,
      "context" : "Recently there has been enormous interest in neural models for NLP generally (Collobert et al., 2011; Goldberg, 2016).",
      "startOffset" : 77,
      "endOffset" : 117
    }, {
      "referenceID" : 10,
      "context" : "Recently there has been enormous interest in neural models for NLP generally (Collobert et al., 2011; Goldberg, 2016).",
      "startOffset" : 77,
      "endOffset" : 117
    }, {
      "referenceID" : 12,
      "context" : "els (which we have built on here) have proven extremely effective for text categorization (Kim, 2014; Zhang and Wallace, 2015).",
      "startOffset" : 90,
      "endOffset" : 126
    }, {
      "referenceID" : 29,
      "context" : "els (which we have built on here) have proven extremely effective for text categorization (Kim, 2014; Zhang and Wallace, 2015).",
      "startOffset" : 90,
      "endOffset" : 126
    }, {
      "referenceID" : 25,
      "context" : "There have been efforts to exploit such resources specifically to induce better word vectors (Yu and Dredze, 2014; Faruqui et al., 2014; Yu et al., 2016; Xu et al., 2014).",
      "startOffset" : 93,
      "endOffset" : 170
    }, {
      "referenceID" : 9,
      "context" : "There have been efforts to exploit such resources specifically to induce better word vectors (Yu and Dredze, 2014; Faruqui et al., 2014; Yu et al., 2016; Xu et al., 2014).",
      "startOffset" : 93,
      "endOffset" : 170
    }, {
      "referenceID" : 26,
      "context" : "There have been efforts to exploit such resources specifically to induce better word vectors (Yu and Dredze, 2014; Faruqui et al., 2014; Yu et al., 2016; Xu et al., 2014).",
      "startOffset" : 93,
      "endOffset" : 170
    }, {
      "referenceID" : 23,
      "context" : "There have been efforts to exploit such resources specifically to induce better word vectors (Yu and Dredze, 2014; Faruqui et al., 2014; Yu et al., 2016; Xu et al., 2014).",
      "startOffset" : 93,
      "endOffset" : 170
    }, {
      "referenceID" : 22,
      "context" : "For example, Yogatama and Smith (2014) used external resources to inform structured, grouped regularization of loglinear text classification models, yielding improvements over standard regularization approaches.",
      "startOffset" : 13,
      "endOffset" : 39
    }, {
      "referenceID" : 7,
      "context" : "Elsewhere, Doshi-Velez et al. (2015) proposed a variant of LDA that exploits a priori known treestructured relations between tokens (e.",
      "startOffset" : 11,
      "endOffset" : 37
    }, {
      "referenceID" : 3,
      "context" : "Notably, Chen et al. (2015) proposed randomly sharing weights in neural networks.",
      "startOffset" : 9,
      "endOffset" : 28
    } ],
    "year" : 2017,
    "abstractText" : "A fundamental advantage of neural models for NLP is their ability to learn representations from scratch. However, in practice this often means ignoring existing external linguistic resources, e.g., WordNet or domain specific ontologies such as the Unified Medical Language System (UMLS). We propose a general, novel method for exploiting such resources via weight sharing. Prior work on weight sharing in neural networks has considered it largely as a means of model compression. In contrast, we treat weight sharing as a flexible mechanism for incorporating prior knowledge into neural models. We show that this approach consistently yields improved performance on classification tasks compared to baseline strategies that do not exploit weight sharing.",
    "creator" : "LaTeX with hyperref package"
  }
}