{
  "name" : "1703.09400.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Diving Deep into Clickbaits: Who Use Them to What Extents in Which Topics with What Effects?",
    "authors" : [ "Md Main Uddin", "Rony", "Naeemul Hassan", "Mohammad Yousuf" ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : null,
      "text" : "I. INTRODUCTION\nThe term clickbait refers to a form of web content that employs writing formulas and linguistic techniques in headlines to trick readers into clicking links [1], [2], but does not deliver on promises 1. Media scholars and pundits consistently show clickbait content in a bad light, but the industry based on this type of content has been rapidly growing and reaching more and more people across the world [3], [4]. Taboola, one of the key providers of clickbait content, claims 2 to have doubled its monthly reach from 500 million unique users to 1 billion in a single year from March 2015. The growth of clickbait industry appears to have clear impact on the media ecosystem, as many traditional media organizations have started to use clickbait techniques to attract readers and generate revenue. However, media analysts suggest that news media risk losing readers’ trust and depleting brand value by using clickbait techniques that may boost advertising revenue only temporarily. According to a study performed by Facebook 3, 80% users “preferred headlines that helped them decide if they wanted to read the full article before they had to click through”. [5] shows that clickbait headlines lead to negative reactions among media users.\nCompared to the reach of clickbait content and its impact on the online media ecosystem, the amount of research done on this topic is very small. No large scale study has been conducted to examine the extent to which different types of media use clickbait techniques. Little is known about the\n1https://www.wired.com/2015/12/psychology-of-clickbait/ 2https://www.taboola.com/press-release/taboola-crosses-one-billion-user-\nmark-second-only-facebook-worlds-largest-discovery 3https://www.nytimes.com/2014/08/26/business/media/facebook-takessteps-against-click-bait-articles.html\nextent to which clickbait headlines contribute to user engagement on social networking platforms – major distributors of web content. This study seeks to fill this gap by examining uses of clickbait techniques in headlines by mainstream and unreliable media organizations on the social network. Some of the questions we answer in this paper are– (i) to what extent, mainstream and unreliable media organizations use clickbait? (ii) does the topic distribution of the contents vary in clickbaity contents? (iii) which type of headlines – clickbait or non-clickbait - generates more user engagement (e.g., shares, comments, reactions)?\nWe first create a set of supervised clickbait classification models to identify clickbait headlines. Instead of following the traditional bag-of-words and hand-crafted feature set approaches, we take a more recent deep learning path that does not require feature engineering. Specifically, we use distributed subword embedding technique [6], [7] to transform the words in the corpus to 300 dimensional embeddings. These embeddings are used to map sentences to a vector space over which a softmax function is applied as a classifier. Our best performing model achieves 98.3% accuracy on a labeled dataset. We use this model to analyze a larger dataset which is a collection of approximately 1.67 million Facebook posts created during 2014–2016 by 68 mainstream media and 85 unreliable media organizations. In addition to identifying the clickbait headlines in the corpus, we also use the embeddings to measure the distance between the headline and the first paragraph, known as intro, of a news article. We use a word co-occurrence based topic model that learns topics by modeling word-word co-occurrences patterns (e.g., bi-terms) to understand the distribution of topics in the clickbait and non-clickbait contents of each media. Finally, using the data on Facebook reactions, comments, and shares, we analyzed the role clickbaits play in user engagement and information spread. The main contributions of this paper are– •We collect a large data corpus of 1.67 million Facebook posts by over 150 U.S. based media organizations. Details of the corpus is explained in Section II. We make the corpus available to use for research purpose 4. •We prepare distributed subword based embeddings for the words present in the corpus. In Section III, we provide a comparison between these word embeddings and the word2vec [8], [9] embeddings created from Google News dataset with\n4URL will be added after acceptance\nar X\niv :1\n70 3.\n09 40\n0v 1\n[ cs\n.S I]\n2 8\nM ar\n2 01\n7\nrespect to clickbait detection. We plan to make these embeddings publicly available upon acceptance of the paper. •We perform detailed analysis of the clickbait practice in the social network from multiple perspectives. Section IV presents qualitative, quantitative and impact analysis of clickbait and non-clickbait contents."
    }, {
      "heading" : "II. DATASET",
      "text" : "We use two datasets in this paper. Below, we provide description of the datasets and explain the collection process.\nHeadlines: This dataset is curated by Chakraborty et al. [2]. It contains 32, 000 headlines of news articles which appeared in ‘WikiNews’, ‘New York Times’, ‘The Guardian’, ‘The Hindu’, ‘BuzzFeed’, ‘Upworthy’, ‘ViralNova’, ‘Thatscoop’, ‘Scoopwhoop’, and ‘ViralStories’. 5 Each of these headlines is manually labeled either as a clickbait or a non-clickbait by at least three volunteers. There are 15, 999 clickbait headlines and 16, 001 non-clickbait headlines in this dataset. We used this labeled dataset to develop an automatic clickbait classification model (details in Section III). An earlier version of this dataset was used in [2], [10]. It had 15, 000 manually labeled headlines with an even distribution of 7, 500 clickbait and 7, 500 non-clickbait headlines.\nMedia Corpus: For large scale analysis, using Facebook Graph API 6, we accumulated all the Facebook posts created by a set of mainstream and unreliable media within January 1st, 2014 – December 31st, 2016. The mainstream set consists of the 25 most circulated print media 7 and the 43 mostwatched broadcast media 8 (according to Nielson rating [11]). The unreliable set is a collection of 85 conspiracy, clickbait, satire and junk science based media organizations. The category of each unreliable media is cross-checked by two sources [12], [13]. Figure 2 shows the number of media organizations in each category in the dataset along with the percentage. Overall, we collected more than 2 million Facebook posts. A Facebook post may contain a photo or a video or a link to an external source. In this paper, we limit ourselves to the link and video type posts only. This reduces the corpus size to 1.67 million. For each post, we collect the headline (title of a video or headline of an article) and the status message. For a collection of 191, 540 link type posts, we also collected the bodies of the corresponding news articles. All these contents (headlines, messages, bodies) were used to train a domain specific word embeddings (details in Section III). We also gather the Facebook reaction (Like, Love, Haha, Wow, Sad, Angry) statistics of each post. Table I shows distribution of the corpus."
    }, {
      "heading" : "III. CLICKBAIT DETECTION",
      "text" : "The key purpose of this study is to systematically quantify the extents to which traditional print and broadcast media as\n5https://github.com/bhargaviparanjape/clickbait/tree/master/dataset 6https://developers.facebook.com/docs/graph-api 7https://en.wikipedia.org/wiki/List of newspapers in the United States 8www.indiewire.com/2016/12/cnn-fox-news-msnbc-nbc-ratings-2016-\nwinners-losers-1201762864/\nwell as “alternative” media – often portrayed as unreliable – use clickbait properties in contents published on the web. The first step towards that goal is to identify clickbait and nonclickbait headlines."
    }, {
      "heading" : "A. Problem Definition",
      "text" : "We define the clickbait identification task as a supervised binary classification problem where the set of classes, C = {clickbait, non clickbait}. Formally, given X , a set of all sentences, and a training set S of labeled sentences 〈s, c〉, where 〈s, c〉 ∈ X × C, we want to learn a function γ such that γ : X → C, in other words, it maps sentences to {clickbait, non clickbait}. In the following sections, we describe modeling of the problem and compare performances of multiple learning techniques."
    }, {
      "heading" : "B. Problem Modeling",
      "text" : "In text classification, a traditional approach is to use bag-ofwords (BOW) model to transform text into feature vectors before applying learning algorithms. [2] followed this approach and used BOW model along with a collection of hand-crafted rules to prepare the feature set. However, inspired by the recent success of deep learning methods in text classification, we use distributed subword embeddings as features instead of applying BOW model. Specifically, we use an extension of the continuous skip-gram model [8], which takes into account subword (substring of a word) information [6]. We call this model as Skip-Gramsw. Below, we explain how SkipGramswis used to generate word embeddings.\n1) Skip-Gramsw: Given a large corpus W , represented as a sequence of words, W = w1, . . . , wT , the objective of the skip-gram model is to maximize the log-likelihood\nT∑ t=1 ∑ c∈Ct log p(wc|wt) (1)\nwhere the context Ct is the set of indices of words surrounding wt. In other words, given a word wt, the model wants to maximize the correct prediction of its context wc. The probability of observing a context word wc given wt is parametrized using the word vectors. The output of the model is an embedding for each word which captures semantic and contextual information of the word. Skip-Gramswworks in a slightly different way. Rather than treating each word as a unit, it breaks down words into subwords and wants to correctly predict the context subwords of a given subword. This extension allows sharing the representations across words, thus allowing to learn reliable representation for rare words. Consider the following example.\nExample 1. “the quick brown fox jumped over the lazy dog”- take the word “quick” as an example. Assuming subword length as three, the subwords are- {qui, uic, ick}. SkipGramswmodel learns to predict qui, ick in the context given uic as the input.\nFigure 3 shows the architecture of the Skip-Gramswmodel. Using neural network, the model learns the mapping between the output and the input. The weights to the hidden layer form the vector representations of the subwords. The embedding of a word is formed by the sum of the vector representations of its subwords. Formally, given a word w and its set of subwords SWw, we can calculate the embedding of w using the following equation-\nuw = ∑\nsw∈SWw\nvsw (2)\nwhere uw is the embedding of w and vsw is the vector representation of sw. Further details of the Skip-Gramswmodel can be found in [6].\n2) Pre-trained Vectors: Note that Skip-Gramswdoes not require C to learn the embeddings of words in corpus W . It means that one can use the model on any large corpus of text to learn the word embeddings irrespective of whether the corpus is labeled or not. This technique of learning from large text corpus helps having richer word embeddings which capture a lot of semantic, conceptual and contextual information. We use the texts (headlines, messages, bodies) from Media Corpus to learn word embeddings using this model. In Section III-C, we present comparison between our pre-trained vectors and word vectors which were trained on about 100 billion words [9] from the Google News dataset.\n3) Classification: For a labeled sentence 〈s, c〉, we average the embeddings of words present in s to form the hidden representation of s. These sentence representations are used to train a linear classifier. Specifically, we use the softmax function to compute the probability distribution over the classes in C. [7] describes the classification process in detail."
    }, {
      "heading" : "C. Evaluation",
      "text" : "We use the Headlines dataset to evaluate our classification model. Section II provides the description of the dataset. We perform 10-fold cross-validation to evaluate various methods with respect to accuracy, precision, recall, f-measure, area under the ROC curve (ROC-AUC) and Cohen’s κ. Table II shows performances of the methods. To avoid randomness effect, we perform each experiment 5 times and present the average. There are in total seven methods. We categorize them based on the use of pre-trained vectors. Note that we report performances of Chakroborty et al. [2] and Anand et al. [10] in the table. We keep Anand et al. with the methods which use pre-trained vectors. Because Anand et al. used word embeddings trained on about 100 billion words from the Google News dataset using the Continuous Bag of Words architecture [9]. Each word embedding has 300 dimensions. Both of these works [2], [10] used a smaller and earlier version of the Headlines dataset. Moreover, the training and test sets of the earlier dataset are not available. So, we could not compare our methods with them using the same test bed.\nThe Skip-Gramswmodel, even without pre-trained vectors, significantly outperforms the BOW based Chakroborty et al. It achieves a f-measure score of 0.975 (2.5% higher than\nChakroborty et al.) and a κ score of 0.952. Powered with the pre-trained vectors, Skip-Gramswperformed even better. We used the same word embeddings provided by [9] as well as our own Media Corpus. Regarding the later, we experimented with three combinations- pre-trained vectors learned from the content headlines only, from headlines and messages, and from headline, bodies and messages. We set embedding size to 300 dimensions while learning from these combinations. For the methods which were applied on the full Headlines dataset, we highlight the top performance in each column. SkipGramswalong with pre-trained vectors from headlines, bodies and messages performed the best among all the variations. We realize that the differences of the measure values among the methods are small. However, we understand that making a small improvement while working above the 0.95 range, is significant.\nMedia Corpus has 477, 236 unique embeddings where Google News dataset provided 100 billion embeddings. One interesting observation is, even though the size of our Media Corpus is significantly smaller than the Google News dataset, it contributes more to the clickbait classification task. It can be rationalized as, the embeddings from Media Corpus have more domain specific knowledge than the Google News dataset. We plan to extend this corpus with more Facebook posts and release it along with the pre-trained vectors for research purpose upon acceptance of the paper.\nWith this powerful clickbait classification model [SkipGramsw+(Headline+Body+Message)], we move forward and perform large scale study on the clickbait practice by a range of media on social network (Facebook)."
    }, {
      "heading" : "IV. PRACTICE OF USING CLICKBAIT IN SOCIAL NETWORK",
      "text" : "We analyze the clickbait practice in Facebook using the Media Corpus from three perspectives."
    }, {
      "heading" : "A. Quantitative Analysis",
      "text" : "To understand the extent of clickbait practice by different media and their categories, we applied the clickbait detection model on their contents; particularly on the headline/title of the link/video type posts. From now onward, we will use the term headline to denote both the headline of a link content (article) and the title of a video content. Table III shows amounts of clickbaits and non-clickbaits in the headlines of mainstream and unreliable media. Out of 887, 794 posts by mainstream media, 297, 774 (33.54%) have clickbait headlines. In unreliable media, the ratio is 39.26% (308, 095 clickbait headlines out of 784, 665). Based on these statistics, the percentage appears to be surprisingly high for the mainstream. We zoom into the categories of these two media to analyze the primary proponents of the clickbait practice. We find that between the two categories of mainstream media, broadcast uses clickbait 47.56% of the times whereas print only uses 24.12%. We further zoom in to understand the high percentage in the broadcast category. The Media Corpus has 43 broadcast media. We manually categorize them into news oriented broadcast media (e.g. CNN, NBC, etc.) and non-news (lifestyle, entertainment,\nsports, etc.) broadcast media (e.g. HGTV, E!, etc.). There are 6 news oriented broadcast media and 37 non-news broadcast media. We find that the ratio of clickbait and non-clickbait is 61.64% in non-news type broadcast media whereas it is only 22.32% (close to print media) in news oriented media. Figure 5 shows kernel density estimation of the clickbait percentage both for news and non-news broadcast media. It clearly shows the difference in clickbait practice in these two sub-categories. Most of the news type broadcast media has about 25% clickbait contents. On the other hand, the percentage of clickbait for non-news type broadcast media has a wider range with peak at about 60%. In case of unreliable media, unsurprisingly all the categories have high percentage of clickbaits in their headlines. In Figure 4, we show the percentage of clickbait in video and link type posts for each of the media categories. Satire is leading in both link and video type posts. Print and conspiracy media have the lowest clickbait practice among all the media categories in link and video type posts, respectively. Table V shows the top-5 clickbait proponents in each media category."
    }, {
      "heading" : "B. Qualitative",
      "text" : "Topic distribution: To understand the topics in the clickbait and non-clickbait contents, we applied topic modeling on all the headlines of each category. One concern about applying the traditional topic modeling algorithms (e.g. Latent Dirichlet Allocation, Latent Semantic Analysis) on our corpus is, they focus on document-level word co-occurrence patterns to discover the topics of a document. So, they may struggle with the high word co-occurrence patterns sparsity which becomes a dominant factor in case of shorter context. That is why we\nuse Biterm Topic Modeling (BTM) [14] which generates the topics by directly modeling the aggregated word co-occurrence patterns of a short document.\nTable IV shows 5 topics in clickbait and non-clickbait contents for each media category. Each topic is represented by a set of 10 words. The words are ordered by their significance in the corresponding topic. The modeling indicates that clickbait headlines in print and broadcast media vary in tones and subject matters from their non-clickbait headlines to a great extent. Clickbait headlines in these media represent more personalized, sensationalized and entertaining topics, while non-clickbait headlines highlight topics of collective problems such as public policies and civic affairs. But this variation is not much evident in unreliable media that use clickbait headlines indiscriminately across all topics.\nThe model highlights some differences in clickbait topics between print and broadcast media. Most clickbait topics in print media, four out of five, are about U.S. President Donald Trumps views on women. Each of these four topics include all of these four words: Trump, woman, make, new. A manual search shows that print news media often used clickbait techniques (e.g., question based headline) in stories about Trump and women. For instance, “Did Donald Trump really say those things?” was the headline of a Washington Post article dated July 25, 2016. The headline of a New York Times story from May 14, 2016, reads; “Crossing the Line: How Donald Trump Behaved With Women in Private.”\nMost clickbait topics in broadcast media are about entertainment (e.g., Taylor Swifts new music video; Kardashians new baby) and lifestyle (e.g., food and health). Two topics appeared to touch Donald Trump and his opponent Hillary Clinton. Clickbait topics in unreliable media, however, range\nfrom politics to lifestyle. At least three topics appeared to be about politics in which key words include, Trump, Hillary, Obama, Muslim, Cop, and Woman. One topic is about food and health while another is unclear.\nNon-clickbait topics remain similar across all three media types, which primarily focus on law and order, and U.S. presidential election campaign. Twelve out of 15 topics – all five in print, three in broadcast, and four in unreliable – are about these two areas. One broadcast topic appears to be about sports and one is unclear. One unreliable topic is about food and health.\nHeadline-Body similarity: One limitation of SkipGramswis, it only considers the headline to determine whether it is a clickbait or not. The body of the news, is not considered as a factor in defining the headline. An attractive headline can be highly relevant to the content/body of a news or it can be very loosely related to the news. Our model is not capable of making the distinction. A metric is required to measure the similarity between the headline and the content to determine if the headline fairly represents the content. In future, we want to systematically incorporate the headline-body similarity in defining the clickbaitiness. Nonetheless, here we measure how similar the clickbait and non-clickbait headlines are to the corresponding bodies using a simple approach. We assume that the first para of an article represents the summary of the whole news [15] and use cosine similarity to measure the similarity between the headline and the sentences in the first para. We use bag-of-words model to transform the sentences into vectors before applying cosine similarity. In future, we plan to use our word embeddings to create the vectors instead. Figure 7 shows the kernel density estimation of the headlinebody similarity in clickbait and non-clickbait contents posted by different media. One observation is, in print media nonclickbait headlines are closer to their summary than clickbait headlines. In broadcast media, the difference is less clear and in unreliable media the difference is almost absent.\nC. Impact To measure the reachability and user engagement of clickbait and non-clickbait contents, we use Facebook reactions, comments and shares as metrices. Figure 8 shows number of comments, shares and reactions (summation of like, haha, wow, sad, angry, happy, love) of an average clickbait and nonclickbait post in each media category. Blue areas indicate that\nTABLE IV TOPIC MODEL OF CLICKBAIT AND NON-CLICKBAIT HEADLINES IN DIFFERENT MEDIA\nMedia Clickbait Non-Clickbait\nPrint\nT1: best, thing, day, new, 2015, cleveland, la, 2016, know, year T1: new, san, la, jose, police, county, vega, get, bay, school T2: trump, woman, donald, new, get, say, make, people, thing, know T2: police, man, cleveland, new, killed, woman, la, shooting, shot, get T3: trump, new, get, woman, donald, make, star, say, man, chicago T3: news, trump, new, man, say, york, woman, hawaii, police, killed T4: new, best, thing, year, get, kid, day, woman, make, trump T4: trump, new, u, clinton, say, state, win, donald, take, world T5: boston, trump, donald, new, say, make, clinton, woman, get, 2016 T5: boston, new, say, trump, sox, chronicle, win, red, get, state\nBroadcast T1: new, movie, star, make, swift, time, video, best, get, like T1: police, man, new, found, woman, killed, arrested, say, shooting, death T2: new, get, baby, kardashian, jenner, star, first, make, love, say T2: trump, clinton, say, new, obama, u, gop, news, campaign, hillary, T3: woman, episode, new, trump, man, black, get, video, full, girl T3: new, u, say, police, found, killed, dead, nbc, year, dy T4: trump, history, know, thing, donald, clinton, get, make, best, say T4: win, new, say, game, first, get, team, player, take, back T5: day, photo, national, way, best, like, food, dog, thing, geographic T5: national, geographic, photo, new, shark, day, classic, fs1undisputed, home, found\nUnreliable T1: trump, hillary, donald, clinton, obama, get, make, say, one, news T1: obama, eagle, muslim, police, say, gun, u, cop, man, patriot T2: video, people, american, black, obama, muslim, u, america, cop, white T2: trump, hillary, clinton, obama, new, say, campaign, news, donald, republican T3: chick, trump, eagle, right, woman, hillary, say, get, people, make T3: u, obama, video, war, isi, new, military, american, world, muslim T4: man, people, thing, woman, make, year, like, get, way, new T4: new, truth, obama, say, u, republican, police, broadcast, man, american T5: day, reunionfather, human, food, way, health, thing, reason, life, make T5: human, cancer, health, new, vaccine, u, study, food, found, world\non average, a clickbait post (link or video) receives more attention (reactions/shares/comments) than a non-clickbait post. Green areas indicate the opposite. Clickbait contents receive more attention and reach to more users in general. One exception is the broadcast media.\nWe also analyze how often a news article is re-posted in Facebook. Figure 6 shows number of times a link is reposted by a media. Each bar represents a news link. The height indicates how many times this link was posted in Facebook by the colored media category. We only consider the links\nFig. 7. Headline-Body similarity in clickbait and non-clickbait contents.\nwhich were re-posted at least 20 times. Compare to others, conspiracy media organizations repeat the same link more. This is observed both for clickbait and non-clickbait. Clickbait media seem to repeatedly posting same clickbait links more than others.\nOther than headlines, the media organizations also practice using clickbait in the Facebook status message itself. Table VI shows use of clickbait status for non-clickbait articles by different media. A general observation is, the practice is there to allure the readers by giving clickbaity message posts even for non-clickbaity news contents. Unsurprisingly, the clickbait media category is leading in this practice."
    }, {
      "heading" : "V. RELATED WORK",
      "text" : "Even though clickbait is a relatively nascent term, its traces can be found in several journalistic concepts such as tabloidization and content trivialization. The linguistic techniques and presentation styles, employed typically in clickbait headlines and articles, derived from the tabloid press that baits readers with sensational language and appealing topics such as celebrity gossip, humor, fear and sex [1]. Clickbait articles are also similar to tabloid press articles in terms of story focus, which puts emphasis on the entertaining elements of an event rather than the informative elements. The Internet and especially the social media have made it easier for the clickbait practitioners to create, publish in a larger scale and reach to a broader audience with a higher speed than before [16]. In the last several years, academicians and media studied this phenomenon from several perspectives.\nClickbait– Properties, Practice and Effects: There have been a small number of studies–some conducted by academic researchers and others by media firms–which examined correlations between headline attributes and degree of user engagement with content. Some media market analysts and commentators [17] discussed various aspects of this practice. However, no research has been found, which gauges the extents of clickbait practices by mainstream and alternative media outlets on the web. Nor have we found any study that examined if clickbait techniques help increase user engagement on social media.\nA journalism professor [1] manually examined content of four online sections of the Spanish newspaper El Pais 9, which apparently used clickbait features to capture attention. The corpus included only 151 articles published in June, 2015. The articles in the corpus appeared to emphasize anecdotal aspects, or issues with little value, and curiosities. The study identified various linguistic techniques used in headlines of these articles such as orality markers and interaction (e.g., direct appeal to the reader), vocabulary and word games (e.g., informal language, generic or buzzwords), and morphosyntax (e.g., simple structures).\nResearchers at the University of Texas’s Engaging News Project [5] conducted an experiment on 2, 057 U.S. adults to examine their reactions to clickbait (e.g., question-based headlines) and traditional news headlines in political articles. They found that clickbait headlines led to more negative reactions among users than non-clickbait headlines. Interestingly, the same users were slightly more engaged with nontraditional media that tend to use clickbait techniques more often. This finding questions the conventional belief that user reactions may predict user engagement, and warrants largescale investigations.\nChartbeat, an analytics firm that provides market intelligence to media organizations, tested 10, 000 headlines from over 100 websites for their effectiveness in engaging users\n9http://elpais.com\nwith content [18]. The study examined 12 ‘common tropes’ in headlines– a majority of them are considered clickbait techniques – and found that some of these tropes are more effective than others. Some media pundits interpreted the findings of this study as clickbaits being detrimental to traditional news brands.\nHubSpot and Outbrain, two content marketing platforms that distribute clickbait contents across the web, examined millions of headlines to identify attributes that contribute to traffic growth, increased engagement, and conversion of readers into subscribers. The study suggested that clickbait techniques may increase temporary engagement [19], but an article must deliver on its promises made in headline for users to return and convert.\nAutomated Clickbait Detection: [2], [10], [20], [21] study automated detection of clickbait headlines using natural language processing and machine learning. [21] collects 10, 000 headlines from Buzzfeed, Clickhole, and The New York Times (NYT) and uses Logistic Regression to create a supervised clickbait detection model. It assumes all Buzzfeed and Clickhole headlines as clickbait and all NYT headlines as nonclickbait. We would like to argue that it makes the model susceptible to personal bias as it overlooks the fact that many Buzzfeed contents are original, non-clickbaity and there are clickbait practice in NYT [22]. Moreover, BuzzFeed, and NYT usually write on very different topics. The model might have been trained merely as a topic classifier. [20] attempts to detect clickbaity Tweets in Twitter by using common words occurring in clickbaits, and by extracting some tweet specific features. [2] uses a dataset of 15, 000 manually labeled headlines to train several supervised models for clickbait detection. These methods heavily depend on a rich set of handcrafted features which take good amount of time to engineer and sometimes are specific to the domain (for example, tweet related features are specific to Twitter data and inapplicable to other domains). [10] presents clickbait detection model which uses word embeddings and Recurrent Neural Network\n(RNN). These works consider the structure and semantic of a headline to determine whether it is a clickbait or not. However, one important aspect, the body of the news, is not considered as a factor in these works at all. We would like to argue that only the headline itself does not fully represent whether an article is a clickbait or not. If a headline represents the body fairly, it should not be considered as a clickbait. Consider the title as an example, ‘The Top 10 Mistakes Of Entrepreneurs’10. It is as clickbait of a headline as it can be. However, the body actually contains reasonably decent materials, which might be interesting to many people.\nClickbait Generation [23]–[25] present automated clickbait generation tools. [23] trains an RNN model using 2 million headlines collected from Buzzfeed, Gawker, Jezebel, Huffington Post and Upworthy. The model is then used to produce new clickbait headlines"
    }, {
      "heading" : "VI. CONCLUSION",
      "text" : "In this paper, we introduce a word-embedding based clickbait detection system which is built on our own collected corpus of news headlines and contents. We showed that our model performs better than the Google news dataset based embeddings. Our analysis also reveals how mainstream media are getting involved into clickbait practicing increasingly. Close scrutiny of the social media posts also reveals that broadcast type media has higher percentage of usage of clickbait practice than the print media and non-news type broadcast media mostly contributes to it. Our study also brings forth another fact of using higher percentage of clickbait practice by unreliable media which is quite obvious. Moreover, results from our topic modeling indicates that clickbait practice is prevalent in personalized and entertaining areas. In future, we want to incorporate the content of the news in defining the clickbaitiness of a headline. We believe, such a system would help social networking platforms to curb the problem of clickbait and provide a better using experience."
    } ],
    "references" : [ {
      "title" : "Reference press metamorphosis in the digital context: clickbait and tabloid strategies in elpais. com.",
      "author" : [ "D. Palau-Sampio" ],
      "venue" : "Communication & Society,",
      "citeRegEx" : "1",
      "shortCiteRegEx" : "1",
      "year" : 2016
    }, {
      "title" : "Stop clickbait: Detecting and preventing clickbaits in online news media",
      "author" : [ "A. Chakraborty", "B. Paranjape", "S. Kakarla", "N. Ganguly" ],
      "venue" : "Advances in Social Networks Analysis and Mining (ASONAM), 2016 IEEE/ACM International Conference on. IEEE, 2016, pp. 9–16.",
      "citeRegEx" : "2",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "Adele and the death of clickbait",
      "author" : [ "M.S. LUCKIE" ],
      "venue" : "http://www. niemanlab.org/2015/12/adele-and-the-death-of-clickbait/, 2015.",
      "citeRegEx" : "3",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Can publishers step away from the brink of peak content?",
      "author" : [ "C. Sutcliffe" ],
      "venue" : "https://www.themediabriefing.com/article/can-publishers-step-awayfrom-the-brink-of-peak-content,",
      "citeRegEx" : "4",
      "shortCiteRegEx" : "4",
      "year" : 2016
    }, {
      "title" : "Investigating the influence of “clickbait” news headlines",
      "author" : [ "J.M. Scacco", "A. Muddiman" ],
      "venue" : "https://engagingnewsproject.org/wpcontent/uploads/2016/08/ENP-Investigating-the-Influence-of-Clickbait- News-Headlines.pdf, 2016.",
      "citeRegEx" : "5",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "Enriching word vectors with subword information",
      "author" : [ "P. Bojanowski", "E. Grave", "A. Joulin", "T. Mikolov" ],
      "venue" : "arXiv preprint arXiv:1607.04606, 2016.",
      "citeRegEx" : "6",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "Bag of tricks for efficient text classification",
      "author" : [ "A. Joulin", "E. Grave", "P. Bojanowski", "T. Mikolov" ],
      "venue" : "arXiv preprint arXiv:1607.01759, 2016. 10www.forbes.com/sites/roberthof/2016/02/23/guy-kawasaki-the-top-10mistakes-of-entrepreneurs",
      "citeRegEx" : "7",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "Distributed representations of words and phrases and their compositionality",
      "author" : [ "T. Mikolov", "I. Sutskever", "K. Chen", "G.S. Corrado", "J. Dean" ],
      "venue" : "Advances in neural information processing systems, 2013, pp. 3111–3119.",
      "citeRegEx" : "8",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Efficient estimation of word representations in vector space",
      "author" : [ "T. Mikolov", "K. Chen", "G. Corrado", "J. Dean" ],
      "venue" : "arXiv preprint arXiv:1301.3781, 2013.",
      "citeRegEx" : "9",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "We used neural networks to detect clickbaits: You won’t believe what happened next!",
      "author" : [ "A. Anand", "T. Chakraborty", "N. Park" ],
      "venue" : "arXiv preprint arXiv:1612.01340,",
      "citeRegEx" : "10",
      "shortCiteRegEx" : "10",
      "year" : 2016
    }, {
      "title" : "Fcc: Nielsen dmas still best definition of tv market",
      "author" : [ "J. Eggerton" ],
      "venue" : "Broadcasting & Cable, 2016.",
      "citeRegEx" : "11",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "Unreliable/fake news sites & sources",
      "author" : [ "informationisbeautiful.net" ],
      "venue" : "https://docs.google.com/spreadsheets/d/1xDDmbr54qzzG8wUrRdxQl C1dixJSIYqQUaXVZBqsJs, 2016.",
      "citeRegEx" : "12",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "My ‘fake news list’ went viral. but made-up stories are only part of the problem",
      "author" : [ "M. Zimdars" ],
      "venue" : "https://www.washingtonpost.com/ posteverything/wp/2016/11/18/my-fake-news-list-went-viral-but-madeup-stories-are-only-part-of-the-problem, 2016.",
      "citeRegEx" : "13",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "A biterm topic model for short texts",
      "author" : [ "X. Yan", "J. Guo", "Y. Lan", "X. Cheng" ],
      "venue" : "Proceedings of the 22nd international conference on World Wide Web. ACM, 2013, pp. 1445–1456.",
      "citeRegEx" : "14",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "The internet didnt invent viral content or clickbait journalism – theres just more of it now, and it happens faster",
      "author" : [ "M. Ingram" ],
      "venue" : "https: //gigaom.com/2014/04/01/the-internet-didnt-invent-viral-content-orclickbait-journalism-theres-just-more-of-it-now-and-it-happens-faster, 2014.",
      "citeRegEx" : "16",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Clickbait is devouring journalism but there are ways out",
      "author" : [ "F. Filloux" ],
      "venue" : "https://qz.com/648845/clickbait-is-devouring-journalism-but-there-areways-out/, 2016.",
      "citeRegEx" : "17",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "You’ll never guess how chartbeat’s data scientists came up with the single greatest headline",
      "author" : [ "C. Breaux" ],
      "venue" : "http://blog.chartbeat.com/2015/11/20/youll-never-guess-howchartbeats-data-scientists-came-up-with-the-single-greatest-headline, 2015.",
      "citeRegEx" : "18",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Data driven strategies for writing effective titles & headlines",
      "author" : [ "Hubspot", "Outbrain" ],
      "venue" : "http://cdn2.hubspot.net/hub/53/file-2505556912pdf/Data Driven Strategies For Writing Effective Titles and Headlines.pdf.",
      "citeRegEx" : "19",
      "shortCiteRegEx" : null,
      "year" : 2505
    }, {
      "title" : "Clickbait detection",
      "author" : [ "M. Potthast", "S. Köpsel", "B. Stein", "M. Hagen" ],
      "venue" : "European Conference on Information Retrieval. Springer, 2016, pp. 810–817.",
      "citeRegEx" : "20",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "Identifying clickbaits using machine learning",
      "author" : [ "A. Thakur" ],
      "venue" : "https://www.linkedin.com/pulse/identifying-clickbaits-using-machinelearning-abhishek-thakur, 2016.",
      "citeRegEx" : "21",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "To clickbait or not to clickbait? an examination of clickbait headline effects on source credibility",
      "author" : [ "N. Hurst" ],
      "venue" : "Ph.D. dissertation, University of Missouri–Columbia, 2016.",
      "citeRegEx" : "22",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "Auto-generating clickbait with recurrent neural networks",
      "author" : [ "L. Eidnes" ],
      "venue" : "https://larseidnes.com/2015/10/13/auto-generating-clickbait-withrecurrent-neural-networks, 2015.",
      "citeRegEx" : "23",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "clickbait generator",
      "author" : [ "C. Cha" ],
      "venue" : "http://www.thisisreallyreal.com/, 2016.",
      "citeRegEx" : "24",
      "shortCiteRegEx" : null,
      "year" : 2016
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "The term clickbait refers to a form of web content that employs writing formulas and linguistic techniques in headlines to trick readers into clicking links [1], [2], but does not deliver on promises 1.",
      "startOffset" : 157,
      "endOffset" : 160
    }, {
      "referenceID" : 1,
      "context" : "The term clickbait refers to a form of web content that employs writing formulas and linguistic techniques in headlines to trick readers into clicking links [1], [2], but does not deliver on promises 1.",
      "startOffset" : 162,
      "endOffset" : 165
    }, {
      "referenceID" : 2,
      "context" : "Media scholars and pundits consistently show clickbait content in a bad light, but the industry based on this type of content has been rapidly growing and reaching more and more people across the world [3], [4].",
      "startOffset" : 202,
      "endOffset" : 205
    }, {
      "referenceID" : 3,
      "context" : "Media scholars and pundits consistently show clickbait content in a bad light, but the industry based on this type of content has been rapidly growing and reaching more and more people across the world [3], [4].",
      "startOffset" : 207,
      "endOffset" : 210
    }, {
      "referenceID" : 4,
      "context" : "[5] shows that clickbait headlines lead to negative reactions among media users.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 5,
      "context" : "Specifically, we use distributed subword embedding technique [6], [7] to transform the words in the corpus to 300 dimensional embeddings.",
      "startOffset" : 61,
      "endOffset" : 64
    }, {
      "referenceID" : 6,
      "context" : "Specifically, we use distributed subword embedding technique [6], [7] to transform the words in the corpus to 300 dimensional embeddings.",
      "startOffset" : 66,
      "endOffset" : 69
    }, {
      "referenceID" : 7,
      "context" : "In Section III, we provide a comparison between these word embeddings and the word2vec [8], [9] embeddings created from Google News dataset with",
      "startOffset" : 87,
      "endOffset" : 90
    }, {
      "referenceID" : 8,
      "context" : "In Section III, we provide a comparison between these word embeddings and the word2vec [8], [9] embeddings created from Google News dataset with",
      "startOffset" : 92,
      "endOffset" : 95
    }, {
      "referenceID" : 1,
      "context" : "[2].",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 1,
      "context" : "An earlier version of this dataset was used in [2], [10].",
      "startOffset" : 47,
      "endOffset" : 50
    }, {
      "referenceID" : 9,
      "context" : "An earlier version of this dataset was used in [2], [10].",
      "startOffset" : 52,
      "endOffset" : 56
    }, {
      "referenceID" : 10,
      "context" : "The mainstream set consists of the 25 most circulated print media 7 and the 43 mostwatched broadcast media 8 (according to Nielson rating [11]).",
      "startOffset" : 138,
      "endOffset" : 142
    }, {
      "referenceID" : 11,
      "context" : "The category of each unreliable media is cross-checked by two sources [12], [13].",
      "startOffset" : 70,
      "endOffset" : 74
    }, {
      "referenceID" : 12,
      "context" : "The category of each unreliable media is cross-checked by two sources [12], [13].",
      "startOffset" : 76,
      "endOffset" : 80
    }, {
      "referenceID" : 1,
      "context" : "[2] followed this approach and used BOW model along with a collection of hand-crafted rules to prepare the feature set.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 7,
      "context" : "Specifically, we use an extension of the continuous skip-gram model [8], which takes into account subword (substring of a word) information [6].",
      "startOffset" : 68,
      "endOffset" : 71
    }, {
      "referenceID" : 5,
      "context" : "Specifically, we use an extension of the continuous skip-gram model [8], which takes into account subword (substring of a word) information [6].",
      "startOffset" : 140,
      "endOffset" : 143
    }, {
      "referenceID" : 16,
      "context" : "28% Satire [18]",
      "startOffset" : 11,
      "endOffset" : 15
    }, {
      "referenceID" : 5,
      "context" : "Junk Science [6] 4%",
      "startOffset" : 13,
      "endOffset" : 16
    }, {
      "referenceID" : 5,
      "context" : "Further details of the Skip-Gramswmodel can be found in [6].",
      "startOffset" : 56,
      "endOffset" : 59
    }, {
      "referenceID" : 8,
      "context" : "In Section III-C, we present comparison between our pre-trained vectors and word vectors which were trained on about 100 billion words [9] from the Google News dataset.",
      "startOffset" : 135,
      "endOffset" : 138
    }, {
      "referenceID" : 6,
      "context" : "[7] describes the classification process in detail.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 1,
      "context" : "[2] and Anand et al.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 9,
      "context" : "[10] in the table.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 8,
      "context" : "used word embeddings trained on about 100 billion words from the Google News dataset using the Continuous Bag of Words architecture [9].",
      "startOffset" : 132,
      "endOffset" : 135
    }, {
      "referenceID" : 1,
      "context" : "Both of these works [2], [10] used a smaller and earlier version of the Headlines dataset.",
      "startOffset" : 20,
      "endOffset" : 23
    }, {
      "referenceID" : 9,
      "context" : "Both of these works [2], [10] used a smaller and earlier version of the Headlines dataset.",
      "startOffset" : 25,
      "endOffset" : 29
    }, {
      "referenceID" : 8,
      "context" : "We used the same word embeddings provided by [9] as well as our own Media Corpus.",
      "startOffset" : 45,
      "endOffset" : 48
    }, {
      "referenceID" : 1,
      "context" : "[2] 0.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 9,
      "context" : "[10] 0.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 13,
      "context" : "use Biterm Topic Modeling (BTM) [14] which generates the topics by directly modeling the aggregated word co-occurrence patterns of a short document.",
      "startOffset" : 32,
      "endOffset" : 36
    }, {
      "referenceID" : 0,
      "context" : "The linguistic techniques and presentation styles, employed typically in clickbait headlines and articles, derived from the tabloid press that baits readers with sensational language and appealing topics such as celebrity gossip, humor, fear and sex [1].",
      "startOffset" : 250,
      "endOffset" : 253
    }, {
      "referenceID" : 14,
      "context" : "The Internet and especially the social media have made it easier for the clickbait practitioners to create, publish in a larger scale and reach to a broader audience with a higher speed than before [16].",
      "startOffset" : 198,
      "endOffset" : 202
    }, {
      "referenceID" : 15,
      "context" : "Some media market analysts and commentators [17] discussed various aspects of this practice.",
      "startOffset" : 44,
      "endOffset" : 48
    }, {
      "referenceID" : 0,
      "context" : "A journalism professor [1] manually examined content of four online sections of the Spanish newspaper El Pais 9, which apparently used clickbait features to capture attention.",
      "startOffset" : 23,
      "endOffset" : 26
    }, {
      "referenceID" : 4,
      "context" : "Researchers at the University of Texas’s Engaging News Project [5] conducted an experiment on 2, 057 U.",
      "startOffset" : 63,
      "endOffset" : 66
    }, {
      "referenceID" : 16,
      "context" : "com with content [18].",
      "startOffset" : 17,
      "endOffset" : 21
    }, {
      "referenceID" : 17,
      "context" : "The study suggested that clickbait techniques may increase temporary engagement [19], but an article must deliver on its promises made in headline for users to return and convert.",
      "startOffset" : 80,
      "endOffset" : 84
    }, {
      "referenceID" : 1,
      "context" : "Automated Clickbait Detection: [2], [10], [20], [21] study automated detection of clickbait headlines using natural language processing and machine learning.",
      "startOffset" : 31,
      "endOffset" : 34
    }, {
      "referenceID" : 9,
      "context" : "Automated Clickbait Detection: [2], [10], [20], [21] study automated detection of clickbait headlines using natural language processing and machine learning.",
      "startOffset" : 36,
      "endOffset" : 40
    }, {
      "referenceID" : 18,
      "context" : "Automated Clickbait Detection: [2], [10], [20], [21] study automated detection of clickbait headlines using natural language processing and machine learning.",
      "startOffset" : 42,
      "endOffset" : 46
    }, {
      "referenceID" : 19,
      "context" : "Automated Clickbait Detection: [2], [10], [20], [21] study automated detection of clickbait headlines using natural language processing and machine learning.",
      "startOffset" : 48,
      "endOffset" : 52
    }, {
      "referenceID" : 19,
      "context" : "[21] collects 10, 000 headlines from Buzzfeed, Clickhole, and The New York Times (NYT) and uses Logistic Regression to create a supervised clickbait detection model.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 20,
      "context" : "susceptible to personal bias as it overlooks the fact that many Buzzfeed contents are original, non-clickbaity and there are clickbait practice in NYT [22].",
      "startOffset" : 151,
      "endOffset" : 155
    }, {
      "referenceID" : 18,
      "context" : "[20] attempts to detect clickbaity Tweets in Twitter by using common words occurring in clickbaits, and by extracting some tweet specific features.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 1,
      "context" : "[2] uses a dataset of 15, 000 manually labeled headlines to train several supervised models for clickbait detection.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 9,
      "context" : "[10] presents clickbait detection model which uses word embeddings and Recurrent Neural Network",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 21,
      "context" : "Clickbait Generation [23]–[25] present automated clickbait generation tools.",
      "startOffset" : 21,
      "endOffset" : 25
    }, {
      "referenceID" : 21,
      "context" : "[23] trains an RNN model using 2 million headlines collected from Buzzfeed, Gawker, Jezebel, Huffington Post and Upworthy.",
      "startOffset" : 0,
      "endOffset" : 4
    } ],
    "year" : 2017,
    "abstractText" : "The use of alluring headlines (clickbait) to tempt the readers has become a growing practice nowadays. For the sake of existence in the highly competitive media industry, most of the on-line media including the mainstream ones, have started following this practice. Although the wide-spread practice of clickbait makes the reader’s reliability on media vulnerable, a large scale analysis to reveal this fact is still absent. In this paper, we analyze 1.67 million Facebook posts created by 153 media organizations to understand the extent of clickbait practice, its impact and user engagement by using our own developed clickbait detection model. The model uses distributed sub-word embeddings learned from a large corpus. The accuracy of the model is 98.3%. Powered with this model, we further study the distribution of topics in clickbait and non-clickbait contents.",
    "creator" : "LaTeX with hyperref package"
  }
}