{
  "name" : "1703.10065.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Hierarchical Classification for Spoken Arabic Dialect Identification using Prosody: Case of Algerian Dialects",
    "authors" : [ "Soumia Bougrinea", "Hadda Cherrouna", "Djelloul Ziadib" ],
    "emails" : [ "sm.bougrine@lagh-univ.dz", "hadda_cherroun@mail.lagh-univ.dz", "djelloul.ziadi@univ-rouen.fr" ],
    "sections" : [ {
      "heading" : null,
      "text" : "In daily communications, Arabs use local dialects which are hard to identify automatically using conventional classification methods. The dialect identification challenging task becomes more complicated when dealing with an under-resourced dialects belonging to a same county/region. In this paper, we start by analyzing statistically Algerian dialects in order to capture their specificities related to prosody information which are extracted at utterance level after a coarse-grained consonant/vowel segmentation. According to these analysis findings, we propose a Hierarchical classification approach for spoken Arabic algerian Dialect IDentification (HADID). It takes advantage from the fact that dialects have an inherent property of naturally structured into hierarchy. Within HADID, a top-down hierarchical classification is applied, in which we use Deep Neural Networks (DNNs) method to build a local classifier for every parent node into the hierarchy dialect structure. Our framework is implemented and evaluated on Algerian Arabic dialects corpus. Whereas, the hierarchy dialect structure is deduced from historic and linguistic knowledges. The results reveal that within HADID, the best classifier is DNNs compared to Support Vector Machine. In addition, compared with a baseline Flat classification system, our HADID gives an improvement of 63.5% in term of precision. Furthermore, overall results evidence the suitability of our prosody-based HADID for speaker independent dialect identification while requiring less than 6s test utterances.\nEmail addresses: sm.bougrine@lagh-univ.dz (Soumia Bougrine), hadda_cherroun@mail.lagh-univ.dz (Hadda Cherroun), djelloul.ziadi@univ-rouen.fr (Djelloul Ziadi )\nPreprint submitted to Elsevier March 30, 2017\nar X\niv :1\n70 3.\n10 06\n5v 1\n[ cs\n.C L\n] 2\n9 M\nar 2\nKeywords: Algerian dialects, Deep Neural Networks, Dialect Identification, Hierarchical Classification, Prosody, Statistical Analysis."
    }, {
      "heading" : "1. Introduction",
      "text" : "Dialect IDentification (DID) is the task of recognizing a dialect automatically, it is part of Natural Language Processing (NLP). DID is classified into two main categories: write-based or spoken-based. Spoken DID systems are featured by their complexity compared to the automatic Language IDentification (LID) because it deals with many variations of the same language.\nIn general, the applications of spoken DID systems can be broadly divided into two categories: front-end for human operators and front-end for machines. As front-end for human operators, spoken DID systems can be useful in routing calls. In fact, to orient the call to human operators who understand the dialect of the caller. On the other hand, in the category front-end for machines, it is used in many domains such as: detection/classification of spoken document retrieval, enhancing the performance of automatic speech/speaker recognition, or multi-language translation system.\nA dialect/language can be distinguished from another by means of many characteristics extracted from the speech information levels: acoustic/phonetic, phonotactic, prosodic, lexical and syntactic [1]. These levels are from the lowest to the highest speech information. Lexical and syntactic are more discriminative in LID/DID. However, they require a large vocabulary recognizers. Thus, most LID/DID systems are based on low level features, acoustic/phonetic and phonotactic, which perform well when the recording conditions are controlled and the record quality is good. In contrast, prosodic based systems are less influenced by noise and channel variations [2]. Furthermore, prosodic systems are more effective for short utterances while the phonotactic and acoustic features work better for long utterances [3].\nMost researches on DID have only been carried out for non-semitic languages. Whereas, little attention has been paid to spoken Arabic Dialect IDentification (ADID), especially when dialects belong to the same geographical area or country [4] [5]. Ara-\nbic is a semitic language spoken by more than 420 million people in 60 countries worldwide [6]. It has the following variants: Ancient Arabic (AA), Classical Arabic (CA), Modern Standard Arabic (MSA), and Dialectal Arabic (DA) [7]. As revealed by its name, AA is found in the old literary writings and mainly the poems and it is no longer used. CA is the language of the Coran, which is the original source of grammar and phonetic rules. MSA is the official language of all Arab countries. It is used in administrations, schools, official radios, press, some TV programs. DA is often referred to colloquial Arabic -vernaculars-, which is used in public places, situations of informal communications, and social media. There is a large number of Arabic dialects and they are grouped in five categories: Arabian Peninsula, Levantine, Mesopotamian, Egyptian, and Maghrebi [8]. Algerian Arabic dialect is a Maghrebi dialect. It has many variations developed mainly as a result of Arabization phases and deep colonization history.\nIn this paper, we propose a Hierarchical classification approach for spoken Arabic Dialect Identification (HADID) where speech is characterized at prosodic level using deep learning. A Hierarchical Classification (HC) is a machine learning method of placing new items into a collection on the light of a predefined hierarchical structure [9].\nThe purpose of our investigation is three folds. First, we focus on measuring the discriminative power of the prosody in Algerian Arabic dialects. Indeed, existing ADID systems rely mainly on knowledges extracted from acoustic/phonetic and phonotactic cues while dismissing prosodic ones in spite of their advantages. In fact, it has been proved that dialect variations are notably pursued in prosodic features [10].\nThe second investigation concerns measuring the effect of Hierarchical classification in ADID. The main idea behind that is to exploit the fact that the languages, especially dialects, have an inherent property of naturally structured into hierarchy. Unfortunately, this fact is not taken into account in the existing works on ADID. Despite the fact that Arabic dialects are very close and share many linguistics features. Hence, their performances decrease quickly when they deal with more than four dialects.\nIn the third investigation, we explore Deep Learning to build dialect models for ADID system. In fact, Deep Learning is considered as state-of-the-art in many NLP\ntasks [11]. It has efficient performances for under-resourced speech recognition [12].\nThe remainder of the paper is organized as follows: in the next section, we review the main existing works on ADID. In Section 3, we present Algerian dialects, their specificities, and their hierarchical structure derived from some historical and linguistic studies. In Section 4, we present the prosodic features of speech and how we extracted them. We also explain our motivations to leverage prosody for ADID system in this same section. Section 5 is dedicated to the statistical analysis of prosody in Algerian Arabic dialects. Afterward, we describe and explain our HADID approach in Section 6. The experiments and results are described and commented in Section 7. Finally, Section 8 concludes the paper."
    }, {
      "heading" : "2. Related Work",
      "text" : "We focus in this section on DID systems for Arabic dialects. The first ADID system was authored by Rouas et al. [15] in 2006, which is recent investigation compared to those developed for other non-Arabic dialects. In fact, for the best of our knowledge, the pioneer work for non-Arabic dialects appeared in the middle of the nineties and it is due to Zissman et al. [24]. This lack of interest to ADID is due to many facts. First, there is a noticeable lack of speech databases/corpora for Arabic dialects dedicated to scientific researches purposes [25] [26]. Furthermore, there is even less standard databases ones. For this reason in what follows, we describe the studied approaches without considering their achieved performances intentionally as they deal with different databases.\nIn Figure 1, we classify the main existing Arabic DID systems. As a matter of fact, our taxonomy is based on two criteria: speech feature Level and Intra/Inter country dialect. The first criterion indicates from which level the speech features are extracted. In general, the pre-lexical levels are the most used to identify dialect from speech. Hence, we consider acoustic/phonetic, phonotactic and prosodic levels that are exploited alone or combined. The second criterion distinguishes the origin of targeted dialects in either Intra-country or Inter-country, which means that the studied dialects are from the same country/region or dialects from many countries. This criterion is chosen because it is\nA D\nID Sy\nst em\ns\nIn tr\naco\nun tr\ny A\nco us\ntic\nD je\nlla b\net al\n.[ 4]\n3 A\nre as\nSD C G M\nM -U\nB M\nH an\nan ie\nta l.\n[5 ]\n4 D\nts\nM FC\nC\nive\nct or\ns\nIn te\nrco\nun tr\ny\nA co\nus tic\n/P ho\nne tic\n(A co\nus /P\nho ne\n) Ph\non ot\nac tic\n(P ho\nno )\nB ia\nds y\net al\n.[ 13\n]\n4 D\nts +\nM SA\nM FC\nC\nH M\nM A\nkb ac\nak et\nal .[\n14 ]\n4 D\nts\nM FC\nC\nN -g\nra m\nPr os\nod y\n(P ro\nso )\nR ou\nas et\nal .[\n15 ]\n3 A\nre as\nA ll\nfe at\nur es\nN -g\nra m\nC om\nbi ne\nd\nB ia\nds y\net al\n.[ 16\n]\n4 D\nts\nPh on\no+ Pr\nos o\nH M\nM +G\nM M\nR ic\nha rd\nso n\net al\n.[ 17\n]\n4 D\nts\nA co\nus +P\nho no SV M\nG re\nen be\nrg et\nal .[\n18 ]\n4 D\nts +\nM SA\nA co\nus +P\nho no SV M\nA li\net al\n.[ 19\n]\n4 D\nts\nPh on\ne+ L\nex ic\nal\nive\nct or\ns\nA lo\nri fi\net al\n.[ 20\n]\n2 D\nts\nM FC\nC\nH M\nM B\nia ds\ny at\nal .[\n21 ]\n4 D\nts SD C SV M\nA l-\nA yy\nou b\net al\n.[ 22\n]\n2 D\nts\nW av\nel et\nB ay\nes N\net L\nac ha\nch ia\nta l.\n[2 3]\n4 D\nts SD C SV M\nFi gu\nre 1:\nTa xo\nno m\ny of\nA D\nID sy\nst em\ns A\ncc or\ndi ng\nto B\not h\nC ri\nte ri\na: Sp\nee ch\nFe at\nur e\nL ev\nel an\nd In\ntr a/\nIn te\nrC ou\nnt ry\n.\nmore hard to identify Arabic dialects belonging to the same geographical area.\nFirst of all, we summarize the ADID systems where acoustic/phonetic models are used alone. Most of the reviewed works are based on spectral features, which are Mel Frequency Cepstral Coefficient (MFCC) or Shifted Delta Cepstrum (SDC), with Gaussian Mixture Model (GMM) [23] and Support Vector Machine (SVM)[21] dialect modeling. Alorfi [20] proposed different acoustic/phonetic approaches using Hidden Markov Models (HMM). He associated two states for each dialect representing common and unique sounds respectively. He restrained the evaluation of his approach to identify only two Inter-country dialects: Egyptian and Gulf.\nFurthermore, Biadsy et al. [21] employed phone labels segmentation to constrain the acoustic models. They generated dialect models using an SVM classifier with special Kernel function, and they applied this approach on four Arabic Inter-country dialects: Iraqi, Gulf, Levantine and Egyptian. In addition to that, Al-Ayyoub et al. [22] designed an acoustic model using fixed100\nsize segmentation for which they extracted the selected wavelet features. They deal with two dialects Jordanian and Egyptian. However, as they confirmed, their results are not conclusive due to the limited size and the quality of the database. For the context of Magrebian ADID, Lachachi and Adla [23] instrumented the reducing Universal Background Model (UBM) to support special SVM classification. In fact, they reduced the size of database using the Minimal Enclosing Ball method by means of a fuzzy Cmean clustering algorithm. They deal with a database containing five dialects spoken in: Oran (Algeria), Algiers (Algeria), Constantine (Algeria), Morocco and Tunisia.\nIn contrast of the other acoustic/phonetic approaches, only Djellab et al. [4] and Hanani et al. [5] have proposed ADID system for Intra-country context. Hanani et al. [5] have investigated an acoustic approach based on i-vectors method for regional accents recognition. They performed their experiments on Arabic Palestinian accents from four different regions: Jerusalem, Hebron, Nablus and Ramallah. Whereas, Djellab et al. [4] designed a GMM-UBM and an i-vectors framework for accent recognition. They implement their experiments on a selected data spoken in three Algerian ares, which are the East, Center and West of Algeria.\nHowever in phonotactic cues, there are few attempts that have built ADID through\nthe use of a Parallel Phone Recognition followed by Language Modeling (PPRLM) [13] [14]. For instance, Biadsy et al. [13] have applied PPRLM using nine (Arabic and nonArabic) phone recognizers where the Arabic ones are their own built. They performed their experiments on a large database of four Arabic dialects (Egyptian, Gulf, Iraqi, Levantine) together with MSA. More to the point, Akbacak et al. [14] have designed an approach that combines three models to identify four Arabic dialects (Iraqi, Gulf, Levantine and Egyptian). These models are cepstral GMM, PPRLM and Phone Recognition modeled via SVMs (PRSVM). The combination is carried-out at the score-level.\nFurthermore, some other works have exploited both acoustic/phonetic and phonotactic features to perform ADID [18] [17]. Firstly, Greenberg et al. [18] have designed a combined approach using four core classifiers based on three spectral similarities and n-grams. This combination is done at the back-end level of the system using Bayes classifier. They targeted a set of 24 languages containing four variations of Arabic language, which are MSA and three dialects: Iraqi, Levantine and Maghrebi. Secondly, Richardson et al. [17] have gathered acoustic and phonotactic features using different classifier. They conduced their experiments on many dialects, including Arabic dialects spoken in Gulf, Iraq and Levantine. They concluded that SVM classifier has achieved best results for Arabic dialects.\nAli et al. [19] have designed an approach based on i-vectors method that combined phonetic and lexical features. They performed their experiments on an Arabic Broadcast speech database of four Arabic dialects Egyptian, Gulf, Levantine, and North Africa.\nOn the other side, we have observed that there are few attempts of prosody-based ADID. Based on a previous work of Ghazali et al. [27], it was shown that some Arabic dialects (Syria, Jordan, Morocco, Algeria, Tunisia and Egypt) can be grouped using rhythmic information in three dialectal areas: Maghreb (Morocco, Algeria), MiddleEast (Syria, Jordan), and an intermediate one (Tunisia, Egypt). Depending on what was mentioned before, Rouas et al. [15] have designed an ADID system for three previous dialectal areas. Their approach collected all prosodic information: intonation, rhythm and stress. Thus, they used a segmentation which is based on consonant/vowel location to get the approximative structure of the syllable. They have utilized a spe-\ncial codification to represent the duration of phonemes and the energy instead of the real values. Then, they classified dialect areas using multi-gram models where grams are their pseudo-syllables and each area’s dialect is represented by the most frequent sequences of n-gram. Unfortunately, they tested their system on a small database.\nAnother work on ADID has been proposed by Biadsy et al. [16], which combined the prosodic and phonotactic approaches. In fact, they augmented their phonotactic system, described above, by adding some prosodic features like durations and fundamental frequency measured at n-gram level where grams are syllables. They tested their system on four Arabic dialects: Gulf, Iraqi, Levantine, and Egyptian.\nTo our knowledge there is no deployment of HC in ADID. However, HLID have been already proposed for others languages. For Indian languages, Jothilakshmi et al. [28] designed a two level classification system using acoustic features. On the other hand, Yin et al. [29], proposed a HLID framework where speech signal is characterized at acoustic level and some prosodic features. The fusion of these classifiers is performed using modern GMM fusion system. Likewise, Wang et al. [30] suggested a hierarchical system using bayesian logistic regression models as score generators. The final identification is performed by a score based-likelihood merger. For Philippine languages, Laguna at al. [31] developed a HLID system via GMM, in which speeches are characterized by means of acoustic and prosodic features.\nOn the light of this near exhaustive review of the most important ADID systems, let us underline that a little attention has been paid to Algerian ADID problem. In addition, we confirm that there is a lack of ADID system that exploit the prosodic information. In fact, only Rouas et al. [15] and Biadsy et al. [16] have considered this kind of information. Rouas et al. [15] have considered area dialects, while Biadsy et al. [16] have treated inter-country dialects.\nAll of the proposed ADID systems use conventional classification method in occurrence SVM, HMM-GMM, BayesNet. However, Deep Learning is not investigated despite their provided efficiency for Language/Dialect identification [32] [33]."
    }, {
      "heading" : "3. A Glance at Algerian Arabic Dialects",
      "text" : "Algeria is a large country, with a total area of about 2.4 million km2. Administratevely divided into 48 departments, Algeria is bordered by mainly three Arabic countries, in the north-east by Tunisia, in the east by Libya, in the west by Morocco. Algeria’s official language is MSA as in all Arab countries. However, Algerian local dialects are mostly used instead of MSA. Algerian Arabic is used to refer to dialect spoken in Algeria, known as Daridjah to its speakers. Algerian dialect presents a complex linguistic features mainly due to both Arabization processes that led to the appropriation of the Arabic language by populations Berber origin, and the deep colonization. In fact, Arabic Algerian dialect is affected by other languages such as Turkish, French, Italian, and Spanish [34].\nAccording to the Arabization process, dialectologists show that Algerian Arabic dialects can be divided into two major groups: Pre-Hilālı̄ and Bedouin dialect. Both dialects are different by many linguistic features [35] [36].\nFirstly, Pre-Hilālı̄ dialect is called sedentary dialect. It is spoken in areas that are affected by the expansion of Islam in the 7th century. At this time, the partially affected cities are: Tlemcen, Constantine, and their rural surroundings. The other cities have preserved their mother tongue language (Berber). Marçais [37] has divided Pre-Hilālı̄ dialect into two dialects: village (mountain), and urban dialect.\n• Village dialect is located between Trara mountains and Mediterranean sea. The\ncentral town of this area is Nedroma, which is located in the northwestern corner of Algeria. There is also a village dialect located in the northeastern corner of Algeria: it is between Collo, Djidjelli, and Mila.\n• Urban dialect is located in the northern cites: Tlemcen, Cherchell, Dellys, Djid-200\njelli, and Collo.\nSecondly, Bedouin dialect is spoken in areas which are influenced by the Arab immigration in the 11th century [38], [39]. Marçais [35] has divided Bedouin dialect into five distinct basic dialects:\nAlgerian Arabic Dialects\nPre-Hilālı̄ dialects\nVillage dialect Urban dialect\nBedouin dialects\nHilālı̄\nSaharan Nomadic Tellian Nomadic High plains of Constantine\nSulaymite Ma’qilian Urban Completely Bedouin\nMarçais [35] gathered the three dialects (3, 4, 5) under the name of Hilālı̄ dialect, which takes its name from Banū Hilāl tribe. In addition to that, there is another dialect which has urban dialects that have been completely influenced by Bedouin dialect: Annaba, Algiers, Béjaı̈a, Blida, Mascara, Mazouna, Mostaganem, Medea, Mila, Miliana, Skikda, Tenes, and Oran. For that, we have classified these dialects, so-called Urban Completely Bedouin (UCB), into the Bedouin dialects group.\nIn spite of the sparse and the specific linguistic studies that have dealt with Arabic dialects, there is no efficient and complete dialect hierarchy dedicated to Algerian\ndialects. We have compiled a preliminary version of such hierarchy from the above historical knowledges. We summarize the Hierarchy structure for Algerian dialects in Figure 2. This Hierarchy structure is also confirmed by some linguistic studies essentially phonological, lexical and morphological [35] [40]. However, this Hierarchy structure has not benefited of deep prosodic analysis for that reason, in what follows, we study which prosodic features are discriminative for Algerian Arabic dialects."
    }, {
      "heading" : "4. Prosodic Information for Dialects",
      "text" : "In order to identify a language/dialect, many features and measurements are developed in literature to capture prosody inherent to a speech. In this section, we first outline our motivation behind the use of prosody for ADID. Then, we describe some prosodic features related to DID purpose. Finally, we explain how we have extracted them."
    }, {
      "heading" : "4.1. Why Prosody for Arabic Dialect Identification?",
      "text" : "The knowledge today which we have about the discriminative power of the prosody in Arabic dialects and specially in Algerian ones, can be summarized in what follows:\n• Arabic dialects differ in their prosodic structure: Barkat et al. [41] evaluated\nthe discriminating power of prosodic pattern in Arabic dialects in a linguistic study. They have shown that the prosodic information can be sufficient to identify Western and Eastern Arabic dialects.\n• Arabic dialects present significant differences at the syllable structure: Hamdi\net al. [42] shown that the different types of syllabic structure observed in Arabic dialects can be used as discriminative element. They demonstrated that rhythm variation of Arabic dialects is correlated with syllable structure. Moreover, Bouziri et al. [43] confirmed this fact by studying the stress measured through the syllable structure.\n• Intonation represents a salient discriminative feature in Arabic dialects: Ghaz-\nali et al. [44] studied the nature of intonation of five Arabic dialects. They observed that the intonation patterns are different between Eastern and Western\nArabic dialects. Furthermore, Yeou et al. [45] confirmed this result using another sample of Eastern and Western Arabic dialects.\n• Rhythm and intonation are discriminant parameters for some Algerian dialects:\nBenali [46] studied the role of the rhythm and the intonation in a human identification by means of two Algerian dialects, which are spoken in Algiers and Oran. He noted that rhythm and intonation are very discriminant parameters, particularly the speech rate and the variation of fundamental frequency.\nOn the light of these information, we focus on studying the rhythm and intonation\nfeatures because their importance to discriminant the Arabic dialects."
    }, {
      "heading" : "4.2. Prosodic Features",
      "text" : "To capture prosodic information, the pitch and duration sequence are used for indi-\ncating intonation and rhythm respectively.\nRhythm refers to aspects of temporal organization of speech. To capture quantitative rhythmic variation, different rhythm metrics have been developed to measure the vocalic and consonantal intervals in continuous speech. The first and most popular metrics used to classify a language include: Interval Measures (IM) [47], their normalized version (VarcoV/VarcoC) [48], and Pairwise Variability Index (PVI) [49]. In addition, we consider another metric: Speech Rate, which measure the number of syllable per second.\nThe IM metrics include three separate measures: the duration proportion, the standard deviation of vocalic interval (%V, ∆V), and the standard deviation of consonantal interval ∆C [47].\nThe PVI metrics focus on the temporal succession between the consonantal and vocalic intervals of the global utterance [49]. The model suggests to use the raw PVI for the Consonantal intervals (rPVI-C) and the normalized PVI for Vocalic intervals (nPVI-V).\nThe pitch, or fundamental frequency (F0), is used for indicating the intonation. The statistical modeling of intonation are used for each utterance. We take into consideration two groups of intonation metrics: Global information and total size of pitch trajec-\ntory. Global information metrics of the pitch are measured using quantiles of nucleus. This group has four pitch values which are: the Bottom is 2nd quantiles pitch nucleus, the Median is 50th quantiles pitch nucleus, the Top is 98th quantiles pitch nucleus in Hz, and Range is the difference between Top and Bottom in SemiTones (ST). Concerning the total size pitch trajectory, this group has two metrics (TrajIntra, TrajInter) calculated using pitch trajectory, which is the sum of absolute intervals within/between (TrajIntra/TrajInter) syllabic nuclei divided by duration (in ST/s). Table 1 details these features."
    }, {
      "heading" : "4.3. Segmentation and Features Extraction",
      "text" : "The extraction of the prosodic features needs a consonant/vowel segmentation. However, for Arabic dialect the problem of phoneme segmentation is not completely solved and unfortunately there is no related decoders such as the case for other dialects. To cope with this problem, we rely on the specific Arabic syllable structure to perform a consonant/vowel segment as we explain in what follows:\nA syllable is the unit of pronunciation between a phoneme and a word. It is divided\ninto three components: the opening Onset, the central Nucleus and the closing segment300\nCoda. The nucleus and coda are called the rhyme (or rime) [50]. In Arabic dialect, each syllable contains at least a nucleus while coda, and onset are optional. The nucleus is imperatively one or many vowels, and the others are consonants. An Arabic syllable structure can be modeled by the regular expression C∗V +C∗ where C is a consonant and V is a vowel. We exploit this fact to perform a consonant/vowel segmentation. Thus, we sketched up these measures by considering nuclei as vowel segments and what remains as consonant segments which we call coarse-grained segmentation. For example, we consider the following sequence of the three syllables (a). The syllable structure segmentation is presented in (b). Then, we get our coarse-grained segmentation (c), where VS (resp. CS) represents vowel (resp. consonant) segment.\nV+\nC*:V+:C*\nV+ V+C*\nCS VS\na) Syllable Sequence\nb) Syllable structure segmentation\nc) Coarse-grained C/V segmentation C* C* C*\nC*:V+:C* C*:V +:C*\nSyllable1 Syllable2 Syllable3\nOnce the consonant/vowel segmentation is performed, our prosodic features are extracted at utterance level. Whereas, previous prosodic-based ADID researches leveraging prosody extracted prosodic features at pseudo-syllable level [15] [16]."
    }, {
      "heading" : "5. Prosodic Statistic Analysis of Algerian Dialects",
      "text" : "In this section, we first study whether Algerian Arabic dialects can be discriminated using prosodic information. Then, we discuss what types of prosodic information can support Algerian Arabic dialect identification."
    }, {
      "heading" : "5.1. Speech Material",
      "text" : "It is important to mention that there is no standard corpus available for Algerian Arabic dialects such as for some other Arab countries [51]. For this reason, we have\ncollected our own corpus ALG-DARIDJAH [25]. This corpus provides a representation of phonetic, prosodic and orthographic varieties of Algerian Arabic dialects. Its current version contains five Arabic Algerian dialects: Pre-Hilālı̄, Hilālı̄, Sulaymite, Ma’qilian, and Urban Completely Bedouin dialects. Table 2 gives more details on the sample chosen for the current analysis. The total number of utterances is 1892, each one is about 6s duration in average.\nThe speakers are chosen from adult population with 18 to 50 years old. The 41 talkers are native from their dialect region, and both parents of each speaker were also native from the same dialect region. The speeches gather both spontaneous and subspontaneous utterances."
    }, {
      "heading" : "5.2. Prosodic Statistic Analysis",
      "text" : "In this statistical analysis, we have considered the prosodic features presented in the previous section. Their extraction is done after the coarse-grained segmentation. More details on used tools are presented in experimental Section 7. Table 3 presents the means for each rhythm and intonation measure for Pre-Hilālı̄, Urban C-B, Hilālı̄, Sulaymite, and Ma’qilian dialects.\nCross-dialectal comparison shows that the proportion of vocalic intervals (%V) represents less than 50% of the total duration of an utterance in all dialects, this result\nsupport the claim of Hamdi et al. [52], that all Arabic dialects have less than 50% for the vocalic intervals (%V).\nPre-Hilālı̄ and Hilālı̄ dialects exhibit the smallest proportion of vocalic intervals (%V), the greatest variability in consonant interval duration (∆C, rPVI-C), and in vocalic intervals (nPVI-V). This fact shows that they have the highest degree of vowel reduction and more complex syllable structure. The findings of the current study are consistent with those of Marçais [35] who found that Pre-Hilālı̄ dialect characterized by the presence of vowel reduction.\nHowever, Sulaymite dialect shows the greatest proportion of vocalic intervals (%V), the smallest variability in consonant interval duration (∆C, rPVI-C), and in vocalic intervals (nPVI-V). Thus, Sulaymite dialect is characterized by the absence of vowel reduction and simple syllable structure. These findings further support the note of Hamdi et al. [53] that Tunisian (Sulaymite) dialect has a simple syllable structure.\nAccording to the speech rate, we noticed a faster overall articulation rate for Su-\nlaymite dialect, whereas a slower articulation rate for Ma’qilian dialect.\nIn order to confirm these observations, we have performed statistical analysis oneway ANalysis Of VAriance (ANOVAs). In this analysis, for each feature we consider only the dialects with the lower and higher mean values respectively. The summary of the significant differences between Algerian dialects is reported in Table 4.\nThe main observation is that the most p-value are smaller than .05 for each ANOVAs,\nwhich means that prosodic features can be used for binary classification. The second main observation is that Sulaymite dialect has presented significant differences with all the other dialects. In addition, Sulaymite dialect shows significant differences with Pre-Hilālı̄ and/or Hilālı̄ dialects for the three consonant variability measures: unnormalized one (∆C) and both consonantal intervals (VarcoC, rPVI-C), the proportion of vocalic intervals (%V), and both pitch measures (Top, TrajInter).\nThe vocalic interval duration (∆V), speech rate and three pitch measures (Range, Bottom, TrajIntra) exhibit a significant difference between Ma’qilian and Sulaymite dialect.\nThe results of Ramus et al.[47] study showed that the combination of %V and ∆C provides the best correlate feature to separate traditional rhythm categorizations of languages (stress-timed, syllabic-timed, mora-timed). Stress-timed language (English and Dutch) has full and reduced vowels. However, syllable-timed language (French, Spanish) does not have vowel reduction. In other words, the percentage of vocalic sequences (%V) of stress-timed language is smaller than in syllable-timed language. Moreover, ∆C is larger in stress-timed language and reflect more complex syllable structure.\nFigure 3 illustrates the placement of the five Arabic Algerian dialects with Algerian-\nMSA, English, and French language on the (%V, ∆C) plane. The measures of Algerian MSA, English, and French prosodic features are taken from Droua et al. [54].\nFrom the (%V, ∆C) plane, we can divide Algerian Arabic dialects into three groups. The first dialect group has the highest ∆C and the lowest %V such as English were those traditionally classified as stress-timed. It include Pre-Hilālı̄ and Hilālı̄ dialect. The second group represents the syllable-timed rhythm class, such as French, which include Sulaymite dialect. The third group includes Ma’qilian and Urban Completely Bedouin dialect that is near to Algerian-MSA language, which is classified to Mixedtimed rhythm class [54]."
    }, {
      "heading" : "6. Hierarchical Dialect Identification Approach",
      "text" : "Our proposed approach relies on prosodic features to identify Arabic dialect in intra-country context. In order to deal with the large dialectal varieties, our approach employs the dialect hierarchy structure to efficiently derive well training models. Figure 4 sketches the global scenario of our HADID approach. As inputs, we provide a database of speech from different dialects. Within the preprocessing phase, we remove noise and silence from all the database speeches. Afterward, the coarse-grained consonant/vowel segmentation is applied and then prosodic information are extracted. The latters processes are explained in Section 4. For the extraction of HADID models, we have used as an input our derived hierarchical structure for Algerian dialects which is\npresented in Figure 2.\nFor building HADID models, many hierarchical classification methods can be taken into consideration. The most used are global or top-down approaches [9]. We opt to use the last one. It is called local classifiers approach, where the hierarchy is taken into account using local information. More precisely, we built a set of dialect models;400\na Local Classifier per Parent Node (LCPN) from the top to down according to the dialect hierarchical structure. We consider for each model only discriminative features. Hence, a different set of features and classifiers can be used separately for each node. In other words, we choose among prosodic features those that have the best discriminative power for the embedded dialects by the node. Thus, each LCPN model dedicated to a node X is trained using the dataset that represents dialects for which X is an ancestor.\nDuring the identification phase, an utterance is determined by passing through the different DID systems within the Hierarchical DID models. The target utterance is firstly classified to the most likely dialect group, proceeding level by level from the top until the final dialect becomes identified.\nLCPN dialect models are made using the state-of-the-art in language/dialect identification, Deep Learning technique [32] [33], in this case Deep Neural Networks (DNNs).\nDNNs is an artificial neural network that has more than one layer of hidden units between its inputs and outputs. The DNNs classifier used in this work is a fully-connected feed-forward neural network with Rectified Linear Units (ReLU). Thus, an input xj at level j is represented by Equation (1). It is mapped to its corresponding activation yj represented by Equation (2).\nxj = bj + ∑ i wij yi (1)\nwhere i is an index over the units of the layer below and bj is the bias of the unit j.\nyj = ReLU(xj) = max(0, xj) (2)\nThe output layer is then configured as a softmax function, where the hidden units\nmap input yj to a class probability pj of the following form:\npj = exp(yj)∑ d exp(yd)\n(3)\nwhere d is an index over all of the target dialect classes.\nAs a cost function for back-propagating gradients in the training stage, we use the\ncross-entropy function defined as:\nC = − ∑ j tj log(pj) (4)\nwhere tj represents the target probability of the class j for the current evaluated example, it takes a value of either 1 (true class) or 0 (false class)."
    }, {
      "heading" : "7. Experiments and Results",
      "text" : "In order to evaluate the performances of our HADID approach, we have performed various experiments. Firstly, we evaluate and analyze the performance of our HADID system. Secondly, we measure the effect of using DNNs for dialect modeling. In fact, we compare HADID performance to HADID system that uses SVM instead of DNNs modeling. Finally, we perform comparison of HADID with a baseline Flat classification approach, which is built without considering hierarchical dialect structure. Before presenting our experiments and results, we present the dataset, used tools, and evaluating metrics."
    }, {
      "heading" : "7.1. Dataset and Tools",
      "text" : "Let us mention that we use the same corpus as for the statistical analysis which is presented in Section 5. It encompassed five dialects with 1892 utterances, each one is about 6s duration in average. This dataset is split into training (3/4) and testing (1/4) sets. We note that we have performed speaker independent DID system. This means that the speaker set used for training is disjoint from speaker set used for testing which leads to real dialect characterization capture.\nIn order to implement and evaluate our system, we have involved a set of Open Source softwares. We have used Praat tool1 to remove noise. Our coarse-grained segmentation is done automatically using also Praat tool enhanced by Prosogram2 script. The latter performs syllable segmentation using intensity of band-pass filtered signal. The syllable’ nuclei are delimited using spectral and amplitude changes. Please also note that this script has reached 80% according to segmentation accuracy [55].\nThe intonation metrics and speech rate are extracted using Prosogram script. While, rhythm features are calculated using Correlatore3 program, which is mainly designed for rhythm analysis.\nConcerning the SVM generation of dialect models, we have used Weka tool4, which is one of the most commonly tools in Machine Learning. The SVM kernel deployed is a Radial Basis Function. We have got the best C and γ parameters of SVM. This is performed using GridSearch script, which is a meta-classifier [56]. In other side, for DNNs dialect modeling and test purposes, we have used H2O5 deep learning package scripted with R language.\n7.2. HADID Implementation\nAccording to the available hierarchical dialect structure, we have built two LCPN based on DNNs classifier (DNNs1, DNNs2). Figure 5 illustrates the hierarchical dialect models. DNNs1 classifier is used to classify the first level dialect groups (Pre-Hilālı̄,\n1Praat v 5.3.47, Online: http://www.fon.hum.uva.nl/praat 2Prosogram v 2.9, Online: http://bach.arts.kuleuven.be/pmertens/prosogram/ 3Correlatore v 2.1, Online: http://www.lfsag.unito.it/correlatore/ 4Weka v 3.7.13, Online: http://www.cs.waikato.ac.nz/ml/weka/ 5H2O, Online: http://www.h2o.ai/\nBedouin). It can be seen as a regional dialect identification. Whereas, DNNs2 classifier is used to classify Bedouin dialects (Sulaymite, Ma’qilian, Urban Completely Bedouin, Hilālı̄ dialect).\nIn order to choose the appropriate prosodic feature set for each classifier, we have used the feature selection method: ANOVA ranking [57]. This latter leads to the following:\n1. For DNNs1 classifier, six features are selected. These features are: the duration\nproportion (%V), the standard deviation of vocalic interval (∆V), and four pitch values (Range, Mean, TrajIntra, TrajInter). Thus, the input layer has 6 linear units. Whereas, the output layer has two units (Pre-Hilālı̄, Bedouin).\n2. For DNNs2 classifier, seven features are selected. These features are: the dura-\ntion proportion (%V), the standard deviation of consonantal interval (∆C), and five pitch values (Range, Top, Bottom, TrajIntra, TrajInter). Thus, the input layer has 7 linear units. Whereas, the output layer has four units.\nNow let us describe both topologies within DNNs1 and DNNs2. Figure 6 illustrates the generic DNNs topology and its related description. Each DNNs has four hidden layers with 560 units. A dropout factor of 0.5 is used for each hidden layer. These parameters are chosen empirically."
    }, {
      "heading" : "7.3. Evaluation Metrics",
      "text" : "Concerning the performance measure of HADID system, we use the extended version of the well known metric Precision but tailored to the hierarchical classification scenario namely hierarchical Precision (hP ) proposed by Kiritchenko et al. [58]. It is defined as follows:\nhP = ∑ i |Ĉi ∩ T̂i|∑\ni |Ĉi|\nwhere Ĉi is the set consisting of the most specific class(es) predicted for test example\ni and all its ancestor classes, T̂ i is the set consisting of the true most specific class(es) of test example i and all its ancestor classes.\nThe performance of the whole HADID system is measured using Hierarchical microprecision, which is the average of hP on the entire test utterances. The performance of the baseline Flat classification approach is measured using the standard microPrecision."
    }, {
      "heading" : "7.4. Results and Discussion",
      "text" : "For all experiments, we use speaker-independent DID and the k-fold cross-validation\ntechnique (k = 5). In order to ensure that our results are reliable.\n7.4.1. HADID System\nThe discussion of the results begins with the study the performance of our HADID system. Table 5 gives the Hierarchical micro-precision for HADID system on five folds.\nThese results confirmed that prosody is suitable to separate region dialects (Level1). In fact, DNNs1 classifier separates between Pre-Hilālı̄ dialects and Bedouin ones with 83.8% of precision. The average precision remains acceptable (62.8%) for all the500\nfive dialects in spite of their closeness. We can also observe that the precision of the system is quite stable. In fact, the deviation between the precision for each fold and the average precision doesn’t exceed 5.2%.\nFigure 7 reports more details on HADID system results. In fact, it reports average\nhP by dialect of the five folds.\nThe best result for HADID system is observed for Ma’qilian and Sulaymite dialects with 87% and 72% precision respectively. This achievement is predicted by our statistical analysis. The worst classification result is observed for the UCB dialect with 44% precision. This result can be explained by the fact that UCB dialect has Pre-Hilālı̄ origins but deeply influenced by Bedouin dialects. A deep examination of results shows that UCB utterances are mis classified in others Bedouin dialects. This fact suggests a refinement of the hierarchical dialect structure which needs dialectologists efforts.\n7.4.2. HADID vs. HADID-SVM System\nTurning now to the comparison of HADID with HADID-SVM system. This latter designed as HADID system where dialect modeling uses conventional SVM classifier. Table 6 gives the comparative results in term of their hP for 5-fold cross-validation.\nConcerning the first level, regional dialect identification, HADID-SVM precision is of the same magnitude as HADID system. It is apparent from that HADID (with DNNs) system is better than HADID-SVM system with an improvement of 7.1% in term of precision. However, detailed results by dialects (see Figure 7) proves that HADID is more suitable than HADID-SVM system. Indeed, the deviation between best and worst precisions by dialect is about 76% for HADID-SVM system.\n7.4.3. HADID vs. Flat System\nThe designed baseline Flat classification system is built using the same preprocessing and segmentation phases as for HADID approach. The speech is also characterized using the best prosodic features according to ANOVA ranking method. However, one DNNs model is generated for all targeted dialects.\nTable 7 reports comparative results of Flat classification and HADID system in term\nof precision.\nThe average precision is about 38.4% for Flat system. It is clear that HADID outperforms this baseline Flat classification system by an improvement more than 63.5%. This main finding proves that for ADID, Hierarchical classification is more suitable than Flat classification. Furthermore, from Figure 7, we can observe that UCB dialect is not at all classified by Flat system. This is due to the same reason cited above."
    }, {
      "heading" : "8. Conclusion",
      "text" : "In this paper, first, we have shown by means of statistical analysis that prosody has a discriminative power for Algerian Arabic dialects. The prosodic features are extracted at the utterance level after our coarse-grained consonant/vowel segmentation.\nWe have also designed a prosody-based Hierarchical Arabic Dialect IDentification (HADID) that identifies Algerian Arabic dialects from a speech. Within HADID system, a top-down method is involved where a Local Classifier per Parent Node (LCPN) is built according to the given predefined hierarchical dialect structure. The LCPN dialects models are constructed using Deep Neural Networks method.\nHADID performances are evaluated on Algerian Arabic dialects corpus with 1892 utterances, each one is about 6s duration in average. For region dialects identification, HADID reaches a precision of 83.6% while for dialect identification it gives 62.8%. These results prove its suitability for Arabic Dialect IDentification (ADID). Compared with Flat classification system, HADID gives an improvement of 63.5% in term of precision.\nTo the best of our knowledge, in the context of Arabic dialect identification, this is the first investigation that applies the hierarchical classification method where Deep Learning technique is deployed to generate dialect models. Furthermore, for Algerian Arabic dialects, it is the first ADID system leveraging prosody.\nCertainly our dataset covers only a part of Arabic Algerian dialects and the hierarchical dialects structure needs more refinement, this framework can be considered as a kernel for more complete systems. It can deal with all Arabic dialects identification, as long as, we have an efficient hierarchical dialect structure.\nMoreover, there are more than one possible ways to perform HADID implementation. We plan to investigate the Global Hierarchical methods. In another ongoing work,\nwe are investigated a combined approach using prosody and acoustic/phonetic speech information."
    } ],
    "references" : [ {
      "title" : "Spoken language recognition: From fundamentals to practice",
      "author" : [ "H. Li", "B. Ma", "K. Lee" ],
      "venue" : "Proceedings of the IEEE 101 (5) ",
      "citeRegEx" : "1",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Language Identification Using Spectral and Prosodic Features",
      "author" : [ "K.S. Rao", "V.R. Reddy", "S. Maity" ],
      "venue" : "Springer",
      "citeRegEx" : "2",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Integrating acoustic",
      "author" : [ "T. Rong", "M. Bin", "Z. Donglai", "L. Haizhou", "C.E. Siong" ],
      "venue" : "prosodic and phonotactic features for spoken language identification, in: Int. Conf. Acoust. Speech and Signal Process.",
      "citeRegEx" : "3",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Algerian Modern Colloquial Arabic Speech Corpus (AMCASC): regional accents recognition within complex socio-linguistic environments",
      "author" : [ "M. Djellab", "A. Amrouche", "A. Bouridane", "N. Mehallegue" ],
      "venue" : "Language Resources and Evaluation ",
      "citeRegEx" : "4",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "Palestinian Arabic Regional Accent Recognition",
      "author" : [ "A. Hanani", "H. Basha", "Y. Sharaf", "S. Taylor" ],
      "venue" : "in: Speech Technology and Human-Computer Dialogue (SpeD)",
      "citeRegEx" : "5",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Ethnologue: Languages of the World",
      "author" : [ "M.P. Lewis", "F.S. Gary", "D.F. Charles" ],
      "venue" : "Eighteenth edition, Web ",
      "citeRegEx" : "6",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Les dialectes arabes modernes: état et nouvelles perspectives pour la classification géo-sociologique",
      "author" : [ "M. Embarki" ],
      "venue" : "Arabica 55 ",
      "citeRegEx" : "7",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "The Arabic Language",
      "author" : [ "K. Versteegh" ],
      "venue" : "Edinburgh University Press, Cambridge",
      "citeRegEx" : "8",
      "shortCiteRegEx" : null,
      "year" : 1997
    }, {
      "title" : "A survey of hierarchical classification across different application domains",
      "author" : [ "J. Silla", "N. Carlos", "A.A. Freitas" ],
      "venue" : "Data Mining and Knowledge Discovery 22 (1-2) ",
      "citeRegEx" : "9",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Accents of English",
      "author" : [ "J.C. Wells" ],
      "venue" : "Vol. 2, Cambridge University Press",
      "citeRegEx" : "10",
      "shortCiteRegEx" : null,
      "year" : 1982
    }, {
      "title" : "A Unified Architecture for Natural Language Processing: Deep Neural Networks with Multitask Learning",
      "author" : [ "R. Collobert", "J. Weston" ],
      "venue" : "in: Proceedings of the 25th international conference on Machine learning, ACM",
      "citeRegEx" : "11",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "F",
      "author" : [ "R. Sahraeian", "D. Van Compernolle" ],
      "venue" : "de Wet, Under-resourced speech recognition based on the speech manifold, in: Sixteenth Annual Conference of the International Speech Communication Association",
      "citeRegEx" : "12",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Spoken Arabic Dialect Identification Using Phonotactic Modeling",
      "author" : [ "F. Biadsy", "J. Hirschberg", "N. Habash" ],
      "venue" : "in: EACL, Athens, Greece",
      "citeRegEx" : "13",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "Effective Arabic Dialect Classification Using Diverse Phonotactic Models",
      "author" : [ "M. Akbacak", "D. Vergyri", "A. Stolcke", "N. Scheffer", "A. Mandal" ],
      "venue" : "in: Interspeech, Florence, Italy",
      "citeRegEx" : "14",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Identification automa-  600 tique des parlers arabes par la prosodie",
      "author" : [ "J.L. Rouas", "M. Barkat-Defradas", "F. Pellegrino", "R. Hamdi" ],
      "venue" : "in: Journées d’Etude sur la Parole, Dinard, France",
      "citeRegEx" : "15",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Using Prosody and Phonotactics in Arabic Dialect Identification",
      "author" : [ "F. Biadsy", "J. Hirschberg" ],
      "venue" : "in: Interspeech, Brighton, UK",
      "citeRegEx" : "16",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "Discriminative N-Gram Selection for Dialect Recognition",
      "author" : [ "F. Richardson", "W. Campbell", "P. Torres-Carrasquillo" ],
      "venue" : "in: Interspeech, Brighton, UK",
      "citeRegEx" : "17",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "The 2011 NIST Language Recognition Evaluation",
      "author" : [ "C. Greenberg", "A. Martin", "M. Przybocki" ],
      "venue" : "in: Interspeech, Portland, Oregon, USA",
      "citeRegEx" : "18",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Automatic Dialect Detection in Arabic Broadcast Speech",
      "author" : [ "A. Ali", "D. Najim", "C. Patrick", "K. Sameer", "Y. Sree Harsha", "J. Glass", "P. Bell", "S. Renals" ],
      "venue" : "arXiv preprint arXiv:1509.06928v2",
      "citeRegEx" : "19",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "Automatic Identification of Arabic Dialects Using Hidden Markov Models",
      "author" : [ "F.S. Alorfi" ],
      "venue" : "Ph.D. thesis, University of Pittsburgh, USA ",
      "citeRegEx" : "20",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "Dialect and Accent Recognition Using Phonetic-Segmentation Supervectors",
      "author" : [ "F. Biadsy", "J. Hirschberg", "D.P.W. Ellis" ],
      "venue" : "in: Interspeech, Florence, Italy",
      "citeRegEx" : "21",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Spoken Arabic dialects identification: The case of Egyptian and Jordanian dialects",
      "author" : [ "M. Al-Ayyoub", "M.K. Rihani", "N.I. Dalgamoni", "N.A. Abdulla" ],
      "venue" : "in: ICICS, Irbid, Jordan",
      "citeRegEx" : "22",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "GMM-Based Maghreb Dialect Identification System",
      "author" : [ "N. Lachachi", "A. Adla" ],
      "venue" : "Journal of Information Processing Systems 11 (1) ",
      "citeRegEx" : "23",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Automatic Dialect Identification of Extemporaneous Conversational",
      "author" : [ "M.A. Zissman", "T.P. Gleason", "D.M. Rekart", "B.L. Losiewicz" ],
      "venue" : "Latin American Spanish Speech, in: ICASSP, Atlanta, Georgia",
      "citeRegEx" : "24",
      "shortCiteRegEx" : null,
      "year" : 1996
    }, {
      "title" : "Toward a Rich Arabic Speech Parallel Corpus for Algerian sub-Dialects",
      "author" : [ "S. Bougrine", "H. Cherroun", "D. Ziadi", "A. Lakhdari", "A. Chorana" ],
      "venue" : "in: LREC’16 Workshop on Free/Open-Source Arabic Corpora and Corpora Processing Tools (OSACT)",
      "citeRegEx" : "25",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "Critical Survey of the Freely Available Arabic Corpora",
      "author" : [ "W. Zaghouani" ],
      "venue" : "in: LREC’14 Workshop on Free/Open-Source Arabic Corpora and Corpora Processing Tools (OSACT). Reykjavik, Iceland",
      "citeRegEx" : "26",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Speech Rhythm Variation in Arabic Dialects",
      "author" : [ "S. Ghazali", "R. Hamdi", "M. Barkat" ],
      "venue" : "in: Proceedings of Prosody, Aix-en-Provence, France",
      "citeRegEx" : "27",
      "shortCiteRegEx" : null,
      "year" : 2002
    }, {
      "title" : "A hierarchical language identification system for Indian languages",
      "author" : [ "S. Jothilakshmi", "V. Ramalingam", "S. Palanivel" ],
      "venue" : "Digital Signal Processing 22 (3) ",
      "citeRegEx" : "28",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Hierarchical Language Identification based on Automatic Language Clustering",
      "author" : [ "B. Yin", "E. Ambikairajah", "F. Chen" ],
      "venue" : "in: Interspeech",
      "citeRegEx" : "29",
      "shortCiteRegEx" : null,
      "year" : 2007
    }, {
      "title" : "A hierarchical system design for language identification",
      "author" : [ "H. Wang", "X. Xiao", "X. Zhang", "J. Zhang", "Y. Yan" ],
      "venue" : "in: ISISE",
      "citeRegEx" : "30",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "Development",
      "author" : [ "A.F.B. Laguna", "R.C.L. Guevara" ],
      "venue" : "Implementation and Testing of Language Identification System for Seven Philippine Languages, Philippine Journal of Science 144 (1) ",
      "citeRegEx" : "31",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "On the use of deep feedforward neural networks for automatic language identification",
      "author" : [ "I. Lopez-Moreno", "J. Gonzalez-Dominguez", "D. Martinez", "O. Plchot", "J. Gonzalez- Rodriguez", "P.J. Moreno" ],
      "venue" : "Computer Speech and Language 40 ",
      "citeRegEx" : "32",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "Study of Senone-Based Deep Neural Network Approaches for Spoken Language Recognition",
      "author" : [ "L. Ferrer", "Y. Lei", "M. McLaren", "N. Scheffer" ],
      "venue" : "IEEE/ACM Transactions on Audio, Speech, and Language Processing 24 (1) ",
      "citeRegEx" : "33",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "Algérie dans l’aménagement linguistique dans le monde",
      "author" : [ "J. Leclerc" ],
      "venue" : "Web ",
      "citeRegEx" : "34",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Algeria",
      "author" : [ "P. Marçais" ],
      "venue" : "Leiden: E.J. Brill",
      "citeRegEx" : "35",
      "shortCiteRegEx" : null,
      "year" : 1986
    }, {
      "title" : "Questionnaire de dialectologie du Maghreb (d’après les travaux de W",
      "author" : [ "D. Caubet" ],
      "venue" : "Marçais, M. Cohen, GS Colin, J. Cantineau, D. Cohen, Ph. Marçais, S. Lévy, etc.), Estudios de dialectologı́a norteafricana y andalusı́, EDNA (5) ",
      "citeRegEx" : "36",
      "shortCiteRegEx" : null,
      "year" : 2000
    }, {
      "title" : "Esquisse grammaticale de l’arabe maghrébin",
      "author" : [ "P. Marçais" ],
      "venue" : "Librairie d’Amérique et d’Orient",
      "citeRegEx" : "37",
      "shortCiteRegEx" : null,
      "year" : 1977
    }, {
      "title" : "Dialects: classification",
      "author" : [ "H. Palva" ],
      "venue" : "Encyclopedia of Arabic Language and Linguistics 1 ",
      "citeRegEx" : "38",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Arabic in the North African Region",
      "author" : [ "C. Pereira" ],
      "venue" : "in: S. Weniger, G. Khan, M. P. Streck, J. C. E. Watson (Eds.), Semitic Languages. An International Handbook, Berlin",
      "citeRegEx" : "39",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Arabic dialects: Classification",
      "author" : [ "H. Palva" ],
      "venue" : "Leiden Boston: Brill",
      "citeRegEx" : "40",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Prosody as a Distinctive Feature for the Discrimination of Arabic Dialects",
      "author" : [ "M. Barkat", "J. Ohala", "F. Pellegrino" ],
      "venue" : "in: Eurospeech, Budapest, Hungary",
      "citeRegEx" : "41",
      "shortCiteRegEx" : null,
      "year" : 1999
    }, {
      "title" : "La variation rythmique dans les dialectes arabes",
      "author" : [ "R. Hamdi" ],
      "venue" : "Ph.D. thesis, University Lumière Lyon 2 and University 7 Novembre, Tunisie ",
      "citeRegEx" : "42",
      "shortCiteRegEx" : null,
      "year" : 2007
    }, {
      "title" : "L’accent de l’arabe parlé à Casablanca et à Tunis: étude phonétique et phonologique",
      "author" : [ "R. Bouziri", "H. Nejmi", "M. Taki" ],
      "venue" : "in: ICPhS, Aix-en-Provence",
      "citeRegEx" : "43",
      "shortCiteRegEx" : null,
      "year" : 1991
    }, {
      "title" : "Intonational and Rhythmic patterns across the Arabic dialect continuum",
      "author" : [ "S. Ghazali", "R. Hamdi", "K. Knis" ],
      "venue" : "in: 19th Annual Symposium on Arabic Linguistics, Illinois, USA",
      "citeRegEx" : "44",
      "shortCiteRegEx" : null,
      "year" : 2005
    }, {
      "title" : "Contrastive focus and F0 patterns in three Arabic dialects",
      "author" : [ "M. Yeou", "M. Embarki", "S. Al-Maqtari" ],
      "venue" : "Nouveaux Cahiers de Linguistique Française 28 ",
      "citeRegEx" : "45",
      "shortCiteRegEx" : null,
      "year" : 2007
    }, {
      "title" : "Le rôle de la prosodie dans l’identification de deux parlers algériens: l’algérois et l’oranais",
      "author" : [ "I. Benali" ],
      "venue" : "in: MIDL, Paris, France",
      "citeRegEx" : "46",
      "shortCiteRegEx" : null,
      "year" : 2004
    }, {
      "title" : "Correlates of Linguistic Rhythm in the Speech Signal",
      "author" : [ "F. Ramus", "M. Nespor", "J. Mehler" ],
      "venue" : "Cognition 75 (1) ",
      "citeRegEx" : "47",
      "shortCiteRegEx" : null,
      "year" : 1999
    }, {
      "title" : "Rhythm and Speech Rate: a Variation Coefficient for deltaC",
      "author" : [ "V. Dellwo" ],
      "venue" : "in: Language and language-processing",
      "citeRegEx" : "48",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Durational Variability in Speech and the Rhythm Class Hypothesis",
      "author" : [ "E. Grabe", "E.L. Low" ],
      "venue" : "Papers in laboratory phonology 7 ",
      "citeRegEx" : "49",
      "shortCiteRegEx" : null,
      "year" : 2002
    }, {
      "title" : "KSU Rich Arabic Speech Database",
      "author" : [ "M. Alsulaiman", "G. Muhammad", "M.A. Bencherif", "A. Mahmood", "Z. Ali" ],
      "venue" : "Journal of Information 16 (6) ",
      "citeRegEx" : "51",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Speech Timing and Rhythmic Structure in Arabic Dialects: A Comparison of Two Approaches",
      "author" : [ "R. Hamdi", "M. Barkat-defradas", "E. Ferragne", "F. Pellegrino" ],
      "venue" : "in: Interspeech",
      "citeRegEx" : "52",
      "shortCiteRegEx" : null,
      "year" : 2004
    }, {
      "title" : "Syllable Structure in Spoken Arabic : a comparative investigation",
      "author" : [ "R. Hamdi", "S. Ghazali", "M. Barkat" ],
      "venue" : "in: Interspeech, Lisbonne, Portugal",
      "citeRegEx" : "53",
      "shortCiteRegEx" : null,
      "year" : 2005
    }, {
      "title" : "W",
      "author" : [ "G. Droua-Hamdani", "S.-A. Selouani", "M. Boudraa" ],
      "venue" : "Cichocki, Algerian arabic rhythm classification., in: ExLing",
      "citeRegEx" : "54",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "Music and speech in early development: automatic analysis  700 and classification of prosodic features from two portuguese variants",
      "author" : [ "I. Salselas", "P. Herrera" ],
      "venue" : "J. Portuguese Linguistics 9 (10) ",
      "citeRegEx" : "55",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "M",
      "author" : [ "I. Braga", "L.P. Carmo", "C.C. Benatti" ],
      "venue" : "C. Monard, Advances in Soft Computing and Its Applications.",
      "citeRegEx" : "56",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Feature selection in speech and speaker recognition",
      "author" : [ "T. Wu" ],
      "venue" : "Ph.D. thesis, Katholieke Universiteit Leuven, Leuven ",
      "citeRegEx" : "57",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "Learning and Evaluation in the Presence of Class Hierarchies: Application to Text Categorization",
      "author" : [ "S. Kiritchenko", "S. Matwin", "R. Nock", "A.F. Famili" ],
      "venue" : "in: Proceedings of the 19th Canadian Conference on Artificial Intelligence, Qubec, Canada.",
      "citeRegEx" : "58",
      "shortCiteRegEx" : null,
      "year" : 2006
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "A dialect/language can be distinguished from another by means of many characteristics extracted from the speech information levels: acoustic/phonetic, phonotactic, prosodic, lexical and syntactic [1].",
      "startOffset" : 196,
      "endOffset" : 199
    }, {
      "referenceID" : 1,
      "context" : "In contrast, prosodic based systems are less influenced by noise and channel variations [2].",
      "startOffset" : 88,
      "endOffset" : 91
    }, {
      "referenceID" : 2,
      "context" : "Furthermore, prosodic systems are more effective for short utterances while the phonotactic and acoustic features work better for long utterances [3].",
      "startOffset" : 146,
      "endOffset" : 149
    }, {
      "referenceID" : 3,
      "context" : "Whereas, little attention has been paid to spoken Arabic Dialect IDentification (ADID), especially when dialects belong to the same geographical area or country [4] [5].",
      "startOffset" : 161,
      "endOffset" : 164
    }, {
      "referenceID" : 4,
      "context" : "Whereas, little attention has been paid to spoken Arabic Dialect IDentification (ADID), especially when dialects belong to the same geographical area or country [4] [5].",
      "startOffset" : 165,
      "endOffset" : 168
    }, {
      "referenceID" : 5,
      "context" : "bic is a semitic language spoken by more than 420 million people in 60 countries worldwide [6].",
      "startOffset" : 91,
      "endOffset" : 94
    }, {
      "referenceID" : 6,
      "context" : "It has the following variants: Ancient Arabic (AA), Classical Arabic (CA), Modern Standard Arabic (MSA), and Dialectal Arabic (DA) [7].",
      "startOffset" : 131,
      "endOffset" : 134
    }, {
      "referenceID" : 7,
      "context" : "There is a large number of Arabic dialects and they are grouped in five categories: Arabian Peninsula, Levantine, Mesopotamian, Egyptian, and Maghrebi [8].",
      "startOffset" : 151,
      "endOffset" : 154
    }, {
      "referenceID" : 8,
      "context" : "A Hierarchical Classification (HC) is a machine learning method of placing new items into a collection on the light of a predefined hierarchical structure [9].",
      "startOffset" : 155,
      "endOffset" : 158
    }, {
      "referenceID" : 9,
      "context" : "In fact, it has been proved that dialect variations are notably pursued in prosodic features [10].",
      "startOffset" : 93,
      "endOffset" : 97
    }, {
      "referenceID" : 10,
      "context" : "tasks [11].",
      "startOffset" : 6,
      "endOffset" : 10
    }, {
      "referenceID" : 11,
      "context" : "It has efficient performances for under-resourced speech recognition [12].",
      "startOffset" : 69,
      "endOffset" : 73
    }, {
      "referenceID" : 14,
      "context" : "[15] in 2006, which is recent investigation compared to those developed for other non-Arabic dialects.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 23,
      "context" : "[24].",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 24,
      "context" : "First, there is a noticeable lack of speech databases/corpora for Arabic dialects dedicated to scientific researches purposes [25] [26].",
      "startOffset" : 126,
      "endOffset" : 130
    }, {
      "referenceID" : 25,
      "context" : "First, there is a noticeable lack of speech databases/corpora for Arabic dialects dedicated to scientific researches purposes [25] [26].",
      "startOffset" : 131,
      "endOffset" : 135
    }, {
      "referenceID" : 3,
      "context" : "[ 4] 3 A re as SD C G M M -U B M",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 4,
      "context" : "[5 ] 4 D ts M FC C ive ct or s",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 12,
      "context" : "[ 13 ] 4 D ts + M SA",
      "startOffset" : 0,
      "endOffset" : 6
    }, {
      "referenceID" : 13,
      "context" : "[ 14 ]",
      "startOffset" : 0,
      "endOffset" : 6
    }, {
      "referenceID" : 14,
      "context" : "[ 15 ]",
      "startOffset" : 0,
      "endOffset" : 6
    }, {
      "referenceID" : 15,
      "context" : "[ 16 ]",
      "startOffset" : 0,
      "endOffset" : 6
    }, {
      "referenceID" : 16,
      "context" : "[ 17 ]",
      "startOffset" : 0,
      "endOffset" : 6
    }, {
      "referenceID" : 17,
      "context" : "[ 18 ]",
      "startOffset" : 0,
      "endOffset" : 6
    }, {
      "referenceID" : 18,
      "context" : "[ 19 ]",
      "startOffset" : 0,
      "endOffset" : 6
    }, {
      "referenceID" : 19,
      "context" : "[ 20 ]",
      "startOffset" : 0,
      "endOffset" : 6
    }, {
      "referenceID" : 20,
      "context" : "[ 21 ]",
      "startOffset" : 0,
      "endOffset" : 6
    }, {
      "referenceID" : 21,
      "context" : "[ 22 ]",
      "startOffset" : 0,
      "endOffset" : 6
    }, {
      "referenceID" : 1,
      "context" : "[2 3]",
      "startOffset" : 0,
      "endOffset" : 5
    }, {
      "referenceID" : 2,
      "context" : "[2 3]",
      "startOffset" : 0,
      "endOffset" : 5
    }, {
      "referenceID" : 22,
      "context" : "Most of the reviewed works are based on spectral features, which are Mel Frequency Cepstral Coefficient (MFCC) or Shifted Delta Cepstrum (SDC), with Gaussian Mixture Model (GMM) [23] and Support Vector Machine (SVM)[21] dialect modeling.",
      "startOffset" : 178,
      "endOffset" : 182
    }, {
      "referenceID" : 20,
      "context" : "Most of the reviewed works are based on spectral features, which are Mel Frequency Cepstral Coefficient (MFCC) or Shifted Delta Cepstrum (SDC), with Gaussian Mixture Model (GMM) [23] and Support Vector Machine (SVM)[21] dialect modeling.",
      "startOffset" : 215,
      "endOffset" : 219
    }, {
      "referenceID" : 19,
      "context" : "Alorfi [20] proposed different acoustic/phonetic approaches using Hidden Markov Models (HMM).",
      "startOffset" : 7,
      "endOffset" : 11
    }, {
      "referenceID" : 20,
      "context" : "[21] employed phone labels segmentation to constrain the acoustic models.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 21,
      "context" : "[22] designed an acoustic model using fixed 100",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 22,
      "context" : "For the context of Magrebian ADID, Lachachi and Adla [23] instrumented the reducing Universal Background Model (UBM) to support special SVM classification.",
      "startOffset" : 53,
      "endOffset" : 57
    }, {
      "referenceID" : 3,
      "context" : "[4] and Hanani et al.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 4,
      "context" : "[5] have proposed ADID system for Intra-country context.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 4,
      "context" : "[5] have investigated an acoustic approach based on i-vectors method for regional accents recognition.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 3,
      "context" : "[4] designed a GMM-UBM and an i-vectors framework for accent recognition.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 12,
      "context" : "the use of a Parallel Phone Recognition followed by Language Modeling (PPRLM) [13] [14].",
      "startOffset" : 78,
      "endOffset" : 82
    }, {
      "referenceID" : 13,
      "context" : "the use of a Parallel Phone Recognition followed by Language Modeling (PPRLM) [13] [14].",
      "startOffset" : 83,
      "endOffset" : 87
    }, {
      "referenceID" : 12,
      "context" : "[13] have applied PPRLM using nine (Arabic and nonArabic) phone recognizers where the Arabic ones are their own built.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 13,
      "context" : "[14] have designed an approach that combines three models to identify four Arabic dialects (Iraqi, Gulf, Levantine and Egyptian).",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 17,
      "context" : "Furthermore, some other works have exploited both acoustic/phonetic and phonotactic features to perform ADID [18] [17].",
      "startOffset" : 109,
      "endOffset" : 113
    }, {
      "referenceID" : 16,
      "context" : "Furthermore, some other works have exploited both acoustic/phonetic and phonotactic features to perform ADID [18] [17].",
      "startOffset" : 114,
      "endOffset" : 118
    }, {
      "referenceID" : 17,
      "context" : "[18] have designed a combined approach using four core classifiers based on three spectral similarities and n-grams.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 16,
      "context" : "[17] have gathered acoustic and phonotactic features using different classifier.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 18,
      "context" : "[19] have designed an approach based on i-vectors method that combined phonetic and lexical features.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 26,
      "context" : "[27], it was shown that some Arabic dialects (Syria, Jordan, Morocco, Algeria, Tunisia and Egypt) can be grouped using rhythmic information in three dialectal areas: Maghreb (Morocco, Algeria), MiddleEast (Syria, Jordan), and an intermediate one (Tunisia, Egypt).",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 14,
      "context" : "[15] have designed an ADID system for three previous dialectal areas.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 15,
      "context" : "[16], which combined the prosodic and phonotactic approaches.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 27,
      "context" : "[28] designed a two level classification system using acoustic features.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 28,
      "context" : "[29], proposed a HLID framework where speech signal is characterized at acoustic level and some prosodic features.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 29,
      "context" : "[30] suggested a hierarchical system using bayesian logistic regression models as score generators.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 30,
      "context" : "[31] developed a HLID system via GMM, in which speeches are characterized by means of acoustic and prosodic features.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 14,
      "context" : "[15] and Biadsy et al.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 15,
      "context" : "[16] have considered this kind of information.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 14,
      "context" : "[15] have considered area dialects, while Biadsy et al.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 15,
      "context" : "[16] have treated inter-country dialects.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 31,
      "context" : "However, Deep Learning is not investigated despite their provided efficiency for Language/Dialect identification [32] [33].",
      "startOffset" : 113,
      "endOffset" : 117
    }, {
      "referenceID" : 32,
      "context" : "However, Deep Learning is not investigated despite their provided efficiency for Language/Dialect identification [32] [33].",
      "startOffset" : 118,
      "endOffset" : 122
    }, {
      "referenceID" : 33,
      "context" : "In fact, Arabic Algerian dialect is affected by other languages such as Turkish, French, Italian, and Spanish [34].",
      "startOffset" : 110,
      "endOffset" : 114
    }, {
      "referenceID" : 34,
      "context" : "Both dialects are different by many linguistic features [35] [36].",
      "startOffset" : 56,
      "endOffset" : 60
    }, {
      "referenceID" : 35,
      "context" : "Both dialects are different by many linguistic features [35] [36].",
      "startOffset" : 61,
      "endOffset" : 65
    }, {
      "referenceID" : 36,
      "context" : "Marçais [37] has divided Pre-Hilālı̄ dialect into two dialects: village (mountain), and urban dialect.",
      "startOffset" : 8,
      "endOffset" : 12
    }, {
      "referenceID" : 37,
      "context" : "Secondly, Bedouin dialect is spoken in areas which are influenced by the Arab immigration in the 11 century [38], [39].",
      "startOffset" : 108,
      "endOffset" : 112
    }, {
      "referenceID" : 38,
      "context" : "Secondly, Bedouin dialect is spoken in areas which are influenced by the Arab immigration in the 11 century [38], [39].",
      "startOffset" : 114,
      "endOffset" : 118
    }, {
      "referenceID" : 34,
      "context" : "Marçais [35] has divided Bedouin dialect into five distinct basic dialects:",
      "startOffset" : 8,
      "endOffset" : 12
    }, {
      "referenceID" : 34,
      "context" : "Marçais [35] gathered the three dialects (3, 4, 5) under the name of Hilālı̄ dialect, which takes its name from Banū Hilāl tribe.",
      "startOffset" : 8,
      "endOffset" : 12
    }, {
      "referenceID" : 34,
      "context" : "This Hierarchy structure is also confirmed by some linguistic studies essentially phonological, lexical and morphological [35] [40].",
      "startOffset" : 122,
      "endOffset" : 126
    }, {
      "referenceID" : 39,
      "context" : "This Hierarchy structure is also confirmed by some linguistic studies essentially phonological, lexical and morphological [35] [40].",
      "startOffset" : 127,
      "endOffset" : 131
    }, {
      "referenceID" : 40,
      "context" : "[41] evaluated the discriminating power of prosodic pattern in Arabic dialects in a linguistic study.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 41,
      "context" : "[42] shown that the different types of syllabic structure observed in Arabic dialects can be used as discriminative element.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 42,
      "context" : "[43] confirmed this fact by studying the stress measured through the syllable structure.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 43,
      "context" : "[44] studied the nature of intonation of five Arabic dialects.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 44,
      "context" : "[45] confirmed this result using another sample of Eastern and Western Arabic dialects.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 45,
      "context" : "• Rhythm and intonation are discriminant parameters for some Algerian dialects: Benali [46] studied the role of the rhythm and the intonation in a human identification by means of two Algerian dialects, which are spoken in Algiers and Oran.",
      "startOffset" : 87,
      "endOffset" : 91
    }, {
      "referenceID" : 46,
      "context" : "The first and most popular metrics used to classify a language include: Interval Measures (IM) [47], their normalized version (VarcoV/VarcoC) [48], and Pairwise Variability Index (PVI) [49].",
      "startOffset" : 95,
      "endOffset" : 99
    }, {
      "referenceID" : 47,
      "context" : "The first and most popular metrics used to classify a language include: Interval Measures (IM) [47], their normalized version (VarcoV/VarcoC) [48], and Pairwise Variability Index (PVI) [49].",
      "startOffset" : 142,
      "endOffset" : 146
    }, {
      "referenceID" : 48,
      "context" : "The first and most popular metrics used to classify a language include: Interval Measures (IM) [47], their normalized version (VarcoV/VarcoC) [48], and Pairwise Variability Index (PVI) [49].",
      "startOffset" : 185,
      "endOffset" : 189
    }, {
      "referenceID" : 46,
      "context" : "The IM metrics include three separate measures: the duration proportion, the standard deviation of vocalic interval (%V, ∆V), and the standard deviation of consonantal interval ∆C [47].",
      "startOffset" : 180,
      "endOffset" : 184
    }, {
      "referenceID" : 48,
      "context" : "The PVI metrics focus on the temporal succession between the consonantal and vocalic intervals of the global utterance [49].",
      "startOffset" : 119,
      "endOffset" : 123
    }, {
      "referenceID" : 14,
      "context" : "Whereas, previous prosodic-based ADID researches leveraging prosody extracted prosodic features at pseudo-syllable level [15] [16].",
      "startOffset" : 121,
      "endOffset" : 125
    }, {
      "referenceID" : 15,
      "context" : "Whereas, previous prosodic-based ADID researches leveraging prosody extracted prosodic features at pseudo-syllable level [15] [16].",
      "startOffset" : 126,
      "endOffset" : 130
    }, {
      "referenceID" : 49,
      "context" : "Speech Material It is important to mention that there is no standard corpus available for Algerian Arabic dialects such as for some other Arab countries [51].",
      "startOffset" : 153,
      "endOffset" : 157
    }, {
      "referenceID" : 24,
      "context" : "collected our own corpus ALG-DARIDJAH [25].",
      "startOffset" : 38,
      "endOffset" : 42
    }, {
      "referenceID" : 50,
      "context" : "[52], that all Arabic dialects have less than 50% for the vocalic intervals (%V).",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 34,
      "context" : "The findings of the current study are consistent with those of Marçais [35] who found that Pre-Hilālı̄ dialect characterized by the presence of vowel reduction.",
      "startOffset" : 71,
      "endOffset" : 75
    }, {
      "referenceID" : 51,
      "context" : "[53] that Tunisian (Sulaymite) dialect has a simple syllable structure.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 46,
      "context" : "[47] study showed that the combination of %V and ∆C provides the best correlate feature to separate traditional rhythm categorizations of languages (stress-timed, syllabic-timed, mora-timed).",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 52,
      "context" : "[54].",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 52,
      "context" : "The third group includes Ma’qilian and Urban Completely Bedouin dialect that is near to Algerian-MSA language, which is classified to Mixedtimed rhythm class [54].",
      "startOffset" : 158,
      "endOffset" : 162
    }, {
      "referenceID" : 8,
      "context" : "The most used are global or top-down approaches [9].",
      "startOffset" : 48,
      "endOffset" : 51
    }, {
      "referenceID" : 31,
      "context" : "LCPN dialect models are made using the state-of-the-art in language/dialect identification, Deep Learning technique [32] [33], in this case Deep Neural Networks (DNNs).",
      "startOffset" : 116,
      "endOffset" : 120
    }, {
      "referenceID" : 32,
      "context" : "LCPN dialect models are made using the state-of-the-art in language/dialect identification, Deep Learning technique [32] [33], in this case Deep Neural Networks (DNNs).",
      "startOffset" : 121,
      "endOffset" : 125
    }, {
      "referenceID" : 53,
      "context" : "Please also note that this script has reached 80% according to segmentation accuracy [55].",
      "startOffset" : 85,
      "endOffset" : 89
    }, {
      "referenceID" : 54,
      "context" : "This is performed using GridSearch script, which is a meta-classifier [56].",
      "startOffset" : 70,
      "endOffset" : 74
    }, {
      "referenceID" : 55,
      "context" : "In order to choose the appropriate prosodic feature set for each classifier, we have used the feature selection method: ANOVA ranking [57].",
      "startOffset" : 134,
      "endOffset" : 138
    }, {
      "referenceID" : 56,
      "context" : "[58].",
      "startOffset" : 0,
      "endOffset" : 4
    } ],
    "year" : 2017,
    "abstractText" : "In daily communications, Arabs use local dialects which are hard to identify automatically using conventional classification methods. The dialect identification challenging task becomes more complicated when dealing with an under-resourced dialects belonging to a same county/region. In this paper, we start by analyzing statistically Algerian dialects in order to capture their specificities related to prosody information which are extracted at utterance level after a coarse-grained consonant/vowel segmentation. According to these analysis findings, we propose a Hierarchical classification approach for spoken Arabic algerian Dialect IDentification (HADID). It takes advantage from the fact that dialects have an inherent property of naturally structured into hierarchy. Within HADID, a top-down hierarchical classification is applied, in which we use Deep Neural Networks (DNNs) method to build a local classifier for every parent node into the hierarchy dialect structure. Our framework is implemented and evaluated on Algerian Arabic dialects corpus. Whereas, the hierarchy dialect structure is deduced from historic and linguistic knowledges. The results reveal that within HADID, the best classifier is DNNs compared to Support Vector Machine. In addition, compared with a baseline Flat classification system, our HADID gives an improvement of 63.5% in term of precision. Furthermore, overall results evidence the suitability of our prosody-based HADID for speaker independent dialect identification while requiring less than 6s test utterances. Email addresses: sm.bougrine@lagh-univ.dz (Soumia Bougrine), hadda_cherroun@mail.lagh-univ.dz (Hadda Cherroun), djelloul.ziadi@univ-rouen.fr (Djelloul Ziadi ) Preprint submitted to Elsevier March 30, 2017 ar X iv :1 70 3. 10 06 5v 1 [ cs .C L ] 2 9 M ar 2 01 7",
    "creator" : "LaTeX with hyperref package"
  }
}