{
  "name" : "1703.10661.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "BanglaLekha-Isolated: A Comprehensive Bangla Handwritten Character Dataset",
    "authors" : [ "Mithun Biswas", "Rafiqul Islam", "Gautam Kumar Shom", "Md. Shopon", "Nabeel Mohammed", "Sifat Momen", "Md Anowarul Abedin" ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "Bangla is the mother language of Bangladesh and the 7th most widely spoken language in the world. There are more than 200 million native Bangla speakers. It is the official language of Bangladesh and several Indian states including West Bengal, Tripura, Assam and Jharkhand. Bangla is also the official language of Sierra Leone a West African country. With the rapid adoption of technology in different sectors in these regions, recognizing handwritten Bangla characters is an important challenge to overcome. While there has been great successes in the application of machine learning tools for the English language, the same level of effectiveness is not observed for Bangla. One of the many reasons for this is the lack of a single comprehensive dataset which covers the frequently used Bangla characters. There are existing data sets which cover either just the Bangla numerals, or just the Bangla characters, or just the Bangla compound characters. While it is possible to combine them to form a unified data set, the incovenience faced by the researchers stem from the lack of consistency in the data presentation of the different data sets. BanglaLekha-Isolated is the first of a chain of datasets being released which aims to foster Bangla handwriting related research by:\n• Providing a large dataset suitable for machine learning applications which include the most frequently used Bangla characters covering Bangla numerals, basic characters and compound characters.\n• Provide a suitably pre-processed version of the dataset to reduce the time between data set acquisition and reporting results.\n• Provide multiple labels per character/character group to facilitate research in:\n– Automatic recognition certain characteristics of the writer (Age, gender, location etc)\n– Automatic assessment of handwriting quality and methods of giving useful feedback.\nThe BanglaLekha-Isolated dataset contains smaples of 84 different Bangla handwritten numerals, basic characters and compound characters. A comparison with the two other popular sources of Bangla handwriting related datasets (CMATERDB[1] and the ISI Handwriting datasets[2]) are given in Table 1.\nar X\niv :1\n70 3.\n10 66\n1v 1\n[ cs\n.C L\n] 2\n2 Fe\nb 20\n1 CMATERDB dataset has 3 different datasets for basic characters,numerals and compound characters. 2 ISI dataset has two different dataset for basic characters and numerals.\nThe BanglaLekha-Isolated dataset consists total of 166,105 square images (while preserving the aspect ratio of the characters), each containing a sample of one of 84 different Bangla characters. The number of samples in each class are almost equal, which is not the case in some of the other datasets (e.g. CMATERDB Compound character set). The 84 characters classes contain 10 numerals, 50 basic characters and 24 frequently used compound characters. Some samples images of the dataset are shown in Figure 1."
    }, {
      "heading" : "2 Data Collection and Pre-processing",
      "text" : "This dataset was collected from literate native Bangla speakers of different regions and with age range between 4 to 27. A small fraction of the samples were collected from individuals with physical disabilities. Each individual was supplied with a form similar to the one shown in Figure 2. For a wider distribution of handwriting quality, samples were collected specific time constraints (10 Minutes, 5 Minutes, 2 Minutes). Each subject also gave information about her/his age, gender, and district he lives in.\nThe images that are present in the dataset were pre-processed in the following ways:\n• Foreground and background were inverted so that images have a black background with the letter drawn in white.\n• Noise removal was attempted by using the median filter.\n• An edge thickening filter was applied.\n• Images were resized to be square in shape with appropriate padding applied to preserve the aspect ratio of the drawn character."
    }, {
      "heading" : "3 Possible Uses of BanglaLekha-Isolated Dataset",
      "text" : "Our dataset can be used for handwritten character recognition, which is obvious, but there are some more features that can be used for research purpose using our dataset. As it is already mentioned in Section 1 that\nit is possible to work on automatic recognition on certain characteristics of the writer such as age,gender, location etc. These informations can be used even for forensic purposes."
    }, {
      "heading" : "4 Naming Convention",
      "text" : "Each and every sample of BangLekha-Isolated dataset has an unique form ID by which the age, gender, district, and Institute of the participants can be identified. So, a 22 characters long form Id was proposed, where first 2 digit is for the district, then the next four digits is for Institution, the next one digit is for gender and the next two is for age, again the next four is for date and the last four is used for form serial number and every information (digit part) is separated by an underscore. For example-\n01 0001 0 09 1016 0001\nis a unique form id and here 01 means the participant is form Comilla, 0001 means participant is from Ispahani School and College, then 0 means the participant is a male and 1016 means the participant filled up the form in October of 2016 and 0001 is the form serial number. So whenever one used any character form this dataset (around 1,68,000 data), he/she can get the information (age, gender, district, etc.) of the participants."
    }, {
      "heading" : "5 Marking",
      "text" : "All the 2000 forms that were collected were marked by 3 native Bangla speakers using the criteria set by a handwriting specialist. The judgment on the mark is based on:\n• Shape of the characters\n• Clarity of the image\n• Appropriate use of matra (A horizontal straight line put over the consonants and some vowels of the Bengali alphabet)\n• Subjective evaluation based on beauty of letters\nThe marks are also provided with the dataset in a separate spreadsheet."
    }, {
      "heading" : "6 Conclusion",
      "text" : "BanglaLekha-Isolated dataset aims for creating new scopes for researchers who are interested in working on Bangla handwritten characters. The dataset is available in [3] . This report documents the initial release of the data set. As more refinements are done and/or new data sets are collected, this report will be updated as appropriate."
    } ],
    "references" : [ {
      "title" : "Handwritten numeral databases of indian scripts and multistage recognition of mixed numerals,",
      "author" : [ "U. Bhattacharya", "B.B. Chaudhuri" ],
      "venue" : "IEEE transactions on pattern analysis and machine intelligence,",
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 2009
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "A comparison with the two other popular sources of Bangla handwriting related datasets (CMATERDB[1] and the ISI Handwriting datasets[2]) are given in Table 1.",
      "startOffset" : 132,
      "endOffset" : 135
    }, {
      "referenceID" : 0,
      "context" : "Type CMATERDB[1] ISI Dataset [2] BanglaLekhaIsolated Basic Character 15,103 30,966 98,950 Numerals 6,000 23,299 19,748 Compound Characters 42,248 None 47,407",
      "startOffset" : 29,
      "endOffset" : 32
    } ],
    "year" : 2017,
    "abstractText" : "Bangla handwriting recognition is becoming a very important issue nowadays. It is potentially a very important task specially for Bangla speaking population of Bangladesh and West Bengal. By keeping that in our mind we are introducing a comprehensive Bangla handwritten character dataset named BanglaLekha-Isolated. This dataset contains Bangla handwritten numerals, basic characters and compound characters. This dataset was collected from multiple geographical location within Bangladesh and includes sample collected from a variety of aged groups. This dataset can also be used for other classification problems i.e: gender, age, district. This is the largest dataset on Bangla handwritten characters yet.",
    "creator" : "LaTeX with hyperref package"
  }
}