{
  "name" : "1703.01485.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Lexical Resources for Hindi Marathi MT",
    "authors" : [ "Pushpak Bhattacharyya" ],
    "emails" : [ "pb}@cse.iitb.ac.in" ],
    "sections" : [ {
      "heading" : "1. Introduction",
      "text" : "Machine Translation (MT) is the process of translating text or speech from one natural language to another with the help of machines. There are many ongoing attempts to develop MT systems for various Indian languages using rule-based as well as statistical-based approaches. Since India is rich in linguistic divergence there are many morphologically rich languages quite different from English as well as from each other, there is a great need for machine translation between them (Nair et.al, 2012). It has 22 scheduled languages, which are written in 10 different scripts. This paper discusses various approaches used in Indian language to Indian language MT systems especially in Marathi to Hindi Statistical MT system and vice versa to improve the quality of machine translation.\nFor example, consider the translated Hindi output from Marathi-Hindi SMT system for the Marathi sentence,\nMarathi - . {hya karnaastav to naraz hota}\nHindi- । {yah phalswaroop vah naraz ho}\nHere the Marathi word “ ”{karnaastav}is wrongly mapped to Hindi word “ ”{phalswaroop} and the verb {hota} is wrongly mapped to {ho gaya}.\nIn order to learn various inflected and verb forms, lexical resources can play a major role. The detailed analysis about various linguistic phenomena and how the lexical resources can be used for improving the translation quality is explained in the following sections.\nIn the case of Marathi, a single noun can have more than\n200 forms that are either adjectives or adverbs. Similarly, a verb may exhibit over 450 forms. Also the language is covering about 10,000 nouns and over 1,900 verbs. Moreover 175 postpositions can be attached to nominal and verbal entities. Some postpositions can occur in compound forms with most of the other postpositions. In addition, there are many kinds of derivable words such as causative verbs like ‘karavane’, i.e. ‘to make (someone) to do (something)’, which is derivable from root ‘karane’ i.e. ‘to do’, and abstract nouns like ‘gharpan’ i.e. ‘homeliness’, which is derivable from ‘ghar’ i.e. ‘home’[Veena et.al., 2005].\nMajor difficulties in Machine Translation are handling the structural difference between the two languages and handling the ambiguities."
    }, {
      "heading" : "1.1 Challenge of Ambiguity",
      "text" : "There are two types of ambiguity: structural ambiguity and lexical ambiguity."
    }, {
      "heading" : "1.1.1. Lexical Ambiguity",
      "text" : "Words and phrases in one language often have multiple meaning in another language. For example, in the sentence,\nMarathi{aale hote mehnaan kaam jchale} Hindi- अद । {aadark tha isliye kaam hua} English- Ginger was there so the work has done or Hindi- ।\n{maenne photo nikala}\nEnglish- came thatsy work was done\nHere in the above sentence “ ”{aale}, has ambiguity\nin meaning. It is not clear that whether the word “ ”{aale}, is used in Hindi as the “ginger” (“अद ”{ aadark } sense or the “ ”{aayen}, sense. This kind of ambiguities will be clear from the context."
    }, {
      "heading" : "1.1.2. Structural Ambiguity",
      "text" : "In this case due to the structural order there will be multiple meanings. For example,\nMarathi - . {tithe latth muli aani mulen hoti}\n{There were fat girls and boys there}\nHere from the words “ ” {lattha muli aani mulen } it is clear that fat girls but it is not clear that boys are fat, since in Marathi to represent tall girls and boys only one word “ ” {lattha} {tall} is being used. It can have two interpretations in Hindi and English according to its structure.\nHindi - औ । {vahan moti ladkiyam our ladkem the }\n{There were fat girls and boys there}\nor\nHindi - औ । {vahan moti ladkiyam our mote ladkem the}\n{There were fat girls and fat boys there}\nTo generate appropriate Machine Translations by handling this kind of structural ambiguity is one of the big problems in Machine Translation. 1.2 Structural Differences In the case of Marathi – Hindi machine translation both languages follow the same structural ordering in sentences, such as Subject- Object-Verb (SOV). Even though there is ordering similarity, there are morphological and stylistic differences which have to be considered during translation. Marathi is morphologically more complex than Hindi, wherein there are a lot of post-modifiers in the former as compared to the later (Dabre et al, 2012, Bhosale, 2011).\nFor example, the word form “ ”{hustinapoorchya} {of / about the hustinapuri} is derived by attaching “ ”{chyaa} as a suffix to the noun “ ” {hustinapur}{a place in India} by undergoing an inflectional process. Marathi exhibits agglutination of suffixes which is not present in Hindi and therefore these suffixes has equivalents in the form of post positions. For the above example, the Hindi equivalent of the suffix “ ” {chyaa} is the post position “ ”{ke} which is separated from the noun “ ”{ hustinapur}. Hence the translation of “ ”{ hustinapoorchya } will be “ ” { hustinapur ke}.\nConsider an example for word ordering ,\nHindi- - द । {gad-mukteshwar hinduom ka paavan teerth hai }\n(S) (O) (V)\nMarathi- द . {gadmukteshwar hindoonche pavitr teerth aahe}\n(S) (O) (V)\nEnglish-Gadmuktheshwar is the holy place for Hindu.\n(S) (V) (O)\nSince the word order is same for both the languages it is an advantage for statistical machine translation system during alignment. And it will improve the quality of translation. 1.2.1 Participial Constructions Constructions in Hindi having Participials in Marathi Example: Hindi:\njo ladkaa gaa rahaa thaa wah chalaa gayaa\nrel. boy sing stay+perf.+cont. be+past walk go+perf.\nThe boy who was singing, has left.\nMarathi (Direct Translations):\njo mulgaa gaat hotaa to nighoon gelaa rel. boy sing+imperf. be+past leave+CP go+perf. The boy who was singing, has left.\nParticipial Constructions in Marathi(Actual Translations):\ngaaNaaraa mulgaa nighoon gelaa sing+part. boy leave+CP go+perf.\nThe boy who was singing left\nNote:-\nDeletion/dropping of subordinate clause is common in\nMarathi as compared to Hindi."
    }, {
      "heading" : "1.3 Vocabulary Differences",
      "text" : "Languages differ in the way they lexically divide the conceptual space and sometimes no direct equivalents can be found for a particular word or phrase of one language in another. Consider the sentence,\n. {kaal mangalgowreechi pooja hoti}\n{Yesterday the pooja which happens in the month of sravan for married women got completed}\nHere “ ”{mangalagowrichi}{the pooja which happens in the month of sraven for married women} as a verb has no equivalent in Hindi, and this sentence has to be translated as, “ | {“Kal sahagan ki sravan maas mem sampannu honewali pooja thi.”} { Yesterday the pooja which happens in the month of sravan for married women got completed }\nTo determine translations of such language specific concepts pose additional challenges in machine translation. .\n2. Difficulties in SMT approach\nAs described in section 1 there are many structural differences between languages. The statistical approach tries to generate translations based on the knowledge and statistical models extracted from parallel aligned bilingual text corpora. Statistical models take the assumption that every word in the target language is a translation of the source language words with some probability (Brown et al., 1993). The words which have the highest probability will give the best translation. Consistent patterns of divergence between the languages (Dorr et al., 1994, Dave et al., 2002, Ramananthan et al. , 2011) when translating from one language to another, handling reordering divergence are one of the fundamental problems in MT (Kunchukuttan and Bhattacharyya 2012, Och and Ney, 2001, Koehn, 2007).\nIn the case of Marathi, Hindi even though both the language follows same word order there are structural difference between the language and in the generation of word forms due to the morphological complexity as described in section 1. In order to overcome this difficulty and make the machine to learn different morphological word forms lexical resources can play a major role. Different word forms such as verb phrases, morphological forms etc can be used. Also the SMT system lacks in vocabulary due to the small amount of parallel corpus. Comparative performance studies conducted by Och and Ney have shown the significance of adding dictionary words into corpus and the improvement in the translation quality in their paper (Och, Ney 2003). In order to increase the coverage of vocabulary we have used IndoWordnet. IndoWordnet(Bhattacharyya, 2010) is a lexical database for various Indian languages, in which Hindi wordnet is the root and all other Indian language wordnets are linked through the expansion approach. Words and its concepts are stored in a structure called the Lexical Matrix, where rows represent word meanings and columns represents the forms. The extraction of bilingual mapped words and its usage in machine translation is described in the experimental section 3. The comparative performance analysis with phrase based model and the phrase based model after augmenting various lexical resources is described in section 4. ."
    }, {
      "heading" : "3. Experimental Discussion",
      "text" : "We now describe the development of our Marathi- Hindi and Hindi- Marathi SMT system 1 (Sreelekha, Dabre and Bhattacharyya 2013), the experiments performed and the comparisons of results, in the form of an error analysis. For the purpose of constructing with statistical models we use Moses and Giza++ 2 . We have conducted various experiments to improve the quality of machine translation by utilizing various lexical resources.\nOur experiments are listed below:\n1 http://www.cfilt.iitb.ac.in/SMTSystem 2 http://www.statmt.org/\n1. SMT system with an uncleaned corpus 2. SMT system with a cleaned corpus 3. Corpus with IndoWordnet extracted words 4. Corpus with Function words and Kridantha pairs 5. Corpus with verb phrases\n3.1.1 SMT system with an uncleaned corpus We have used 50000 corpus of Tourism and Health provided by ILCI consortium. There were many misalignments, wrong and missing translations in the corpus. It affected the translation and the quality was not good. For example, sentence from the corpus where the translation is wrong, Hindi : द - अ , , द । {manipur ke doorsth uththa-poorv raajy mem polo khel ka astivthv kaayam rahne keliye, samsar aadhunik polo ke janmu ka shruni hae, kyonki aaj yah poori duniya mem khela ja raha hae |} English : {To retain the existence of the game of Polo in the far north eastern state of Manipur, the world is indebted to the birth of modern polo as today it is being played all over the world.}\nEquivalent Marathi Translation (wrong) भ भ द . {polo aaj jagbhar khelela jato tyache shrey to yieshany bharatateel manipoorchya durgm dongarangamadye jivant raahila yakade jaate} English: Today Polo is being played all over the world and it's credit goes to retaining the existence of the game of Polo in the remote hills of Manipur of north eastern India.\nThe comparative performance results of cleaned corpus over uncleaned corpus were shown in the Table 4, 5, 6 and 7. From the error analysis we came to a conclusion that in order to improve the translation quality we need to provide a well cleaned parallel corpus for training. 3.1.2 SMT system with cleaned corpus We have corrected the misalignments between parallel sentences which improves the learning of word to word alignments. Sometimes we had to correct source sentences even. For example, for the above sentence Hindi : द - अ , , द । {manipur ke doorsth uththa-poorv raajy maem polo khel ka astivthv kaayam rahne keliye, samsar aadhunik polo ke janmu ka shruni hae, kyomki aaj yah poori duniya mem khela ja raha hae }\nCorrect Marathi Translation\nद अ , , भ . {manipoorchyaa durasth eeshanya rajaymadye polo khelache asthvithv tikoon thevnyasati, samsar aadhunik polochya jenmache shruni aahe, kaaran ki aaj ha sampoorn jagphar khetla jaat aahe.} English : {To retain the existence of the game of Polo in the far north eastern state of Manipur, the world is indebted to the birth of modern polo as today it is being played all over the world.}\nWe have removed the stylistic constructions from the\nparallel corpus which prevent the learning of grammatical structures. Removed the unwanted characters and wrong translations and corrected the missing translations and phrases. The resultant machine translation system’s quality improved more than 40 %. The statistics of corpus used are shown in Table 1 and the results are shown in the Tables 4, 5, 6 and 7. During error analysis we came to know that the machine lacks in sufficient amount of vocabulary and hence we investigated on the usage of IndoWordnet to improve the quality of machine translation. 3.1.3 Corpus with IndoWordnet extracted words\nWe have extracted a total of 437832 parallel Marathi-\nHindi words using bilingual mapping according to its\nsemantic and lexical relations as described in section 2. We have used an algorithm to extract the bilingual words from IndoWordnet. Bilingual mappings are generated using the concept-based approach across words and synsets (Mohanty et.al., 2008). For a single word considered it’s all synset word mappings and generated that many entries of parallel words. For example, the word अ {antaheen} has the following equivalent synset words in IndoWordnet.\nअ : अ अ अ अ अ अ {antaheen: anantu asamapya antaheen anant antaheen anavasaan} {endless: endless not-ending endless infinite endless not-ending }\nWe augmented the extracted parallel words into the training corpus. It helped in improving the translation quality to a great extent. The statistics of Wordnet synsets used are shown in Table 2 and the results are shown in the Tables 4, 5, 6 and 7. During the error analysis we observed that even though the machine translation system is able to give considerably good quality translation, it lacks in handling case markers and inflected forms. One of the advantages is that it helped the machine to handle word\nsense disambiguation well, since the synsets covers all\ncommon forms of a word. 3.1.4 Corpus with Function words and Kridantha pairs\nMarathi and Hindi have 7 types of kridanta forms, its’\npost position, pre-position and inflected forms. We have augmented kridanta, akhyat, function words, suffix pairs etc into the training corpus. This helped in machine translation system to infer the grammatical structures and hence the quality of translation improved.\nSample Marathi-Hindi kridanta form pair is,\n_ : _ _ {aayla pahije : na chahiye}\n{need : need}\nThe statistics of function words used are shown in Table 2 and the results are shown in the Tables 4, 5, 6 and 7. From the error analysis we came to a conclusion that translation system is facing difficulties in handling verbal translations because of the morphological phenomena. 3.1.5 Corpus with verb phrases\nIn order to overcome the verbal translation difficulty we\nhave extracted Marathi- Hindi parallel verbal forms and its translations which contains various phenomena. We have augmented the 4471 entries of verbal translations into the training corpus. Sample Marathi-Hindi verb form pair is,\n: अ {zaroor karva lem : avasyu karvoon ghya} {should get it done : should get it done}\nThe statistics of function words used are shown in Table 2 and the results are shown in the Tables 4, 5, 6 and 7. The error analysis study has shown that the quality of the translation has been improved drastically."
    }, {
      "heading" : "4. Evaluation",
      "text" : "We have tested the translation system with a corpus of 100 sentences taken from the ‘EILMT tourism health’ corpus as shown in Table 3. We have used various evaluation methods such as subjective evaluation, BLEU score (Papineni et al., 2002), METEOR and TER (Agarwal and Lavie 2008). But we gave importance to subjective evaluation to determine the fluency (F) and adequacy (A) of the translation, since for morphologically rich languages subjective evaluations can give more accurate results comparing to other measures. Fluency is an indicator of correct grammatical constructions present in the translated sentence whereas adequacy is an indicator of the amount of meaning being carried over from the source to the target. Marathi Hindi Bilingual experts have assigned scores between 1 and 5 for each generated translation, on the basis of how much meaning conveyed by the generated translation and its grammatical correctness. The basis of scoring is given below:\n 5: The translations are perfect.  4: One or two incorrect translations and\nmistakes.\n 3: Translations are of average quality,\nbarely making sense.\n 2: The sentence is barely translated.  1: The sentence is not translated or the\ntranslation is gibberish.\nS1, S2, S3, S4 and S5 are the counts of the number of\nsentences with scores from 1 to 5 and N is the total number of sentences evaluated. The formula (Bhosale et al., 2011) used for computing the scores is:\n  N SSS FA 3*6.04*8.05 *100/  \nWe consider only the sentences with scores above 3. We penalize the sentences with scores 4 and 3 by multiplying their count by 0.8 and 0.6 respectively so that the estimate of scores is much better. The estimate may vary from person to person as these scores are subjective, in which case an inter annotator agreement is required. We do not give these scores, since we had only one evaluator. The results of our evaluations are given in Table 4, 5, 6 and 7."
    }, {
      "heading" : "5. Error Analysis",
      "text" : "We have evaluated the translated outputs of both Marathi to Hindi and Hindi to Marathi Statistical Machine Translation systems in all 5 categories as explained in Section 3. The detailed error analysis is shown in Table 8 and 9 for a sentence exhibiting a variety of linguistic phenomena and how the quality of Machine Translation system changes by augmenting various lexical resources. The results of BLEU score, METEOR and TER evaluations are displayed in Tables 6 and 7 and the results of subjective evaluations are displayed in Table 4 and 5. We have observed that the quality of the translation is improving as the corpus is getting cleaned as well as more lexical resources are used. Hence there is an incremental growth in adequacy, fluency, BLEU score, METEOR score and in TER score. The fluency of the translation increased up to 83% in the case of Marathi to Hindi and up to 85% in the case of Hindi to Marathi.\nAlso we have observed that the score of Hindi to Marathi translation quality is slightly higher than that of Marathi to Hindi translation. Since Marathi is morphologically richer than Hindi and Marathi have more agglutinative suffixes attached, while in Hindi it is not present, as explained in above section 1.2. Therefore these Marathi suffixes have Hindi equivalents in the form of post positions. So during alignment from Hindi to Marathi, Hindi word can align to the words with agglutination in Marathi, since it is a single word. But on the other hand while aligning form Marathi-Hindi the agglutinative word can map to only root words, there is a chance to miss out the post position mapping, since it is separate words. So it will improve the translation quality of Hindi- Marathi SMT as compared to Marathi-Hindi SMT.\nFor example, during Hindi-Marathi Translation, in Hindi-Marathi alignment the noun “ ”\n{hustinapur} can easily align to “ ” {hustinapoorchya}, since it is a single word. But in Marathi-Hindi alignment, “ ” {hustinapoorchya} may be map to “ ” {hustinapur} and there is a possibility to drop down the post position “ ”{ke} which is a separate word from the noun “ ”{hustinapur}. These features will have\nimpact on the translation quality and hence the inflected forms may not translate properly from Marathi to Hindi. On the other hand, Hindi to Marathi translation system will not face this difficulty because of alignments. Thus there is an improvement in quality of Hindi-Marathi MT comparing to Marathi-Hindi MT."
    }, {
      "heading" : "6. Conclusion",
      "text" : "In this paper we have mainly focused on the usage of\nvarious lexical resources for improving the quality of\nMachine Translation. We have discussed the comparative\nperformance of Statistical Machine Translation with various lexical resources for both Marathi – Hindi and Hindi-Marathi. As discussed in the experimental section, SMT, although lacks the ability to handle rich morphology it can overcome by using various lexical resources, which will help the machine to improve the translation quality. In our experiments we have used various measures to evaluate such as BLEU Score, METEOR, TER and Fluency and Adequacy using subjective evaluation. We can see that there is an incremental growth in both Marathi- Hindi and Hindi Marathi systems in terms of BLEU-Score, METEOR, and TER evaluations. Also our subjective evaluation results shows promising scores in terms of fluency and adequacy. This leads to the importance of utilizing various lexical resources for an efficient Machine Translation system. Thus we can come to a conclusion that various lexical resources can play an important role in providing good machine translation system for morphologically rich languages.\nOur future work will be focused on investigating more lexical resources for improving the quality of Statistical Machine Translation systems and there by develop an accurate MT system for both Marathi- Hindi and Hindi-Marathi Machine Translation."
    }, {
      "heading" : "7. Acknowledgements",
      "text" : "We thank Almighty and truth for this work."
    }, {
      "heading" : "8. References",
      "text" : "Abhay Agarwal, Alon Lavie, 2008, Meteor, M-Bleu,\nM-ter Evaluation matrics for high correlation with Human Ranking of Machine Translation output, Proceedings of the Third Workshop on Statistical Machine Translation,, pages 115–118, Columbus, Ohio, USA, June 2008. 2008 Association for Computational Linguistics.\nAnanthakrishnan Ramananthan, Pushpak Bhattacharyya,\nKarthik Visweswariah, Kushal Ladha, and Ankur Gandhe. 2011. Clause-Based Reordering Constraints to Improve Statistical Machine Translation.IJCNLP, 2011. Anoop Kunchukuttan and Pushpak Bhattacharyya. 2012.\nPartially modelling word reordering as a sequence labeling problem, COLING 2012. Antony P. J. 2013. Machine Translation Approaches and\nSurvey for Indian Languages, The Association for Computational Linguistics and Chinese Language Processing, Vol. 18, No. 1, March 2013, pp. 47-78\nArafat Ahsan, Prasanth Kolachina, Sudheer Kolachina,\nDipti Misra Sharma and Rajeev Sangal. 2010. Coupling Statistical Machine Translation with Rule-based Transfer and Generation. amta2010.amtaweb.org\nBonnie J. Dorr. 1994. Machine Translation Divergences:\nA Formal Description and Proposed Solution. Computational Linguistics, 1994.\nFranz Josef Och and Hermann Ney. 2003. A Systematic\nComparison of Various Statistical Alignment Models. Computational Linguistics, 2003. Franz Josef Och and Hermann Ney. 2001. Statistical Multi\nSource Translation. MT Summit 2001.\nGanesh Bhosale, Subodh Kembhavi, Archana Amberkar,\nSupriya Mhatre, Lata Popale and Pushpak Bhattacharyya. 2011. Processing of Participle (Krudanta) in Marathi. ICON 2011, Chennai, December, 2011. Kevin Knight. 1999. Decoding complexity in\nword-replacement translation models, Computational Linguistics, 1999. Kishore Papineni, Salim Roukos, Todd Ward and\nWei-Jing Zhu. 2002. BLEU: a Method for Automatic Evaluation of Machine Translation, Proceedings of the 40th Annual Meeting of the Association for Computational Linguistics (ACL), Philadelphia, July 2002, pp. 311-318. Latha R. Nair and David Peter S. 2012. Machine\nTranslation Systems for Indian Languages, International Journal of Computer Applications (0975 – 8887), Volume 39– No.1, February 2012. Peter E Brown, Stephen A. Della Pietra. Vincent J. Della\nPietra, and Robert L. Mercer*. 1993. The Mathematics of Statistical Machine Translation: Parameter Estimationn. Association for Computational Linguistics. Philipp Koehn, Hieu Hoang, Alexandra Birch, Chris\nCallison-Burch, Marcello Federico, Nicola Bertoldi, Brooke Cowan, Wade Shen, Christine Moran, Richard Zens, Chris Dyer, Ondrej Bojar, Alexandra Constantin, Evan Herbst. 2007. Moses: Open Source Toolkit for Statistical Machine Translation, Annual Meeting of the Association for Computational Linguistics (ACL), demonstration session, Prague, Czech Republic, June 2007. Pushpak Bhattacharyya, 2010. IndoWordnet, LREC 2010. Rajat Kumar Mohanty, Pushpak Bhattacharyya, Shraddha\nKalele, Prabhakar Pandey, Aditya Sharma, Mitesh Kopra Synset Based Multilingual Dictionary: Insights, Applications and Challenges, Global Wordnet Conference 2008 Sreelekha, Raj Dabre, Pushpak Bhattacharyya 2013.\nComparison of SMT and RBMT, The Requirement of Hybridization for Marathi – Hindi MT ICON, 10 th International conference on NLP, December 2013. Veena Dixit, Satish Dethe And Rushikesh K. Joshi,\nDesign and Implementation of a Morphology-based Spellchecker for Marathi, an Indian Language, Archives of Control Sciences, Volume 15(LI), 2005, No. 3, pages 251–258"
    } ],
    "references" : [ {
      "title" : "Meteor, M-Bleu, M-ter Evaluation matrics for high correlation with Human Ranking of Machine Translation output",
      "author" : [ "Abhay Agarwal", "Alon Lavie" ],
      "venue" : "Proceedings of the Third Workshop on Statistical Machine Translation,,",
      "citeRegEx" : "Agarwal and Lavie,? \\Q2008\\E",
      "shortCiteRegEx" : "Agarwal and Lavie",
      "year" : 2008
    }, {
      "title" : "Clause-Based Reordering Constraints to Improve Statistical Machine Translation.IJCNLP",
      "author" : [ "Ananthakrishnan Ramananthan", "Pushpak Bhattacharyya", "Karthik Visweswariah", "Kushal Ladha", "Ankur Gandhe" ],
      "venue" : null,
      "citeRegEx" : "Ramananthan et al\\.,? \\Q2011\\E",
      "shortCiteRegEx" : "Ramananthan et al\\.",
      "year" : 2011
    }, {
      "title" : "Partially modelling word reordering as a sequence labeling",
      "author" : [ "Anoop Kunchukuttan", "Pushpak Bhattacharyya" ],
      "venue" : null,
      "citeRegEx" : "Kunchukuttan and Bhattacharyya.,? \\Q2012\\E",
      "shortCiteRegEx" : "Kunchukuttan and Bhattacharyya.",
      "year" : 2012
    }, {
      "title" : "Machine Translation Approaches and Survey for Indian Languages, The Association for Computational Linguistics and Chinese Language Processing, Vol",
      "author" : [ "J. Antony P." ],
      "venue" : "18, No. 1, March 2013, pp. 47-78",
      "citeRegEx" : "P.,? 2013",
      "shortCiteRegEx" : "P.",
      "year" : 2013
    }, {
      "title" : "Coupling Statistical Machine Translation with Rule-based Transfer and Generation",
      "author" : [ "Arafat Ahsan", "Prasanth Kolachina", "Sudheer Kolachina", "Dipti Misra Sharma", "Rajeev Sangal." ],
      "venue" : "amta2010.amtaweb.org",
      "citeRegEx" : "Ahsan et al\\.,? 2010",
      "shortCiteRegEx" : "Ahsan et al\\.",
      "year" : 2010
    }, {
      "title" : "Machine Translation Divergences: A Formal Description and Proposed Solution",
      "author" : [ "Bonnie J. Dorr." ],
      "venue" : "Computational Linguistics, 1994.",
      "citeRegEx" : "Dorr.,? 1994",
      "shortCiteRegEx" : "Dorr.",
      "year" : 1994
    }, {
      "title" : "A Systematic Comparison of Various Statistical Alignment Models",
      "author" : [ "Franz Josef Och", "Hermann Ney." ],
      "venue" : "Computational Linguistics, 2003.",
      "citeRegEx" : "Och and Ney.,? 2003",
      "shortCiteRegEx" : "Och and Ney.",
      "year" : 2003
    }, {
      "title" : "Statistical Multi Source Translation",
      "author" : [ "Franz Josef Och", "Hermann Ney." ],
      "venue" : "MT Summit 2001.",
      "citeRegEx" : "Och and Ney.,? 2001",
      "shortCiteRegEx" : "Och and Ney.",
      "year" : 2001
    }, {
      "title" : "Processing of Participle (Krudanta) in Marathi",
      "author" : [ "Ganesh Bhosale", "Subodh Kembhavi", "Archana Amberkar", "Supriya Mhatre", "Lata Popale", "Pushpak Bhattacharyya." ],
      "venue" : "ICON 2011, Chennai, December, 2011.",
      "citeRegEx" : "Bhosale et al\\.,? 2011",
      "shortCiteRegEx" : "Bhosale et al\\.",
      "year" : 2011
    }, {
      "title" : "Decoding complexity in word-replacement translation models",
      "author" : [ "Kevin Knight" ],
      "venue" : "Computational Linguistics,",
      "citeRegEx" : "Knight.,? \\Q1999\\E",
      "shortCiteRegEx" : "Knight.",
      "year" : 1999
    }, {
      "title" : "BLEU: a Method for Automatic Evaluation of Machine Translation",
      "author" : [ "Kishore Papineni", "Salim Roukos", "Todd Ward", "Wei-Jing Zhu" ],
      "venue" : "Proceedings of the 40th Annual Meeting of the Association",
      "citeRegEx" : "Papineni et al\\.,? \\Q2002\\E",
      "shortCiteRegEx" : "Papineni et al\\.",
      "year" : 2002
    }, {
      "title" : "Machine Translation Systems for Indian Languages, International Journal of Computer Applications",
      "author" : [ "Latha R. Nair", "David Peter S" ],
      "venue" : "Volume 39–",
      "citeRegEx" : "Nair and S.,? \\Q2012\\E",
      "shortCiteRegEx" : "Nair and S.",
      "year" : 2012
    }, {
      "title" : "The Mathematics of Statistical Machine Translation: Parameter Estimationn",
      "author" : [ "Peter E Brown", "Robert L. Mercer" ],
      "venue" : null,
      "citeRegEx" : "Brown et al\\.,? \\Q1993\\E",
      "shortCiteRegEx" : "Brown et al\\.",
      "year" : 1993
    }, {
      "title" : "Moses: Open Source Toolkit",
      "author" : [ "Philipp Koehn", "Hieu Hoang", "Alexandra Birch", "Chris Callison-Burch", "Marcello Federico", "Nicola Bertoldi", "Brooke Cowan", "Wade Shen", "Christine Moran", "Richard Zens", "Chris Dyer", "Ondrej Bojar", "Alexandra Constantin", "Evan Herbst" ],
      "venue" : null,
      "citeRegEx" : "Koehn et al\\.,? \\Q2007\\E",
      "shortCiteRegEx" : "Koehn et al\\.",
      "year" : 2007
    }, {
      "title" : "Synset Based Multilingual Dictionary: Insights, Applications and Challenges",
      "author" : [ "Rajat Kumar Mohanty", "Pushpak Bhattacharyya", "Shraddha Kalele", "Prabhakar Pandey", "Aditya Sharma", "Mitesh Kopra" ],
      "venue" : "Global Wordnet Conference",
      "citeRegEx" : "Mohanty et al\\.,? \\Q2008\\E",
      "shortCiteRegEx" : "Mohanty et al\\.",
      "year" : 2008
    }, {
      "title" : "Comparison of SMT and RBMT, The Requirement of Hybridization for Marathi ",
      "author" : [ "Sreelekha", "Raj Dabre", "Pushpak Bhattacharyya" ],
      "venue" : "Hindi MT ICON,",
      "citeRegEx" : "Sreelekha et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Sreelekha et al\\.",
      "year" : 2013
    }, {
      "title" : "Design and Implementation of a Morphology-based Spellchecker for Marathi, an Indian Language, Archives of Control Sciences",
      "author" : [ "Veena Dixit", "Satish Dethe", "Rushikesh K. Joshi" ],
      "venue" : "Volume 15(LI),",
      "citeRegEx" : "Dixit et al\\.,? \\Q2005\\E",
      "shortCiteRegEx" : "Dixit et al\\.",
      "year" : 2005
    } ],
    "referenceMentions" : [ {
      "referenceID" : 12,
      "context" : "Statistical models take the assumption that every word in the target language is a translation of the source language words with some probability (Brown et al., 1993).",
      "startOffset" : 146,
      "endOffset" : 166
    }, {
      "referenceID" : 10,
      "context" : "We have used various evaluation methods such as subjective evaluation, BLEU score (Papineni et al., 2002), METEOR and TER (Agarwal and Lavie 2008).",
      "startOffset" : 82,
      "endOffset" : 105
    }, {
      "referenceID" : 0,
      "context" : ", 2002), METEOR and TER (Agarwal and Lavie 2008).",
      "startOffset" : 24,
      "endOffset" : 48
    }, {
      "referenceID" : 8,
      "context" : "The formula (Bhosale et al., 2011) used for computing the scores is:",
      "startOffset" : 12,
      "endOffset" : 34
    } ],
    "year" : 2017,
    "abstractText" : "In this paper we describe some ways to utilize various lexical resources to improve the quality of statistical machine translation system. We have augmented the training corpus with various lexical resources such as IndoWordnet semantic relation set, function words, kridanta pairs and verb phrases etc. Our research on the usage of lexical resources mainly focused on two ways such as augmenting parallel corpus with more vocabulary and augmenting with various word forms. We have described case studies, evaluations and detailed error analysis for both Marathi to Hindi and Hindi to Marathi machine translation systems. From the evaluations we observed that, there is an incremental growth in the quality of machine translation as the usage of various lexical resources increases. Moreover usage of various lexical resources helps to improve the coverage and quality of machine translation where limited parallel corpus is available.",
    "creator" : "Microsoft® Office Word 2007"
  }
}