{
  "name" : "1705.03487.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Sukiyaki in French style: A novel system for transformation of dietary patterns",
    "authors" : [ "Masahiro Kazama", "Minami Sugimoto", "Chizuru Hosokawa", "Keisuke Matsushima", "Lav R. Varshney", "Yoshiki Ishikawa" ],
    "emails" : [ "ishikun@gmail.com" ],
    "sections" : [ {
      "heading" : null,
      "text" : "Keywords: food, big data, dietary style, newton diagram, neural network, word2vec"
    }, {
      "heading" : "1 Introduction",
      "text" : "Modern dietary styles have been more inclined toward unhealthy eating patterns [1]. As such, there is an emerging consensus that public health efforts should be directed to developing an innovative technology to change dietary style to become more healthy. While there is compelling research in nutrition sciences on what makes a recipe healthy [2], this does not necessarily mean that such a recipe is matched to one’s unique food preferences. For example, the Japanese dietary style as measured in the 1970s is reported to have been healthy [3]. However, recipes in such a Japanese style may not be readily acceptable for those that prefer Southern American dietary style.\nFurthermore, not limited to such a public health perspective, with growing diversity in personal food preference and dietary style, personalized information systems that can transform a recipe into any selected dietary style that a user might prefer would help food companies and professional chefs create new recipes.\nTo achieve this goal, there are two significant challenges: 1) identifying the degree of dietary style mixture of any selected recipe; and 2) developing an algorithm that shifts a recipe into any selected dietary style.\nAs to the former challenge, with growing globalization and economic development, it is becoming difficult to identify a recipe’s dietary style with specific traditional styles since dietary patterns have been changing and converging in many countries throughout Asia, Europe, and elsewhere [4]. Regarding the latter challenge, to the best of our knowledge, little attention has been paid to developing algorithms which transform a recipe’s dietary style into any selected dietary pattern, cf. [5, 6].\nThe aim of this study is to propose a novel data-driven system for transformation of dietary style. This system has three characteristics. First, we propose a new method for identifying a recipe’s dietary style\n∗ishikun@gmail.com\nar X\niv :1\n70 5.\n03 48\n7v 1\n[ cs\n.C Y\n] 6\nmixture by calculating the contribution of each ingredient to certain dietary patterns, such as Mediterranean, French, or Japanese, by drawing on ingredient prevalence data from large recipe repositories. Second, the system visualizes a recipe’s dietary style mixture in two-dimensional space under barycentric coordinates using what we call a Newton diagram. Third, the system transforms a recipe’s dietary pattern into any selected regional style by recommending replaceable ingredients in existing recipes.\nAs an example of this proposed system, we transform a traditional Japanese recipe, Sukiyaki, into French style."
    }, {
      "heading" : "2 Architecture of recommendation system",
      "text" : "Figure 1 shows the overall architecture of recommendation system, which consists of two steps: 1) identification and visualization of a recipe’s dietary style mixture; and 2) algorithm which transforms a given recipe into any selected regional/country style. Details of the steps are described as follows."
    }, {
      "heading" : "2.1 Step 1: Identification and visualization of a recipe’s dietary style mixture",
      "text" : "Using a neural network method as detailed below, we identify a recipe’s dietary style. The neural network model was constructed as shown in Figure 2.\nWhen we enter a recipe, this model classifies which country or regional cuisine the recipe belongs to. The input is a vector with the dimension of the total number of ingredients included in the dataset, and only the indices of ingredients contained in the input recipe are 1, otherwise they are 0.\nThere are two hidden layers. Therefore, this model can consider a combination of ingredients to predict the country probability. Dropout is also used for the hidden layer, randomly (20%) setting the value of the node to 0. So a robust network is constructed. The final layer’s dimension is the number of countries, here 20 countries. In the final layer, we convert it to a probability value using the softmax function, which represents the probability that the recipe belongs to that country.\nIn this study, we used a labeled corpus of Yummly recipes to train this neural network. Yummly dataset has 39774 recipes from the 20 countries as shown in Table 1. Each recipe has the ingredients and country information. Firstly, we randomly divided the data set into 80% for training the neural network and 20%\nfor testing how precisely it can classify. The final neural network achieved a classification accuracy of 79% on the test set.\nBy using the probability values that emerge from the activation function in the neural network, rather than just the final classification, we can draw a barycentric Newton diagram, as shown in Figure 3. The basic idea of the visualization, drawing on Isaac Newton’s visualization of the color spectrum [7], is to express a mixture in terms of its constituents as represented in barycentric coordinates. This visualization allows an intuitive interpretation of which country a recipe belongs to. If the probability of Japanese is high, the recipe is mapped near the Japanese."
    }, {
      "heading" : "2.2 Step 2: Recommendation algorithm for transforming dietary style",
      "text" : "If you want to change a given recipe into a recipe having high probability of a specific country by just changing one ingredient, which ingredient should be alternatively used?\nWhen we change the one ingredient xi in the recipe to ingredient xj , the probability value of country likelihood can be calculated by using the above neural network model. If we want to change the recipe to have high probability of a specific country c, we can find ingredient xj that maximizes the following probability.\nP (C = c|r − xi + xj) (1)\nwhere r is the recipe. However, with this method, regardless of the ingredient xi, only specific ingredients having a high probability of country c are always selected. In this system, we want to select ingredients that are similar to ingredient xi and have a high probability of country c. Therefore, we propose a method of extending word2vec as a method of finding ingredients resembling ingredient xi.\nWord2vec is a technique proposed in the field of natural language processing [8]. As the name implies, it is a method to vectorize words, and similar words are represented by similar vectors. To train word2vec, sentences with their implicit structure among words are used as data. One sentence is made up of a set of\nwords, and learned on the assumption that the words appearing in the vicinity are similar. After vectorization, word2vec can calculate analogies. For example, the analogy of “King - Man + Women = ?” can be “Queen” by using word2vec.\nIn this study, word2vec is applied to the data set of recipes. Word2vec can be applied by considering recipes as sentences and ingredients as words. We do not include a window size parameter, since it is used to encode the ordering of words in sentences where it is important. In recipes, the listing of ingredients is unordered.\nEach ingredient is vectorized by word2vec, and the similarity of each ingredient is calculated using cosine similarity. Through vectorization in word2vec, those of the same genre are placed nearby. In other words, by using the word2vec vector, it is possible to select ingredients with similar genres. Figure 4 shows ingredient maps by neural network and word2vec.\nNext, we extend word2vec to be able to incorporate information of the country. When we can vectorize the countries, we can calculate the analogy between countries and ingredients. For example, this method can tell us what is the French ingredient that corresponds to Japanese soy sauce by calculating “Soy sauce - Japan + French = ?”.\nThe detail of our method is as follows. We will maximize objective function (2).\n∑ r∈R ∑ wi∈r logP (wi|cr) + logP (cr|wi) + ∑ j 6=i logP (wj |wi)  (2) where R is a set of recipes, r is a recipe, wi is i th ingredient in the recipe r, and cr is a country the recipe r belongs to. The probability is defined below.\nP (b|a) = exp(v T a v\n′ b)∑ c∈W exp(v T a v ′ c)\n(3)\nwhere a is a ingredient or country, b, c are also, va ∈ RK is an input vector of ingredient or country, v ′\na ∈ RK is an output vector of ingredient or country, K is a dimension of vector, and W is a set of all ingredients and all countries.\nWe can use hierarchical softmax or negative sampling method [8] to maximize objective function (2) and find the vectors of ingredients and countries.\nTable 2 shows the ingredients around each country in the vector space, and which could be considered as most authentic for that regional cuisine [9]. Also, Figure 4 shows the ingredients and countries in 2D map by using t-SNE method [10]."
    }, {
      "heading" : "3 Experiment",
      "text" : "As an example of our proposed system, we transformed a traditional Japanese Sukiyaki into French style. Table 3 shows the suggested replaceable ingredients and the probability after replacing. “Sukiyaki” consists of soy sauce, beef sirloin, white sugar, green onions, mirin, shiitake, egg, vegetable oil, konnyaku, and chinese\ncabbage. Figure 5 shows the Sukiyaki in French style cooked by professional chef KM who is one of the coauthors of this paper."
    }, {
      "heading" : "4 Discussion",
      "text" : "Unhealthy dietary style is one of the most important public health issues to be tackled. Given that past research has identified what makes a recipe healthy, future efforts should pay attention to the development of data-driven systems which can transform such healthy recipes into any given dietary style. Then a scientifically proven healthy dietary style could be acceptable in accordance with a user’s unique food preferences. Also, with growing diversity in personal food preference and dietary style, such an algorithm might be of\nvalue for food companies or professional chefs to create new recipes. In this regard, this study adds two important contributions to the literature. First, this is to the best of our knowledge, the first study to identify a recipe’s mixture of dietary country/regional styles from the large number of recipes around the world. Previous studies have focused on assessing degree of adherence to a single dietary pattern. For example, Mediterranean Diet Score is one of the most popular diet scores. This method uses 11 main items (e.g., fruit, vegetable, olive oil, and wine) as criteria for assessing the degree of one’s Mediterranean style [11]. However, in this era, it is becoming difficult to identify a recipe’s dietary style with specific country/regional style. For example, should Fish Provencal, whose recipe name is suggestive of Southern France, be cast as French style? The answer is mixture of different country styles: 32% French; 26% Italian; and 38% Spanish (see Figure 3).\nFurthermore, our identification algorithm can be used to assess the degree of personal dietary style mixture, using the user’s daily eating pattern as inputs. For example, when one enters the recipes that one has eaten in the past week into the algorithm, the probability values of each country would be returned, which shows the mixture of dietary styles of one’s daily eating pattern. As such, a future research direction would be developing algorithms that can transform personal dietary patterns to a healthier style by providing a series of recipes that are in accordance with one’s unique food preferences.\nSecond, this study proposes an algorithm that can transform a given recipe into any selected regional pattern. Previous studies have focused on developing recommendation algorithm which suggests replaceable ingredients Based on cooking action [12], degree of similarity among ingredient [13], ingredient network [14], degree of typicality of ingredient [15], and flavor (foodpairing.com). Our recommendation algorithm can be improved by adding multiple datasets from around the world. Needless to say, lack of a comprehensive data sets makes it difficult to develop recommendation algorithms for transforming dietary style. For example, Yummly, one of the largest recipe sites in the world, is less likely to contain recipes from non-Western regions. Furthermore, data on traditional dietary patterns is usually described in its native language. As such, developing a way to integrate multiple data sets in multiple languages is required for future research.\nOne of the methods to address this issue might be as follows: 1) generating the vector representation for each ingredient by using each data set independently; 2) translating only a small set of common ingredients among each data set, such as potato, tomato, and onion; 3) with a use of common ingredients, mapping each vector representation into one common vector space using a canonical correlation analysis [16], for example.\nSeveral fundamental limitations of the present study warrant mention. First of all, our identification and transformation algorithms depend on the quantity and quality of recipes included in the data. As such, future research using our proposed system should employ quality big recipe data. Second, the evolution of regional cuisines prevents us from developing precise algorithm. For example, the definition of Mediterranean dietary pattern has been revised to adapt to current dietary patterns [17, 18]. Therefore, future research should employ time-trend recipe data to distinctively specify a recipe’s mixture of dietary style and its date cf. [19]. Third, we did not consider the cooking method (e.g., baking, boiling, and deep flying) as a characteristic of country/regional style. Each country/region has different ways of cooking ingredients and this is one of the important factors characterizing the food culture of each country/region. Forth, the combination of\ningredients was not considered as the way to represent country/regional style. For example, previous studies have shown that Western recipes and East Asian recipes are opposite in flavor compounds included in the ingredient pair [20, 19, 21, 22, 9]. For example, Western cuisines tend to use ingredient pairs sharing many flavor compounds, while East Asian cuisines tend to avoid compound sharing ingredients. It is suggested that combination of flavor compounds was also elemental factor to characterize the food in each country/region. As such, if we analyze the recipes data using flavor compounds, we might get different results.\nIn conclusion, we proposed a novel system which can transform a given recipe into any selected dietary style. This system has three characteristics: 1) the system can identify a degree of dietary style mixture of any selected recipe; 2) the system can visualize such dietary style mixture using a barycentric Newton diagram; and the system can suggest ingredient substitution through extended word2vec model, such that a recipe becomes more authentic for any selected dietary style. Future research directions were also discussed.\nConflict of Interest Statement\nThe authors declare that they have no conflict of interest.\nAuthor Contributions\nMK, LRV, and YI had the idea for the study and drafted the manuscript. MK performed the data collection and analysis. MS, CH, and KM participated in the interpretation of the results and discussions for manuscript writing and finalization. All authors read and approved the final manuscript.\nFunding\nVarshney’s work was supported in part by the IBM-Illinois Center for Cognitive Computing Systems Research (C3SR), a research collaboration as part of the IBM Cognitive Horizons Network."
    }, {
      "heading" : "Acknowledgments",
      "text" : "This study used data from Yummly. We would like to express our deepest gratitude to everyone who participated in this services."
    } ],
    "references" : [ {
      "title" : "Dietary quality among men and women in 187 countries in 1990 and 2010: a systematic assessment",
      "author" : [ "F. Imamura", "R. Micha", "S. Khatibzadeh", "S. Fahimi", "P. Shi", "J. Powles", "D. Mozaffarian" ],
      "venue" : "The Lancet Global Health, vol. 3, no. 3, pp. e132–e142, Mar. 2015.",
      "citeRegEx" : "1",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Major dietary risk factors for chronic diseases: A systematic review of the current evidence for causal effects and effect sizes",
      "author" : [ "S. Khatibzadeh", "R. Micha", "A. Afshin", "M. Rao", "M.Y. Yakoob", "D. Mozaffarian" ],
      "venue" : "Circulation, vol. 125, no. Su. 10, p. AP060, Mar. 2012.",
      "citeRegEx" : "2",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Influence of Japanese food on senility and health maintenance",
      "author" : [ "T. Tsuduki" ],
      "venue" : "Yakugaku Zasshi: Journal of the Pharmaceutical Society of Japan, vol. 135, no. 1, pp. 57–65, 2014.",
      "citeRegEx" : "3",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Increasing homogeneity in global food supplies and the implications for food security",
      "author" : [ "C.K. Khoury", "A.D. Bjorkman", "H. Dempewolf", "J. Ramirez-Villegas", "L. Guarino", "A. Jarvis", "L.H. Rieseberg", "P.C. Struik" ],
      "venue" : "Proceedings of the National Academy of Sciences of the United States of America, vol. 111, no. 11, pp. 4001–4006, Mar. 2014. 8",
      "citeRegEx" : "4",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Using physicochemical correlates of perceptual flavor similarity to enhance, balance and substitute flavors",
      "author" : [ "F. Pinel", "N. Shao", "L.R. Varshney" ],
      "venue" : "Aug. 13 2014, US Patent App. 14/458,315.",
      "citeRegEx" : "5",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Substitution of work products",
      "author" : [ "F. Pinel", "L.R. Varshney" ],
      "venue" : "May 5 2014, US Patent App. 14/269,353.",
      "citeRegEx" : "6",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Distributed representations of words and phrases and their compositionality",
      "author" : [ "T. Mikolov", "I. Sutskever", "K. Chen", "G.S. Corrado", "J. Dean" ],
      "venue" : "Advances in Neural Information Processing Systems 26, C. J. C. Burges, L. Bottou, M. Welling, Z. Ghahramani, and K. Q. Weinberger, Eds. Cambridge, MA: MIT Press, 2013, pp. 3111–3119.",
      "citeRegEx" : "8",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Flavor network and the principles of food pairing",
      "author" : [ "Y.-Y. Ahn", "S.E. Ahnert", "J.P. Bagrow", "A.-L. Barabási" ],
      "venue" : "Scientific Rerports, vol. 1, p. 196, Dec. 2011.",
      "citeRegEx" : "9",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Visualizing data using t-SNE",
      "author" : [ "L. van der Maaten", "G. Hinton" ],
      "venue" : "Journal of Machine Learning Research, vol. 9, pp. 2579–2605, Nov. 2008.",
      "citeRegEx" : "10",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "Dietary patterns: a Mediterranean diet score and its relation to clinical and biological markers of cardiovascular disease risk",
      "author" : [ "D.B. Panagiotakos", "C. Pitsavos", "C. Stefanadis" ],
      "venue" : "Nutrition, Metabolism and Cardiovascular Diseases, vol. 16, no. 8, pp. 559–568, Dec. 2006.",
      "citeRegEx" : "11",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Finding replaceable materials in cooking recipe texts considering characteristic cooking actions",
      "author" : [ "Y. Shidochi", "T. Takahashi", "I. Ide", "H. Murase" ],
      "venue" : "Proceedings of the ACM Multimedia 2009 Workshop on Multimedia for Cooking and Eating Activities, Oct. 2009, pp. 9–14.",
      "citeRegEx" : "12",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "Finding method of replaceable ingredients using large amounts of cooking recipes",
      "author" : [ "K. Nozawa", "Y. Nakaoka", "S. Yamamoto", "T. Satoh" ],
      "venue" : "IEICE Technical Report, vol. 114, no. 204, pp. 41–46, Sep. 2014.",
      "citeRegEx" : "13",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Recipe recommendation using ingredient networks",
      "author" : [ "C.-Y. Teng", "Y.-R. Lin", "L.A. Adamic" ],
      "venue" : "Proceedings of the 3rd Annual ACM Web Science Conference (WebSci’12), Jun. 2012, pp. 298–307.",
      "citeRegEx" : "14",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Typicality analysis of the combination of ingredients in a cooking recipe for assisting the arrangement of ingredients",
      "author" : [ "S. Yokoi", "K. Doman", "T. Hirayama", "I. Ide", "D. Deguchi", "H. Murase" ],
      "venue" : "2015 IEEE International Conference on Multimedia & Expo Workshops (ICMEW), Jun. 2015.",
      "citeRegEx" : "15",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Canonical analysis of several sets of variables",
      "author" : [ "J.R. Kettenring" ],
      "venue" : "Biometrika, vol. 58, no. 3, pp. 433–451, Dec. 1971.",
      "citeRegEx" : "16",
      "shortCiteRegEx" : null,
      "year" : 1971
    }, {
      "title" : "Does the definition of the Mediterranean diet need to be updated?",
      "author" : [ "L. Serra-Majem", "A. Trichopoulou", "J.N. de la Cruz", "P. Cervera", "A.G. Álvarez", "C. La Vecchia", "A. Lemtouni", "D. Trichopoulos" ],
      "venue" : "Public Health Nutrition,",
      "citeRegEx" : "17",
      "shortCiteRegEx" : "17",
      "year" : 2004
    }, {
      "title" : "The non-equilibrium nature of culinary evolution",
      "author" : [ "O. Kinouchi", "R.W. Diez-Garcia", "A.J. Holanda", "P. Zambianchi", "A.C. Roque" ],
      "venue" : "New Journal of Physics, vol. 10, no. 7, p. 073020, 2008.",
      "citeRegEx" : "18",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "Flavor pairing in Medieval European cuisine: A study in cooking with dirty data",
      "author" : [ "K.R. Varshney", "L.R. Varshney", "J. Wang", "D. Myers" ],
      "venue" : "Int. Joint Conf. Artif. Intell. Workshops, pp. 3–12, Aug. 2013.",
      "citeRegEx" : "19",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Geography and similarity of regional cuisines in China",
      "author" : [ "Y.-X. Zhu", "J. Huang", "Z.-K. Zhang", "Q.-M. Zhang", "T. Zhou", "Y.-Y. Ahn" ],
      "venue" : "PloS ONE, vol. 8, no. 11, p. e79161, Nov. 2013.",
      "citeRegEx" : "20",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Analysis of food pairing in regional cuisines of India",
      "author" : [ "A. Jain", "Rakhi N.K.", "G. Bagler" ],
      "venue" : "PLoS ONE, vol. 10, no. 10, p. e0139539.",
      "citeRegEx" : "21",
      "shortCiteRegEx" : null,
      "year" : 1395
    }, {
      "title" : "Exploring the food pairing hypothesis in Arab cuisine: A study in computational gastronomy",
      "author" : [ "S.T. Tallab", "M.S. Alrazgan" ],
      "venue" : "Procedia Computer Science, vol. 82, pp. 135–137, 2016. 9",
      "citeRegEx" : "22",
      "shortCiteRegEx" : null,
      "year" : 2016
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "Modern dietary styles have been more inclined toward unhealthy eating patterns [1].",
      "startOffset" : 79,
      "endOffset" : 82
    }, {
      "referenceID" : 1,
      "context" : "While there is compelling research in nutrition sciences on what makes a recipe healthy [2], this does not necessarily mean that such a recipe is matched to one’s unique food preferences.",
      "startOffset" : 88,
      "endOffset" : 91
    }, {
      "referenceID" : 2,
      "context" : "For example, the Japanese dietary style as measured in the 1970s is reported to have been healthy [3].",
      "startOffset" : 98,
      "endOffset" : 101
    }, {
      "referenceID" : 3,
      "context" : "As to the former challenge, with growing globalization and economic development, it is becoming difficult to identify a recipe’s dietary style with specific traditional styles since dietary patterns have been changing and converging in many countries throughout Asia, Europe, and elsewhere [4].",
      "startOffset" : 290,
      "endOffset" : 293
    }, {
      "referenceID" : 4,
      "context" : "[5, 6].",
      "startOffset" : 0,
      "endOffset" : 6
    }, {
      "referenceID" : 5,
      "context" : "[5, 6].",
      "startOffset" : 0,
      "endOffset" : 6
    }, {
      "referenceID" : 6,
      "context" : "Word2vec is a technique proposed in the field of natural language processing [8].",
      "startOffset" : 77,
      "endOffset" : 80
    }, {
      "referenceID" : 6,
      "context" : "We can use hierarchical softmax or negative sampling method [8] to maximize objective function (2) and find the vectors of ingredients and countries.",
      "startOffset" : 60,
      "endOffset" : 63
    }, {
      "referenceID" : 7,
      "context" : "Table 2 shows the ingredients around each country in the vector space, and which could be considered as most authentic for that regional cuisine [9].",
      "startOffset" : 145,
      "endOffset" : 148
    }, {
      "referenceID" : 8,
      "context" : "Also, Figure 4 shows the ingredients and countries in 2D map by using t-SNE method [10].",
      "startOffset" : 83,
      "endOffset" : 87
    }, {
      "referenceID" : 9,
      "context" : ", fruit, vegetable, olive oil, and wine) as criteria for assessing the degree of one’s Mediterranean style [11].",
      "startOffset" : 107,
      "endOffset" : 111
    }, {
      "referenceID" : 10,
      "context" : "Previous studies have focused on developing recommendation algorithm which suggests replaceable ingredients Based on cooking action [12], degree of similarity among ingredient [13], ingredient network [14], degree of typicality of ingredient [15], and flavor (foodpairing.",
      "startOffset" : 132,
      "endOffset" : 136
    }, {
      "referenceID" : 11,
      "context" : "Previous studies have focused on developing recommendation algorithm which suggests replaceable ingredients Based on cooking action [12], degree of similarity among ingredient [13], ingredient network [14], degree of typicality of ingredient [15], and flavor (foodpairing.",
      "startOffset" : 176,
      "endOffset" : 180
    }, {
      "referenceID" : 12,
      "context" : "Previous studies have focused on developing recommendation algorithm which suggests replaceable ingredients Based on cooking action [12], degree of similarity among ingredient [13], ingredient network [14], degree of typicality of ingredient [15], and flavor (foodpairing.",
      "startOffset" : 201,
      "endOffset" : 205
    }, {
      "referenceID" : 13,
      "context" : "Previous studies have focused on developing recommendation algorithm which suggests replaceable ingredients Based on cooking action [12], degree of similarity among ingredient [13], ingredient network [14], degree of typicality of ingredient [15], and flavor (foodpairing.",
      "startOffset" : 242,
      "endOffset" : 246
    }, {
      "referenceID" : 14,
      "context" : "One of the methods to address this issue might be as follows: 1) generating the vector representation for each ingredient by using each data set independently; 2) translating only a small set of common ingredients among each data set, such as potato, tomato, and onion; 3) with a use of common ingredients, mapping each vector representation into one common vector space using a canonical correlation analysis [16], for example.",
      "startOffset" : 410,
      "endOffset" : 414
    }, {
      "referenceID" : 15,
      "context" : "For example, the definition of Mediterranean dietary pattern has been revised to adapt to current dietary patterns [17, 18].",
      "startOffset" : 115,
      "endOffset" : 123
    }, {
      "referenceID" : 16,
      "context" : "For example, the definition of Mediterranean dietary pattern has been revised to adapt to current dietary patterns [17, 18].",
      "startOffset" : 115,
      "endOffset" : 123
    }, {
      "referenceID" : 17,
      "context" : "[19].",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 18,
      "context" : "For example, previous studies have shown that Western recipes and East Asian recipes are opposite in flavor compounds included in the ingredient pair [20, 19, 21, 22, 9].",
      "startOffset" : 150,
      "endOffset" : 169
    }, {
      "referenceID" : 17,
      "context" : "For example, previous studies have shown that Western recipes and East Asian recipes are opposite in flavor compounds included in the ingredient pair [20, 19, 21, 22, 9].",
      "startOffset" : 150,
      "endOffset" : 169
    }, {
      "referenceID" : 19,
      "context" : "For example, previous studies have shown that Western recipes and East Asian recipes are opposite in flavor compounds included in the ingredient pair [20, 19, 21, 22, 9].",
      "startOffset" : 150,
      "endOffset" : 169
    }, {
      "referenceID" : 20,
      "context" : "For example, previous studies have shown that Western recipes and East Asian recipes are opposite in flavor compounds included in the ingredient pair [20, 19, 21, 22, 9].",
      "startOffset" : 150,
      "endOffset" : 169
    }, {
      "referenceID" : 7,
      "context" : "For example, previous studies have shown that Western recipes and East Asian recipes are opposite in flavor compounds included in the ingredient pair [20, 19, 21, 22, 9].",
      "startOffset" : 150,
      "endOffset" : 169
    } ],
    "year" : 2017,
    "abstractText" : "We propose a novel system which can transform a recipe into any selected regional style (e.g., Japanese, Mediterranean, or Italian). This system has three characteristics. First the system can identify the degree of dietary style mixture of any selected recipe. Second, the system can visualize such dietary style mixtures using barycentric Newton diagrams. Third, the system can suggest ingredient substitutions through an extended word2vec model, such that a recipe becomes more authentic for any selected dietary style. Drawing on a large number of recipes from Yummly, an example shows how the proposed system can transform a traditional Japanese recipe, Sukiyaki, into French style.",
    "creator" : "LaTeX with hyperref package"
  }
}