{
  "name" : "1705.00424.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Model Transfer for Tagging Low-resource Languages using a Bilingual Dictionary",
    "authors" : [ "Meng Fang" ],
    "emails" : [ "meng.fang@unimelb.edu.au,", "t.cohn@unimelb.edu.au" ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "Part-of-speech (POS) tagging is an important first step in most natural language processing (NLP) applications. Typically this is modelled using sequence labelling methods to predict the conditional probability of taggings given word sequences, using linear graphical models (Lafferty et al., 2001), or neural network models, such as recurrent neural networks (RNN) (Mikolov et al., 2010; Huang et al., 2015). These supervised learning algorithms rely on large labelled corpora; this is particularly true for state-of-the-art neural network models. Due to the expense of annotating sufficient data, such techniques are not well suited to applications in low-resource languages.\nPrior work on low-resource NLP has primarily focused on exploiting parallel corpora to project\ninformation between a high- and low-resource language (Yarowsky and Ngai, 2001; Täckström et al., 2013; Guo et al., 2015; Agić et al., 2016; Buys and Botha, 2016). For example, POS tags can be projected via word alignments, and the projected POS is then used to train a model in the lowresource language (Das and Petrov, 2011; Zhang et al., 2016; Fang and Cohn, 2016). These methods overall have limited effectiveness due to errors in the alignment and fundamental differences between the languages. They also assume a large parallel corpus, which may not be available for many low-resource languages.\nTo address these limitations, we propose a new technique for low resource tagging, with more modest resource requirements: 1) a bilingual dictionary; 2) monolingual corpora in the high and low resource languages; and 3) a small annotated corpus of around 1, 000 tokens in the low-resource language. The first two resources are used as a form of distant supervision through learning crosslingual word embeddings over the monolingual corpora and bilingual dictionary (Ammar et al., 2016). Additionally, our model jointly incorporates the language-dependent information from the small set of gold annotations. Our approach combines these two sources of supervision using multi-task learning, such that the kinds of errors that occur in cross-lingual transfer can be accounted for, and corrected automatically.\nWe empirically demonstrate the validity of our observation by using distant supervision to improve POS tagging performance with little supervision. Experimental results show the effectiveness of our approach across several low-resource languages, including both simulated and true lowresource settings. Furthermore, given the clear superiority of training with manual annotations, we compare several active learning heuristics. Active learning using uncertainty sampling with a word-\nar X\niv :1\n70 5.\n00 42\n4v 1\n[ cs\n.C L\n] 1\nM ay\n2 01\n7\ntype bias leads to substantial gains over benchmark methods such as token or sentence level uncertainty sampling."
    }, {
      "heading" : "2 Related work",
      "text" : "POS tagging has been studied for many years. Traditionally, probabilistic models are a popular choice, such as Hidden Markov Models (HMM) and Conditional Random Fields (CRF) (Lafferty et al., 2001). Recently, neural network models have been developed for POS tagging and achieved good performance, such as RNN and bidirectional long short-term memory (BiLSTM) and CRF-BiLSTM models (Mikolov et al., 2010; Huang et al., 2015). For example, the CRFBiLSTM POS tagger obtained the state-of-theart performance on Penn Treebank WSJ corpus (Huang et al., 2015).\nHowever, in low-resource languages, these models are seldom used because of limited labelled data. Parallel data therefore appears to be the most realistic additional source of information for developing NLP systems in low-resource languages (Yarowsky and Ngai, 2001; Das and Petrov, 2011; Täckström et al., 2013; Fang and Cohn, 2016; Zhang et al., 2016). Yarowsky and Ngai (2001) pioneered the use of parallel data for projecting POS tag information from one language to another language. Das and Petrov (2011) used parallel data and exploited graph-based label propagation to expand the coverage of labelled tokens.\nTäckström et al. (2013) constructed tag dictionaries by projecting tag information from a highresource language to a low-resource language via alignments in the parallel text. Fang and Cohn (2016) used parallel data to obtain projected tags as distant labels and proposed a joint BiLSTM model trained on both the distant data and 1, 000 tagged tokens. Zhang et al. (2016) used a few word translations pairs to find a linear transformation between two language embeddings. Then they used unsupervised learning to refine embedding transformations and model parameters. Instead we use minimal supervision to refine ‘distant’ labels through modelling the tag transformation, based on a small set of annotations."
    }, {
      "heading" : "3 Model",
      "text" : "We now describe the modelling framework for POS tagging in a low-resource language, based on very limited linguistic resources. Our approach extends the work of Fang and Cohn (2016), who present a model based on distant supervision in the form of cross-lingual projection and use projected tags generated from parallel corpora as distant annotations. There are three main differences between their work and ours: 1) We do not use parallel corpora, but instead use a bilingual dictionary for knowledge transfer. 2) Our model uses a more expressive multi-layer perceptron when generating the gold standard tags. The multi-layer perceptron can capture both language-specific infor-\nmation and consistent tagging errors arising from this method of supervision. 3) We propose a number of active learning methods to further reduces the annotation requirements. Our method is illustrated in Figure 1, and we now elaborate on the model components.\nDistant cross-lingual supervision In order to transfer tag information between the high- and low-resource languages, we start by learning cross-lingual word embeddings, which operate by learning vector valued embeddings such that words and their translations tend to be close together in the vector space. We use the embeddings from Ammar et al. (2016) which trains monolingual word2vec distributional representations, which are then projected into a common space, learned from bilingual dictionaries.\nWe then train a POS tagger on the high-resource language, using the cross-lingual word embeddings as the first, fixed, layer of a bidirectional LSTM tagger. The tagger is a language-universal model based on cross-lingual word embeddings, for processing an arbitrary language, given a monolingual corpus and a bilingual dictionary, as shown in Figure 2. Next we apply this tagger to unannotated text in the low-resource language; this application is made possible through the use of cross-lingual word embeddings. We refer to text tagged this way as distantly supervised data, and emphasize that although much better than chance, the outputs are often incorrect and are of limited utility on their own.\nAs illustrated in Figure 1, the distant components are generated directly as softmax outputs,\nyt ∼ Categorial(ot), with parameters ot = Softmax(Wht + b) as a linear classifier over a sentence encoding, ht, which is the output of a bidirectional LSTM encoder over the words.\nGround truth supervision The second component of the model is manually labelled text in the low-resource language. To model this data we employ the same model structure as above but augmented with a second perceptron output layer, as illustrated in Figure 1 (right). Formally, ỹt ∼ Categorial(õt) where õt = MLP(ot) is a single hidden layer perceptron with tanh activation and softmax output transformation. This component allows for a more expressive label mapping than Fang and Cohn (2016)’s linear matrix translation.\nJoint multi-task learning To combine the two sources of information, we use a joint objective,\nJ = −γ ∑ t∈N 〈ỹt, log õt〉 − ∑ t∈M 〈yt, log ot〉 , (1)\nwhere N and M index the token positions in the distant and ground truth corpora, respectively, and γ is a constant balancing the two components which we set for uniform weighting, γ = |M||N | .\nConsider the training effect of the true POS tags: when performing error backpropagation, the cross-entropy error signal must pass through the transformation linking õwith o, which can be seen as a language-specific step, after which the generalised error signal can be further backpropagated to the rest of the model.\nActive learning Given the scarcity of ground truth labels and the high cost of annotation, a natural question is whether we can optimise which text to be annotated in order achieve the high accuracy for the lowest cost. We now outline a range of active learning approaches based on the following heuristics, which are used to select the instances for annotation from a pool of candidates:\nTOKEN Select the token xt with the highest uncertainty, H(x, t) = − ∑ y P (y|x, t) logP (y|x, t);\nSENT Select the sentence x with the highest aggregate uncertainty, H(x) = ∑ tH(x, t);\nFREQTYPE Select the most frequent unannotated word type (Garrette and Baldridge, 2013), in which case all token instances are\nannotated with the most frequent label for the type in the training corpus;1\nSUMTYPE Select a word type, z, for annotation with the highest aggregate uncertainty over token occurrences, H(z) = ∑ i∈D ∑ xi,t=z\nH(xi, t), which effectively combines uncertainty sampling with a bias towards high frequency types; and\nRANDOM Select word types randomly."
    }, {
      "heading" : "4 Experiments",
      "text" : "We evaluate the effectiveness of the proposed model for several different languages, including both simulated low-resource and true low-resource settings. The first evaluation set uses the CoNLLX datasets of European languages (Buchholz and Marsi, 2006), comprising Danish (da), Dutch (nl), German (de), Greek (el), Italian (it), Portuguese (pt), Spanish (es) and Swedish (sv). We use the standard corpus splits. The first 20 sentences of training set are used for training as the tiny labelled (gold) data and the last 20 sentences are used for development (early stopping). We report accuracy on the held-out test set.\nThe second evaluation set includes two highly challenging languages, Turkish (tk) and Malagasy (mg), both having high morphological complexity and the latter has truly scant resources. Turkish data was drawn from CoNLL 20032 and Malagasy data was collected from Das and Petrov (2011), in both cases using the same training configuration as above.\nIn all cases English is used as the source ‘high resource’ language, on which we train a tagger using the Penn Treebank, and we evaluate on each of the remaining languages as an independent target. For cross-lingual word embeddings, we evaluate two techniques from Ammar et al. (2016): CCA-based word embeddings and clusterbased word embeddings. Both types of word embedding techniques are based on bilingual dictionaries. The dictionaries were formed by translating the 20k most common words in the En-\n1We could support more than one class label, by marginalising over the set of valid labels for all tokens in the training objective.\n2http://www.cnts.ua.ac.be/conll2003/ner/\nglish monolingual corpus with Google Translate.3 The monolingual corpora were constructed from a combination of text from the Leipzig Corpora Collection and Europarl. We trained the languageuniversal POS tagger based on the cross-lingual word embeddings with the universal POS tagset (Petrov et al., 2011), and then applied to the target language using the embedding lookup table for the corresponding language embeddings. We implement our learning procedure with the DyNet toolkit (Neubig et al., 2017).4 The BiLSTM layer uses 128 hidden units, and 32 hidden units for the transformation step. We used SGD with momentum to train models, with early stopping based on development performance.\nFor benchmarks, we compare the proposed model against various state-of-the-art supervised learning methods, namely: a BILSTM tagger, BILSTM-CRF tagger (Huang et al., 2015), and a state-of-the-art semi-supervised POS tagging algorithm, MINITAGGER (Stratos and Collins, 2015), which is also focusing on minimising the amount of labelled data. Note these methods do not use cross-lingual supervision. For a more direct comparison, we include BILSTMDEBIAS (Fang and Cohn, 2016), applied using our proposed cross-lingual supervision based on dictionaries, instead of parallel corpora; accordingly the key difference is their linear transformation for the distant data, versus our non-linear transformation to the gold data.\nResults Table 1 reports the tagging accuracy, showing that our models consistently outperform the baseline techniques. The poor performance of the supervised methods suggests they are overfitting the small training set, however this is much less of a problem for our approach (labelled Joint). Note that distant supervision alone gives reasonable performance (labelled DISTANT) however the joint modelling of the ground truth and distant data yields significant improvements in almost all cases. BILSTM-DEBIAS (Fang and Cohn, 2016) performs worse than our proposed method, indicating that a linear transformation is insufficient for modelling distant supervision. The accuracies are higher overall for the European cf. Turkic languages, presumably because these languages are\n3Although the use of a translation system conveys a dependence on parallel text, high quality word embeddings can be learned directly from bilingual dictionaries such as Panlex (Kamholz et al., 2014).\n4Code available at https://github.com/mengf1/trpos\ncloser to English, have higher quality dictionaries and in most cases are morphologically simpler. Finally, note the difference between CCA and Cluster methods for learning word embeddings which arise from the differing quality of distant supervision between the languages.\nFigure 3 compares various active learning heuristics (see §3) based on different taggers, either a supervised BILSTM (labelled Trad) or our multi-task model which also includes crosslingual supervision (JOINT).\nTraditional uncertainty-based sampling strategies (TOKEN(Trad) and SENT(Trad)) do not work well because models based on limited supervision do not provide accurate uncertainty information,5 and moreover, annotating at the type rather than token level provides a significantly stronger supervision signal. The difference is apparent from the decent performance of Random sampling over word types. Overall, SUMTYPE(Joint) outperforms the other heuristics consistently, underlining the importance of cross-lingual distant super-\n5Sentence level annotation is likely to be much faster than token or type level annotation, however even if it were an order of magnitude faster it is still not a competitive active learning strategy.\nvision, as well as combining the benefits of uncertainty sampling, type selection and a frequency bias. Comparing the amount of annotation required between the best traditional active learning method SUMTYPE(Trad) and our best method SUMTYPE(Joint), we achieve the same performance with an order of magnitude less annotated data (100 vs. 1, 000 labelled words)."
    }, {
      "heading" : "5 Conclusion",
      "text" : "In this paper, we proposed a means of tagging a low-resource language without the need for bilingual parallel corpora. We introduced a new cross-lingual distant supervision method based on a bilingual dictionary. Furthermore, deep neural network models can be effective with limited supervision by incorporating distant supervision, in the form of model transfer with cross-lingual word embeddings. We show that traditional uncertainty sampling strategies do not work well on low-resource settings, and introduce new methods based around labelling word types. Overall our approach leads to consistent and substantial improvements over benchmark methods."
    }, {
      "heading" : "Acknowledgments",
      "text" : "This work was sponsored by the Defense Advanced Research Projects Agency Information Innovation Office (I2O) under the Low Resource Languages for Emergent Incidents (LORELEI) program issued by DARPA/I2O under Contract No. HR0011-15-C-0114. The views expressed are those of the author and do not reflect the official policy or position of the Department of Defense or the U.S. Government. Trevor Cohn was supported by the Australian Research Council Future Fellowship (project number FT130101105)."
    } ],
    "references" : [ {
      "title" : "Multilingual projection for parsing truly low-resource languages. Transactions of the Association for Computational Linguistics",
      "author" : [ "Željko Agić", "Anders Johannsen", "Barbara Plank", "Héctor Alonso Martı́nez", "Natalie Schluter", "Anders Søgaard" ],
      "venue" : null,
      "citeRegEx" : "Agić et al\\.,? \\Q2016\\E",
      "shortCiteRegEx" : "Agić et al\\.",
      "year" : 2016
    }, {
      "title" : "Massively multilingual word embeddings",
      "author" : [ "Waleed Ammar", "George Mulcaire", "Yulia Tsvetkov", "Guillaume Lample", "Chris Dyer", "Noah A Smith." ],
      "venue" : "Transactions of the Association for Computational Linguistics 4:431–444.",
      "citeRegEx" : "Ammar et al\\.,? 2016",
      "shortCiteRegEx" : "Ammar et al\\.",
      "year" : 2016
    }, {
      "title" : "Conll-x shared task on multilingual dependency parsing",
      "author" : [ "Sabine Buchholz", "Erwin Marsi." ],
      "venue" : "Proceedings of the Tenth Conference on Computational Natural Language Learning. Association for Computational Linguistics, pages 149–164.",
      "citeRegEx" : "Buchholz and Marsi.,? 2006",
      "shortCiteRegEx" : "Buchholz and Marsi.",
      "year" : 2006
    }, {
      "title" : "Cross-lingual morphological tagging for low-resource languages",
      "author" : [ "Jan Buys", "Jan A. Botha." ],
      "venue" : "Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics (ACL). Association for Computational Linguistics, Berlin, Ger-",
      "citeRegEx" : "Buys and Botha.,? 2016",
      "shortCiteRegEx" : "Buys and Botha.",
      "year" : 2016
    }, {
      "title" : "Unsupervised part-of-speech tagging with bilingual graph-based projections",
      "author" : [ "Dipanjan Das", "Slav Petrov." ],
      "venue" : "Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies (ACL-",
      "citeRegEx" : "Das and Petrov.,? 2011",
      "shortCiteRegEx" : "Das and Petrov.",
      "year" : 2011
    }, {
      "title" : "Learning when to trust distant supervision: An application to lowresource pos tagging using cross-lingual projection",
      "author" : [ "Meng Fang", "Trevor Cohn." ],
      "venue" : "Proceedings of the 20th SIGNLL Conference on Computational Natural Language Learning",
      "citeRegEx" : "Fang and Cohn.,? 2016",
      "shortCiteRegEx" : "Fang and Cohn.",
      "year" : 2016
    }, {
      "title" : "Learning a part-of-speech tagger from two hours of annotation",
      "author" : [ "Dan Garrette", "Jason Baldridge." ],
      "venue" : "Proceedings of the 2013 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies",
      "citeRegEx" : "Garrette and Baldridge.,? 2013",
      "shortCiteRegEx" : "Garrette and Baldridge.",
      "year" : 2013
    }, {
      "title" : "Token and type",
      "author" : [ "McDonald", "Joakim Nivre" ],
      "venue" : null,
      "citeRegEx" : "McDonald and Nivre.,? \\Q2013\\E",
      "shortCiteRegEx" : "McDonald and Nivre.",
      "year" : 2013
    }, {
      "title" : "Ten pairs to tag– multilingual pos tagging via coarse mapping between embeddings",
      "author" : [ "Yuan Zhang", "David Gaddy", "Regina Barzilay", "Tommi Jaakkola." ],
      "venue" : "Proceedings of the 2016 Conference of the North American Chapter of the Asso-",
      "citeRegEx" : "Zhang et al\\.,? 2016",
      "shortCiteRegEx" : "Zhang et al\\.",
      "year" : 2016
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "Prior work on low-resource NLP has primarily focused on exploiting parallel corpora to project information between a high- and low-resource language (Yarowsky and Ngai, 2001; Täckström et al., 2013; Guo et al., 2015; Agić et al., 2016; Buys and Botha, 2016).",
      "startOffset" : 149,
      "endOffset" : 257
    }, {
      "referenceID" : 3,
      "context" : "Prior work on low-resource NLP has primarily focused on exploiting parallel corpora to project information between a high- and low-resource language (Yarowsky and Ngai, 2001; Täckström et al., 2013; Guo et al., 2015; Agić et al., 2016; Buys and Botha, 2016).",
      "startOffset" : 149,
      "endOffset" : 257
    }, {
      "referenceID" : 4,
      "context" : "resource language (Das and Petrov, 2011; Zhang et al., 2016; Fang and Cohn, 2016).",
      "startOffset" : 18,
      "endOffset" : 81
    }, {
      "referenceID" : 8,
      "context" : "resource language (Das and Petrov, 2011; Zhang et al., 2016; Fang and Cohn, 2016).",
      "startOffset" : 18,
      "endOffset" : 81
    }, {
      "referenceID" : 5,
      "context" : "resource language (Das and Petrov, 2011; Zhang et al., 2016; Fang and Cohn, 2016).",
      "startOffset" : 18,
      "endOffset" : 81
    }, {
      "referenceID" : 1,
      "context" : "The first two resources are used as a form of distant supervision through learning crosslingual word embeddings over the monolingual corpora and bilingual dictionary (Ammar et al., 2016).",
      "startOffset" : 166,
      "endOffset" : 186
    }, {
      "referenceID" : 4,
      "context" : "Parallel data therefore appears to be the most realistic additional source of information for developing NLP systems in low-resource languages (Yarowsky and Ngai, 2001; Das and Petrov, 2011; Täckström et al., 2013; Fang and Cohn, 2016; Zhang et al., 2016).",
      "startOffset" : 143,
      "endOffset" : 255
    }, {
      "referenceID" : 5,
      "context" : "Parallel data therefore appears to be the most realistic additional source of information for developing NLP systems in low-resource languages (Yarowsky and Ngai, 2001; Das and Petrov, 2011; Täckström et al., 2013; Fang and Cohn, 2016; Zhang et al., 2016).",
      "startOffset" : 143,
      "endOffset" : 255
    }, {
      "referenceID" : 8,
      "context" : "Parallel data therefore appears to be the most realistic additional source of information for developing NLP systems in low-resource languages (Yarowsky and Ngai, 2001; Das and Petrov, 2011; Täckström et al., 2013; Fang and Cohn, 2016; Zhang et al., 2016).",
      "startOffset" : 143,
      "endOffset" : 255
    }, {
      "referenceID" : 4,
      "context" : "Parallel data therefore appears to be the most realistic additional source of information for developing NLP systems in low-resource languages (Yarowsky and Ngai, 2001; Das and Petrov, 2011; Täckström et al., 2013; Fang and Cohn, 2016; Zhang et al., 2016). Yarowsky and Ngai (2001) pioneered the use of parallel data for projecting POS tag information from one language to another language.",
      "startOffset" : 169,
      "endOffset" : 282
    }, {
      "referenceID" : 4,
      "context" : "Parallel data therefore appears to be the most realistic additional source of information for developing NLP systems in low-resource languages (Yarowsky and Ngai, 2001; Das and Petrov, 2011; Täckström et al., 2013; Fang and Cohn, 2016; Zhang et al., 2016). Yarowsky and Ngai (2001) pioneered the use of parallel data for projecting POS tag information from one language to another language. Das and Petrov (2011) used parallel data and exploited graph-based label propagation to expand the coverage of labelled tokens.",
      "startOffset" : 169,
      "endOffset" : 413
    }, {
      "referenceID" : 4,
      "context" : "Parallel data therefore appears to be the most realistic additional source of information for developing NLP systems in low-resource languages (Yarowsky and Ngai, 2001; Das and Petrov, 2011; Täckström et al., 2013; Fang and Cohn, 2016; Zhang et al., 2016). Yarowsky and Ngai (2001) pioneered the use of parallel data for projecting POS tag information from one language to another language. Das and Petrov (2011) used parallel data and exploited graph-based label propagation to expand the coverage of labelled tokens. Täckström et al. (2013) constructed tag dictionaries by projecting tag information from a highresource language to a low-resource language via alignments in the parallel text.",
      "startOffset" : 169,
      "endOffset" : 543
    }, {
      "referenceID" : 8,
      "context" : "Zhang et al. (2016) used a few word translations pairs to find a linear transfor-",
      "startOffset" : 0,
      "endOffset" : 20
    }, {
      "referenceID" : 5,
      "context" : "Our approach extends the work of Fang and Cohn (2016), who present a model based on distant supervision in the form of cross-lingual projection and use projected tags generated from parallel corpora as distant annotations.",
      "startOffset" : 33,
      "endOffset" : 54
    }, {
      "referenceID" : 1,
      "context" : "We use the embeddings from Ammar et al. (2016) which trains monolingual word2vec distributional representations, which are then projected into a common space, learned from bilingual dictionaries.",
      "startOffset" : 27,
      "endOffset" : 47
    }, {
      "referenceID" : 5,
      "context" : "This component allows for a more expressive label mapping than Fang and Cohn (2016)’s linear matrix translation.",
      "startOffset" : 63,
      "endOffset" : 84
    }, {
      "referenceID" : 6,
      "context" : "FREQTYPE Select the most frequent unannotated word type (Garrette and Baldridge, 2013), in which case all token instances are",
      "startOffset" : 56,
      "endOffset" : 86
    }, {
      "referenceID" : 2,
      "context" : "X datasets of European languages (Buchholz and Marsi, 2006), comprising Danish (da), Dutch (nl), German (de), Greek (el), Italian (it), Portuguese (pt), Spanish (es) and Swedish (sv).",
      "startOffset" : 33,
      "endOffset" : 59
    }, {
      "referenceID" : 4,
      "context" : "Turkish data was drawn from CoNLL 20032 and Malagasy data was collected from Das and Petrov (2011), in both cases using the same training configuration as above.",
      "startOffset" : 77,
      "endOffset" : 99
    }, {
      "referenceID" : 1,
      "context" : "For cross-lingual word embeddings, we evaluate two techniques from Ammar et al. (2016): CCA-based word embeddings and clusterbased word embeddings.",
      "startOffset" : 67,
      "endOffset" : 87
    }, {
      "referenceID" : 5,
      "context" : "For a more direct comparison, we include BILSTMDEBIAS (Fang and Cohn, 2016), applied using our proposed cross-lingual supervision based on dic-",
      "startOffset" : 54,
      "endOffset" : 75
    }, {
      "referenceID" : 5,
      "context" : "BILSTM-DEBIAS (Fang and Cohn, 2016)",
      "startOffset" : 14,
      "endOffset" : 35
    } ],
    "year" : 2017,
    "abstractText" : "Cross-lingual model transfer is a compelling and popular method for predicting annotations in a low-resource language, whereby parallel corpora provide a bridge to a high-resource language and its associated annotated corpora. However, parallel data is not readily available for many languages, limiting the applicability of these approaches. We address these drawbacks in our framework which takes advantage of cross-lingual word embeddings trained solely on a high coverage bilingual dictionary. We propose a novel neural network model for joint training from both sources of data based on cross-lingual word embeddings, and show substantial empirical improvements over baseline techniques. We also propose several active learning heuristics, which result in improvements over competitive benchmark methods.",
    "creator" : "LaTeX with hyperref package"
  }
}