{
  "name" : "1705.04187.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "On the role of words in the network structure of texts: application to authorship attribution",
    "authors" : [ "Camilo Akimushkina", "Diego R. Amancio", "Osvaldo N. Oliveira Jr." ],
    "emails" : [ "diego.raphael@gmail.com" ],
    "sections" : [ {
      "heading" : null,
      "text" : "Well-established automatic analyses of texts mainly consider frequencies of linguistic units, e.g. letters, words and bigrams, while methods based on cooccurrence networks consider the structure of texts regardless of the nodes label (i.e. the words semantics). In this paper, we reconcile these distinct viewpoints by introducing a generalized similarity measure to compare texts which accounts for both the network structure of texts and the role of individual words in the networks. We use the similarity measure for authorship attribution of three collections of books, each composed of 8 authors and 10 books per author. High accuracy rates were obtained with typical values from 90% to 98.75%, much higher than with the traditional the TF-IDF approach for the same collections. These accuracies are also higher than taking only the topology of networks into account. We conclude that the different properties of specific words on the macroscopic scale structure of a whole text are as relevant as their frequency of appearance; conversely, considering the identity of nodes brings further knowledge about a piece of text represented as a network.\nKeywords: complex networks, word semantics, authorship attribution, similarity measures 2010 MSC: 00-01, 99-00\n∗Corresponding author Email address: diego.raphael@gmail.com (Diego R. Amancio)\nPreprint submitted to Journal of LATEX Templates May 12, 2017\nar X\niv :1\n70 5.\n04 18\n7v 1\n[ cs\n.C L\n] 1\n1 M"
    }, {
      "heading" : "1. Introduction",
      "text" : "The huge volume of written text produced everyday makes it imperative to use automatic tools to retrieve relevant information, e.g. with text summarization, information retrieval methods, polarity analysis, citation analysis, and document classification [1, 2, 3, 4, 5, 6, 7]. An essential step in many of these tasks is to compare pieces of texts, as in classification of texts into categories [4] and in search engines where typically a list of texts relevant to a given query is retrieved. A special case is the pairwise comparison, where one searches for similarities between pairs of texts, which is actually a typical subtask in the authorship attribution process [8]. Automatic authorship attribution has been made with varied strategies [9], from the use of first-order statistics of linguistic elements to the processing of text represented as networks [10, 11]. For example, the frequency of characters [12, 13], phonemes [14], and morphemes [15, 16] has been explored, with texts normally modelled as lists of individual words, i.e. word order is disregarded. The archetype of such models is the so-called bag-of-words (BoW) model [17], where the text is represented as the set of its constitutive words by counting the number of appearances for each word. Word frequencies, which follow Zipf’s law [18, 19], can then be used straightforwardly as attributes in a machine learning scheme [20] or to further build specific similarity measures.\nVariations of the BoW model have been developed to address possible biases, e.g. the tendency of larger texts of being more likely to be considered similar to any other. These variations include the use of the term frequency-inverse document frequency (TF-IDF) statistic [21, 4], where lower relevance is assigned to words frequent in the document as well as in the whole collection. The model has also been modified to incorporate other kinds of data, such as in the bag-offeatures model used for image analysis [22]. Another important modification is to consider n-grams, i.e., groups of n adjacent words [23, 24], in an attempt to take syntactic information into account, since the BoW model disregards word ordering. In other types of work, the syntactic roles of the words in sentences\nare used for authorship attribution [25, 26]. It must be noted, nevertheless, that all of these approaches are based on the counting of features, even if some consider small-scale structural relationships.\nAn alternative perspective has been developed in recent years from the discovery that language features may be best described by complex networks models [27]. The structure of a text, for instance, can be mapped onto a co-occurrence network [10], which is characterized by power-law distributions [19, 28], and core-periphery structures [29]. Even though the general features of these complex networks remain analogous for texts in the same language, the network representation can also be used for classification tasks, particularly for authorship attribution [10, 30, 31].\nWhile the frequency-based methods overlook all structural relationships among\nwords farther than in the same sentence, the methods based on co-occurrence networks ignore the identity of the words (i.e. which actual word corresponds to a given node), thus characterizing the texts only on the basis of the network topology. In this study, we reconcile both viewpoints to show that, from a network perspective, words can play relevant roles in the structure of a text besides their frequencies."
    }, {
      "heading" : "2. Methods",
      "text" : "The methodology proposed to address the authorship attribution task consists of four steps: i) construct a co-occurrence network for each text; ii) obtain various distance matrices for the collection using the proposed similarity metrics (see below); iii) join the various distance matrices with multi-dimensional scaling [32]; and iv) analyze the resulting data with standard supervised learning algorithms [20]. These steps are described in detail below. The model was applied to three collections of 80 literary texts. Each collection contains 10 texts per author for 8 authors from the 19th century, with 22 of the 24 authors being native English writers (details of the collections are included in the Supporting Information)."
    }, {
      "heading" : "2.1. Network construction and characterization",
      "text" : "Texts are pre-processed for constructing the networks, with stopwords, such as articles and prepositions, being removed, and lemmatization being applied to reduce different forms to a common base form. Lemmatization is assisted by a part-of-speech tagger based on entropy maximization [33], in order to solve ambiguities in mapping words to their lemmatized form. From the resulting pre-processed text, a co-occurrence (or word adjacency) network is built, where each distinct word is a node and two nodes are connected if the words appear consecutively in the text. The link is directed according to the natural reading order. For instance, the title of this paper generates the network: role → word → network → structure → text → application → author → attribution. Each link has a default weight equal to one, which is increased by one unit each time the pair of words appears in the text.\nNetworks were characterized in this study by four well-known node-local\nmetrics:\n1. Degree (ki): this metric corresponds to the number of links attached to a\nnode. As a consequence of the construction rules imposed by co-occurrence networks, there is strong correlation between this metric and the word frequency.\n2. Average shortest path length (li): this is the typical distance between two\nnodes of the network, given by:\nli = N −1Σjdij , (1)\nwhere dij is the shortest path length between nodes i and j, and N is the number of nodes. This metric is useful to identify keywords in written texts, irrespectively of the word frequency [34]. Low values of l are not only associated to the frequent words, but also to the words appearing close to other relevant words in the text.\n3. Betweenness centrality (Bi): the betweenness is the fraction of all shortest\npaths that pass through the node, i.e.\nBi = ∑\ni 6=j 6=k\nn (i) jk njk , (2)\nwhere n (i) jk is the number of shortest paths from j to k passing through i and njk is the total number of shortest paths from j to k. In text analysis, the betweenness can be interpreted as a measure to quantify the ability of a word to appear in restrict or wider contexts [10].\n4. Intermittency (Ii): the intermittency is a measure that quantifies the spa-\ntial distribution of a given word along a text. To define this measure, consider the text as a sequence of tokens. This sequence generates, for each word i, a time series T (i) = {t(i)1 , t (i) 2 , . . . , t (i) fi }, where t(i)j corresponds to the position of the j-th occurrence of the word i. The interval recurrence (τ) for word i is defined as the spatial difference between two occurrences, i.e. τ (i) j = t (i) j −t (i) j−1. The set of all values of τ (i) j , i.e. T (i) = {τ (i) 1 , τ (i) 2 , . . .} is used to quantify the regularity of the appearance of i along the sequence of tokens. More specifically, this regularity is computed using the intermittency defined as:\nIi = σT /〈T 〉 = [ 〈T 2〉 〈T 〉2 − 1 ]1/2 , (3)\nwhere σT and 〈T 〉 are the standard deviation and average of T , respectively. In text networks, the intermittency also measures the relevance of words, since it has been shown that intermittent (i.e. bursty) words are the ones most related to the subject being approached [34]."
    }, {
      "heading" : "2.2. Similarity metrics",
      "text" : "The novelty introduced in this work is to compare the words representing the most relevant nodes in the network topology, in contrast to previous approaches where only the statistics of topological metrics were taken into account [10]. We consider as the most relevant the nodes possessing the highest degree and\nbetweenness. As for the other metrics, namely average shortest paths and intermittency, we chose the nodes with lowest values. We tested the largest shortest paths but the results were not as good. Intermittency obeys a power law with positive exponent. We hypothesize that two pieces of text will be similar if there is significant overlap in the words (nodes) considered most relevant in both texts.\nFigures 1 and 2 show the distributions of betweenness centralities for two books from Arthur Conan Doyle: The Memoirs of Sherlock Holmes and The Return of Sherlock Holmes, which could be expected to be similar since these books were written by the same author in the same series of novels. In both figures, the highest centralities belong to the same words (19 out of 20) which also occupy almost the same relative positions. We shall therefore test the hypothesis that not only the frequency of usage but also the long-scale topological metrics of the organization of words may be reliable signatures of authorship.\nTo quantify this we introduce a similarity measure between pairs of texts as follows: for each network metric considered we give a rank R to each word w from a subset V of top words with unique properties. In our approach the\nimportance of a word depends on the particular network metric considered. As mentioned above, we select the words with the highest connectivity and betweenness centrality, and with the smallest values of shortest path and intermittency. For these two latter metrics the smallest values were chosen because their distributions present power laws with positive coefficients. We choose sets of 100 top words since in subsidiary experiments we observed that the interval between 50 − 150 words gave the best results. A ranking is assigned to each word, starting with the maximum value (100 in this case) for the word with the most extreme value (e.g. “say” for the betweenness centrality of “The Memoirs of Sherlock Holmes”), and decreasing in one unit for each consecutive word until reaching the last of the top words which receives a ranking value of one. With these rankings, the similarity between two texts A and B for a given network metric is given by\nA ·B = ∑\nw∈VA∩VB\nRA(w)RB(w), (4)\nthat is, if a word is present in the top words subsets of both texts, the product of its rankings adds to their similarity.\nThis similarity metric is guaranteed to be high only if the same words occupy\nsimilar positions in the distributions such as in figures 1 and 2, with higher influence from the highest-ranked words. Equation 4 implies that the norm or similarity of a text with itself is always the same, that is, A ·A = B ·B = n(n+ 1)(2n+1)/6, where n is the size of V . We therefore normalize all similarities for this value to be one and the minimum value to be zero, and define the distance DAB between two texts as being one minus this normalized value. It is worth noting that other similarity metrics could be used to compare two pairs of texts, but the dot product adopted here appears to be the most straightforward, as it is done in bag-of-words methods [4].\nWith all the values DAB we produce a distance matrix for each metric. The distance matrix for the betweenness centrality of one of the collections is shown in figure 3, where the indices 0 to 9 correspond to texts from the first author, texts 10 to 19 to the second author and so on. Note that, in general, texts from the same author appear to be closer among themselves compared to texts from different authors even if they are relatively separated (e.g. texts 10 − 19 and 50− 59)."
    }, {
      "heading" : "2.3. Combining Distance Matrices",
      "text" : "One strength of the approach is the ability of observing different aspects of the network structure simultaneously. Each metric yields a different distance matrix; hence, we can observe the similarity between texts at different scales. We now combine information from the distinct metrics in order to have useful data for the classification algorithms.\nIn this study we employed two strategies for the input into the classification algorithms. In the first, we simply used the whole of the distance matrices for the different metrics, i.e. with distances as attributes. In the second strategy, we reduced the dimensionality of the distance metrics with Multi-dimensional scaling (MDS) [35], with the aim of capturing the highest similarities while eliminating possible unnecessary information that may harm the classification task. MDS was conceived to map distances into positions in a space so that the distances between these positions reproduce as well as possible the original input distances. The space obtained is usually intended to have a small dimensionality and the algorithm is largely used for visualization purposes. The positions obtained when applying the algorithm to map one of the distance matrices to a two-dimensional space is presented in figure 4 reflecting the similarities between same-author texts already observed with the distance matrices. We use MDS to map the four distance matrices of each collection into four subspaces and then join these subspaces into a space of bigger dimension: if we write the positions in each subspace as a matrix M ×Ni where M is the number of points (80 texts per collection in our case) and Ni is the dimensionality of the subspace, then the positions in the total space are given by a matrix M × (N1 +N2 +N3 +N4) where each row is composed joining head to tail the corresponding rows of the positions on the subspaces.\nInstead of a bi-dimensional mapping such as that of figure 4, the dimensionalities Ni are calculated based on the stress or cost function (the difference between the actual and the obtained distances). As stress is a monotonically decreasing function of the number of dimensions we set a threshold of 10% of the value for one dimension (also known as the elbow method) which was usually\nfound to be reached at Ni = 6."
    }, {
      "heading" : "2.4. Data analysis",
      "text" : "The final positions on the composed space are the attributes for the data analysis algorithms. Analysis is done with supervised learning algorithms from the main types currently in use: tree-based J48; K-Nearest Neighbors (KNN); Naive Bayesian (NB); and Radial Basis Function Network (RBFN). For all cases 10-fold cross validation is applied and the parameters are set to their default values [20]. For KNN the number of neighbors is set to three which is the smallest odd non-trivial value. For RBFN the number of clusters is set to eight which is the number of authors. Authorship is also addressed using the standard TF-IDF model. Since TF-IDF returns a distance matrix, we also use MDS in this single matrix in order to apply the same classification algorithms on both approaches."
    }, {
      "heading" : "3. Results and Discussion",
      "text" : "The approach based on distance matrices as input for the classification algorithms was applied for the three collections, for which the success score for classification by chance is 1/8 = 12.5%. The results are outstanding as shown in table 1, especially when MDS was used. It seems therefore that reducing the dimensionality actually amounted to an efficient feature selection, probably eliminating data that brought noise to the analysis. With MDS, typical accuracy rates were above 90% and the maximum value was 98.75% obtained with KNN for the third collection which corresponds to only one text (out of 80) not correctly classified. These scores greatly surpassed the values obtained by applying the TF-IDF method, for which the mean scores among collections were 36.67% for J48, 66.25% for KNN, 63.75% for NB, and 65% for RBFN, as shown in figure 5. These scores demonstrate the added value of using the network structure over relying only on the frequency of appearance of features. Significantly, the higher scores for the approach introduced here are maintained when changing the classification algorithm (KNN, NB, and RBFN), which indicates the robustness of the proposed metrics. Also worth noting is that the present approach outperforms a previous one where the topology of networks was taken without considering the labels of the nodes (words) [31], for which the accuracy rates for the second collection studied here were 63.75% with J48, 88.75% with KNN, 81.25% with NB, and 83.75% with RBFN. In addition, the approach presented is less demanding, both computationally and conceptually, than the previous one.\nTaken together, the results indicate that, apart from the frequency of appearance and syntactical relations, certain words are essential to the structure of a text as a whole. The procedure to identify such words using complex networks has been successful, since utilization of these words is author-dependent. The co-occurrence network procedure allows one to observe the features of a word at different scales in the text. For instance, words with low intermittency, i.e. whose appearance in the text is highly periodic, had a high relevance for\nthe authorship attribution, even though a word can have a low intermittency and not appear in most paragraphs.\nOurs is a unified framework for multivariate analysis of texts. In contrast to other multivariate approaches, the generalized similarity measure 4 allows to easily introduce new features to the scheme using some of the many nodelocal network metrics in existence. Care must be taken, however, because not all metrics are useful and some can even lower the performance. For example, we tested the clustering coefficient (characterized by a bell-shaped distribution) and eigenvalue centrality without success. Even though the computation of the similarity measures between documents resembles that of TF-IDF (i.e. cosine similarity) there are significant differences, mainly the fact that the vectors are of a much smaller size and that there are no repeated values. A question to be further studied is the optimal ranking procedure: we chose a ranking a la Zipf because of the presence of power law distributions, but other rankings could be possible. While both TF-IDF and our method account for the heterogeneity of sizes of texts, our ranking procedure has two principal advantages: computation is faster and most importantly, the ranking does not have to be repeated every time the collection is modified, which is especially advantageous with big collections."
    }, {
      "heading" : "4. Conclusions",
      "text" : "We have introduced an approach by which the representation of text with complex networks is enhanced by considering the words corresponding to the nodes. This is done with a similarity metric to compare two pieces of text where the presence of the most relevant words, according to network metrics, is taken into account. When the distance matrices obtained with the similarity metrics were used as input into machine learning algorithms, a high accuracy was achieved which reached 98.75% for one of the book collections. Significantly, the accuracy was considerably higher than for traditional methods based on TFIDF, being also higher than other network approaches that did not consider the\nlabel of the nodes. Also relevant is that the performance was improved with dimensionality reduction with MDS, which is advantageous owing to the lower computational cost.\nWith regard to the limitations, one should emphasize that the present approach is not useful for very short texts (such as a summary of an article). The method can be extended to employ other metrics and multi-node distributions. As some authors have pointed out [36], it is likely that every person has a characteristic writing fingerprint owing to their particular way to learn a language. If this is the case, the traits that define such fingerprint are probably complex and not bounded to one single measure. Finally, the approach proposed could be used for such other applications as part-of-speech analysis of network distributions and resolution of word polysemy."
    }, {
      "heading" : "Acknowledgments",
      "text" : "This work was supported by CNPq (Brazil) and FAPESP (grants 2014/20830-\n0, 2013/14262-7 and 2016/19069-9)."
    } ],
    "references" : [ {
      "title" : "D",
      "author" : [ "T.C. Silva" ],
      "venue" : "R. Amancio, EPL (Europhysics Letters) 98 ",
      "citeRegEx" : "2",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "L",
      "author" : [ "X. Zhong", "J. Liu", "Y. Gao" ],
      "venue" : "Wu, Physica A 466 ",
      "citeRegEx" : "3",
      "shortCiteRegEx" : null,
      "year" : 2017
    }, {
      "title" : "H",
      "author" : [ "C.D. Manning", "P. Raghavan" ],
      "venue" : "Schütze, et al., Introduction to information retrieval, volume 1, Cambridge university press Cambridge",
      "citeRegEx" : "4",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "I",
      "author" : [ "M.Z. Asghar", "A. Khan", "S. Ahmad", "M. Qasim" ],
      "venue" : "A. Khan, PLoS One 12 ",
      "citeRegEx" : "5",
      "shortCiteRegEx" : null,
      "year" : 2017
    }, {
      "title" : "O",
      "author" : [ "D.R. Amancio" ],
      "venue" : "N. Oliveira Jr., L. F. Costa, Journal of Informetrics 6 ",
      "citeRegEx" : "6",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "L",
      "author" : [ "M.P. Viana", "D.R. Amancio" ],
      "venue" : "F. Costa, Journal of Informetrics 7 ",
      "citeRegEx" : "7",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Foundations and Trends in information Retrieval",
      "author" : [ "P. Juola" ],
      "venue" : null,
      "citeRegEx" : "8",
      "shortCiteRegEx" : "8",
      "year" : 2006
    }, {
      "title" : "Soc",
      "author" : [ "E. Stamatatos", "J. Am" ],
      "venue" : "Inf. Sci. Technol. 60 ",
      "citeRegEx" : "9",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "L",
      "author" : [ "D.R. Amancio", "E.G. Altmann", "O.N. Oliveira Jr" ],
      "venue" : "F. Costa, New Journal of Physics 13 ",
      "citeRegEx" : "10",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "D",
      "author" : [ "O.V. Kukushkina", "A. Polikarpov" ],
      "venue" : "V. Khmelev, Problems of Information Transmission 37 ",
      "citeRegEx" : "15",
      "shortCiteRegEx" : null,
      "year" : 2001
    }, {
      "title" : "The psycho-biology of language",
      "author" : [ "G.K. Zipf" ],
      "venue" : "Houghton, Mifflin",
      "citeRegEx" : "18",
      "shortCiteRegEx" : null,
      "year" : 1935
    }, {
      "title" : "R",
      "author" : [ "R. Ferrer-i Cancho" ],
      "venue" : "V. Solé, Journal of Quantitative Linguistics 8 ",
      "citeRegEx" : "19",
      "shortCiteRegEx" : null,
      "year" : 2001
    }, {
      "title" : "L",
      "author" : [ "D.R. Amancio", "C.H. Comin", "D. Casanova", "G. Travieso", "O.M. Bruno", "F.A. Rodrigues" ],
      "venue" : "F. Costa, PLoS One 9 ",
      "citeRegEx" : "20",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "M",
      "author" : [ "J. Zhang" ],
      "venue" : "Marsza  lek, S. Lazebnik, C. Schmid, International journal of computer vision 73 ",
      "citeRegEx" : "22",
      "shortCiteRegEx" : null,
      "year" : 2007
    }, {
      "title" : "D",
      "author" : [ "R. Clement" ],
      "venue" : "Sharp, Literary and linguistic computing 18 ",
      "citeRegEx" : "24",
      "shortCiteRegEx" : null,
      "year" : 2003
    }, {
      "title" : "F",
      "author" : [ "H. Baayen", "H. Van Halteren" ],
      "venue" : "Tweedie, Literary and Linguistic Computing 11 ",
      "citeRegEx" : "25",
      "shortCiteRegEx" : null,
      "year" : 1996
    }, {
      "title" : "H",
      "author" : [ "J. Cong" ],
      "venue" : "Liu, Physics of Life Reviews 11 ",
      "citeRegEx" : "27",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Proceedings of the Royal Society of London",
      "author" : [ "S.N. Dorogovtsev", "J.F.F. Mendes" ],
      "venue" : "Series B: Biological Sciences 268 ",
      "citeRegEx" : "28",
      "shortCiteRegEx" : null,
      "year" : 2001
    }, {
      "title" : "A",
      "author" : [ "A. Mehri", "A.H. Darooneh" ],
      "venue" : "Shariati, Physica A 391 ",
      "citeRegEx" : "30",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "O",
      "author" : [ "C. Akimushkin", "D.R. Amancio" ],
      "venue" : "N. Oliveira Jr., PLoS One 12 ",
      "citeRegEx" : "31",
      "shortCiteRegEx" : null,
      "year" : 2017
    }, {
      "title" : "Modern Multidimensional Scaling: Theory and Applications",
      "author" : [ "I. Borg", "P. Groenen" ],
      "venue" : "Springer",
      "citeRegEx" : "32",
      "shortCiteRegEx" : null,
      "year" : 2005
    }, {
      "title" : "G",
      "author" : [ "B.B. Greene" ],
      "venue" : "M. Rubin, Automatic grammatical tagging of english",
      "citeRegEx" : "33",
      "shortCiteRegEx" : null,
      "year" : 1971
    }, {
      "title" : "A",
      "author" : [ "M. Ortuno", "P. Carpena", "P. Bernaola-Galvn", "E. Muoz" ],
      "venue" : "M. Somoza, EPL (Europhysics Letters) 57 ",
      "citeRegEx" : "34",
      "shortCiteRegEx" : null,
      "year" : 2002
    }, {
      "title" : "A",
      "author" : [ "H. Van Halteren", "H. Baayen", "F. Tweedie", "M. Haverkort" ],
      "venue" : "Neijt, Journal of Quantitative Linguistics 12 ",
      "citeRegEx" : "36",
      "shortCiteRegEx" : null,
      "year" : 2005
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "with text summarization, information retrieval methods, polarity analysis, citation analysis, and document classification [1, 2, 3, 4, 5, 6, 7].",
      "startOffset" : 122,
      "endOffset" : 143
    }, {
      "referenceID" : 1,
      "context" : "with text summarization, information retrieval methods, polarity analysis, citation analysis, and document classification [1, 2, 3, 4, 5, 6, 7].",
      "startOffset" : 122,
      "endOffset" : 143
    }, {
      "referenceID" : 2,
      "context" : "with text summarization, information retrieval methods, polarity analysis, citation analysis, and document classification [1, 2, 3, 4, 5, 6, 7].",
      "startOffset" : 122,
      "endOffset" : 143
    }, {
      "referenceID" : 3,
      "context" : "with text summarization, information retrieval methods, polarity analysis, citation analysis, and document classification [1, 2, 3, 4, 5, 6, 7].",
      "startOffset" : 122,
      "endOffset" : 143
    }, {
      "referenceID" : 4,
      "context" : "with text summarization, information retrieval methods, polarity analysis, citation analysis, and document classification [1, 2, 3, 4, 5, 6, 7].",
      "startOffset" : 122,
      "endOffset" : 143
    }, {
      "referenceID" : 5,
      "context" : "with text summarization, information retrieval methods, polarity analysis, citation analysis, and document classification [1, 2, 3, 4, 5, 6, 7].",
      "startOffset" : 122,
      "endOffset" : 143
    }, {
      "referenceID" : 2,
      "context" : "An essential step in many of these tasks is to compare pieces of texts, as in classification of texts into categories [4] and in search engines where typically a list of texts relevant to a given query is retrieved.",
      "startOffset" : 118,
      "endOffset" : 121
    }, {
      "referenceID" : 6,
      "context" : "A special case is the pairwise comparison, where one searches for similarities between pairs of texts, which is actually a typical subtask in the authorship attribution process [8].",
      "startOffset" : 177,
      "endOffset" : 180
    }, {
      "referenceID" : 7,
      "context" : "Automatic authorship attribution has been made with varied strategies [9], from the use of first-order statistics of linguistic elements to the processing of text represented as networks [10, 11].",
      "startOffset" : 70,
      "endOffset" : 73
    }, {
      "referenceID" : 8,
      "context" : "Automatic authorship attribution has been made with varied strategies [9], from the use of first-order statistics of linguistic elements to the processing of text represented as networks [10, 11].",
      "startOffset" : 187,
      "endOffset" : 195
    }, {
      "referenceID" : 9,
      "context" : "For example, the frequency of characters [12, 13], phonemes [14], and morphemes [15, 16] has been explored, with texts normally modelled as lists of individual words, i.",
      "startOffset" : 80,
      "endOffset" : 88
    }, {
      "referenceID" : 10,
      "context" : "Word frequencies, which follow Zipf’s law [18, 19], can then be used straightforwardly as attributes in a machine learning scheme [20] or to further build specific similarity measures.",
      "startOffset" : 42,
      "endOffset" : 50
    }, {
      "referenceID" : 11,
      "context" : "Word frequencies, which follow Zipf’s law [18, 19], can then be used straightforwardly as attributes in a machine learning scheme [20] or to further build specific similarity measures.",
      "startOffset" : 42,
      "endOffset" : 50
    }, {
      "referenceID" : 12,
      "context" : "Word frequencies, which follow Zipf’s law [18, 19], can then be used straightforwardly as attributes in a machine learning scheme [20] or to further build specific similarity measures.",
      "startOffset" : 130,
      "endOffset" : 134
    }, {
      "referenceID" : 2,
      "context" : "These variations include the use of the term frequency-inverse document frequency (TF-IDF) statistic [21, 4], where lower relevance is assigned to words frequent in the document as well as in the whole collection.",
      "startOffset" : 101,
      "endOffset" : 108
    }, {
      "referenceID" : 13,
      "context" : "The model has also been modified to incorporate other kinds of data, such as in the bag-offeatures model used for image analysis [22].",
      "startOffset" : 129,
      "endOffset" : 133
    }, {
      "referenceID" : 14,
      "context" : ", groups of n adjacent words [23, 24], in an attempt to take syntactic information into account, since the BoW model disregards word ordering.",
      "startOffset" : 29,
      "endOffset" : 37
    }, {
      "referenceID" : 15,
      "context" : "are used for authorship attribution [25, 26].",
      "startOffset" : 36,
      "endOffset" : 44
    }, {
      "referenceID" : 16,
      "context" : "An alternative perspective has been developed in recent years from the discovery that language features may be best described by complex networks models [27].",
      "startOffset" : 153,
      "endOffset" : 157
    }, {
      "referenceID" : 8,
      "context" : "The structure of a text, for instance, can be mapped onto a co-occurrence network [10], which is characterized by power-law distributions [19, 28], and core-periphery structures [29].",
      "startOffset" : 82,
      "endOffset" : 86
    }, {
      "referenceID" : 11,
      "context" : "The structure of a text, for instance, can be mapped onto a co-occurrence network [10], which is characterized by power-law distributions [19, 28], and core-periphery structures [29].",
      "startOffset" : 138,
      "endOffset" : 146
    }, {
      "referenceID" : 17,
      "context" : "The structure of a text, for instance, can be mapped onto a co-occurrence network [10], which is characterized by power-law distributions [19, 28], and core-periphery structures [29].",
      "startOffset" : 138,
      "endOffset" : 146
    }, {
      "referenceID" : 8,
      "context" : "Even though the general features of these complex networks remain analogous for texts in the same language, the network representation can also be used for classification tasks, particularly for authorship attribution [10, 30, 31].",
      "startOffset" : 218,
      "endOffset" : 230
    }, {
      "referenceID" : 18,
      "context" : "Even though the general features of these complex networks remain analogous for texts in the same language, the network representation can also be used for classification tasks, particularly for authorship attribution [10, 30, 31].",
      "startOffset" : 218,
      "endOffset" : 230
    }, {
      "referenceID" : 19,
      "context" : "Even though the general features of these complex networks remain analogous for texts in the same language, the network representation can also be used for classification tasks, particularly for authorship attribution [10, 30, 31].",
      "startOffset" : 218,
      "endOffset" : 230
    }, {
      "referenceID" : 20,
      "context" : "The methodology proposed to address the authorship attribution task consists of four steps: i) construct a co-occurrence network for each text; ii) obtain various distance matrices for the collection using the proposed similarity metrics (see below); iii) join the various distance matrices with multi-dimensional scaling [32]; and iv) analyze the resulting data with standard supervised learning algorithms [20].",
      "startOffset" : 322,
      "endOffset" : 326
    }, {
      "referenceID" : 12,
      "context" : "The methodology proposed to address the authorship attribution task consists of four steps: i) construct a co-occurrence network for each text; ii) obtain various distance matrices for the collection using the proposed similarity metrics (see below); iii) join the various distance matrices with multi-dimensional scaling [32]; and iv) analyze the resulting data with standard supervised learning algorithms [20].",
      "startOffset" : 408,
      "endOffset" : 412
    }, {
      "referenceID" : 21,
      "context" : "Lemmatization is assisted by a part-of-speech tagger based on entropy maximization [33], in order to solve ambiguities in mapping words to their lemmatized form.",
      "startOffset" : 83,
      "endOffset" : 87
    }, {
      "referenceID" : 22,
      "context" : "This metric is useful to identify keywords in written texts, irrespectively of the word frequency [34].",
      "startOffset" : 98,
      "endOffset" : 102
    }, {
      "referenceID" : 8,
      "context" : "In text analysis, the betweenness can be interpreted as a measure to quantify the ability of a word to appear in restrict or wider contexts [10].",
      "startOffset" : 140,
      "endOffset" : 144
    }, {
      "referenceID" : 22,
      "context" : "bursty) words are the ones most related to the subject being approached [34].",
      "startOffset" : 72,
      "endOffset" : 76
    }, {
      "referenceID" : 8,
      "context" : "Similarity metrics The novelty introduced in this work is to compare the words representing the most relevant nodes in the network topology, in contrast to previous approaches where only the statistics of topological metrics were taken into account [10].",
      "startOffset" : 249,
      "endOffset" : 253
    }, {
      "referenceID" : 2,
      "context" : "It is worth noting that other similarity metrics could be used to compare two pairs of texts, but the dot product adopted here appears to be the most straightforward, as it is done in bag-of-words methods [4].",
      "startOffset" : 205,
      "endOffset" : 208
    }, {
      "referenceID" : 12,
      "context" : "For all cases 10-fold cross validation is applied and the parameters are set to their default values [20].",
      "startOffset" : 101,
      "endOffset" : 105
    }, {
      "referenceID" : 19,
      "context" : "Also worth noting is that the present approach outperforms a previous one where the topology of networks was taken without considering the labels of the nodes (words) [31], for which the accuracy rates for the second collection studied here were 63.",
      "startOffset" : 167,
      "endOffset" : 171
    }, {
      "referenceID" : 23,
      "context" : "As some authors have pointed out [36], it is likely that every person has a characteristic writing fingerprint owing to their particular way to learn a language.",
      "startOffset" : 33,
      "endOffset" : 37
    } ],
    "year" : 2017,
    "abstractText" : "Well-established automatic analyses of texts mainly consider frequencies of linguistic units, e.g. letters, words and bigrams, while methods based on cooccurrence networks consider the structure of texts regardless of the nodes label (i.e. the words semantics). In this paper, we reconcile these distinct viewpoints by introducing a generalized similarity measure to compare texts which accounts for both the network structure of texts and the role of individual words in the networks. We use the similarity measure for authorship attribution of three collections of books, each composed of 8 authors and 10 books per author. High accuracy rates were obtained with typical values from 90% to 98.75%, much higher than with the traditional the TF-IDF approach for the same collections. These accuracies are also higher than taking only the topology of networks into account. We conclude that the different properties of specific words on the macroscopic scale structure of a whole text are as relevant as their frequency of appearance; conversely, considering the identity of nodes brings further knowledge about a piece of text represented as a network.",
    "creator" : "LaTeX with hyperref package"
  }
}