{
  "name" : "1706.04206.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Identifying Condition-Action Statements in Medical Guidelines Using Domain-Independent Features",
    "authors" : [ ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : null,
      "text" : "ar X\niv :1\n70 6.\n04 20\n6v 2\n[ cs\n.C L\n] 2\n1 Ju\nn 20"
    }, {
      "heading" : "Introduction",
      "text" : "Clinical decision-support system (CDSS) is any computer system intended to provide decision support for healthcare professionals, and using clinical data or knowledge (Musen, Middleton, and Greenes 2014). The classic problem of diagnosis is only one of the clinical decision problems. Deciding which questions to ask, tests to order, procedures to perform, treatment to indicate, or which alternative medical care to try, are other examples of clinical decisions. CDSSs generally fall into two categories (Musen, Middleton, and Greenes 2014)\n• Determining ”what is true” about a patient (usually what the correct diagnosis is).\n• Determining ”what to do” for the patient (usually what test to order, whether to treat, or what therapy plan to institute).\nMost of the questions physicians need to consult about with CDSSs are from the latter category. Medical guidelines (also known as clinical guidelines, clinical protocols or clinical practice guidelines) are most useful at the point of care and answering to ”what to do” questions. Medical guidelines are systematically developed statements to assist with practitioners’ and patients’ decisions. They establish criteria regarding diagnosis, management, and treatment in specific areas of healthcare. For example, a sentence such as ”if the A1C is 7.0% and a repeat result is 6.8%, the diagnosis of diabetes is confirmed” in medical guidelines determines what is true about a patient. Sentences such as ”Topical and oral decongestants and antihistamines should be avoided in patients with ABRS” guide what to do or not to do with a patient. These examples illustrate conditions, criteria applicable to patients, and consequences of\nthe conditions. The consequences may refer to activities, effects, intentions, or events. If a guideline-based CDSS needs to answer ”what to do” questions, it has to have access to condition-action statements describing under what circumstances an action can be performed. Medical guidelines contain many condition-action statements. Condition-action statements provide information about expected process flow. If a guideline-based CDSS could extract and formalize these statements, it could help practitioners in the decision-making process. For example, it could help automatically asses the relationship between therapies, guidelines and outcomes, and in particular could help the impact of changing guidelines. However, completely automated extraction of conditionaction statements does not seem possible. This is due among other things to the variety of linguistic expressions used in condition-action sentences. For example, they are not always in form of ”{if} condition {then} action”. In the sentence ”Conditions that affect erythrocyte turnover and hemoglobin variants must be considered, particularly when the A1C result does not correlate with the patient’s clinical situation”, we have a condition-action sentence without an ”{if}” term. We propose a supervised machine learning model classifying sentences as to whether they express a condition or not. After we determine a sentence contain a condition, we use natural language processing and information extraction tools to extract conditions and resulting activities. With the help of a domain expert, we annotated three sets of guidelines to create gold standards to measure the performance of our condition-action extracting models. The sets of guidelines are: hypertension (PA et al. 2014), chapter4 of asthma (Network and others 2008), and rhinosinusitis (Chow et al. 2012). Chapter 4 of asthma guidelines was selected for comparison with prior work of Wenzina and Kaiser (Wenzina and Kaiser 2013). We have annotated the guidelines for the conditions, consequences, modifiers of conditions, and type of consequences. These annotate sets of guidelines are available for experiments https://www.dropbox.com/.\nRelated Work\nWe will briefly discuss the modeling and annotation of condition-action for medical usage in this section. Our cor-\npus and method of identifying conditions in clinical guidelines is explained in section 3. Research on CIGs started about 20 years ago and became more popular in the late-1990s and early 2000s. Different approaches have been developed to represent and execute clinical guidelines over patient-specific clinical data. They include document-centric models, decision trees and probabilistic models, and ”Task-Network Models”(TNMs) (Peleg et al. 2003), which represent guideline knowledge in hierarchical structures containing networks of clinical actions and decisions that unfold over time. Serban et. al (Serban et al. 2007) developed a methodology for extracting and using linguistic patterns in guideline formalization, to aid the human modellers in guideline formalization and reduce the human modelling effort. Kaiser et. al (Kaiser, Seyfang, and Miksch 2011) developed a method to identify activities to be performed during a treatment which are described in a guideline document. They used relations of the UMLS Semantic Network (McCray 1989) to identify these activities in a guideline document. Wenzina and Kaiser (Wenzina and Kaiser 2013) developed a rule-based method to automatically identifying conditional activities in guideline documents.They achieved a recall of 75% and a precision of 88% on chapter 4 of asthma guidelines which was mentioned before."
    }, {
      "heading" : "Condition-Action Extraction",
      "text" : "Medical guidelines condition-action statements provide information to determine ”what to do” with a patient. Other types of consequences of a condition in a sentence may help practitioner to find what is true about a patient. In this paper, we propose an automated process to find and extract condition-action statements from medical guidelines. We employed NLP tools and concepts in the process to achieve more general models. We define the task as classification task. Given an input statement, classify it to one of the three categories: NC (no condition) if the statement doesnt have a condition; CA if the statement is a condition-action sentence; and CC (conditionconsequence) if the statement has a condition which has a non-action consequence. For a CDSS, to determine both ”what is true” about a patient and ”what to do” with a patient, CC and CA statements can be merged to one category. There are limitations in this specification of classification categories. For example, guidelines may contain statements with a condition referring to a consequence in another statement. Or, we can see condition and effect in two different sentences: ”However, there are some cases for which the results for black persons were different from the results for the general population (question 3, evidence statements 2, 10, and 17). In those cases, separate evidence statements were developed.” In this work we focus only on statements that follow the above sentence categorization rules. This allows us to make clear comparison to prior work e.g. by Wenzina and Kaiser (Wenzina and Kaiser 2013). They annotated chapter 4 of asthma and other guidelines. They used information extraction rules and semantic pattern rules to extract conditional activities, condition-action statements. We use POS tags as\nfeatures in the classification models. In our opinion, using POS tags instead of semantic pattern rules makes our model more domain-independent, and therefore more suitable for establishing baselines, not only for text mining of medical guidelines but also in other domains, such as text mining of business rules. But we also expect to improve the performance of our extraction programs by adding semantic and discourse information (this work is ongoing)."
    }, {
      "heading" : "Classification",
      "text" : "Most of the condition-action sentences have a modifier in the sentences. For example, in ”In the population aged 18 years or older with CKD and hypertension, initial (or addon) antihypertensive treatment should include an ACEI or ARB to improve kidney outcomes”, we have ”the population aged 18 years or older with CKD and hypertension” as a condition and ”{in}” is the modifier. ”If”, ”in”, ”for”, ”to”, ”which”, and ”when” are the most frequent modifiers in our guidelines. We used CoreNLP (Manning et al. 2014) Shift-Reduce Constituency Parser to parse sentences in guidelines. As we mentioned, ”if”, ”in”, ”for”, ”to”, ”which”, and ”when” are the most frequent modifiers in our guidelines. ”If”, ”in”, and ”for” are tagged as ”IN” which represents preposition or subordinating conjunction. ”To” is tagged as ”TO” and ”when” and ”which” are tagged as ”WHADV”. We used regular expressions to find those parses which are promising candidates for extraction of condition-action pairs; for example, we selected sentences which include these tags: IN, TO and WHADVP. We extracted part of speech (POS) tags as our features for our model. Each candidate sentence has at least one candidate condition part. We extract these parts by regular expressions. Each part of sentence which starts with below patterns is a candidate condition part:\n• ”\\((SBAR—PP) \\(IN”\n• ”\\(SBAR \\(WHADVP”\n• ”\\(PP \\(TO”\nFor example, ”(ROOT (S (PP (IN In) (NP (NP (NNS adults)) (PP (IN with) (NP (NN hypertension))))) (, ,) (VP (VBZ does) (S (VP (VBG initiating) (S (NP (NP (JJ antihypertensive) (JJ pharmacologic) (NN therapy)) (PP (IN at) (NP (JJ specific) (NN BP) (NNS thresholds)))) (VP (VBP improve) (NP (NN health) (NNS outcomes))))))) (. ?)))” is the constituent parsed tree of ”In adults with hypertension, does initiating antihypertensive pharmacologic therapy at specific BP thresholds improve health outcomes?”. ”(PP (IN In) (NP (NP (NNS adults)) (PP (IN with) (NP (NN hypertension)))))” and ”(PP (IN at) (NP (JJ specific) (NN BP) (NNS thresholds)))” are two candidate condition parts in this example. We created features for our model based on POS tags and their combinations. The sets of features and the combinations are learned automatically from annotated examples. We used these novel features to make our model more domain-independent. For each sentence, we extracted POS tags, sequences of 3 POS tags, and combination of all POS tags of candidate\nconditions as features. For example, ”PP IN NP NP NNS PP IN NP NN PPINNP INNPNP NPNPNNS NPNNSPP NNSPPIN PPINNP INNPNN PPINNPNPNNSPPINNPNN PP IN NP NN PPINNP INNPNN PPINNPNN PP IN NP JJ NN NNS PPINNP INNPJJ NPJJNN JJNNNNS PPINNPJJNNNNS” represents ”In adults with hypertension, does initiating antihypertensive pharmacologic therapy at specific BP thresholds improve health outcomes?” in our model. Note that the glued together part of speech tags are not a formatting error but features automatically derived by our model (from consecutive part of speech tags)."
    }, {
      "heading" : "Evaluation",
      "text" : ""
    }, {
      "heading" : "Gold Standard Datasets",
      "text" : "We use three medical guidelines documents to create gold standard datasets. They provide statements, tables, and figures about hypertension, rhinosinusitis, and asthma. The creation of the gold standard datasets is described below in detail. Our data preparation process proceeded as follows: We started by converting the guidelines from PDF or html to text format, editing sentences only to manage conversion errors, the majority of which were bullet points. Tables and some figures pose a problem, and we are simply treating them as unstructured text. We are not dealing at this time with the ambiguities introduced by this approach; we do have plans to address it in future work.\nUsing regular expressions, as described above, we selected candidate sentences from text files. Note that candidate sentences do not always include a modifier such as ”if” or ”in”. For example, in ”Patients on long-term steroid tablets (e.g. longer than three months) or requiring frequent courses of steroid tablets (e.g. three to four per year) will be at risk of systemic side-effects”, there is no modifier in the sentence.\nThe annotation of the guidelines text (the next step), focused on determining whether there were condition statements in the candidate sentences or not. The instruction to the annotators were to try to paraphrase candidate sentences as sentences with ”if condition, then consequence”. If the transformed/paraphrased sentence conveyed the same meaning as the original, we considered to be a conditionconsequence sentence. Then we we could annotate condition and consequence parts. For example, we paraphrased ”Beta-blockers, including eye drops, are contraindicated in patients with asthma” to ”If patients have asthma, then betablockers, including eye drops, are contraindicated”. The paraphrased sentence conveys same meaning. So it became a condition-consequence sentence in our dataset. On the other hand, for example, we cannot paraphrase ”Further, the diagnostic criteria for CKD do not consider age-related decline in kidney function as reflected in estimated GFR” to an if-then sentence.\nWe also annotated the type of sentences based on their semantics: We classified them into three classes: conditionaction, condition-consequence(effect, intention, and event) and action. Examples are shown in table 1. Each sentence was annotated by one domain expert and us\n(and the disagreements where less than 10 percent). Table 2 shows the statistics of the annotated sentences for 3 different medical guidelines."
    }, {
      "heading" : "Model Performance",
      "text" : "Hypertension, asthma, and rhinosinusitis guidelines and gold standard datasets were applied to evaluate our model. Since two of these annotated corpora are new, our model is establishing a baseline. The asthma corpus was investigated previously by (Wenzina and Kaiser 2013). We extracted candidate statements by applying aforementioned regex on POS tags. Hypertension, asthma, and rhinosinusitis guidelines had 278, 172, and 761 candidate statements respectively. By applying this filtering subtask, we get rid of 38, 116, and 5 no condition statement respectively from guidelines. We used Weka (Hall et al. 2009) classifiers to create our models. ZeroR, Nave Bayes, J48, and random forest classifiers were applied in our project. Table 3, 4, and 5 show the results of classifiers for each guidelines.The results are based on 10-fold cross-validation on respective datasets.\nHypertension Condition-Action Total Precision Recall F-measure Precision\nZeroR 0 0 0 0.72 NaiveBayes 0.581 0.397 0.472 0.74 J48 0.619 0.413 0.495 0.74 RandomForest 0.931 0.429 0.587 0.81\nTable 5: Classification results on hypertension guidelines\nThe results show that generally random forest classifier seems to work best in extracting Condition-Action statements.\nNotice that these results are lower than previously reported by (Wenzina and Kaiser 2013). The difference is due to our using of completely automated feature selection when training on an annotated corpus, and not relying onmanually created extraction rules. In addition, their results demonstrate recalls on activities with specific patterns. If we consider all activities in their annotated corpus, their recall will be 56%. And if we apply their approach on our annotated corpus, the recall will be 39%. In ongoing work we hope to reduce or close this gap by adding semantic and discourse information to our feature sets."
    }, {
      "heading" : "Conclusions and Future Work",
      "text" : "We investigated the problem of automated extraction of condition-action from clinical guidelines based on an annotated corpus. We proposed a simple supervised model which classifies statements based on combinations of part of speech tags used as features. We showed results of classifiers using this model on three different annotated datasets which we created. We release these dataset for others to use.\nObviously, this is very preliminary work. Our work established baselines for automated extraction of conditionaction rules from medical guidelines, but its performance is still inferior to a collection of manually created extraction rules. To close this gap we are currently augmenting our model with semantic information along the lines of (Kaiser, Seyfang, and Miksch 2011) and (Wenzina and Kaiser 2013). In addition, we are beginning to experiment with some discourse relations – these are important, for example, in understanding of lists and tables. We also plan to make our annotated datasets more convenient to use by re-annotating them with standard annotation tools e.g. BRAT (Stenetorp et al. 2012).\n[Hall et al. 2009] Hall, M.; Frank, E.; Holmes, G.; Pfahringer, B.; Reutemann, P.; and Witten, I. H. 2009. The weka data mining software: an update. ACM SIGKDD explorations newsletter 11(1):10–18.\n[Kaiser, Seyfang, and Miksch 2011] Kaiser, K.; Seyfang, A.; and Miksch, S. 2011. Identifying treatment activities for modelling computer-interpretable clinical practice guidelines. In Knowledge Representation for Health-Care. Springer. 114–125.\n[Manning et al. 2014] Manning, C. D.; Surdeanu, M.; Bauer, J.; Finkel, J.; Bethard, S. J.; and McClosky, D. 2014. The Stanford CoreNLP natural language processing toolkit. In Proceedings of 52nd Annual Meeting of the Association for Computational Linguistics: System Demonstrations, 55–60.\n[McCray 1989] McCray, A. T. 1989. The umls semantic network. In Proceedings/the... Annual Symposium on Computer Application [sic] in Medical Care. Symposium on Computer Applications in Medical Care, 503–507. American Medical Informatics Association.\n[Musen, Middleton, and Greenes 2014] Musen, M. A.; Middleton, B.; and Greenes, R. A. 2014. Clinical decisionsupport systems. In Biomedical informatics. Springer. 643– 674.\n[Network and others 2008] Network, B. T. S. S. I. G., et al. 2008. British guideline on the management of asthma. Thorax 63:iv1.\n[PA et al. 2014] PA, J.; S, O.; BL, C.; and et al. 2014. 2014 evidence-based guideline for the management of high blood pressure in adults: Report from the panel members appointed to the eighth joint national committee (jnc 8). JAMA 311(5):507–520.\n[Peleg et al. 2003] Peleg, M.; Tu, S.; Bury, J.; Ciccarese, P.; Fox, J.; Greenes, R. A.; Hall, R.; Johnson, P. D.; Jones, N.; Kumar, A.; et al. 2003. Comparing computer-interpretable guideline models: a case-study approach. Journal of the"
    }, {
      "heading" : "American Medical Informatics Association 10(1):52–68.",
      "text" : "[Serban et al. 2007] Serban, R.; ten Teije, A.; van Harmelen, F.; Marcos, M.; and Polo-Conde, C. 2007. Extraction and use of linguistic patterns for modelling medical guidelines. Artificial intelligence in medicine 39(2):137–149.\n[Stenetorp et al. 2012] Stenetorp, P.; Pyysalo, S.; Topić, G.; Ohta, T.; Ananiadou, S.; and Tsujii, J. 2012. Brat: a webbased tool for nlp-assisted text annotation. In Proceedings of the Demonstrations at the 13th Conference of the European Chapter of the Association for Computational Linguistics, 102–107. Association for Computational Linguistics.\n[Wenzina and Kaiser 2013] Wenzina, R., and Kaiser, K. 2013. Identifying condition-action sentences using a heuristic-based information extraction method. In Process\nSupport and Knowledge Representation in Health Care. Springer. 26–38."
    } ],
    "references" : [ {
      "title" : "Idsa clinical practice guideline for acute bacterial rhinosinusitis in children and adults. Clinical Infectious Diseases",
      "author" : [ "Chow" ],
      "venue" : null,
      "citeRegEx" : "Chow,? \\Q2012\\E",
      "shortCiteRegEx" : "Chow",
      "year" : 2012
    }, {
      "title" : "The weka data mining software: an update. ACM SIGKDD explorations newsletter",
      "author" : [ "Hall" ],
      "venue" : null,
      "citeRegEx" : "Hall,? \\Q2009\\E",
      "shortCiteRegEx" : "Hall",
      "year" : 2009
    }, {
      "title" : "Identifying treatment activities for modelling computer-interpretable clinical practice guidelines. In Knowledge Representation for Health-Care",
      "author" : [ "Seyfang Kaiser", "K. Miksch 2011] Kaiser", "A. Seyfang", "S. Miksch" ],
      "venue" : null,
      "citeRegEx" : "Kaiser et al\\.,? \\Q2011\\E",
      "shortCiteRegEx" : "Kaiser et al\\.",
      "year" : 2011
    }, {
      "title" : "The Stanford CoreNLP natural language processing toolkit",
      "author" : [ "Manning" ],
      "venue" : "In Proceedings of 52nd Annual Meeting of the Association for Computational Linguistics: System Demonstrations,",
      "citeRegEx" : "Manning,? \\Q2014\\E",
      "shortCiteRegEx" : "Manning",
      "year" : 2014
    }, {
      "title" : "The umls semantic network",
      "author" : [ "A.T. McCray 1989] McCray" ],
      "venue" : "In Proceedings/the... Annual Symposium on Computer Application [sic] in Medical Care. Symposium on Computer Applications in Medical Care,",
      "citeRegEx" : "McCray,? \\Q1989\\E",
      "shortCiteRegEx" : "McCray",
      "year" : 1989
    }, {
      "title" : "Clinical decisionsupport systems",
      "author" : [ "Middleton Musen", "M.A. Greenes 2014] Musen", "B. Middleton", "R.A. Greenes" ],
      "venue" : "In Biomedical informatics. Springer",
      "citeRegEx" : "Musen et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Musen et al\\.",
      "year" : 2014
    }, {
      "title" : "British guideline on the management of asthma",
      "author" : [ "Network", "B.T.S.S.I. G" ],
      "venue" : "Thorax 63:iv1",
      "citeRegEx" : "Network and G,? \\Q2008\\E",
      "shortCiteRegEx" : "Network and G",
      "year" : 2008
    }, {
      "title" : "evidence-based guideline for the management of high blood pressure in adults: Report from the panel members appointed to the eighth joint national committee (jnc",
      "author" : [ "PA" ],
      "venue" : "JAMA",
      "citeRegEx" : "PA,? \\Q2014\\E",
      "shortCiteRegEx" : "PA",
      "year" : 2014
    }, {
      "title" : "Comparing computer-interpretable guideline models: a case-study approach",
      "author" : [ "Peleg" ],
      "venue" : "Journal of the American Medical Informatics Association",
      "citeRegEx" : "Peleg,? \\Q2003\\E",
      "shortCiteRegEx" : "Peleg",
      "year" : 2003
    }, {
      "title" : "Extraction and use of linguistic patterns for modelling medical guidelines. Artificial intelligence in medicine",
      "author" : [ "Serban" ],
      "venue" : null,
      "citeRegEx" : "Serban,? \\Q2007\\E",
      "shortCiteRegEx" : "Serban",
      "year" : 2007
    }, {
      "title" : "Brat: a webbased tool for nlp-assisted text annotation",
      "author" : [ "Stenetorp" ],
      "venue" : "In Proceedings of the Demonstrations at the 13th Conference of the European Chapter of the Association for Computational Linguistics,",
      "citeRegEx" : "Stenetorp,? \\Q2012\\E",
      "shortCiteRegEx" : "Stenetorp",
      "year" : 2012
    }, {
      "title" : "Identifying condition-action sentences using a heuristic-based information extraction method",
      "author" : [ "Wenzina", "R. Kaiser 2013] Wenzina", "K. Kaiser" ],
      "venue" : null,
      "citeRegEx" : "Wenzina et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Wenzina et al\\.",
      "year" : 2013
    } ],
    "referenceMentions" : [ {
      "referenceID" : 4,
      "context" : "They used relations of the UMLS Semantic Network (McCray 1989) to identify these activities in a guideline document.",
      "startOffset" : 49,
      "endOffset" : 62
    } ],
    "year" : 2017,
    "abstractText" : "This paper advances the state of the art in text understanding of medical guidelines by releasing two new annotated clinical guidelines datasets, and establishing baselines for using machine learning to extract condition-action pairs. In contrast to prior work that relies on manually created rules, we report experiment with several supervised machine learning techniques to classify sentences as to whether they express conditions and actions. We show the limitations and possible extensions of this work on text mining of medical guidelines.",
    "creator" : "LaTeX with hyperref package"
  }
}