{"conference": "ICLR 2017 conference submission", "title": "Inference and Introspection in Deep Generative Models of Sparse Data", "abstract": "Deep generative models such as deep latent Gaussian models (DLGMs) are powerful and popular density estimators. However, they have been applied almost exclusively to dense data such as images; DLGMs are rarely applied to sparse, high-dimensional integer data such as word counts or product ratings. One reason is that the standard training procedures find poor local optima when applied to such data. We propose two techniques that alleviate this problem, significantly improving our ability to fit DLGMs to sparse, high-dimensional data. Having fit these models, we are faced with another challenge: how to use and interpret the representation that we have learned? To that end, we propose a method that extracts distributed representations of features via a simple linearization of the model.", "histories": [], "reviews": [{"DATE": "06 Feb 2017", "TITLE": "ICLR committee final decision", "IS_META_REVIEW": false, "comments": "The paper introduces a number of ideas / heuristics for learning and interpreting deep generative models of text (tf-idf weighting, a combination of using an inference networks with direct optimization of the variational parameters, a method for inducing context-sensitive word embeddings). Generally, the last bit is the most novel, interesting and promising one, however, I agree with the reviewers that empirical evaluation of this technique does not seem sufficient. \n \n Positive:\n -- the ideas are sensible \n -- the paper is reasonably well written and clear\n \n Negative\n -- most ideas are not so novel\n -- the word embedding method requires extra analysis / evaluation, comparison to other methods for producing context-sensitive embeddings, etc", "OTHER_KEYS": "ICLR 2017 pcs"}, {"DATE": "14 Jan 2017", "TITLE": "Rebuttal ", "IS_META_REVIEW": false, "comments": "We thank all the reviewers for their careful reading of our work and for their suggestions. \n\nBelow we highlight additional experiments carried out based on suggestions by reviewers and clarify what set out to achieve with this work. Following which, we respond to individual reviewers inline. \n\nA] We have added to the paper additional experiments and insights that we highlight here: \n* We study how the proposed method for learning performs when varying the sparsity and dimensionality of the data. (Figure 2(c))\n* We have added a section that sheds light on how the feature representations are constructed when using gradients with respect to z in linear and non-linear models. (the last subsection of Section 3: Methodology)\n* We have studied the effect of varying hyperparameters in the inference network while continuing the optimize the variational parameters (Appendix A)\n* We make code for our work available here: ", "OTHER_KEYS": "Rahul Krishnan"}, {"TITLE": "Interesting ideas that could have been explored in greater depth", "OTHER_KEYS": "ICLR 2017 conference AnonReviewer5", "comments": "The paper claims improved inference for density estimation of sparse data (here text documents) using deep generative Gaussian models (variational auto-encoders), and a method for deriving word embeddings from the model's generative parameters that allows for a degree of interpretability similar to that of Bayesian generative topic models.\n\nTo discuss the contributions I will quickly review the generative story in the paper: first a K-dimensional latent representation is sampled from a multivariate Gaussian, then an MLP (with parameters \\theta) predicts unnormalised potentials over a vocabulary of V words, the potentials are exponentiated and normalised to make the parameters of a multinomial from where word observations are repeatedly sampled to make a document. Here intractable inference is replaced by the VAE formulation where an inference network (with parameters \\phi) independently predicts for each document the mean and variance of a normal distribution (amenable to reparameterised gradient computation).\n\nThe first, and rather trivial, contribution is to use tf-idf features to inject first order statistics (a global information) into local observations. The authors claim that this is particularly helpful in the case of sparse data such as text.\n\nThe second contribution is more interesting. In optimising generative parameters (\\theta) and variational parameters (\\phi), the authors turn to a treatment which is reminiscent of the original SVI procedure. That is, they see the variational parameters \\phi as *global* variational parameters, and the predicted mean \\mu(x) and covariance \\Sigma(x) of each observation x are treated as *local* variational parameters. In the original VAE, local parameters are not directly optimised, instead they are indirectly optimised via optimisation of the global parameters utilised in their prediction (shared MLP parameters). Here, local parameters are optimised holding generative parameters fixed (line 3 of Algorithm 1). The optimised local parameters are then used in the gradient step of the generative parameters (line 4 of Algorithm 1). Finally, global variational parameters are also updated (line 5). \nWhereas indeed other authors have proposed to optimise local parameters, I think that deriving this procedure from the more familiar SVI makes the contribution less of a trick and easier to relate to.\n\nSome things aren't entirely clear to me. I think it would have been nice if the authors had shown the functional form of the gradient used in step 3 of Algorithm 1. The gradient step for global variational parameters (line 5 of Algorithm 1) uses the very first prediction of local parameters (thus ignoring the optimisation in step 3), this is unclear to me. Perhaps I am missing a fundamental reason why that has to be the case (either way, please clarify).\nThe authors argue that this optimisation turns out helpful to modelling sparse data because there is evidence that the generative model p_\\theta(x|z) suffers from poor initialisation. Please, discuss why you expect the initialisation problem to be worse in the case of sparse data.\n\nThe final contribution is a neat procedure to derive word embeddings from the generative model parameters. These embeddings are then used to interpret what the model has learnt. Interestingly, these word embeddings are context-sensitive once that the latent variable models an entire document.\n\nAbout Figures 2a and 2b: the caption says that solid lines indicate validation perplexity for M=1 (no optimisation of local parameters) and dashed lines indicate M=100 (100 iterations of optimisation of local parameters), but the legends of the figures suggest a different reading. If I interpret the figures based on the caption, then it seems that indeed deeper networks exposed to more data benefit from optimisation of local parameters. Are the authors pretty sure that in Figure 2b models with M=1 have reached a plateau (so that longer training would not allow them to catch up with M=100 curves)? As the authors explain in the caption, x-axis is not comparable on running time, thus the question.\n\nThe analysis of singular values seems like an interesting way to investigate how the model is using its capacity.  However, I can barely interpret Figures 2c and 2d, I think the authors could have walked readers through them.\n\nAs for the word embedding I am missing an evaluation on a predictive task. Also, while illustrative, Table 2b is barely reproducible. The text reads \"we create a document comprising a subset of words in the the context’s Wikipedia page.\" which is rather vague. I wonder whether this construct needs to be carefully designed in order to get Table 2b.\n\nIn sum, I have a feeling that the inference technique and the embedding technique are both useful, but perhaps they should have been presented separately so that each could have been explored in greater depth.", "IS_META_REVIEW": false, "RECOMMENDATION": 6, "DATE": "03 Jan 2017", "REVIEWER_CONFIDENCE": 4}, {"TITLE": "Good ; lacks more decisive experiments", "OTHER_KEYS": "ICLR 2017 conference AnonReviewer3", "comments": "First I would like to apologize for the delay in reviewing.\n\nSummary : In this paper a variational inference is adapted to deep generative models, showing improvement for non-negative sparse dataset. The authors offer as well a method to interpret the data through the model parameters.\n\nThe writing is generally clear. The methods seem correct. The introspection approach appears to be original. I found very interesting the experiment on the polysemic word embedding. I would however have like to see how the obtained embedding would perform with respect to other more common embeddings in solving a supervised task.\n\nMinor :\nEq. 2: too many closing parentheses", "IS_META_REVIEW": false, "RECOMMENDATION": 7, "DATE": "30 Dec 2016", "REVIEWER_CONFIDENCE": 3}, {"TITLE": "Decent paper, but lacking novelty", "OTHER_KEYS": "ICLR 2017 conference AnonReviewer4", "comments": "This paper introduces three tricks for training deep latent variable models on sparse discrete data:\n1) tf-idf weighting\n2) Iteratively optimizing variational parameters after initializing them with an inference network\n3) A technique for improving the interpretability of the deep model\n\nThe first idea is sensible but rather trivial as a contribution. The second idea is also sensible, but is conceptually not novel. What is new is the finding that it works well for the dataset used in this paper.\n\nThe third idea is interesting, and seems to give qualitatively reasonable results. The quantitative semantic similarity results don’t seem that convincing, but I am not very familiar with the relevant literature and therefore cannot make a confident judgement on this issue.", "IS_META_REVIEW": false, "RECOMMENDATION": 5, "DATE": "16 Dec 2016", "REVIEWER_CONFIDENCE": 3}, {"TITLE": "Weak reject", "OTHER_KEYS": "ICLR 2017 conference AnonReviewer1", "comments": "This paper presents a small trick to improve the model quality of variational autoencoders (further optimizing the ELBO while initializing it from the predictions of the q network, instead of just using those directly) and the idea of using Jacobian vectors to replace simple embeddings when interpreting variational autoencoders.\n\nThe idea of the Jacobian as a natural replacement for embeddings is interesting, as it does seem to cleanly generalize the notion of embeddings from linear models. It'd be interesting to see comparisons with other work seeking to provide context-specific embeddings, either by clustering or by smarter techniques (like Neelakantan et al, Efficient non-parametric estimation of multiple embeddings per word in vector space, or Chen et al A Unified Model for Word Sense Representation and Disambiguation). With the evidence provided in the experimental section of the paper it's hard to be convinced that the Jacobian of VAE-generated embeddings is substantially better at being context-sensitive than prior work.\n\nSimilarly, the idea of further optimizing the ELBO is interesting but not fully explored. It's unclear, for example, what is the tradeoff between the complexity of the q network and steps further optimizing the ELBO, in terms of compute versus accuracy.\n\nOverall the ideas in this paper are good but I'd like to see them a little more fleshed out.", "IS_META_REVIEW": false, "RECOMMENDATION": 5, "DATE": "15 Dec 2016", "REVIEWER_CONFIDENCE": 4}, {"DATE": "14 Dec 2016", "TITLE": "Responses to initial comments", "IS_META_REVIEW": false, "comments": "[R1] Yes. Though our point was to highlight that instead of just conditioning on the input directly, thinking about how to incorporate other characteristics of the data the inference network typically has no access to (such as global first order statistics, which in the case of non-negative data corresponds to tf-idf features) helps learning.  We have updated the algorithm box to make clear the role of the additional optimization of the local variational parameters in the revised version. \n\n[R4] The current implementation is about 15x slower (we have emphasized this in the caption for Fig. 2) since we do 100 steps of optimizing the variational parameter. It is possible that this additional optimization is primarily helpful in the first few epochs after which one could resume training normally, though we did not experiment with such variants. \n\n[R3] x is the same as x_d. We have clarified the notation in the revised version. We haven’t tried our embeddings on prediction tasks for text as yet. ", "OTHER_KEYS": "Rahul Krishnan"}, {"DATE": "04 Dec 2016", "TITLE": "Notation clarification and experiment", "IS_META_REVIEW": false, "comments": "", "OTHER_KEYS": "ICLR 2017 conference AnonReviewer3"}, {"DATE": "02 Dec 2016", "TITLE": "Computational cost", "IS_META_REVIEW": false, "comments": "", "OTHER_KEYS": "ICLR 2017 conference AnonReviewer4"}, {"DATE": "30 Nov 2016", "TITLE": "Questions about the contributions (section 3)", "IS_META_REVIEW": false, "comments": "", "OTHER_KEYS": "ICLR 2017 conference AnonReviewer1"}, {"DATE": "06 Feb 2017", "TITLE": "ICLR committee final decision", "IS_META_REVIEW": false, "comments": "The paper introduces a number of ideas / heuristics for learning and interpreting deep generative models of text (tf-idf weighting, a combination of using an inference networks with direct optimization of the variational parameters, a method for inducing context-sensitive word embeddings). Generally, the last bit is the most novel, interesting and promising one, however, I agree with the reviewers that empirical evaluation of this technique does not seem sufficient. \n \n Positive:\n -- the ideas are sensible \n -- the paper is reasonably well written and clear\n \n Negative\n -- most ideas are not so novel\n -- the word embedding method requires extra analysis / evaluation, comparison to other methods for producing context-sensitive embeddings, etc", "OTHER_KEYS": "ICLR 2017 pcs"}, {"DATE": "14 Jan 2017", "TITLE": "Rebuttal ", "IS_META_REVIEW": false, "comments": "We thank all the reviewers for their careful reading of our work and for their suggestions. \n\nBelow we highlight additional experiments carried out based on suggestions by reviewers and clarify what set out to achieve with this work. Following which, we respond to individual reviewers inline. \n\nA] We have added to the paper additional experiments and insights that we highlight here: \n* We study how the proposed method for learning performs when varying the sparsity and dimensionality of the data. (Figure 2(c))\n* We have added a section that sheds light on how the feature representations are constructed when using gradients with respect to z in linear and non-linear models. (the last subsection of Section 3: Methodology)\n* We have studied the effect of varying hyperparameters in the inference network while continuing the optimize the variational parameters (Appendix A)\n* We make code for our work available here: ", "OTHER_KEYS": "Rahul Krishnan"}, {"TITLE": "Interesting ideas that could have been explored in greater depth", "OTHER_KEYS": "ICLR 2017 conference AnonReviewer5", "comments": "The paper claims improved inference for density estimation of sparse data (here text documents) using deep generative Gaussian models (variational auto-encoders), and a method for deriving word embeddings from the model's generative parameters that allows for a degree of interpretability similar to that of Bayesian generative topic models.\n\nTo discuss the contributions I will quickly review the generative story in the paper: first a K-dimensional latent representation is sampled from a multivariate Gaussian, then an MLP (with parameters \\theta) predicts unnormalised potentials over a vocabulary of V words, the potentials are exponentiated and normalised to make the parameters of a multinomial from where word observations are repeatedly sampled to make a document. Here intractable inference is replaced by the VAE formulation where an inference network (with parameters \\phi) independently predicts for each document the mean and variance of a normal distribution (amenable to reparameterised gradient computation).\n\nThe first, and rather trivial, contribution is to use tf-idf features to inject first order statistics (a global information) into local observations. The authors claim that this is particularly helpful in the case of sparse data such as text.\n\nThe second contribution is more interesting. In optimising generative parameters (\\theta) and variational parameters (\\phi), the authors turn to a treatment which is reminiscent of the original SVI procedure. That is, they see the variational parameters \\phi as *global* variational parameters, and the predicted mean \\mu(x) and covariance \\Sigma(x) of each observation x are treated as *local* variational parameters. In the original VAE, local parameters are not directly optimised, instead they are indirectly optimised via optimisation of the global parameters utilised in their prediction (shared MLP parameters). Here, local parameters are optimised holding generative parameters fixed (line 3 of Algorithm 1). The optimised local parameters are then used in the gradient step of the generative parameters (line 4 of Algorithm 1). Finally, global variational parameters are also updated (line 5). \nWhereas indeed other authors have proposed to optimise local parameters, I think that deriving this procedure from the more familiar SVI makes the contribution less of a trick and easier to relate to.\n\nSome things aren't entirely clear to me. I think it would have been nice if the authors had shown the functional form of the gradient used in step 3 of Algorithm 1. The gradient step for global variational parameters (line 5 of Algorithm 1) uses the very first prediction of local parameters (thus ignoring the optimisation in step 3), this is unclear to me. Perhaps I am missing a fundamental reason why that has to be the case (either way, please clarify).\nThe authors argue that this optimisation turns out helpful to modelling sparse data because there is evidence that the generative model p_\\theta(x|z) suffers from poor initialisation. Please, discuss why you expect the initialisation problem to be worse in the case of sparse data.\n\nThe final contribution is a neat procedure to derive word embeddings from the generative model parameters. These embeddings are then used to interpret what the model has learnt. Interestingly, these word embeddings are context-sensitive once that the latent variable models an entire document.\n\nAbout Figures 2a and 2b: the caption says that solid lines indicate validation perplexity for M=1 (no optimisation of local parameters) and dashed lines indicate M=100 (100 iterations of optimisation of local parameters), but the legends of the figures suggest a different reading. If I interpret the figures based on the caption, then it seems that indeed deeper networks exposed to more data benefit from optimisation of local parameters. Are the authors pretty sure that in Figure 2b models with M=1 have reached a plateau (so that longer training would not allow them to catch up with M=100 curves)? As the authors explain in the caption, x-axis is not comparable on running time, thus the question.\n\nThe analysis of singular values seems like an interesting way to investigate how the model is using its capacity.  However, I can barely interpret Figures 2c and 2d, I think the authors could have walked readers through them.\n\nAs for the word embedding I am missing an evaluation on a predictive task. Also, while illustrative, Table 2b is barely reproducible. The text reads \"we create a document comprising a subset of words in the the context’s Wikipedia page.\" which is rather vague. I wonder whether this construct needs to be carefully designed in order to get Table 2b.\n\nIn sum, I have a feeling that the inference technique and the embedding technique are both useful, but perhaps they should have been presented separately so that each could have been explored in greater depth.", "IS_META_REVIEW": false, "RECOMMENDATION": 6, "DATE": "03 Jan 2017", "REVIEWER_CONFIDENCE": 4}, {"TITLE": "Good ; lacks more decisive experiments", "OTHER_KEYS": "ICLR 2017 conference AnonReviewer3", "comments": "First I would like to apologize for the delay in reviewing.\n\nSummary : In this paper a variational inference is adapted to deep generative models, showing improvement for non-negative sparse dataset. The authors offer as well a method to interpret the data through the model parameters.\n\nThe writing is generally clear. The methods seem correct. The introspection approach appears to be original. I found very interesting the experiment on the polysemic word embedding. I would however have like to see how the obtained embedding would perform with respect to other more common embeddings in solving a supervised task.\n\nMinor :\nEq. 2: too many closing parentheses", "IS_META_REVIEW": false, "RECOMMENDATION": 7, "DATE": "30 Dec 2016", "REVIEWER_CONFIDENCE": 3}, {"TITLE": "Decent paper, but lacking novelty", "OTHER_KEYS": "ICLR 2017 conference AnonReviewer4", "comments": "This paper introduces three tricks for training deep latent variable models on sparse discrete data:\n1) tf-idf weighting\n2) Iteratively optimizing variational parameters after initializing them with an inference network\n3) A technique for improving the interpretability of the deep model\n\nThe first idea is sensible but rather trivial as a contribution. The second idea is also sensible, but is conceptually not novel. What is new is the finding that it works well for the dataset used in this paper.\n\nThe third idea is interesting, and seems to give qualitatively reasonable results. The quantitative semantic similarity results don’t seem that convincing, but I am not very familiar with the relevant literature and therefore cannot make a confident judgement on this issue.", "IS_META_REVIEW": false, "RECOMMENDATION": 5, "DATE": "16 Dec 2016", "REVIEWER_CONFIDENCE": 3}, {"TITLE": "Weak reject", "OTHER_KEYS": "ICLR 2017 conference AnonReviewer1", "comments": "This paper presents a small trick to improve the model quality of variational autoencoders (further optimizing the ELBO while initializing it from the predictions of the q network, instead of just using those directly) and the idea of using Jacobian vectors to replace simple embeddings when interpreting variational autoencoders.\n\nThe idea of the Jacobian as a natural replacement for embeddings is interesting, as it does seem to cleanly generalize the notion of embeddings from linear models. It'd be interesting to see comparisons with other work seeking to provide context-specific embeddings, either by clustering or by smarter techniques (like Neelakantan et al, Efficient non-parametric estimation of multiple embeddings per word in vector space, or Chen et al A Unified Model for Word Sense Representation and Disambiguation). With the evidence provided in the experimental section of the paper it's hard to be convinced that the Jacobian of VAE-generated embeddings is substantially better at being context-sensitive than prior work.\n\nSimilarly, the idea of further optimizing the ELBO is interesting but not fully explored. It's unclear, for example, what is the tradeoff between the complexity of the q network and steps further optimizing the ELBO, in terms of compute versus accuracy.\n\nOverall the ideas in this paper are good but I'd like to see them a little more fleshed out.", "IS_META_REVIEW": false, "RECOMMENDATION": 5, "DATE": "15 Dec 2016", "REVIEWER_CONFIDENCE": 4}, {"DATE": "14 Dec 2016", "TITLE": "Responses to initial comments", "IS_META_REVIEW": false, "comments": "[R1] Yes. Though our point was to highlight that instead of just conditioning on the input directly, thinking about how to incorporate other characteristics of the data the inference network typically has no access to (such as global first order statistics, which in the case of non-negative data corresponds to tf-idf features) helps learning.  We have updated the algorithm box to make clear the role of the additional optimization of the local variational parameters in the revised version. \n\n[R4] The current implementation is about 15x slower (we have emphasized this in the caption for Fig. 2) since we do 100 steps of optimizing the variational parameter. It is possible that this additional optimization is primarily helpful in the first few epochs after which one could resume training normally, though we did not experiment with such variants. \n\n[R3] x is the same as x_d. We have clarified the notation in the revised version. We haven’t tried our embeddings on prediction tasks for text as yet. ", "OTHER_KEYS": "Rahul Krishnan"}, {"DATE": "04 Dec 2016", "TITLE": "Notation clarification and experiment", "IS_META_REVIEW": false, "comments": "", "OTHER_KEYS": "ICLR 2017 conference AnonReviewer3"}, {"DATE": "02 Dec 2016", "TITLE": "Computational cost", "IS_META_REVIEW": false, "comments": "", "OTHER_KEYS": "ICLR 2017 conference AnonReviewer4"}, {"DATE": "30 Nov 2016", "TITLE": "Questions about the contributions (section 3)", "IS_META_REVIEW": false, "comments": "", "OTHER_KEYS": "ICLR 2017 conference AnonReviewer1"}], "authors": "Rahul G. Krishnan, Matthew Hoffman", "accepted": false, "id": "595"}