{"reviews": [{"IMPACT": "3", "SUBSTANCE": "3", "APPROPRIATENESS": "5", "MEANINGFUL_COMPARISON": "2", "PRESENTATION_FORMAT": "Poster", "comments": "- Strengths: the paper is well-written, except for a few places as described\nbelow. The problem the paper tackles is useful. The proposed approach,\nmultigraph-based model, is a variant of MH. The empirical result is solid.\n\n- Weaknesses: Clarification is needed in several places.\n\n1. In section 3, in addition to the description of the previous model, MH, you\nneed point out the issues of MH which motivate you to propose a new model.\n\n2. In section 4, I don't see the reason why separators are introduced. what\nadditional info they convene beyond T/I/O?\n\n3. section 5.1 does not seem to provide useful info regarding why the new model\nis superior.\n\n4. the discussion in section 5.2 is so abstract that I don't get the insights\nwhy the new model is better than MH. can you provide examples of spurious\nstructures? \n\n- General Discussion: The paper presents a new model for detecting overlapping\nentities in text. The new model improves the previous state-of-the-art, MH, in\nthe experiments on a few benchmark datasets. But it is not clear why and how\nthe new model works better.", "SOUNDNESS_CORRECTNESS": "4", "ORIGINALITY": "3", "is_meta_review": null, "RECOMMENDATION": "3", "CLARITY": "3", "REVIEWER_CONFIDENCE": "3"}, {"IMPACT": "3", "SUBSTANCE": "4", "APPROPRIATENESS": "5", "MEANINGFUL_COMPARISON": "2", "PRESENTATION_FORMAT": "Poster", "comments": "The paper suggests an approach based on multigraphs (several edges may link two\nnodes) for detecting potentially overlapping entities.\n\nStrengths:\nThe problem itself could be rather interesting especially for crossing entities\nto decide which one might actually be mentioned in some text. The technique\nseems to work although the empirically results do not show some \"dramatic\"\neffect. I like that some words are spent on efficiency compared to a previous\nsystem. The paper in general is well-written but also needs some further\npolishing in some details (see minor remarks below).\n\nWeaknesses:\nThe problem itself is not really well motivated. Why is it important to detect\nChina as an entity within the entity Bank of China, to stay with the example in\nthe introduction? I do see a point for crossing entities but what is the use\ncase for nested entities? This could be much more motivated to make the reader\ninterested. As for the approach itself, some important details are missing in\nmy opinion: What is the decision criterion to include an edge or not? In lines\n229--233 several different options for the I^k_t nodes are mentioned but it is\nnever clarified which edges should be present!\n\nAs for the empirical evaluation, the achieved results are better than some\nprevious approaches but not really by a large margin. I would not really call\nthe slight improvements as \"outperformed\" as is done in the paper. What is the\neffect size? Does it really matter to some user that there is some improvement\nof two percentage points in F_1? What is the actual effect one can observe? How\nmany \"important\" entities are discovered, that have not been discovered by\nprevious methods? Furthermore, what performance would some simplistic\ndictionary-based method achieve that could also be used to find overlapping\nthings? And in a similar direction: what would some commercial system like\nGoogle's NLP cloud that should also be able to detect and link entities would\nhave achieved on the datasets. Just to put the results also into contrast of\nexisting \"commercial\" systems.\n\nAs for the result discussion, I would have liked to see some more emphasis on\nactual crossing entities. How is the performance there? This in my opinion is\nthe more interesting subset of overlapping entities than the nested ones. How\nmany more crossing entities are detected than were possible before? Which ones\nwere missed and maybe why? Is the performance improvement due to better nested\ndetection only or also detecting crossing entities? Some general error\ndiscussion comparing errors made by the suggested system and previous ones\nwould also strengthen that part.\n\nGeneral Discussion:\nI like the problems related to named entity recognition and see a point for\nrecognizing crossing entities. However, why is one interested in nested\nentities? The paper at hand does not really motivate the scenario and also\nsheds no light on that point in the evaluation. Discussing errors and maybe\nadvantages with some example cases and an emphasis on the results on crossing\nentities compared to other approaches would possibly have convinced me more.\nSo, I am only lukewarm about the paper with maybe a slight tendency to\nrejection. It just seems yet another try without really emphasizing the in my\nopinion important question of crossing entities.\n\nMinor remarks:\n\n- first mention of multigraph: some readers may benefit if the notion of a\nmultigraph would get a short description\n\n- previously noted by ... many previous: sounds a little odd\n\n- Solving this task: which one?\n\n- e.g.: why in italics?\n\n- time linear in n: when n is sentence length, does it really matter whether it\nis linear or cubic?\n\n- spurious structures: in the introduction it is not clear, what is meant\n\n- regarded as _a_ chunk\n\n- NP chunking: noun phrase chunking?\n\n- Since they set: who?\n\n- pervious -> previous\n\n- of Lu and Roth~(2015)\n\n- the following five types: in sentences with no large numbers, spell out the\nsmall ones, please\n\n- types of states: what is a state in a (hyper-)graph? later state seems to be\nused analogous to node?!\n\n- I would place commas after the enumeration items at the end of page 2 and a\nperiod after the last one\n\n- what are child nodes in a hypergraph?\n\n- in Figure 2 it was not obvious at first glance why this is a hypergraph.\ncolors are not visible in b/w printing. why are some nodes/edges in gray. it is\nalso not obvious how the highlighted edges were selected and why the others are\nin gray ...\n\n- why should both entities be detected in the example of Figure 2? what is the\ndifference to \"just\" knowing the long one?\n\n- denoting ...: sometimes in brackets, sometimes not ... why?\n\n- please place footnotes not directly in front of a punctuation mark but\nafterwards\n\n- footnote 2: due to the missing edge: how determined that this one should be\nmissing?\n\n- on whether the separator defines ...: how determined?\n\n- in _the_ mention hypergraph\n\n- last paragraph before 4.1: to represent the entity separator CS: how is the\nCS-edge chosen algorithmically here?\n\n- comma after Equation 1?\n\n- to find out: sounds a little odd here\n\n- we extract entities_._\\footnote\n\n- we make two: sounds odd; we conduct or something like that?\n\n- nested vs. crossing remark in footnote 3: why is this good? why not favor\ncrossing? examples to clarify?\n\n- the combination of states alone do_es_ not?\n\n- the simple first order assumption: that is what?\n\n- In _the_ previous section\n\n- we see that our model: demonstrated? have shown?\n\n- used in this experiments: these\n\n- each of these distinct interpretation_s_\n\n- published _on_ their website\n\n- The statistics of each dataset _are_ shown\n\n- allows us to use to make use: omit \"to use\"\n\n- tried to follow as close ... : tried to use the features suggested in\nprevious works as close as possible?\n\n- Following (Lu and Roth, 2015): please do not use references as nouns:\nFollowing Lu and Roth (2015)\n\n- using _the_ BILOU scheme\n\n- highlighted in bold: what about the effect size?\n\n- significantly better: in what sense? effect size?\n\n- In GENIA dataset: On the GENIA dataset\n\n- outperforms by about 0.4 point_s_: I would not call that \"outperform\"\n\n- that _the_ GENIA dataset\n\n- this low recall: which one?\n\n- due to _an_ insufficient\n\n- Table 5: all F_1 scores seems rather similar to me ... again, \"outperform\"\nseems a bit of a stretch here ...\n\n- is more confident: why does this increase recall?\n\n- converge _than_ the mention hypergraph\n\n- References: some paper titles are lowercased, others not, why?", "SOUNDNESS_CORRECTNESS": "4", "ORIGINALITY": "3", "is_meta_review": null, "RECOMMENDATION": "2", "CLARITY": "3", "REVIEWER_CONFIDENCE": "3"}], "abstract": "In this paper, we propose a new model for predicting overlapping entities based on multigraphs, as opposed to simple graphs commonly used in graphical models for structured predictions. Through experiments in standard datasets containing overlapping and non-overlapping entities, we demonstrate that our model outperforms previous models. We also present some analysis on the differences between our model and the previous models and discuss the possible implications of the differences. To the best of our knowledge, this is the first structured prediction model utilizing multigraphs to predict overlapping structures.", "histories": [], "id": 108, "title": "A Multigraph-based Model for Overlapping Entity Recognition"}
