{"reviews": [{"IMPACT": "3", "SUBSTANCE": "5", "APPROPRIATENESS": "5", "MEANINGFUL_COMPARISON": "3", "PRESENTATION_FORMAT": "Poster", "comments": "This paper presents a new dataset with annotations of products coming from\nonline cybercrime forums. The paper is clear and well-written and the\nexperiments are good. Every hypothesis is tested and compared to each other.\n\nHowever, I do have some concerns about the paper:\n\n1. The authors took the liberty to change the font size and the line spacing of\nthe abstract, enabling them to have a longer abstract and to fit the content\ninto the 8 pages requirement.\n\n2. I don't think this paper fits the tagging, chunking, parsing area, as it is\nmore an information extraction problem.\n\n3. I have difficulties to see why some annotations such as sombody in Fig. 1\nare related to a product.\n\n4. The basic results are very basic indeed and - with all the tools available\nnowadays in NLP -, I am sure that it would have been possible to have more\nelaborate baselines without too much extra work.\n\n5. Domain adaptation experiments corroborate what we already know about\nuser-generated data where two forums on video games, e.g., may have different\ntypes of users (age, gender, etc.) leading to very different texts. So this\ndoes not give new highlights on this specific problem.", "SOUNDNESS_CORRECTNESS": "3", "ORIGINALITY": "3", "is_meta_review": null, "RECOMMENDATION": "3", "CLARITY": "5", "REVIEWER_CONFIDENCE": "4"}], "abstract": "One weakness of machine-learned NLP models is that they typically perform poorly on out-of-domain data. In this work, we study the task of identifying products being bought and sold in online cybercrime forums, which exhibits particularly challenging cross-domain effects. We formulate a task that represents a hybrid of slot-filling information extraction and named entity recognition and annotate datasets consisting of data from four different forums. Each of these forums constitutes its own \"fine-grained domain\" in that the forums cover different market sectors with different properties, even though all forums are in the broad domain of cybercrime. We characterize these domain differences in the context of a learning-based system: supervised models see decreased accuracy when applied to new forums, and standard techniques for semi-supervised learning and domain adaptation have limited effectiveness on this data, which suggests the need to improve these techniques.  We release a dataset of 93,924 posts from across 4 forums, with annotations for 1,938 posts.", "histories": [], "id": 180, "title": "Identifying Products in Online Cybercrime Marketplaces: A Dataset and Fine-grained Domain Adaptation Task"}
