{"reviews": [{"IMPACT": "3", "SUBSTANCE": "4", "APPROPRIATENESS": "5", "MEANINGFUL_COMPARISON": "3", "PRESENTATION_FORMAT": "Oral Presentation", "comments": "- Strengths:\n     - The related work is quite thorough and the comparison with the approach\npresented in this paper makes the hypothesis of the paper stronger. The\nevaluation section is also extensive and thus, the experiments are convincing.\n\n- Weaknesses:\n     - In Section 3 it is not clear what is exactly the dataset that you used\nfor training the SVM and your own model. Furthermore, you only give the\nstarting date for collecting the testing data, but there is no other\ninformation related to the size of the dataset or the time frame when the data\nwas collected. This might also give some insight for the results and statistics\ngiven in Section 3.2.\n     - In Table 3 we can see that the number of reviewers is only slightly\nlower than the number of reviews posted (at least for hotels), which means that\nonly a few reviewers posted more than one review, in the labeled dataset. How\ndoes this compare with the full dataset in Table 2? What is the exact number of\nreviewers in Table 2 (to know what is the percentage of labeled reviewers)? It\nis also interesting to know how many reviews are made by one person on average.\nIf there are only a few reviewers that post more than one review (i.e., not\nthat much info to learn from), the results would benefit from a thorough\ndiscussion. \n\n- General Discussion:\n     This paper focuses on identifying spam reviews under the assumption that\nwe deal with a cold-start problem, i.e., we do not have enough information to\ndraw a conclusion. The paper proposes a neural network model that learns how to\nrepresent new reviews by jointly using embedded textual information and\nbehaviour information. Overall, the paper is very well written and the results\nare compelling.\n\n- Typos and/or grammar:                                 \n     - The new reviewer only provide us                                        \n\n     - Jindal and Liu (2008) make the first step -> the work is quite old, you\ncould use past tense to refer to it\n     - Usage of short form “can’t”, “couldn’t”, “what’s”\ninstead of the prefered long form\n     - The following sentence is not clear and should be rephrased: “The new\nreviewer just posted one review and we have to filter it out immediately, there\nis not any historical reviews provided to us.“", "SOUNDNESS_CORRECTNESS": "5", "ORIGINALITY": "5", "is_meta_review": null, "RECOMMENDATION": "4", "CLARITY": "4", "REVIEWER_CONFIDENCE": "4"}, {"IMPACT": "3", "SUBSTANCE": "5", "APPROPRIATENESS": "5", "MEANINGFUL_COMPARISON": "3", "PRESENTATION_FORMAT": "Oral Presentation", "comments": "This paper investigates the cold-start problem in review spam detection. The\nauthors first qualitatively and quantitatively analyze the cold-start problem.\nThey observe that there is no enough prior data from a new user in this\nrealistic scenario. The traditional features fail to help to identify review\nspam. Instead, they turn to rely on the abundant textual and behavioral\ninformation of the existing reviewer to augment the information of a new user.\nIn specific, they propose a neural network to represent the review of the new\nreviewer with the learnt word embedding and jointly encoded behavioral\ninformation. In the experiments, the authors make comparisons with traditional\nmethods, and show the effectiveness of their model.\n\n- Strengths:\n\nThe paper is well organized and clearly written. The idea of jointly encoding\ntexts and behaviors is interesting. The cold-start problem is actually an\nurgent problem to several online review analysis applications. In my knowledge,\nthe previous work has not yet attempted to tackle this problem. This paper is\nmeaningful and presents a reasonable analysis. And the results of the proposed\nmodel can also be available for downstream detection models.\n\n- Weaknesses:\n\nIn experiments, the author set the window width of the filters in the CNN\nmodule to 2. Did the author try other window widths, for example width `1' to\nextract unigram features, `3' to trigram, or use them together? \nThe authors may add more details about the previous work in the related work\nsection. More specifically description would help the readers to understand the\ntask clearly.\n\nThere are also some typos to be corrected:\nSec 1: ``...making purchase decision...'' should be ``making a/the purchase\ndecision''\nSec 1: ``...are devoted to explore... '' should be `` are devoted to\nexploring''\nSec 1: ``...there is on sufficient behaviors...'' should be “there are no\nsufficient behaviors''\nSec 1: ``...on business trip...'' should be ``on a business trip''\nSec 1: ``...there are abundant behavior information...'' should be ``there is\nabundant behavior''\nSec 3: ``The new reviewer only provide us...'' should be ``...The new reviewer\nonly provides us...''\nSec 3: ``...features need not to take much...'' should be ``...features need\nnot take much...''\nSec 4: ``...there is not any historical reviews...'' should be ``...there are\nnot any historical reviews...''\nSec 4: ``...utilizing a embedding learning model...'' should be ``...utilizing\nan embedding learning model...''\nSec 5.2 ``...The experiment results proves...'' should be ``...The experiment\nresults prove...''\n\n- General Discussion:\n\nIt is a good paper and should be accepted by ACL.", "SOUNDNESS_CORRECTNESS": "5", "ORIGINALITY": "5", "is_meta_review": null, "RECOMMENDATION": "5", "CLARITY": "4", "REVIEWER_CONFIDENCE": "5"}], "abstract": "Solving cold-start problem in review spam detection is an urgent and significant task. It can help the on-line review websites to relieve the damage of spammers in time, but has never been investigated by previous work. This paper proposes a novel neural network model to detect review spam for cold-start problem, by learning to represent the new reviewers' review with jointly embedded textual and behavioral information. Experimental results prove the proposed model achieves an effective performance and possesses preferable domain-adaptability. It is also applicable to a large scale dataset in an unsupervised way.", "histories": [], "id": "338", "title": "Handling Cold-Start Problem in Review Spam Detection by Jointly Embedding Texts and Behaviors"}
