{"reviews": [{"IMPACT": "4", "SUBSTANCE": "4", "APPROPRIATENESS": "5", "MEANINGFUL_COMPARISON": "4", "PRESENTATION_FORMAT": "Poster", "comments": "- Strengths:\n\n - The paper is clearly written and well-structured. \n\n - The system newly applied several techniques including global optimization to\nend-to-end neural relation extraction, and the direct incorporation of the\nparser representation is interesting.\n\n - The proposed system has achieved the state-of-the-art performance on both\nACE05 and CONLL04 data sets.\n\n - The authors include several analyses.\n\n- Weaknesses:\n\n - The approach is incremental and seems like just a combination of existing\nmethods.  \n\n - The improvements on the performance (1.2 percent points on dev) are\nrelatively small, and no significance test results are provided.\n\n- General Discussion:\n\n- Major comments:\n\n - The model employed a recent parser and glove word embeddings. How did they\naffect the relation extraction performance?\n\n - In prediction, how did the authors deal with illegal predictions?\n\n- Minor comments:\n\n - Local optimization is not completely \"local\". It \"considers structural\ncorrespondences between incremental decisions,\" so this explanation in the\nintroduction is misleading.\n\n - Points in Figures 6 and 7 should be connected with straight lines, not\ncurves.\n\n - How are entities represented in \"-segment\"?\n\n - Some citations are incomplete. Kingma et al. (2014) is accepted to ICLR,\nand Li et al. (2014) misses pages.", "SOUNDNESS_CORRECTNESS": "3", "ORIGINALITY": "3", "is_meta_review": null, "RECOMMENDATION": "4", "CLARITY": "5", "REVIEWER_CONFIDENCE": "5"}], "abstract": "Neural networks have recently shown promising results for relation extraction. State-of-the-art models cast the task as an end-to-end problem, solved incrementally using a local classifier. Yet previous work using statistical models have demonstrated that global optimization can achieve better performances compared to local classification. We build a globally optimized neural model for end-to-end relation extraction, proposing novel LSTM features in order to better learn representations. Experiments show that our model is highly effective, achieving the best performances on two standard benchmarks.", "histories": [], "id": 557, "title": "End-to-End Neural Relation Extraction with Global Optimization"}
