{"reviews": [{"IMPACT": "3", "SUBSTANCE": "2", "APPROPRIATENESS": "4", "MEANINGFUL_COMPARISON": "4", "PRESENTATION_FORMAT": "Poster", "comments": "- Strengths: The paper broadens the applicability of readability scores to an\nadditional language, and produces a well-validated applicability score for\nVietnamese. \n\n- Weaknesses: The greatest weaknesses, with respect to ACL are that 1)\nreadability scores are of limited interest within the field of computational\nlinguistics. While they are somewhat useful in educational and public\ncommunication fields, their impact on the progress of computational linguistics\nis limited.  A minor weakness is in the writing: the paper has numerous minor\ngrammatical errors.\nAlthough the discussion compares the performance of the PDS1 and PDW1 features\nfrom the previous work, it is unclear how poorly the previous readability\nmeasures perform, relevant to the one developed here, for practical purposes.\n\n- General Discussion: This paper would be a stronger candidate for inclusion if\nthe corpus (and importantly, labels developed) were released. It could be used\nmore widely than the development of scalar readability metrics, and would\nenable (e.g.) investigation of application of more powerful feature-selection\nmethods.", "SOUNDNESS_CORRECTNESS": "5", "ORIGINALITY": "3", "is_meta_review": null, "RECOMMENDATION": "2", "CLARITY": "4", "REVIEWER_CONFIDENCE": "4"}, {"IMPACT": "3", "SUBSTANCE": "1", "APPROPRIATENESS": "4", "MEANINGFUL_COMPARISON": "4", "PRESENTATION_FORMAT": "Poster", "comments": "- Strengths:\n New Dataset, \n NLP on Resource poor language\n\n- Weaknesses:\n Incomplete related work references, \n No comparison with recent methods and approaches, \n Lack of technical contribution, \n Weak experiments,\n\n- General Discussion:\n\nIn this paper the authors present a simple formula for readability assessment\nof Vietnamese Text. Using a combination of features such as word count,\nsentence length etc they train a simple regression model to estimate the\nreadability of the documents. \n\nOne of the major weaknesses of the paper its lack of technical contribution -\nwhile early work in readability assessment employed simple methods like the one\noutlined in this paper, recent work on predicting readability uses more robust\nmethods that rely on language models for instance (Eg :\nhttp://www.cl.cam.ac.uk/~mx223/readability_bea_2016.pdf,\nhttp://www-personal.umich.edu/~kevynct/pubs/ITL-readability-invited-article-v10\n-camera.pdf). A comparison with such methods could be a useful contribution and\nmake the paper stronger especially if simple methods such as those outlined in\nthis paper can compete with more complicated models. \n\nBaseline experiments with SMOG, Gunning Fog index etc should also be presented\nas well as the other Vietnamese metrics and datasets that the authors cite. \n\nAnother problem is that while previous readability indices were more selective\nand classified content into granular levels corresponding to grade levels (for\ninstance), the authors use a coarse classification scheme to label documents as\neasy, medium and hard which makes the metric uninteresting. (Also, why not use\na classifier?)\n\nThe work is probably a bit too pre-mature and suffers from significant\nweaknesses to be accepted at this stage. I would encourage the authors to\nincorporate suggested feedback to make it better. \n\nThe paper also has quite a few grammatical errors which should be addressed in\nany future submission.", "SOUNDNESS_CORRECTNESS": "5", "ORIGINALITY": "3", "is_meta_review": null, "RECOMMENDATION": "1", "CLARITY": "4", "REVIEWER_CONFIDENCE": "5"}, {"IMPACT": "3", "SUBSTANCE": "1", "APPROPRIATENESS": "3", "MEANINGFUL_COMPARISON": "4", "PRESENTATION_FORMAT": "Poster", "comments": "The authors present a new formula for assessing readability of Vietnamese\ntexts. The formula is developed based on a multiple regression analysis with\nthree features. Furthermore, the authors have developed and annotated a new\ntext corpus with three readability classes (easy, middle, hard).\n\nResearch on languages other than English is interesting and important,\nespecially when it comes to low-resource languages. Therefore, the corpus might\nbe a nice additional resource for research (but it seems that the authors will\nnot publish it - is that right?). However, I don't think the paper is\nconvincing in its current shape or will influence future research. Here are my\nreasons:\n\n- The authors provide no reasons why there is a need for delevoping a new\nformula for readability assessments, given that there already exist two\nformulas for Vietnamese with almost the same features. What are the\ndisadvantages of those formulas and why is the new formula presented in this\npaper better?\n\n- In general, the experimental section lacks comparisons with previous work and\nanalysis of results. The authors claim that the accuracy of their formula (81%\non their corpus) is \"good and can be applied in practice\". What would be the\naccuracy of other formulas that already exist and what are the pros and cons of\nthose existing formulas compared to the new one?\n\n- As mentioned before, an analysis of results is missing, e.g. which word /\nsentence lengths / number of difficult words are considered as easy/middle/hard\nby their model?\n\n- A few examples how their formula could be applied in a practical application\nwould be nice as well.\n\n- The related work section is rather a \"background\" section since it only\npresents previously published formulas. What I'm missing is a more general\ndiscussion of related work. There are some papers that might be interesting for\nthat, e.g., DuBay 2004: \"The principles of readability\", or Rabin 1988:\n\"Determining difficulty levels of text written in languages other than English\"\n\n- Since Vietnamese is syllable-based and not word-based, I'm wondering how the\nauthors get \"words\" in their study. Do they use a particular approach for\nmerging syllables? And if yes, which approach do they use and what's the\naccuracy of the approach?\n\n- All in all, the content of the paper (experiments, comparisons, analysis,\ndiscussion, related work) is not enough for a long paper.\n\nAdditional remarks:\n\n- The language needs improvements\n\n- Equations: The usage of parentheses and multiplying operators is inconsistent\n\n- Related works section: The usage of capitalized first letters is inconsistent", "SOUNDNESS_CORRECTNESS": "5", "ORIGINALITY": "3", "is_meta_review": null, "RECOMMENDATION": "1", "CLARITY": "3", "REVIEWER_CONFIDENCE": "4"}], "abstract": "Text readability has an important role in text drafting and document selecting. Researches on the readability of the text have been made long ago for English and some common languages. There are few researches in Vietnamese text readability and most of them are performed from more than two decades ago on very small corpora. In this paper, we build a new and larger corpus and use it to create a newer formula to predict the difficulty of Vietnamese text. The experimental results show that the new formula can predict the readability of Vietnamese documents with over 80% accuracy.", "histories": [], "id": 68, "title": "A New Formula for Vietnamese Text Readability Assessment"}
