{"reviews": [{"IMPACT": "4", "SUBSTANCE": "4", "APPROPRIATENESS": "5", "MEANINGFUL_COMPARISON": "4", "PRESENTATION_FORMAT": "Oral Presentation", "comments": "- Strengths:\n\nThe authors propose a kernel-based method that captures high-order patterns\ndifferentiting different types of rumors by evaluating the similarities between\ntheir propagation tree structures.\n\n- Weaknesses:\n\nmaybe the maths is not always clear in Sect. 4. \n\n- General Discussion:\n\nThe authors propose a propagation tree kernel, a kernel-based method that\ncaptures high-order patterns differentiating types of rumors by evaluating the\nsimilarities between their propagation tree structures. The proposed approach\ndetects rumors more quickly and with a higher accuracy compared to the one\nobtained by the state of the art methods.\n\nThe data set should be made public for research purposes.\n\nTypos need to be fixed (e.g. 326/3277: any subgraph which have->has; 472:\nTPK->PTK; 644: Table 2 show+s), missing information needs to be added (875:\nwhere was it published?), information needs to be in the same format (e.g. 822\nvs 897). Figure 5 is a bit small.", "SOUNDNESS_CORRECTNESS": "3", "ORIGINALITY": "4", "is_meta_review": null, "RECOMMENDATION": "4", "CLARITY": "4", "REVIEWER_CONFIDENCE": "4"}], "abstract": "How fake news goes viral via social media? How does its propagation pattern differ from real stories? In this paper, we attempt to address the problem of identifying rumors, i.e., fake information, out of microblog posts based on their propagation structure. We firstly model microblog posts diffusion with propagation trees, which provide valuable clues on how an original message is transmitted and developed over time. We then propose a kernel-based method called Propagation Tree Kernel, which captures high-order patterns differentiating different types of rumors by evaluating the similarities between their propagation tree structures. Experimental results on two real-world datasets demonstrate that the proposed kernel-based approach can detect rumors more quickly and accurately than state-of-the-art rumor detection models.", "histories": [], "id": "729", "title": "Detect Rumors in Microblog Posts Using Propagation Structure via Kernel Learning"}
