{"reviews": [{"IMPACT": "4", "SUBSTANCE": "3", "APPROPRIATENESS": "5", "MEANINGFUL_COMPARISON": "4", "PRESENTATION_FORMAT": "Oral Presentation", "comments": "This paper proposes a joint model of salient phrase selection and discourse\nrelation prediction in spoken meeting. Experiments using meeting corpora show\nthat the proposed model has higher performance than the SVM-based classifier.\n\n- Strengths:\nThe paper is written to be easy to read. Technical details are described fully,\nand high performance is also shown in experimental evaluation. It also shows\nuseful comparisons with related research in the field of discourse structure\nanalysis and key phrase identification. It is interesting to note that not only\nthe performance evaluation of phrase selection from discourse, discourse\nrelation labeling, and summary generation as their applications, but also\napplication to the prediction of the consistency of  understanding by team\nmembers is also verified .\n\n- Weaknesses:\nJointly Modeling salient phrase extraction and discourse relationship labeling\nbetween speaker turns has been proposed. If intuitive explanation about their\ninteractivity and the usefulness of considering it is fully presented.\n\n- General Discussion:\nSVM-based classifier is set as a comparative method in the experiment. It would\nbe useful to mention the validity of the setting.", "SOUNDNESS_CORRECTNESS": "3", "ORIGINALITY": "4", "is_meta_review": null, "RECOMMENDATION": "3", "CLARITY": "4", "REVIEWER_CONFIDENCE": "2"}], "abstract": "We present a joint modeling approach to identify salient discussion points in spoken meetings as well as to label the discourse relations between speaker turns. A variation of our model is also discussed when discourse relations are treated as latent variables. Experimental results on two popular meeting corpora show that our joint model can outperform state-of-the-art approaches for both phrase-based content selection and discourse relation prediction tasks. We also evaluate our model on predicting the consistency among team members' understanding of their group decisions. Classifiers trained with features constructed from our model achieve significant better predictive performance than the state-of-the-art.", "histories": [], "id": "759", "title": "Joint Modeling of Content and Discourse Relations in Dialogues"}
