{"reviews": [{"IMPACT": "3", "SUBSTANCE": "3", "APPROPRIATENESS": "5", "MEANINGFUL_COMPARISON": "4", "PRESENTATION_FORMAT": "Poster", "comments": "This paper proposes an approach for classifying literal and metaphoric\nadjective-noun pairs. The authors create a word-context matrix for adjectives\nand nouns where each element of the matrix is the PMI score. They then use\ndifferent methods for selecting dimensions of this matrix to represent each\nnoun/adjective as a vector. The geometric properties of average, nouns, and\nadjective vectors and their normalized versions are used as features in\ntraining a regression model for classifying the pairs to literal or metaphor\nexpressions. Their approach performs similarly to previous work that learns a\nvector representation for each adjective.\n\nSupervision and zero-shot learning. The authors argue that their approach\nrequires less supervision (compared to previous work)  and can do zero-shot\nlearning. I don’t think this is quite right and given that it seems to be one\nof the main points of the paper, I think it is worth clarifying. The approach\nproposed in the paper is a supervised classification task: The authors form\nvector representations from co-occurrence statistics, and then use the\nproperties of these representations and the gold-standard labels of each pair\nto train a classifier. The model (similarly to any other supervised classifier)\ncan be tested on words that did not occur in the training data; but, the model\ndoes not learn from such examples. Moreover, those words are not really\n“unseen” because the model needs to have a vector representation of those\nwords.\n\nInterpretation of the results. The authors provide a good overview of the\nprevious related work on metaphors. However, I am not sure what the intuition\nabout their approach is (that is, using the geometric properties such as vector\nlength in identifying metaphors). For example, why are the normalized vectors\nconsidered? It seems that they don’t contribute to a better performance.\nMoreover, the most predictive feature is the noun vector; the authors explain\nthat this is a side effect of the data which is collected such that each\nadjective occurs in both metaphoric and literal expressions. (As a result, the\nadjective vector is less predictive.) It seems that the proposed approach might\nbe only suitable for the given data. This shortcoming is two-fold: (a) From the\ntheoretical perspective (and especially since the paper is submitted to the\ncognitive track), it is not clear what we learn about theories of metaphor\nprocessing. (b) From the NLP applications standpoint, I am not sure how\ngeneralizable this approach is compared to the compositional models.\n\nNovelty. The proposed approach for representing noun/adjective vectors is very\nsimilar to that of Agres et al. It seems that the main contribution of the\npaper is that they use the geometric properties to classify the vectors.", "SOUNDNESS_CORRECTNESS": "3", "ORIGINALITY": "4", "is_meta_review": null, "RECOMMENDATION": "3", "CLARITY": "4", "REVIEWER_CONFIDENCE": "4"}, {"IMPACT": "3", "SUBSTANCE": "3", "APPROPRIATENESS": "5", "MEANINGFUL_COMPARISON": "4", "PRESENTATION_FORMAT": "Poster", "comments": "This paper presents a  method for metaphor identification based on geometric\napproach. Certainly, very interesting piece of work. I enjoyed learning a\ncompletely new perspective. However, I have a few issues, I like them to be\naddressed by the authors. I would like to read author's response on the\nfollowing issues.\n\n- Strengths:\n\n* A geometric approach to metaphor interpretation is a new research strand\naltogether. \n* The paper is well written.\n* Author's claim is the beauty of their model lies in its simplicity, I do\nagree with their claim. But the implication of the simplicity is not been\naddressed in simple ways. Please refer the weakness section.\n\n- Weaknesses:\nRegarding writing\n===============\nNo doubt the paper is well-written. But the major issue with the paper is its\nlucidness. Indeed, poetic language, elegance is applaud-able, but clarity in\nscientific writing is very much needed. \nI hope you will agree with most of the stuff being articulated here:\nhttps://chairs-blog.acl2017.org/2017/02/02/last-minute-writing-advice/\n\nLet me put my objections on writing here:\n* \"while providing a method which is effectively zero-shot\"..left readers in\nthe blank. The notion of zero-shot has not been introduced yet!\n* Figure 2: most, neutral, least - metaphoric. How did you arrive at such\ndifferentiations?\n* Talk more about data. Otherwise, the method is less intuitive.\n* I enjoyed reading the analysis section. But it is not clear why the proposed\nsimple (as claimed) method can over-perform than other existing techniques?\nPutting some examples would be better, I believe.\n\nTechnicality\n============\n \"A strength of this model is its simplicity\" - indeed, but the implication is\nnot vivid from the writing. Mathematical and technical definition of a problem\nis one aspect, but the implication from the definition is quite hard to be\nunderstood. When that's the note-able contribution of the paper. Comparing to\nprevious research this paper shows only marginal accuracy gain.\n\n* Comparison only with one previous work and then claiming that the method is\ncapable of zero-shot, is slightly overstated. Is the method extendable to\nTwitter, let's say.\n\n- General Discussion:", "SOUNDNESS_CORRECTNESS": "3", "ORIGINALITY": "4", "is_meta_review": null, "RECOMMENDATION": "3", "CLARITY": "4", "REVIEWER_CONFIDENCE": "4"}], "abstract": "We present a method for metaphor identification based on an explicitly geometric approach to modelling salient lexical associations, and test it on a task of distinguishing metaphoric from literal uses of adjective-noun phrases. By contextually projecting candidate word pairs into interpretably geometric spaces, we show that it obtains state-of-the-art performance, while providing a method which is effectively \\emph{zero-shot} -- able to be applied to new unseen phrases. Our dynamically context-sensitive model is inspired by theoretical insight into the situational nature of language and cognition.", "histories": [], "id": 775, "title": "A Geometric Contextual Model for Identifying Unseen Metaphors"}
