{"title": "Broad-Coverage Semantic Parsing: A Transition-Based Approach", "abstract": "The representation of many common semantic phenomena requires structural properties beyond those commonly used for syntactic parsing.  We discuss a set of structural properties required for broad-coverage semantic representation, and note that existing parsers support some of these properties, but not all. We propose two transition-based techniques for parsing such semantic structures: (1) applying conversion procedures to map them into related formalisms, and using existing state-of-the-art parsers on the converted representations; and (2) constructing a parser that directly supports the full set of properties. We experiment with UCCA-annotated corpora, the only ones with all these structural semantic properties. Results demonstrate the effectiveness of transition-based methods for the task.", "id": "18", "reviews": [{"comments": "This paper presents a transition-based graph parser able to cope with the rich\nrepresentations of a semantico-cognitive annotation scheme, instantiated in the\nUCCA corpora. The authors start first by exposing what, according to them,\nshould cover a semantic-based annotation scheme: (i) being graph-based\n(possibility for a token/node of having multiple governors) (2) having\nnon-terminal nodes (representing complex structures â\u0080\u0093 syntactic -: coordinate\nphrases, lexical: multiword expression) and (3) allowing discontinuous elements\n(eg. Verbs+particules). Interestingly, none of these principles is tied to a\nsemantic framework, they could also work for syntax or other representation\nlayers. The authors quickly position their work by first introducing the larger\ncontext of broad-coverage semantic parsing then their annotation scheme of\nchoice (UCCA).              They then present 3 sets of parsing experiments: (i) one\ndevoted to phrase-based parsing using the Stanford parser and an UCCA to\nconstituency conversion, (ii) one devoted to dependency parsing using an UCCA\nto dependency conversion and finally (iii) the core of their proposal, a  set\nof experiments showing that their transition-based graph parser is suitable for\ndirect parsing of UCCA graphs.\n\nI found this work interesting but before considering a publication, I have\nseveral concerns with regards to the methodology and the empirical\njustifications:\n\nThe authors claimed that there are the first to propose a parser for a\nsemantically-oriented scheme such as theirs. Of course, they are. But with all\ndue respect to the work behind this scheme, it is made of graphs with a various\nlevel of under-specified structural arguments and semantically oriented label\n(Process, state) and nothing in their transition sets treats the specificities\nof such a graph. Even the transitions related to the remote edges could have\nbeen handled by the other ones assuming a difference in the label set itself\n(like adding an affix for example). If we restrict the problem to graph\nparsing, many works post the 2014-2015 semeval shared tasks (Almeda and\nMartins, 2014,2015 ; Ribeyre et al, 2014-2015) proposed an extension to\ntransition-based graph parser or an adaptation of a higher-model one, and\nnothing precludes their use on this data set.  Itâ\u0080\u0099s mostly the use of a\nspecific feature template that anchors this model to this scheme (even though\nitâ\u0080\u0099s less influencial than the count features and the unigram one). Anyway,\nbecause the above-mentioned graph-parsers are available [1,2] I donâ\u0080\u0099t\nunderstand why they couldnâ\u0080\u0099t be used as a baseline or source of comparisons.\nRegarding the phrase-based  experiments using uparse, it could have been also\nvalidated by another parser from Fernandez-Gonzales and Martins (2015) which\ncan produce LCFRS-like parsing as good as Uparse (ref missing when you first\nintroduced uparse).  \n\nBecause this scheme supports a more abstract view of syntaxico-semantic\nstructures than most of the SDP treebanks, it would have been important to use\nthe same metrics as in the related shared task. At this point in the field,\nmany systems, models and data set are competing and I think that the lack of\ncomparison points with other models and parsers is detrimental to this work as\nwhole. Yet I found it interesting and because weâ\u0080\u0099re at crossing time in term\nof where to go next, I think that this paper should be discussed at a\nconference such as ConLL.\n\nNote in random order\n-         please introduce the â\u0080\u009cgrounded semanticâ\u0080\u009d before page 2, you use\nthat phrase before\n-         why havenâ\u0080\u0099t you try to stick to constituent-tree with rich node\nlabels and propagater traces and then train/parse with the Berkeley parser? It\ncould have been a good baseline. \n-         The conversion to surface dependency trees is in my mind useless: you\nloose too many information, here a  richer conversion such as the one from\nâ\u0080\u0098Schluter et al, 2014, Semeval SDP) should have been used.\n-         Can you expand on â\u0080\u009cUCCA graphs may contains implicit unit that have\nno correspondent in the textâ\u0080\u009d  or provide a ref or an example.\n-         You mentioned other representations such as MRS and DRT, this raises\nthe fact that your scheme doesnâ\u0080\u0099t seem to allow for a modelling of quantifier\nscope information. Itâ\u0080\u0099s thus fully comparable to other more syntax-oriented\nscheme. Itâ\u0080\u0099s indeed more abstract than DM for example and probably more\nunderspecified than the semantic level of the PCEDT but how much? How really\ninformative is this scheme and how really â\u0080\u009cparsableâ\u0080\u009d is it? According to\nyour scores, it seems â\u0080\u009charderâ\u0080\u009d but an  error analysis would have been\nuseful.\n- As I said before, the 3 principles you devised could apply to a lot of\nthings,  they look a bit ad-hoc to me and would probably need to take place in\na much wider (and a bit clearer) introduction. What are you trying to argue\nfor: a parser that can parse UCCA? a model suitable for semantic analysis ? or\na semantic oriented scheme that can actually be parsable?  you're trying to say\nall of those in a very dense way and it's borderline to be be confusing.\n\n[1] http://www.corentinribeyre.fr/projects/view/DAGParser\n[2] https://github.com/andre-martins/TurboParser and\nhttps://github.com/andre-martins/TurboParser/tree/master/semeval2014_data", "is_meta_review": null, "RECOMMENDATION": "3", "REPLICABILITY": "5", "PRESENTATION_FORMAT": "Oral Presentation", "CLARITY": "4", "MEANINGFUL_COMPARISON": "4", "SUBSTANCE": "4", "REVIEWER_CONFIDENCE": "5", "SOUNDNESS_CORRECTNESS": "4", "APPROPRIATENESS": "5", "IMPACT": "3", "ORIGINALITY": "3"}, {"comments": "The paper presents the first broad-coverage semantic parsers for UCCA, one\nspecific approach to graph-based semantic representations. Unlike CoNLL\nsemantic dependency graphs, UCCA graphs can contain \"nonterminal\" nodes which\ndo not represent words in the string. Unlike AMRs, UCCA graphs are \"grounded\",\nwhich the authors take to mean that the text tokens appear as nodes in the\nsemantic representation. The authors present a number of parsing methods,\nincluding a transition-based parser that directly constructs UCCA parses, and\nevaluate them.\n\nGiven that UCCA and UCCA-annotated data exist, it seems reasonable to develop a\nsemantic parser for UCCA. However, the introduction and background section hit\na wrong note to my ear, in that they seem to argue that UCCA is the _only_\ngraph-based semantic representation (SR) formalism that makes sense to be\nstudied. This doesn't work for me, and also seems unnecessary -- a good UCCA\nparser could be a nice contribution by itself.\n\nI do not entirely agree with the three criteria for semantic representation\nformalisms the authors lay out in the introduction. For instance, it is not\nclear to me that \"nonterminal nodes\" contribute any expressive capacity. Sure,\nit can be inconvenient to have to decide which word is the head of a\ncoordinated structure, but exactly what information is it that could only be\nrepresented with a nonterminal and not e.g. with more informative edge labels?\nAlso, the question of discontinuity does not even arise in SRs that are not\n\"grounded\". The advantages of \"grounded\" representations over AMR-style ones\ndid not become clear to me. I also think that the word \"grounded\" has been used\nfor enough different concepts in semantics in the past ten years, and would\nencourage the authors to find a different one (\"anchored\"? \"lexicalized\"?).\nThus I feel that the entire introductory part of the paper should be phrased\nand argued much more carefully.\n\nThe parser itself seems fine, although I did not check the details. However, I\ndid not find the evaluation results very impressive. On the \"primary\" edges,\neven a straightforward MaltParser outperforms the BSP parser presented here,\nand the f-scores on the \"remote\" edges (which a dependency-tree parser like\nMalt cannot compute directly) are not very high either. Furthermore, the\nconversion of dependency graphs to dependency trees has been studied quite a\nbit under the name \"tree approximations\" in the context of the CoNLL 2014 and\n2015 shared tasks on semantic dependency parsing (albeit without \"nonterminal\"\nnodes). Several authors have proposed methods for reconstructing the edges that\nwere deleted in the graph-to-tree conversion; for instance, Agic et al. (2015),\n\"Semantic dependency graph parsing using tree approximations\" discuss the\nissues involved in this reconstruction in detail. By incorporating such\nmethods, it is likely that the f-score of the MaltParser (and the LSTM-based\nMaltParser!) could be improved further, and the strength of the BSP parser\nbecomes even less clear to me.", "is_meta_review": null, "RECOMMENDATION": "2", "REPLICABILITY": "4", "PRESENTATION_FORMAT": "Oral Presentation", "CLARITY": "3", "MEANINGFUL_COMPARISON": "2", "SUBSTANCE": "2", "REVIEWER_CONFIDENCE": "4", "SOUNDNESS_CORRECTNESS": "3", "APPROPRIATENESS": "5", "IMPACT": "3", "ORIGINALITY": "3"}]}
