{
  "name" : "182.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Modeling Contextual Relationships Among Utterances for Multimodal Sentiment Analysis",
    "authors" : [ ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : null,
      "text" : "1 000\n011\n012\n013\n014\n015\n016\n017\n018\n019\n020\n021\n022\n023\n024\n025\n026\n027\n028\n029\n030\n031\n032\n033\n034\n035\n036\n037\n038\n039\n040\n041\n042\n043\n044\n045\n046\n047\n048\n049\n061\n062\n063\n064\n065\n066\n067\n068\n069\n070\n071\n072\n073\n074\n075\n076\n077\n078\n079\n080\n081\n082\n083\n084\n085\n086\n087\n088\n089\n090\n091\n092\n093\n094\n095\n096\n097\n098\n099"
    }, {
      "heading" : "1 Introduction",
      "text" : "Emotion recognition and sentiment analysis have become a new trend in social media, helping users to automatically extract the opinions expressed in user-generated content, especially videos. Thanks to the high availability of computers and smartphones, and the rapid rise of social media, consumers tend to record their reviews and opinions about products or films and upload them on social media platforms, such as YouTube or Facebook. Such videos often contain comparisons, which can aid prospective buyers make an informed decision.\nThe primary advantage of analyzing videos over text is the surplus of behavioral cues present in vocal and visual modalities. The vocal modulations and facial expressions in the visual data, along with textual data, provide important cues to better identify affective states of the opinion holder. Thus, a combination of text and video data helps to create a better emotion and sentiment analysis model (Poria et al., 2017).\nRecently, a number of approaches to multimodal sentiment analysis, producing interesting results, have been proposed (Pérez-Rosas et al., 2013; Wollmer et al., 2013; Poria et al., 2015). However, there are major issues that remain unaddressed, such as the role of speaker-dependent versus speaker-independent models, the impact of each modality across the dataset, and generalization ability of a multimodal sentiment classifier. Leaving these issues unaddressed has presented difficulties in effective comparison of different multimodal sentiment analysis methods.\nAn utterance is a unit of speech bound by breathes or pauses. Utterance-level sentiment analysis focuses on tagging every utterance of a video with a sentiment label (instead of assigning a unique label to the whole video). In particular, utterance-level sentiment analysis is useful to understand the sentiment dynamics of different aspects of the topics covered by the speaker throughout his/her speech. The true meaning of an utterance is relative to its surrounding utterances.\nIn this paper, we consider such surrounding utterances to be the context, as the consideration of temporal relation and dependency among utterances is key in human-human communication. For example, the MOSI dataset (Zadeh et al., 2016) contains a video, in which a girl reviews the movie ‘Green Hornet’. At one point, she says “The Green Hornet did something similar”. Normally, doing something similar, i.e., monotonous or repetitive might be perceived as negative. However, the nearby utterances “It engages the audience more”, “they took a new spin on it”, “and I just loved it” indicate a positive context.\nIn this paper, we discard the oversimplifying hypothesis on the independence of utterances and develop a framework based on long short-term memory (LSTM) to extract utterance features that also consider surrounding utterances.\n2\n101\n102\n103\n104\n105\n106\n107\n108\n109\n110\n111\n112\n113\n114\n115\n116\n117\n118\n119\n120\n121\n122\n123\n124\n125\n126\n127\n128\n129\n130\n131\n132\n133\n134\n135\n136\n137\n138\n139\n140\n141\n142\n143\n144\n145\n146\n147\n148\n149\n150\n151\n152\n153\n154\n155\n156\n157\n158\n159\n160\n161\n162\n163\n164\n165\n166\n167\n168\n169\n170\n171\n172\n173\n174\n175\n176\n177\n178\n179\n180\n181\n182\n183\n184\n185\n186\n187\n188\n189\n190\n191\n192\n193\n194\n195\n196\n197\n198\n199\nOur model enables consecutive utterances to share information, thus providing contextual information in the classification process. Experimental results show that the proposed framework has outperformed the state of the art on benchmark datasets by 5−10%. The paper is organized as follows: Section 2 provides a brief literature review on multimodal sentiment analysis; Section 3 describes the proposed method in detail; experimental results and discussion are shown in Section 4; finally, Section 5 concludes the paper."
    }, {
      "heading" : "2 Related Work",
      "text" : "Text-based sentiment analysis systems can be broadly categorized into knowledge-based and statistics-based systems (Cambria, 2016). While the use of knowledge bases was initially more popular for the identification of emotions and polarity in text, sentiment analysis researchers have recently been using statistics-based approaches, with a special focus on supervised statistical methods (Pang et al., 2002; Socher et al., 2013).\nIn 1970, Ekman (Ekman, 1974) carried out extensive studies on facial expressions which showed that universal facial expressions are able to provide sufficient clues to detect emotions. Recent studies on speech-based emotion analysis (Datcu and Rothkrantz, 2008) have focused on identifying relevant acoustic features, such as fundamental frequency (pitch), intensity of utterance, bandwidth, and duration.\nAs for fusing audio and visual modalities for emotion recognition, two of the early works were done by De Silva et al. (De Silva et al., 1997) and Chen et al. (Chen et al., 1998). Both works showed that a bimodal system yielded a higher accuracy than any unimodal system. More recent research on audio-visual fusion for emotion recognition has been conducted at either feature level (Kessous et al., 2010) or decision level (Schuller, 2011).\nWhile there are many research papers on audiovisual fusion for emotion recognition, only a few have been devoted to multimodal emotion or sentiment analysis using textual clues along with visual and audio modalities. Wollmer et al. (Wollmer et al., 2013) and Rozgic et al. (Rozgic et al., 2012a,b) fused information from audio, visual, and textual modalities to extract emotion and sentiment. Metallinou et al. (Metallinou et al., 2008) and Eyben et al. (Eyben et al., 2010a) fused audio and textual modalities for emotion recognition.\nBoth approaches relied on a feature-level fusion. Wu et al. (Wu and Liang, 2011) fused audio and textual clues at decision level."
    }, {
      "heading" : "3 Method",
      "text" : "In this work, we propose a LSTM network that takes as input all utterances in a video and extracts contextual unimodal and multimodal features by modeling the dependencies among the input utterances. Below, we propose an overview of the method -\n1. Context-Independent Unimodal UtteranceLevel Feature Extraction\nFirst, the unimodal features are extracted without considering the contextual information of the utterances (Section 3.1). Table 1 presents the feature extraction methods used for each modality.\n2. Contextual Unimodal and Multimodal Classification\nThe context-independent unimodal features (from Step 1) are then fed into a LSTM network (termed contextual LSTM) that allows consecutive utterances in a video to share semantic information in the feature extraction process (which provides context-dependent unimodal and multimodal classification of the utterances). We experimentally show that this proposed framework improves the performance of utterance-level sentiment classification over traditional frameworks.\nVideos, comprising of its constituent utterances, serve as the input. We represent the dataset as U:\nU = ⎡⎢⎢⎢⎢⎢⎣ u1,1 u1,2 u1,3 ... u1,L1 u2,1 u2,2 u2,3 ... u2,L2 . . . ... . uM,1 uM,2 uM,3 ... uM,LM ⎤⎥⎥⎥⎥⎥⎦ .\nHere, ui,j denotes the jth utterance of the ith video and L = [L1, L2, ..., LM ] represents the number of utterances per video in the dataset set."
    }, {
      "heading" : "3.1 Extracting Context-Independent Unimodal Features",
      "text" : "Initially, the unimodal features are extracted from each utterance separately, i.e., we do not consider the contextual relation and dependency among the utterances (Table 1). Below, we explain the textual, audio, and visual feature extraction methods.\n3\n201\n202\n203\n204\n205\n206\n207\n208\n209\n210\n211\n212\n213\n214\n215\n216\n217\n218\n219\n220\n221\n222\n223\n224\n225\n226\n227\n228\n229\n230\n231\n232\n233\n234\n235\n236\n237\n238\n239\n240\n241\n242\n243\n244\n245\n246\n247\n248\n249\n250\n251\n252\n253\n254\n255\n256\n257\n258\n259\n260\n261\n262\n263\n264\n265\n266\n267\n268\n269\n270\n271\n272\n273\n274\n275\n276\n277\n278\n279\n280\n281\n282\n283\n284\n285\n286\n287\n288\n289\n290\n291\n292\n293\n294\n295\n296\n297\n298\n299"
    }, {
      "heading" : "3.1.1 text-CNN: Textual Features Extraction",
      "text" : "For feature extraction from textual data, we use a convolutional neural network (CNN).\nThe idea behind convolution is to take the dot product of a vector of k weights, wk, known as kernel vector, with each k-gram in the sentence s(t) to obtain another sequence of features c(t) = (c1(t), c2(t), . . . , cL(t)):\ncj = wTk ⋅ xi∶i+k−1. We then apply a max pooling operation over the feature map and take the maximum value ĉ(t) = max{c(t)} as the feature corresponding to this particular kernel vector. We use varying kernel vectors and window sizes to obtain multiple features.\nThe process of extracting textual features is as follows -\nFirst, we represent each sentence as the concatenation of vectors of the constituent words. These vectors are the publicly available 300-dimensional word2vec vectors trained on 100 billion words from Google News (Mikolov et al., 2013). The convolution kernels are thus applied to these word vectors instead of individual words. Each sentence is wrapped to a window of 50 words which serves as the input to the CNN.\nThe CNN has two convolutional layers - the first layer having a kernel size of 3 and 4, with 50 feature maps each and a kernel size 2 with 100 feature maps for the second. The convolution layers are interleaved with pooling layers of dimension 2. We use ReLU as the activation function. The convolution of the CNN over the sentence learns abstract representations of the phrases equipped with implicit semantic information, which with each successive layer spans over increasing number of words and ultimately the entire sentence.\nModality Model\nText text-CNN: Deep Convolutional NeuralNetwork with word embeddings\nVideo 3d-CNN: 3-dimensional CNNs employed onutterances of the videos Audio openSMILE: Extracts low level audiodescriptors from the audio modality\nTable 1: Methods for extracting context independent baseline features from different modalities."
    }, {
      "heading" : "3.1.2 Audio Feature Extraction",
      "text" : "Audio features are extracted in 30 Hz frame-rate; we use a sliding window of 100 ms. To compute the features, we use the open-source software\nopenSMILE (Eyben et al., 2010b) which automatically extracts pitch and voice intensity. Voice normalization is performed and voice intensity is thresholded to identify samples with and without voice. Z-standardization is used to perform voice normalization.\nThe features extracted by openSMILE consist of several low-level descriptors (LLD) and their statistical functionals. Some of the functionals are amplitude mean, arithmetic mean, root quadratic mean, etc. Taking into account all functionals of each LLD, we obtained 6373 features."
    }, {
      "heading" : "3.1.3 Visual Feature Extraction",
      "text" : "We use 3D-CNN to obtain visual features from the video. We hypothesize that 3D-CNN will not only be able to learn relevant features from each frame, but will also be able to learn the changes among given number of consecutive frames.\nIn the past, 3D-CNN has been successfully applied to object classification on 3D data (Ji et al., 2013). Its ability to achieve state-of-the-art results motivated us to use it.\nLet vid ∈ Rc×f×h×w be a video, where c = number of channels in an image (in our case c = 3, since we consider only RGB images), f = number of frames, h = height of the frames, and w = width of the frames. Again, we consider the 3D convolutional filter filt ∈ Rfm×c×fl×fh×fw, where fm = number of feature maps, c = number of channels, fd = number of frames (in other words depth of the filter), fh = height of the filter, and fw = width of the filter. Similar to 2D-CNN, filt slides across video vid and generates output convout ∈ Rfm×c×(f−fd+1)×(h−fh+1)×(w−fw+1). Next, we apply max pooling to convout to select only relevant features. The pooling will be applied only to the last three dimensions of the array convout.\nIn our experiments, we obtained best results with 32 feature maps (fm) with the filter-size of 5 × 5 × 5 (or fd × fh × fw). In other words, the dimension of the filter is 32 × 3 × 5 × 5 × 5 (or fm × c × fd × fh × fw). Subsequently, we apply max pooling on the output of convolution operation, with window-size being 3×3×3. This is followed by a dense layer of size 300 and softmax. The activations of this dense layer are finally used as the video features for each utterance."
    }, {
      "heading" : "3.2 Context-Dependent Feature Extraction",
      "text" : "We hypothesize that, within a video, there is a high probability of utterance relatedness with respect\n4\n301\n302\n303\n304\n305\n306\n307\n308\n309\n310\n311\n312\n313\n314\n315\n316\n317\n318\n319\n320\n321\n322\n323\n324\n325\n326\n327\n328\n329\n330\n331\n332\n333\n334\n335\n336\n337\n338\n339\n340\n341\n342\n343\n344\n345\n346\n347\n348\n349\n350\n351\n352\n353\n354\n355\n356\n357\n358\n359\n360\n361\n362\n363\n364\n365\n366\n367\n368\n369\n370\n371\n372\n373\n374\n375\n376\n377\n378\n379\n380\n381\n382\n383\n384\n385\n386\n387\n388\n389\n390\n391\n392\n393\n394\n395\n396\n397\n398\n399\nto their sentimental and emotional clues. Since most videos tend to be about a single topic, the utterances within each video are correlated, e.g., due to the development of the speaker’s idea, coreferences, etc. This calls for a model which takes into account such inter-dependencies and the effect these might have on the current utterance. To capture this flow of informational triggers across utterances, we use a LSTM-based recurrent network scheme (Gers, 2001)."
    }, {
      "heading" : "3.2.1 Long Short-Term Memory",
      "text" : "LSTM is a kind of recurrent neural network (RNN), an extension of conventional feed-forward neural network. Specifically, LSTM cells are capable of modeling long-range dependencies, which other traditional RNNs fail to do given the vanishing gradient issue. Each LSTM cell consists of an input gate i, an output gate o, and a forget gate f , which enables it to remember the error during the error propagation. Current research (Zhou et al., 2016) indicates the benefit of using such networks to incorporate contextual information in the classification process.\nIn our case, the LSTM network serves the purpose of context-dependent feature extraction by modeling relations among utterances. We term our architecture ‘contextual LSTM’. We propose several architectural variants of it later in the paper.\nLSTM\nsc-L ST M\nUtterance 1 Utterance 2 Utterance !\nContext Sensitive Utterance features\nDense Layer\nSoftmax Output\nLSTM LSTM\nContext Independent Utterance features\nFigure 1: Contextual LSTM network: input features are passed through an unidirectional LSTM layer, followed by a dense layer and then a softmax layer. Categorical cross entropy loss is taken for training. The dense layer activations serve as the output features."
    }, {
      "heading" : "3.2.2 Contextual LSTM Architecture",
      "text" : "Let unimodal features have dimension k, each utterance is thus represented by a feature vector xi,t ∈ Rk, where t represents the tth utterance of the video i. For a video, we collect the vectors for all the utterances in it, to get Xi = [xi,1,xi,2, ...,xi,Li] ∈ RLi×k, where Li represents the number of utterances in the video. This matrix Xi serves as the input to the LSTM. Figure 1 demonstrates the functioning of this LSTM module.\nIn the procedure getLstmFeatures(Xi) of Algorithm 1, each of these utterance xi,t is passed through a LSTM cell using the equations mentioned in line 32 to 37. The output of the LSTM cell hi,t is then fed into a dense layer and finally into a softmax layer (line 38 to 39). The activations of the dense layer zi,t are used as the contextdependent features of contextual LSTM."
    }, {
      "heading" : "3.2.3 Training",
      "text" : "The training of the LSTM network is performed using categorical cross entropy on each utterance’s softmax output per video, i.e.,\nloss = 1 N\nN\n∑ n=1\nC\n∑ c=1 yn,c log2( ˆyn,c),\nwhere N = total number of utterances in a video, yn,c = original output of class c, and ˆyn,c = predicted output.\nA dropout layer between the LSTM cell and dense layer is introduced to check overfitting. As the videos do not have same the number of utterances, padding is introduced to serve as neutral utterances. To avoid the proliferation of noise within the network, masking is done on these padded utterances to eliminate their effect in the network. Parameter tuning is done on the train set by splitting it into train and validation components with 80/20% split. RMSprop has been used as the optimizer which is known to resolve Adagrad’s radically diminishing learning rates (Duchi et al., 2011). After feeding the train set to the network, the test set is passed through it to generate their context-dependent features.\nDifferent Network Architectures We consider the following variants of the contextual LSTM architecture in our experiments -\nsc-LSTM This variant of the contextual LSTM architecture consists of unidirectional\n5\n401\n402\n403\n404\n405\n406\n407\n408\n409\n410\n411\n412\n413\n414\n415\n416\n417\n418\n419\n420\n421\n422\n423\n424\n425\n426\n427\n428\n429\n430\n431\n432\n433\n434\n435\n436\n437\n438\n439\n440\n441\n442\n443\n444\n445\n446\n447\n448\n449\n470\n471\n472\n473\n474\n475\n476\n477\n478\n479\n480\n481\n482\n483\n484\n485\n486\n487\n488\n489\n490\n491\n492\n493\n494\n495\n496\n497\n498\n499\nLSTM cells. As this is the simple variant of the contextual LSTM, we termed it as simple contextual LSTM (sc-LSTM)\nh-LSTM We also test on an architecture where the dense layer after the LSTM cell is omitted. Thus, the output of the LSTM cell hi,t provides our context-dependent features and the softmax layer provides the classification. We call this architecture hidden LSTM (h-LSTM).\nbc-LSTM Bi-directional LSTMs are two unidirectional LSTMs stacked together having opposite directions. Thus, an utterance can get information from other utterances occurring before and after itself in the video. We replaced the regular LSTM with a bi-directional LSTM and named the resulting architecture as bi-directional contextual LSTM (bc-LSTM). The training process of this architecture is similar to sc-LSTM.\nuni-SVM In this setting, we first obtain the unimodal features as explained in Section 3.1, concatenate them and then send to a SVM for the final classification. It should be noted that using a gated recurrent unit (GRU) instead of LSTM did not improve the performance."
    }, {
      "heading" : "3.3 Fusion of Modalities",
      "text" : "We accomplish multimodal fusion in two different ways as explained below -"
    }, {
      "heading" : "3.3.1 Non-hierarchical Framework",
      "text" : "In non-hierarchical framework, we concatenate context-independent unimodal features (from Section 3.1) and feed that into the contextual LSTM networks, i.e., sc-LSTM, bc-LSTM, and h-LSTM."
    }, {
      "heading" : "3.3.2 Hierarchical Framework",
      "text" : "Contextual unimodal features, taken as input, can further improve performance of the multimodal fusion framework explained in Section 3.3.1. To accomplish this, we propose a hierarchical deep network which comprises of two levels –\nLevel-1: context-independent unimodal features (from 3.1) are fed to the proposed LSTM network (Section 3.2.2) to get context-sensitive unimodal feature representations for each utterance. Individual LSTM networks are used for each modality.\nLevel-2: consists of a contextual LSTM network similar to Level-1 but independent in training and computation. Output from each LSTM network in Level-1 are concatenated and fed into\nthis LSTM network, thus providing an inherent fusion scheme - the prime objective of this level (Fig 2). The performance of the second level banks on the quality of the features from the previous level, with better features aiding the fusion process. Algorithm 1 describes the overall computation for utterance classification. For the hierarchical framework, we train Level 1 and Level 2 successively but separately.\nWeight Bias Wi,Wf ,Wc,Wo ∈ Rd×k bi, bf , bc, bo ∈ Rd Pi, Pf , Pc, PoVo ∈ Rd×d bz ∈ Rm\nWz ∈ Rm×d bsft ∈ Rc Wsft ∈ Rc×m\nTable 2: Summary of notations used in Algorithm 1. Note: d - dimension of hidden unit. k - dimension of input vectors to LSTM layer . c - number of classes."
    }, {
      "heading" : "4 Experimental Results",
      "text" : ""
    }, {
      "heading" : "4.1 Dataset details",
      "text" : "Most of the research in multimodal sentiment analysis is performed on datasets with speaker overlap in train and test splits.\nBecause each individual has a unique way of expressing emotions and sentiments, finding generic, person-independent features for sentimental analysis is very tricky. In real-world applications, the\n6\n501\n502\n503\n504\n505\n506\n507\n508\n509\n510\n511\n512\n513\n514\n515\n516\n517\n518\n519\n520\n521\n522\n523\n524\n525\n526\n527\n528\n529\n530\n531\n532\n533\n534\n535\n536\n537\n538\n539\n540\n541\n542\n543\n544\n545\n546\n547\n548\n549\n550\n551\n552\n553\n554\n555\n556\n557\n558\n559\n560\n561\n562\n563\n564\n565\n566\n567\n568\n569\n570\n571\n572\n573\n574\n575\n576\n577\n578\n579\n580\n581\n582\n583\n584\n585\n592\n593\n594\n595\n596\n597\n598\n599\nAlgorithm 1 Proposed Architecture 1: procedure TRAINARCHITECTURE( U, V) 2: Train context-independent models with U 3: for i:[1,M] do ▷ extract baseline features 4: for j:[1,Li] do 5: xi,j ← TextFeatures(ui,j) 6: x ′\ni,j ← V ideoFeatures(ui,j) 7: x”i,j ← AudioFeatures(ui,j) 8: Unimodal: 9: Train LSTM at Level-1 with X,X ′ andX”.\n10: for i:[1,M] do ▷ unimodal features 11: Zi ← getLSTMFeatures(Xi) 12: Z ′ i ← getLSTMFeatures(X ′\ni) 13: Z”i ← getLSTMFeatures(X”i ) 14: Multimodal: 15: for i:[1,M] do 16: for j:[1,Li] do 17: if Non-hierarchical fusion then 18: x∗i,j ← (xi,j ∣∣x ′\ni,j ∣∣x”i,j) ▷ concatenation\n19: else 20: if Hierarchical fusion then 21: x∗i,j ← (zi,j ∣∣z ′\ni,j ∣∣z”i,j) ▷ concatenation 22: Train LSTM at Level-2 with X∗. 23: for i:[1,M] do ▷ multimodal features 24: Z∗i ← getLSTMFeatures(X∗i ) 25: testArchitecture( V) 26: return Z∗\n27: procedure TESTARCHITECTURE( V) 28: Similar to training phase. V is passed through the\nlearnt models to get the features and classification outputs. Table 2 shows the trainable parameters.\n29: procedure GETLSTMFEATURES(Xi) ▷ for ith video 30: Zi ← φ 31: for t:[1,Li] do ▷ Table 2 provides notation 32: it ← σ(Wixi,t + Pi.ht−1 + bi) 33: C̃t ← tanh(Wcxi,t + Pcht−1 + bc) 34: ft ← σ(Wfxt + Pfht−1 + bf) 35: Ct ← it ∗ C̃t + ft ∗Ct−1 36: ot ← σ(Woxt + Poht−1 + VoCt + bo) 37: ht ← ot ∗ tanh(Ct) ▷ output of lstm cell 38: zt ← ReLU(Wzht + bz) ▷ dense layer 39: prediction← softmax(Wsftzt + bsft) 40: Zi ← Zi ∪ zt 41: return Zi\nmodel should be robust to person variance but it is very difficult to come up with a generalized model from the behavior of a limited number of individuals To this end, we perform person-independent experiments to emulate unseen conditions. Our train/test splits of the datasets are completely disjoint with respect to speakers.\nWhile testing, our models have to classify emotions and sentiments from utterances by speakers they have never seen before.\nIEMOCAP: The IEMOCAP contains the acts of 10 speakers in a two way conversation segmented into utterances. The database contains the following categorical labels: anger, happiness, sadness, neutral, excitement, frustration, fear, surprise, and other, but we take only the first four so as to compare with the state of the art (Rozgic et al., 2012b) and other authors. Videos by the first 8 speakers are considered in the train set. The train/test split details are provided in table 3.\nMOSI: The MOSI dataset is a dataset rich in sentimental expressions where 93 persons review topics in English. It contains positive and negative classes as its sentiment labels. The train/validation set comprises of the first 62 individuals in the dataset.\nMOUD: This dataset contains product review videos provided by around 55 persons. The reviews are in Spanish (we use Google Translate API1 to get the english transcripts). The utterances are labeled to be either positive, negative or neutral. However, we drop the neutral label to maintain consistency with previous work. The first 59 videos are considered in the train/val set.\nTable 3 provides information regarding train/test split of all the datasets. In these splits it is ensured that 1) No two utterances from the train and test splits belong to the same video. 2) The train/test splits have no speaker overlap. This provides the speaker-independent setting.\nTable 3 also provides cross dataset split details where the complete datasets of MOSI and MOUD are used for training and testing respectively. The proposed model being used on reviews from different languages allows us to analyze its robustness and generalizability.\nIt should be noted that the datasets’ individual configuration and splits are same throughout all the experiments (i.e., context-independent unimodal feature extraction, LSTM-based context-\n1http://translate.google.com\n7\n601\n602\n603\n604\n605\n606\n607\n608\n609\n610\n611\n612\n613\n614\n615\n616\n617\n618\n619\n620\n621\n622\n623\n624\n625\n626\n627\n628\n629\n630\n631\n632\n633\n634\n635\n636\n637\n638\n639\n640\n641\n642\n643\n644\n645\n646\n647\n648\n649\n650\n651\n652\n653\n654\n655\n656\n657\n658\n659\n660\n661\n662\n663\n664\n665\n666\n667\n668\n669\n670\n671\n672\n673\n674\n675\n676\n677\n678\n679\n680\n681\n682\n683\n684\n685\n686\n687\n688\n689\n690\n691\n692\n693\n694\n695\n696\n697\n698\n699\ndependent unimodal and multimodal feature extraction and classification)."
    }, {
      "heading" : "4.2 Performance of Different Models and Comparisons",
      "text" : "In this section, we present unimodal and multimodal sentiment analysis performance of different LSTM network variants as explained in Section 3.2.3 and comparison with the state of the art.\nHierarchical vs Non-hierarchical Fusion Framework - As expected, trained contextual unimodal features help the hierarchical fusion framework to outperform the non-hierarchical framework. Table 4 demonstrates this by comparing both hierarchical and non-hierarchical framework using the bc-LSTM network. Due to this fact, we provide all further analysis and results using the hierarchical framework. Nonhierarchical model outperforms the performance of the baseline uni-SVM. This further leads us to conclude that it is the context-sensitive learning paradigm which plays the key role in improving performance over the baseline.\nComparison among Network Variants - It is to be noted that both sc-LSTM and bc-LSTM perform quite well on the multimodal emotion recognition and sentiment analysis datasets. Since, bcLSTM has access to both the preceding and following information of the utterance sequence, it performs consistently better on all the datasets over sc-LSTM.\nThe usefulness of the dense layer in improving the performance is prominent from the experimental results as shown in Table 4. The performance improvement is in the range of 0.3% to 1.5% on MOSI and MOUD datasets. On the IEMOCAP dataset, the performance improvement of bc-LSTM and sc-LSTM over h-LSTM is in the range of 1% to 5%.\nComparison with the Baseline and state of the art - Every LSTM network variant has outperformed the baseline uni-SVM on all the datasets by the margin of 2% to 5%(see Table 4). These results prove our initial hypothesis that modeling the contextual dependencies among utterances, which uni-SVM cannot do, improves the classification. The higher performance improvement on the IEMOCAP dataset indicates the necessity of modeling long-range dependencies among the utterances as continuous emotion recognition\nis a multiclass sequential problem where a person doesnt frequently change emotions (Wöllmer et al., 2008).\nWe have implemented and compared with the current state-of-the-art approach proposed by Poria et al. (Poria et al., 2015). In their method, they extracted features from each modality and fed to a multiple kernel learning (MKL) classifier. However, they did not conduct the experiment in speaker-independent manner and also did not consider the contextual relation among the utterances. Experimental results in Table 5 shows that the proposed method has outperformed Poria et al. (Poria et al., 2015) by a significant margin. For the emotion recognition task, we have compared our method with the current state of the art (Rozgic et al., 2012b), who extracted features in a similar fashion to (Poria et al., 2015) did. However, for fusion they used SVM trees."
    }, {
      "heading" : "4.3 Importance of the Modalities",
      "text" : "As expected, in all kinds of experiments, bimodal and trimodal models have outperformed unimodal models. Overall, audio modality has performed better than visual on all the datasets. On MOSI and IEMOCAP datasets, textual classifier achieves the best performance over other unimodal classifiers. On IEMOCAP dataset, the unimodal and multimodal classifiers obtained poor performance to classify neutral utterances. Textual modality, combined with non-textual modes boosts the performance in IEMOCAP by a large margin. However, the margin is less in the other datasets.\nOn the MOUD dataset, textual modality performs worse than audio modality due to the noise introduced in translating Spanish utterances to English. Using Spanish word vectors2 in text-CNN results in an improvement of 10% . Nonetheless, we report results using these translated utterances as opposed to utterances trained on Spanish word vectors, in order to make fair comparison with (Poria et al., 2015)."
    }, {
      "heading" : "4.4 Generalization of the Models",
      "text" : "To test the generalizability of the models, we have trained our framework on complete MOSI dataset and tested on MOUD dataset (Table 6). The performance was poor for audio and textual modality as the MOUD dataset is in Spanish while the model is trained on MOSI dataset which is in En-\n2http://crscardellino.me/SBWCE\n8\n701\n702\n703\n704\n705\n706\n707\n708\n709\n710\n711\n712\n713\n714\n715\n716\n717\n718\n719\n720\n721\n722\n723\n724\n725\n726\n727\n728\n729\n730\n731\n732\n733\n734\n735\n736\n737\n738\n739\n740\n741\n742\n743\n744\n745\n746\n747\n748\n749\n750\n751\n752\n753\n754\n755\n756\n757\n758\n759\n760\n761\n762\n763\n764\n765\n766\n767\n768\n769\n770\n771\n772\n773\n774\n775\n776\n777\n778\n779\n780\n781\n782\n783\n784\n785\n786\n787\n788\n789\n790\n791\n792\n793\n794\n795\n796\n797\n798\n799\nModality MOSI MOUD IEMOCAP hierarchical (%)\nno n-\nhi er\n(% ) hierarchical (%)\nno n-\nhi er\n(% ) hierarchical (%)\nno n-\nhi er\n(% )\nun i-\nSV M\nhL\nST M\nsc -L\nST M\nbc -L\nST M\nun i-\nSV M\nhL\nST M\nsc -L\nST M\nbc -L\nST M\nun i-\nSV M\nhL\nST M\nsc -L\nST M\nbc -L\nST M\nT 75.5 77.4 77.6 78.1 49.5 50.1 51.3 52.1 65.5 68.9 71.4 73.6 V 53.1 55.2 55.6 55.8 46.3 48.0 48.2 48.5 47.0 52.0 52.6 53.2 A 58.5 59.6 59.9 60.3 51.5 56.3 57.5 59.9 52.9 54.4 55.2 57.1\nT + V 76.7 78.9 79.9 80.2 78.5 50.2 50.6 51.3 52.2 50.9 68.5 70.3 72.3 75.4 73.2 T + A 75.8 78.3 78.8 79.3 78.2 53.1 56.9 57.4 60.4 55.5 70.1 74.1 75.2 75.6 74.5 V + A 58.6 61.5 61.8 62.1 60.3 62.8 62.9 64.4 65.3 64.2 67.6 67.8 68.2 68.9 67.3 T + V + A 77.9 78.1 78.6 80.3 78.1 66.1 66.4 67.3 68.1 67.0 72.5 73.3 74.2 76.1 73.5\nTable 4: Comparison of models mentioned in Section 3.2.3. The table reports the accuracy of classification. Note: non-hier ← Non-hierarchical bc-lstm. For remaining fusion hierarchical fusion framework is used (Section 3.3.2)\nModality Sentiment (%) Emotion on IEMOCAP (%)MOSI MOUD angry happy sad neutral T 78.12 52.17 76.07 78.97 76.23 67.44 V 55.80 48.58 53.15 58.15 55.49 51.26 A 60.31 59.99 58.37 60.45 61.35 52.31\nT + V 80.22 52.23 77.24 78.99 78.35 68.15 T + A 79.33 60.39 77.15 79.10 78.10 69.14 V + A 62.17 65.36 68.21 71.97 70.35 62.37 A + V + T 80.30 68.11 77.98 79.31 78.30 69.92 State-of 73.551 63.251 73.10 2 72.402 61.902 58.102-the-art 1by (Poria et al., 2015),2by (Rozgic et al., 2012b)\nTable 5: Accuracy % on textual (T), visual (V), audio (A) modality and comparison with the state of the art. For fusion, hierarchical fusion framework was used (Section 3.3.2)\nModality MOSI→MOUDuni-SVM h-LSTM sc-LSTM bc-LSTM T 46.5% 46.5% 46.6% 46.9% V 43.3% 45.5% 48.3% 49.6% A 42.9% 46.0% 46.4% 47.2%\nT + V 49.8% 49.8% 49.8% 49.8% T + A 50.4% 50.9% 51.1% 51.3% V + A 46.0% 47.1% 49.3% 49.6% T + V + A 51.1% 52.2% 52.5% 52.7%\nTable 6: Cross Dataset comparison. The table reports the accuracy of classification.\nglish language. However, notably visual modality performs better than other two modalities in this experiment which signifies that in cross-lingual scenarios facial expressions carry more generalized, robust information than audio and textual modalities. We could not carry out the similar experiment for emotion recognition as no other utterance-level dataset apart from the IEMOCAP was available at the time of our experiments."
    }, {
      "heading" : "4.5 Qualitative Analysis",
      "text" : "In some cases the predictions of the proposed method are wrong given the difficulty in recognizing the face and noisy audio signal in the utterances. Also, cases where the sentiment is very weak and non contextual, the proposed approach shows some bias towards its surrounding utter-\nances which further leads to wrong predictions. This can be solved by developing a context aware attention mechanism. In order to have a better understanding on roles of modalities for overall classification, we also have done some qualitative analysis. For example, this utterance - ”who doesn’t have any presence or greatness at all.”, was classified as positive by the audio classifier (“doesn’t” was spoken normally by the speaker, but “presence and greatness at all” was spoken with enthusiasm). However, textual modality caught the negation induced by “doesn’t” and classified correctly. In another utterance “amazing special effects” as there was no jest of enthusiasm in speaker’s voice and face audio-visual classifier failed to identify the positivity of this utterance. On the other textual classifier correctly detected the polarity as positive.\nOn the other hand, textual classifier classified this sentence - “that like to see comic book characters treated responsibly” as positive, possibly because of the presence of positive phrases such as “like to see”, “responsibly”. However, the high pitch of anger in the person’s voice and the frowning face helps identify this to be a negative utterance."
    }, {
      "heading" : "5 Conclusion",
      "text" : "Contextual relationship among the utterances is mostly ignored in the literature. In this paper, we developed a LSTM-based network to extract contextual features from the utterances of a video for multimodal sentiment analysis. The proposed method has outperformed the state of the art and showed significant performance improvement over the baseline. As a part of the future work, we plan to propose LSTM attention model to determine importance of the utterances and contribution of modalities in the sentiment classification.\n9\n801\n802\n803\n804\n805\n806\n807\n808\n809\n810\n811\n812\n813\n814\n815\n816\n817\n818\n819\n820\n821\n822\n823\n824\n825\n826\n827\n828\n829\n830\n831\n832\n833\n834\n835\n836\n837\n838\n839\n840\n841\n842\n843\n844\n845\n846\n847\n848\n849\n850\n851\n852\n853\n854\n855\n856\n857\n858\n859\n860\n861\n862\n863\n864\n865\n866\n867\n868\n869\n870\n871\n872\n873\n874\n875\n876\n877\n878\n879\n880\n881\n882\n883\n884\n885\n886\n887\n888\n889\n890\n891\n892\n893\n894\n895\n896\n897\n898\n899"
    } ],
    "references" : [ {
      "title" : "Affective computing and sentiment analysis",
      "author" : [ "Erik Cambria." ],
      "venue" : "IEEE Intelligent Systems 31(2):102– 107.",
      "citeRegEx" : "Cambria.,? 2016",
      "shortCiteRegEx" : "Cambria.",
      "year" : 2016
    }, {
      "title" : "Multimodal human emotion/expression recognition",
      "author" : [ "Lawrence S Chen", "Thomas S Huang", "Tsutomu Miyasato", "Ryohei Nakatsu." ],
      "venue" : "Proceedings of the Third IEEE International Conference on Automatic Face and Gesture Recognition. IEEE,",
      "citeRegEx" : "Chen et al\\.,? 1998",
      "shortCiteRegEx" : "Chen et al\\.",
      "year" : 1998
    }, {
      "title" : "Semantic audio-visual data fusion for automatic emotion recognition",
      "author" : [ "Dragos Datcu", "L Rothkrantz." ],
      "venue" : "Euromedia’2008 .",
      "citeRegEx" : "Datcu and Rothkrantz.,? 2008",
      "shortCiteRegEx" : "Datcu and Rothkrantz.",
      "year" : 2008
    }, {
      "title" : "Facial emotion recognition using multi-modal information",
      "author" : [ "Liyanage C De Silva", "Tsutomu Miyasato", "Ryohei Nakatsu." ],
      "venue" : "Proceedings of ICICS. IEEE, volume 1, pages 397–401.",
      "citeRegEx" : "Silva et al\\.,? 1997",
      "shortCiteRegEx" : "Silva et al\\.",
      "year" : 1997
    }, {
      "title" : "Adaptive subgradient methods for online learning and stochastic optimization",
      "author" : [ "John Duchi", "Elad Hazan", "Yoram Singer." ],
      "venue" : "Journal of Machine Learning Research 12(Jul):2121–2159.",
      "citeRegEx" : "Duchi et al\\.,? 2011",
      "shortCiteRegEx" : "Duchi et al\\.",
      "year" : 2011
    }, {
      "title" : "Universal facial expressions of emotion",
      "author" : [ "Paul Ekman." ],
      "venue" : "Culture and Personality: Contemporary Readings/Chicago .",
      "citeRegEx" : "Ekman.,? 1974",
      "shortCiteRegEx" : "Ekman.",
      "year" : 1974
    }, {
      "title" : "On-line emotion recognition in a 3-d activation-valence-time continuum using acoustic and linguistic cues",
      "author" : [ "Florian Eyben", "Martin Wöllmer", "Alex Graves", "Björn Schuller", "Ellen Douglas-Cowie", "Roddy Cowie." ],
      "venue" : "Journal on Multimodal User In-",
      "citeRegEx" : "Eyben et al\\.,? 2010a",
      "shortCiteRegEx" : "Eyben et al\\.",
      "year" : 2010
    }, {
      "title" : "Opensmile: the munich versatile and fast open-source audio feature extractor",
      "author" : [ "Florian Eyben", "Martin Wöllmer", "Björn Schuller." ],
      "venue" : "Proceedings of the 18th ACM international conference on Multimedia. ACM, pages 1459–1462.",
      "citeRegEx" : "Eyben et al\\.,? 2010b",
      "shortCiteRegEx" : "Eyben et al\\.",
      "year" : 2010
    }, {
      "title" : "Long Short-Term Memory in Recurrent Neural Networks",
      "author" : [ "Felix Gers." ],
      "venue" : "Ph.D. thesis, Universität Hannover.",
      "citeRegEx" : "Gers.,? 2001",
      "shortCiteRegEx" : "Gers.",
      "year" : 2001
    }, {
      "title" : "3d convolutional neural networks for human action recognition",
      "author" : [ "Shuiwang Ji", "Wei Xu", "Ming Yang", "Kai Yu." ],
      "venue" : "IEEE transactions on pattern analysis and machine intelligence 35(1):221–231.",
      "citeRegEx" : "Ji et al\\.,? 2013",
      "shortCiteRegEx" : "Ji et al\\.",
      "year" : 2013
    }, {
      "title" : "Multimodal emotion recognition in speech-based interaction using facial expression, body gesture and acoustic analysis",
      "author" : [ "Loic Kessous", "Ginevra Castellano", "George Caridakis." ],
      "venue" : "Journal on Multimodal User Interfaces 3(1-2):33–48.",
      "citeRegEx" : "Kessous et al\\.,? 2010",
      "shortCiteRegEx" : "Kessous et al\\.",
      "year" : 2010
    }, {
      "title" : "Audio-visual emotion recognition using gaussian mixture models for face and voice",
      "author" : [ "Angeliki Metallinou", "Sungbok Lee", "Shrikanth Narayanan." ],
      "venue" : "Tenth IEEE International Symposium on ISM 2008. IEEE, pages 250–257.",
      "citeRegEx" : "Metallinou et al\\.,? 2008",
      "shortCiteRegEx" : "Metallinou et al\\.",
      "year" : 2008
    }, {
      "title" : "Efficient estimation of word representations in vector space",
      "author" : [ "Tomas Mikolov", "Kai Chen", "Greg Corrado", "Jeffrey Dean." ],
      "venue" : "arXiv preprint arXiv:1301.3781 .",
      "citeRegEx" : "Mikolov et al\\.,? 2013",
      "shortCiteRegEx" : "Mikolov et al\\.",
      "year" : 2013
    }, {
      "title" : "Thumbs up?: sentiment classification using machine learning techniques",
      "author" : [ "Bo Pang", "Lillian Lee", "Shivakumar Vaithyanathan." ],
      "venue" : "Proceedings of ACL. Association for Computational Linguistics, pages 79–86.",
      "citeRegEx" : "Pang et al\\.,? 2002",
      "shortCiteRegEx" : "Pang et al\\.",
      "year" : 2002
    }, {
      "title" : "Utterance-level multimodal sentiment analysis",
      "author" : [ "Verónica Pérez-Rosas", "Rada Mihalcea", "LouisPhilippe Morency." ],
      "venue" : "ACL (1). pages 973– 982.",
      "citeRegEx" : "Pérez.Rosas et al\\.,? 2013",
      "shortCiteRegEx" : "Pérez.Rosas et al\\.",
      "year" : 2013
    }, {
      "title" : "A review of affective computing: From unimodal analysis to multimodal fusion",
      "author" : [ "Soujanya Poria", "Erik Cambria", "Rajiv Bajpai", "Amir Hussain." ],
      "venue" : "Information Fusion .",
      "citeRegEx" : "Poria et al\\.,? 2017",
      "shortCiteRegEx" : "Poria et al\\.",
      "year" : 2017
    }, {
      "title" : "Deep convolutional neural network textual features and multiple kernel learning for utterance-level multimodal sentiment analysis",
      "author" : [ "Soujanya Poria", "Erik Cambria", "Alexander Gelbukh." ],
      "venue" : "Proceedings of EMNLP. pages 2539–2544.",
      "citeRegEx" : "Poria et al\\.,? 2015",
      "shortCiteRegEx" : "Poria et al\\.",
      "year" : 2015
    }, {
      "title" : "Ensemble of SVM trees for multimodal emotion recognition",
      "author" : [ "V. Rozgic", "Sankaranarayanan Ananthakrishnan", "Shirin Saleem", "Rohit Kumar", "Rohit Prasad." ],
      "venue" : "Proceedings of APSIPA ASC. IEEE, pages 1–4.",
      "citeRegEx" : "Rozgic et al\\.,? 2012a",
      "shortCiteRegEx" : "Rozgic et al\\.",
      "year" : 2012
    }, {
      "title" : "Ensemble of svm trees for multimodal emotion recognition",
      "author" : [ "Viktor Rozgic", "Sankaranarayanan Ananthakrishnan", "Shirin Saleem", "Rohit Kumar", "Rohit Prasad." ],
      "venue" : "Signal & Information Processing Association Annual Summit and Conference",
      "citeRegEx" : "Rozgic et al\\.,? 2012b",
      "shortCiteRegEx" : "Rozgic et al\\.",
      "year" : 2012
    }, {
      "title" : "Recognizing affect from linguistic information in 3d continuous space",
      "author" : [ "Björn Schuller." ],
      "venue" : "IEEE Transactions on Affective Computing 2(4):192–205.",
      "citeRegEx" : "Schuller.,? 2011",
      "shortCiteRegEx" : "Schuller.",
      "year" : 2011
    }, {
      "title" : "Recursive deep models for semantic compositionality over a sentiment treebank",
      "author" : [ "Richard Socher", "Alex Perelygin", "Jean Y Wu", "Jason Chuang", "Christopher D Manning", "Andrew Y Ng", "Christopher Potts." ],
      "venue" : "Proceedings of EMNL). Citeseer, volume",
      "citeRegEx" : "Socher et al\\.,? 2013",
      "shortCiteRegEx" : "Socher et al\\.",
      "year" : 2013
    }, {
      "title" : "Abandoning emotion classes-towards continuous emotion recognition with modelling of long-range dependencies",
      "author" : [ "Martin Wöllmer", "Florian Eyben", "Stephan Reiter", "Björn W Schuller", "Cate Cox", "Ellen Douglas-Cowie", "Roddy Cowie" ],
      "venue" : null,
      "citeRegEx" : "Wöllmer et al\\.,? \\Q2008\\E",
      "shortCiteRegEx" : "Wöllmer et al\\.",
      "year" : 2008
    }, {
      "title" : "Youtube movie reviews: Sentiment analysis in an audio-visual context",
      "author" : [ "Martin Wollmer", "Felix Weninger", "Timo Knaup", "Bjorn Schuller", "Congkai Sun", "Kenji Sagae", "LouisPhilippe Morency." ],
      "venue" : "IEEE Intelligent Systems 28(3):46–53.",
      "citeRegEx" : "Wollmer et al\\.,? 2013",
      "shortCiteRegEx" : "Wollmer et al\\.",
      "year" : 2013
    }, {
      "title" : "Emotion recognition of affective speech based on multiple classifiers using acoustic-prosodic information and semantic labels",
      "author" : [ "Chung-Hsien Wu", "Wei-Bin Liang." ],
      "venue" : "IEEE Transactions on Affective Computing 2(1):10–21.",
      "citeRegEx" : "Wu and Liang.,? 2011",
      "shortCiteRegEx" : "Wu and Liang.",
      "year" : 2011
    }, {
      "title" : "Multimodal sentiment intensity analysis in videos: Facial gestures and verbal",
      "author" : [ "Amir Zadeh", "Rowan Zellers", "Eli Pincus", "LouisPhilippe Morency" ],
      "venue" : null,
      "citeRegEx" : "Zadeh et al\\.,? \\Q2016\\E",
      "shortCiteRegEx" : "Zadeh et al\\.",
      "year" : 2016
    }, {
      "title" : "Attentionbased bidirectional long short-term memory networks for relation classification",
      "author" : [ "Peng Zhou", "Wei Shi", "Jun Tian", "Zhenyu Qi", "Bingchen Li", "Hongwei Hao", "Bo Xu." ],
      "venue" : "The 54th Annual Meeting of the Association for Computational Lin-",
      "citeRegEx" : "Zhou et al\\.,? 2016",
      "shortCiteRegEx" : "Zhou et al\\.",
      "year" : 2016
    } ],
    "referenceMentions" : [ {
      "referenceID" : 15,
      "context" : "Thus, a combination of text and video data helps to create a better emotion and sentiment analysis model (Poria et al., 2017).",
      "startOffset" : 105,
      "endOffset" : 125
    }, {
      "referenceID" : 14,
      "context" : "Recently, a number of approaches to multimodal sentiment analysis, producing interesting results, have been proposed (Pérez-Rosas et al., 2013; Wollmer et al., 2013; Poria et al., 2015).",
      "startOffset" : 117,
      "endOffset" : 185
    }, {
      "referenceID" : 22,
      "context" : "Recently, a number of approaches to multimodal sentiment analysis, producing interesting results, have been proposed (Pérez-Rosas et al., 2013; Wollmer et al., 2013; Poria et al., 2015).",
      "startOffset" : 117,
      "endOffset" : 185
    }, {
      "referenceID" : 16,
      "context" : "Recently, a number of approaches to multimodal sentiment analysis, producing interesting results, have been proposed (Pérez-Rosas et al., 2013; Wollmer et al., 2013; Poria et al., 2015).",
      "startOffset" : 117,
      "endOffset" : 185
    }, {
      "referenceID" : 24,
      "context" : "For example, the MOSI dataset (Zadeh et al., 2016) contains a video, in which a girl reviews the movie ‘Green Hornet’.",
      "startOffset" : 30,
      "endOffset" : 50
    }, {
      "referenceID" : 0,
      "context" : "Text-based sentiment analysis systems can be broadly categorized into knowledge-based and statistics-based systems (Cambria, 2016).",
      "startOffset" : 115,
      "endOffset" : 130
    }, {
      "referenceID" : 13,
      "context" : "While the use of knowledge bases was initially more popular for the identification of emotions and polarity in text, sentiment analysis researchers have recently been using statistics-based approaches, with a special focus on supervised statistical methods (Pang et al., 2002; Socher et al., 2013).",
      "startOffset" : 257,
      "endOffset" : 297
    }, {
      "referenceID" : 20,
      "context" : "While the use of knowledge bases was initially more popular for the identification of emotions and polarity in text, sentiment analysis researchers have recently been using statistics-based approaches, with a special focus on supervised statistical methods (Pang et al., 2002; Socher et al., 2013).",
      "startOffset" : 257,
      "endOffset" : 297
    }, {
      "referenceID" : 5,
      "context" : "In 1970, Ekman (Ekman, 1974) carried out extensive studies on facial expressions which showed that universal facial expressions are able to provide sufficient clues to detect emotions.",
      "startOffset" : 15,
      "endOffset" : 28
    }, {
      "referenceID" : 2,
      "context" : "Recent studies on speech-based emotion analysis (Datcu and Rothkrantz, 2008) have focused on identifying relevant acoustic features, such as fundamental frequency (pitch), intensity of utterance, bandwidth, and duration.",
      "startOffset" : 48,
      "endOffset" : 76
    }, {
      "referenceID" : 1,
      "context" : "(Chen et al., 1998).",
      "startOffset" : 0,
      "endOffset" : 19
    }, {
      "referenceID" : 10,
      "context" : "More recent research on audio-visual fusion for emotion recognition has been conducted at either feature level (Kessous et al., 2010) or decision level (Schuller, 2011).",
      "startOffset" : 111,
      "endOffset" : 133
    }, {
      "referenceID" : 19,
      "context" : ", 2010) or decision level (Schuller, 2011).",
      "startOffset" : 26,
      "endOffset" : 42
    }, {
      "referenceID" : 22,
      "context" : "(Wollmer et al., 2013) and Rozgic et al.",
      "startOffset" : 0,
      "endOffset" : 22
    }, {
      "referenceID" : 11,
      "context" : "(Metallinou et al., 2008) and Eyben et al.",
      "startOffset" : 0,
      "endOffset" : 25
    }, {
      "referenceID" : 6,
      "context" : "(Eyben et al., 2010a) fused audio and textual modalities for emotion recognition.",
      "startOffset" : 0,
      "endOffset" : 21
    }, {
      "referenceID" : 23,
      "context" : "(Wu and Liang, 2011) fused audio and textual clues at decision level.",
      "startOffset" : 0,
      "endOffset" : 20
    }, {
      "referenceID" : 12,
      "context" : "These vectors are the publicly available 300-dimensional word2vec vectors trained on 100 billion words from Google News (Mikolov et al., 2013).",
      "startOffset" : 120,
      "endOffset" : 142
    }, {
      "referenceID" : 7,
      "context" : "To compute the features, we use the open-source software openSMILE (Eyben et al., 2010b) which automatically extracts pitch and voice intensity.",
      "startOffset" : 67,
      "endOffset" : 88
    }, {
      "referenceID" : 9,
      "context" : "In the past, 3D-CNN has been successfully applied to object classification on 3D data (Ji et al., 2013).",
      "startOffset" : 86,
      "endOffset" : 103
    }, {
      "referenceID" : 8,
      "context" : "To capture this flow of informational triggers across utterances, we use a LSTM-based recurrent network scheme (Gers, 2001).",
      "startOffset" : 111,
      "endOffset" : 123
    }, {
      "referenceID" : 25,
      "context" : "Current research (Zhou et al., 2016) indicates the benefit of using such networks to incorporate contextual information in the classification process.",
      "startOffset" : 17,
      "endOffset" : 36
    }, {
      "referenceID" : 4,
      "context" : "RMSprop has been used as the optimizer which is known to resolve Adagrad’s radically diminishing learning rates (Duchi et al., 2011).",
      "startOffset" : 112,
      "endOffset" : 132
    }, {
      "referenceID" : 18,
      "context" : "The database contains the following categorical labels: anger, happiness, sadness, neutral, excitement, frustration, fear, surprise, and other, but we take only the first four so as to compare with the state of the art (Rozgic et al., 2012b) and other authors.",
      "startOffset" : 219,
      "endOffset" : 241
    }, {
      "referenceID" : 21,
      "context" : "The higher performance improvement on the IEMOCAP dataset indicates the necessity of modeling long-range dependencies among the utterances as continuous emotion recognition is a multiclass sequential problem where a person doesnt frequently change emotions (Wöllmer et al., 2008).",
      "startOffset" : 257,
      "endOffset" : 279
    }, {
      "referenceID" : 16,
      "context" : "(Poria et al., 2015).",
      "startOffset" : 0,
      "endOffset" : 20
    }, {
      "referenceID" : 16,
      "context" : "(Poria et al., 2015) by a significant margin.",
      "startOffset" : 0,
      "endOffset" : 20
    }, {
      "referenceID" : 18,
      "context" : "For the emotion recognition task, we have compared our method with the current state of the art (Rozgic et al., 2012b), who extracted features in a similar fashion to (Poria et al.",
      "startOffset" : 96,
      "endOffset" : 118
    }, {
      "referenceID" : 16,
      "context" : ", 2012b), who extracted features in a similar fashion to (Poria et al., 2015) did.",
      "startOffset" : 57,
      "endOffset" : 77
    }, {
      "referenceID" : 16,
      "context" : "Nonetheless, we report results using these translated utterances as opposed to utterances trained on Spanish word vectors, in order to make fair comparison with (Poria et al., 2015).",
      "startOffset" : 161,
      "endOffset" : 181
    }, {
      "referenceID" : 16,
      "context" : "10 -the-art by (Poria et al., 2015),by (Rozgic et al.",
      "startOffset" : 15,
      "endOffset" : 35
    }, {
      "referenceID" : 18,
      "context" : ", 2015),by (Rozgic et al., 2012b)",
      "startOffset" : 11,
      "endOffset" : 33
    } ],
    "year" : 2017,
    "abstractText" : "Multimodal sentiment analysis is a developing area of research, which involves identification of emotions and sentiments in videos. Current research considers utterances as independent entities, i.e., ignores the inter-dependencies and relations among utterances of a video. In this paper, we propose an LSTM based model which enables these utterances to capture contextual information from its surroundings in the same video, thus aiding the classification process. Our model shows 5 − 10% improvement over the state of the art and high robustness to generalizability.",
    "creator" : "LaTeX with hyperref package"
  }
}