{
  "name" : "216.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Topical Coherence in LDA-based Models through Induced Segmentation",
    "authors" : [ ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : null,
      "text" : "1 000\n011\n012\n013\n014\n015\n016\n017\n018\n019\n020\n021\n022\n023\n024\n025\n026\n027\n028\n029\n030\n031\n032\n033\n034\n035\n036\n037\n038\n039\n040\n041\n042\n043\n044\n045\n046\n047\n048\n049\n061\n062\n063\n064\n065\n066\n067\n068\n069\n070\n071\n072\n073\n074\n075\n076\n077\n078\n079\n080\n081\n082\n083\n084\n085\n086\n087\n088\n089\n090\n091\n092\n093\n094\n095\n096\n097\n098\n099"
    }, {
      "heading" : "1 Introduction",
      "text" : "Since the seminal works of Hofmann (1999) and Blei et al. (2003), there have been several developments in probabilistic topic models. Many extensions have indeed been proposed for different applications, including ad-hoc information retrieval (Wei and Croft, 2006), clustering search results (Zeng et al., 2004) and driving faceted browsing (Mimno and McCallum, 2007). In most of these studies, the initial exchangeability assumptions of PLSA and LDA, stipulating that words within a document are interdependent, has led to incoherent topic assignments within semantically meaningful text units, even though the importance of having topically coherent phrases is generally admitted (Griffiths et al., 2005). More recently, (Balikas\net al., 2016b) has shown that binding topics, so as to obtain more coherent topic assignments, within such text segments as noun phrases improves the performance (e.g. in terms of perplexity) of LDAbased models. The question nevertheless remains as to which segmentation one should rely on.\nFurthermore, text segments can refer to topics that are barely present in other parts of the document. For example, the segment “the Kurdish regional capital” in the sentence1 “A thousand protesters took to the main street in Erbil, the Kurdish regional capital, to condemn a new law requiring all public demonstrations to have government permits.” refers to geography in a document that is mainly devoted to politics. Relying on a single topic distribution, as done in most previous studies including (Balikas et al., 2016b), may prevent one from capturing those segment specific topics.\nIn this paper, we propose a novel LDA-based model that automatically segments documents into topically coherent sequences of words. The coherence between topics is ensured through copulas (Elidan, 2013) that bind the topics associated to the words of a segment. In addition, this model relies on both document and segment specific topic distributions so as to capture fine grained differences in topic assignments. A simple switching mechanism is used to select the appropriate distribution (document or segment specific) for assigning a topic to a word. We show that this model naturally encompasses other state-of-the-art LDA-based models proposed to accomplish the same task, and that it outperforms these models over six publicly available collections in terms of perplexity, Normalized Pointwise Mutual Information (NPMI), a measure used to assess the coherence of topics with documents, and the Micro F1-measure in a text classification context.\n1This sentence is taken from New York Times news (NYT) collection described in Section 4.\n2\n101\n102\n103\n104\n105\n106\n107\n108\n109\n110\n111\n112\n113\n114\n115\n116\n117\n118\n119\n120\n121\n122\n123\n124\n125\n126\n127\n128\n129\n130\n131\n132\n133\n134\n135\n136\n137\n138\n139\n140\n141\n142\n143\n144\n145\n146\n147\n148\n149\n150\n151\n152\n153\n154\n155\n156\n157\n158\n159\n160\n161\n162\n163\n164\n165\n166\n167\n168\n169\n170\n171\n172\n173\n174\n175\n176\n177\n178\n179\n180\n181\n182\n183\n184\n185\n186\n187\n188\n189\n190\n191\n192\n193\n194\n195\n196\n197\n198\n199"
    }, {
      "heading" : "2 Related work",
      "text" : "Probabilistic Latent Semantic Analysis (PLSA) proposed by (Hofmann, 1999) is the first probabilistic model that explains the generation of cooccurrence data using latent radom topics and, the EM algorithm for parameter estimation. The model was found more flexible and scalable than the Latent Semantic Analysis (Deerwester et al., 1990), which is based on the singular value decomposition of the document-term matrix, however PLSA is not a generative model as parameter estimation should be performed at each addition of new documents. To overcome this drawback, Blei et al. (2003) proposed the Latent Dirichlet Allocation (LDA) by assuming that the latent topics are random variables sampled from a Dirichlet distribution and that the generated words, occurring in a document, are exchangeable. The interdependence assumption allows the parameter estimation and the inference of the LDA model to be carried out efficiently, but it is not realistic in the sense that topics assigned to similar words of a text span are generally incoherent.\nDifferent studies, presented in the following sections, attempted to remedy this problem and they can be grouped in two broad families depending on whether they make use of external knowledgebased tools or not in order to exhibit text structure for word-topic assignment."
    }, {
      "heading" : "2.1 Knowledge-based topic assignments",
      "text" : "The main assumption behind these models are that text-spans such as sentences, phrases or segments are related in their content. Therefore, the integration of these dependent structures can help to discover coherent latent topics for words. Different attempts to combine LDA-based models with statistical tools to discover document structures have been successfully proposed, such as the study of Griffiths et al. (2005) who investigated the effect of combining a Hidden Markov Model with LDA to capture long and short distance dependencies. Similarly, (Boyd-Graber and Blei, 2008; Balikas et al., 2016a,b) integrated text structure exhibited by a parser or a chunker in their topic models. In this line, Du et al. (2013) following (Du et al., 2010) presented a hierarchical Bayesian model for unsupervised topic segmentation. This model integrates a boundary sampling method used in a Bayesian segmentation model introduced by Purver et al.(2006) to the topic model. For inference, a\nnon-parametric Markov Chain inference is used that splits and merges the segments while a PitmanYor process (Teh, 2006) binds the topics. Recently, Tamura and Sumita (2016) extended this idea to the bilingual setting. They assume that documents consist of segments and the topic distribution of each segment is generated using a Pitman-Yor process (Teh, 2006).\nThough, the topic assignments follow the structure of the text; these models suffer from the bias of statistical or linguistic tools they rely on. To overpass this limitation, other systems integrated automatically the extraction of text structure, in the form of phrases, in their process."
    }, {
      "heading" : "2.2 Knowledge-free topic assignments",
      "text" : "This type of models extract text-spans using ngram counts and word collections and use bigrams to integrate the order of words as well as to capture the topical content of a phrase (Lau et al., 2013). In (Wang et al., 2007), depending on the topic a particular bigram can be either considered as a single token or as two unigrams. Further, Wang et al. (2009) merged topic models with a unigram model over sentences that assigns topics to the sentences instead of the words.\nOur proposed approach also does not make use of external statistical tools to find text segments. The main difference with the previous knowledgefree topic model approaches is that the proposed approach assigns topics to words based on two, segment-specific and document-specific distributions selected from a Bernoulli law. Topics within segments are then constrained using copulas that bind their distributions. In this way, segmentation is embedded in the model and it naturally comes along with the topic assignment."
    }, {
      "heading" : "3 Joint latent model for topics and segments",
      "text" : "We define here a segment as a topically coherent sequence of contiguous words. By topically coherent, we mean that, even though words in a segment can be associated to different topics, these topics are usually related. This view is in line with the one expressed in (Balikas et al., 2016b), in which a latent topic model, referred to as copLDA in the remainder, includes a binding mechanism between topics within coherent text spans, defined in their study as noun phrases (NPs). The relation between topics is captured through a copula that provides\n3\n201\n202\n203\n204\n205\n206\n207\n208\n209\n210\n211\n212\n213\n214\n215\n216\n217\n218\n219\n220\n221\n222\n223\n224\n225\n226\n227\n228\n229\n230\n231\n232\n233\n234\n235\n236\n237\n238\n239\n240\n241\n242\n243\n244\n245\n246\n247\n248\n249\n250\n251\n252\n253\n254\n255\n256\n257\n258\n259\n260\n261\n262\n263\n264\n265\n266\n267\n268\n269\n270\n271\n272\n273\n274\n275\n276\n277\n278\n279\n280\n281\n282\n283\n284\n285\n286\n287\n288\n289\n290\n291\n292\n293\n294\n295\n296\n297\n298\n299\nα\nθd\nz1 zn\nw1 wn\nφ βλ\n|S| D\nK\n. . .\n. . .\n(a) copLDA\nα\nθd\nz1 zn\nw1 wnS\n|Sd|\nφ βλ\n|S| D\nK\n. . .\n. . .\n(b) segLDAcopp=0\nα\nθd\nfn\nθd,s,n\np\nθs\nzn\nwnS\n|Sd|\nφ β\n|S| D\nK\n(c) segLDAcopλ=0\nα\nθd\nf1 fn\nθd,s,1 θd,s,n\np\nθs\nz1 zn\nw1 wnS\n|Sd|\nφ βλ\n|S| D\nK\n. . .\n. . .\n. . .\n. . .\n(d) segLDAcop\nFigure 1: Graphical model for Copula LDA (copLDA), extension of Copula LDA with segmentation (segLDAcopp=0), LDA with segmentation and topic shift (segLDAcopλ=0) and complete model (segLDAcop).\na joint probability for all the topics used in a segment. That is, to generate words in a segment, one first jointly generates all the word specific topics z via a copula, and then generates each word in the segment from its word specific topic and the word-topic distribution φ. Figure 1(a) illustrates this.\nCopulas are particularly useful when modeling dependencies between random variables, as the joint cumulative distribution function (CDF) FX1,··· ,Xn of any random vector X = (X1, · · · , Xn) can be written as a function of its marginals, according to Sklar’s Theorem (Nelsen, 2006):\nFX1,··· ,Xn(x1, · · · , xp) = C(FX1(x1), · · · , FXn(xn))\nwhere C is a copula. For latent topic models, as discussed in (Amoualian et al., 2016), Frank’s copula is particularly interesting as (a) it is invariant by permutations and associative, as are the words and topics z in each segment due to the exchangeability assumption, and (b) it relies on a single parameter (denoted λ here) that controls the strength of dependence between the variables and is thus easy to implement. In Frank’s copula, when the parameter λ approaches 0, the variables are independent of each other, whereas when λ approaches +∞, the variables take the same value. For further details on copulas, we refer the reader to (Nelsen, 2006).\nOne important problem, however, with copLDA is its reliance on a predefined segmentation. Although the information brought by the segmentation based on NPs helps to improve topic assignment, it may not be flexible enough to capture all the possible segments of a text. It is easy to correct this problem by considering all possible segmentations of a document and by choosing the most appropriate one at the same time that topics are assigned to words. This is illustrated in Figure 1(b), where a segmentation S is chosen from the set Sd of possible segmentations for a document d, and where each segment in S are generated in turn. We refer to the associated model as segLDAcopp=0 for reasons that will become clear later.\nAnother point to be noted about copLDA (and segLDAcopp=0) is that the topics used in each segment come from the same document specific topic distribution θd. This entails that, in these models, one cannot differentiate the main topics of a document from potential segment specific topics that can explain some parts of it. Indeed, some text segments can refer to topics that are barely present in other parts of the document; relying on a single topic distribution may prevent one from capturing those segment specific topics.\nIt is possible to overcome this difficulty by generating a segment specific topic distribution as illustrated in Figure 1(c) (this model is referred to\n4\n301\n302\n303\n304\n305\n306\n307\n308\n309\n310\n311\n312\n313\n314\n315\n316\n317\n318\n319\n320\n321\n322\n323\n324\n325\n326\n327\n328\n329\n330\n331\n332\n333\n334\n335\n336\n337\n338\n339\n340\n341\n342\n343\n344\n345\n346\n347\n348\n349\n350\n351\n352\n353\n354\n355\n356\n357\n358\n359\n360\n361\n362\n363\n364\n365\n366\n367\n368\n369\n370\n371\n372\n373\n374\n375\n376\n377\n378\n379\n380\n381\n382\n383\n384\n385\n386\n387\n388\n389\n390\n391\n392\n393\n394\n395\n396\n397\n398\n399\nas segLDAcopλ=0, again for reasons that will become clear later). However, as some words in a segment can be associated to the general topics of a document, we introduce a mechanism to choose, for each word in a segment, a topic either from the segment specific topic distribution θs or from the document specific topic distribution θd (this mechanism is similar to the one used for routes and levels in (Paul and Girju, 2010)). The choice between them is based on the Bernoulli variable f , as explained in the generative story given below.\nThe above developments can be combined in a single, complete model, illustrated in Figure 1(d) and detailed below. We will simply refer to this model as segLDAcop."
    }, {
      "heading" : "3.1 Complete generative model",
      "text" : "As in standard LDA based models, with V denoting the size of the vocabulary of the collection and K the number of latent topics, β and φk, 1 ≤ k ≤ K, are V dimensional vectors, α and θ (i.e., θd, θs, θd,s,n) are K dimensional vectors, whereas zn takes value in {1, · · · ,K}. Lower indices are used to denote coordinates of the above vectors. Lastly, Dir denotes the Dirichlet distribution, Cat the categorical distribution (which is a multinomial distribution with one draw) and we omit, as is usual, the generation of the length of the document. The complete model segLDAcop is then based on the following generative process:\n1. Generate, for each topic k, 1 ≤ k ≤ K, a distribution over the words: φk ∼ Dir(β);\n2. For each document d, 1 ≤ d ≤ D:\n(a) Choose a document specific topic distribution: θd ∼ Dir(α);\n(b) Choose a segmentation S of the document uniformly from the set of all possible segmentations Sd: P (S) = 1|Sd| ; (c) For each segment s in S: (i) Choose a segment specific topic distri-\nbution: θs ∼ Dir(α); (ii) For each position n in s, choose fn ∼\nBer(p) and set:\nθd,s,n = { θs if fn = 1 θd otherwise\n(iii) Choose topics Zs = {z1, . . . , zn} from Frank’s copula with parameter λ and marginals Cat(θd,s,n);\n(iv) For each position n in s, choose word wn: wn ∼ Cat(φzn).\nAs on can note, the generative process relies on a segmentation uniformly chosen from the set of possible segmentations (step 2.b) to generate related topics within each segment (Frank’s copula in step 2.c.(iii)), the distribution underlying each word specific topic zn being either specific to the segment or general to the document (steps 2.c.(i) and 2.c.(ii)). The other steps are similar to the standard LDA steps.\nAs in almost all previous studies on LDA, α and β are considered fixed and symmetric, each coordinate of the vector being equal: α1 = · · · = αK . The hyperparameters p (∈ [0, 1]) of the Bernoulli distribution and λ (∈ [0,+∞]) of Frank’s copula respectively regulate the choice between the segment specific and the document specific topic distributions and the strength of the dependence between topics in a segment. As for the other hyperparameters, we consider them fixed here (the values for all hyperparameters are given in Section 4).\nAs mentioned before, all the models presented in Figure 1 are special cases of the complete model segLDAcop: hence segLDAcopλ=0 is obtained by dropping the topic dependencies, which amounts to setting λ to (a value close to) 0, segLDAcopp=0 is obtained by relying only on the topic distribution obtained for the document, which amounts to setting p to 0, and the previously introduced copLDA model is obtained by setting p to 0, and fixing the segmentation."
    }, {
      "heading" : "3.2 Inference with Gibbs sampling",
      "text" : "The parameters of the complete model can be directly estimated through Gibbs sampling. The Gibbs updates for the parameters φ and θ are the same as the ones for standard LDA (Blei et al., 2003). The parameters fn are directly estimated through: fn ∼ Ber(p). Lastly, for the variables z, we follow the same strategy as the one described in (Balikas et al., 2016b) and based on (Amoualian et al., 2016), leading to:\nP (Zs|Z−s,W,Θ,Φ, λ) = p(Zs|Θ, λ) ∏ n φznwn\nwhere W denotes the document collection, and Θ and Φ the sets of all θ and φk, 1 ≤ k ≤ K, vectors. p(Zs|Θ, λ) is obtained by Frank’s copula with parameter λ and marginals Cat(θd,s,n). As is standard in topic models, the notation −s means excluding the information from s.\n5\n401\n402\n403\n404\n405\n406\n407\n408\n409\n410\n411\n412\n413\n414\n415\n416\n417\n418\n419\n420\n421\n422\n423\n424\n425\n426\n427\n428\n429\n430\n431\n432\n433\n434\n435\n436\n437\n438\n439\n440\n441\n442\n443\n444\n445\n446\n447\n448\n449\n460\n461\n462\n463\n464\n465\n466\n467\n468\n469\n470\n471\n472\n473\n474\n475\n476\n477\n478\n479\n480\n481\n482\n483\n484\n485\n486\n487\n488\n489\n490\n491\n492\n493\n494\n495\n496\n497\n498\n499\nFrom the above equation, one can formulate an acceptance/rejection algorithm based on the following steps: (a) sample Zs from p(Zs|Θ, λ) using Frank’s copula, and (b) accept the sample with probability ∏ n φ zn wn , where n runs over all the positions in segment s."
    }, {
      "heading" : "3.3 Efficient segmentation",
      "text" : "As topics may change from one sentence to another, we assume here that segments cannot overlap sentence boundaries. The different segmentations of a document are thus based on its sentence segmentations. In the remainder, we use L to denote the maximum length of a segment and g(M ;L) to denote the number of segmentations in a sentence of length M , each segment comprising at most L words.\nGenerating all possible segmentations of a sentence and then selecting one at random is not an efficient process as the number of segments rapidly grows with the length of the sentence. In practice, however, one can define an efficient segmentation on the basis of the following proposition, the proof of which is given in Appendix A:\nProposition 3.1. Let lsi be the random variable associated to the length of the segment starting at position i in a sentence of length M (positions go from 1 to M and lsi takes value in {1, · · · , L}). Then P (lsi = l) := g(M+1−i−l);L) g(M+1−i;L) defines a probability distribution over lsi .\nFurthermore, the following process is equivalent to choosing sentence segmentations uniformly from the set of possible segmentations.\nFrom pos. 1, repeat till end of sentence: (a) Generate segment length acc. to P; (b) Add segment to current segmentation; (c) Move to position after the segment.\nIn practice, we thus replace steps 2.b and 2.c of the generative story by a loop over all sentences, and in each sentence use the process described in Prop, 3.1. Furthermore, as described in Appendix A, the values of g needed to compute P (lsi = l) can be efficiently computed by recurrence."
    }, {
      "heading" : "4 Experiments",
      "text" : "We conducted a number of experiments aimed at studying the impact of simultaneously segmenting and assigning topics to words within segments using the proposed segLDAcop model.\nDatasets: We considered six publicly available datasets derived from Pubmed2 (Tsatsaronis et al., 2015), Wikipedia (Partalas et al., 2015), Reuters3 and New York Times (NYT)4 (Yao et al., 2016). The first two collections were considered in (Balikas et al., 2016a), we followed their setup by considering 3 subsets of Wikipedia with different number of classes (namely, Wiki0, Wiki1 and Wiki2). The Reuters dataset comes from Reuters-21578, Distribution 1.0 as investigated in (Bird et al., 2009) and the NYT dataset is collected from full text of New York Times global news, from January 1st to December 31st, 2011.\nThese collections were processed following (Blei et al., 2003) by removing a standard list of 50 stop words, lemmatizing, lowercasing and keeping only words made of letters. To deal with relatively homogeneous collections, we also removed documents that are too long. The statistics of these datasets, as well as the admissible maximal length for documents, in terms of the number of words they contain, can be found in Table 1.\nSettings: We compared our models (segLDAcopp=0, segLDAcopλ=0, segLDAcop) with three models, namely the standard LDA model, and two previously introduced models aiming at binding topics within segments:\n1. LDA: Standard Latent Dirichlet Allocation implemented using collapsed Gibbs sampling inference (Griffiths and Steyvers, 2004)5. Note that there are neither segmentation nor topic\n2https://github.com/balikasg/ topicModelling/tree/master/data\n3https://archive.ics.uci.edu/ ml/datasets/Reuters-21578+Text+ Categorization+Collection\n4https://github.com/yao8839836/COT/ tree/master/data\n5http://gibbslda.sourceforge.net\n6\n501\n502\n503\n504\n505\n506\n507\n508\n509\n510\n511\n512\n513\n514\n515\n516\n517\n518\n519\n520\n521\n522\n523\n524\n525\n526\n527\n528\n529\n530\n531\n532\n533\n534\n535\n536\n537\n538\n539\n540\n541\n542\n543\n544\n545\n546\n547\n548\n549\n550\n551\n552\n553\n554\n555\n556\n557\n558\n559\n560\n561\n562\n563\n564\n565\n566\n567\n568\n569\n570\n571\n572\n573\n574\n575\n576\n577\n578\n579\n580\n581\n582\n583\n584\n585\n586\n587\n588\n589\n590\n591\n592\n593\n594\n595\n596\n597\n598\n599\nModels Wiki0 Wiki1 Wiki2 Pubmed Reuters NYT 20 100 20 100 20 100 20 100 20 100 20 100 LDA 853.7 370.9 1144.6 541.1 1225.2 570.6 1267.8 628.7 210.6 118.8 1600.1 1172.1 senLDA 958.4 420.5 1236.7 675.3 1253.1 625.2 1346.3 674.3 254.3 173.6 1735.9 1215.3 copLDA 753.1 264.3 954.1 411.5 1028.6 420.6 1031.5 483.2 206.3 101.3 1551.5 1063.2 segLDAcopp=0 670.2 235.4 904.2 382.4 975.7 409.2 985.5 459.3 194.2 96.7 1504.2 1033.2 segLDAcopλ=0 655.1 222.1 890.3 370.2 949.2 404.3 971.3 451.2 190.1 91.3 1474.6 1014.3 segLDAcop 621.2 213.5 861.2 358.6 934.7 394.4 960.4 442.1 182.1 87.5 1424.2 992.3\nTable 2: Perplexity with respect to different number of topics (20 and 100).\nbinding mechanisms in this model;\n2. senLDA: Sentence LDA, introduced in (Balikas et al., 2016a), which forces all words within a sentence to be assigned to the same topic. The segments considered thus correspond to sentences, and the binding between topics within segments is maximal as all word specific topics are equal;\n3. copLDA: Copula LDA, introduced in (Balikas et al., 2016b) already discussed before, which relies on two types of segments, namely NPs (extracted with the nltk.chunk package (Bird et al., 2009)) and single words. In addition, a copula is also used to bind topics within NPs, from the document specific topic distribution.\nBoth senLDA and copLDA implementations, can be found in https://github.com/ balikasg/topicModelling.\nIn all models α and β play a symmetric role and are respectively fixed to 1/K, following (Asuncion et al., 2009). For copula based models, λ is set to 5, following (Balikas et al., 2016b). As already discussed, p is set to 0 for segLDAcopp=0; it is set to 0.5 for segLDAcop so as not to privilege a priori one topic distribution (document or segment specific) over the other. For sampling from Frank’s copula, we relied on the R copula package (Hofert and Maechler, 2011) 6. We chose L (the maximum length of a segment) using line search forL ∈ [2, 5] and used L = 3 in all our experiments. Finally, to illustrate the behaviors of the different models with different number of topics, we present here the results obtained with K = 20 and K = 100.\nWe now compare the different models along three main dimensions: perplexity, use of topic representations for classification and topic coherence."
    }, {
      "heading" : "4.1 Perplexity",
      "text" : "We first randomly split here all the collections, using 75% of them for training, and 25% for testing.\nIn order to see how well the models fit the data and following (Blei et al., 2003), we first evaluated the methods in terms of perplexity defined as:\nPerplexity = exp\n( − ∑ d∈D ∑ w∈d log ∑K k=1 θ d kφ\nk w∑\nd∈D |d|\n) ,\nwhere d is a test document from the test set D, and |d| is the total number of words in d, and K is the total number of topics. The lower the perplexity is, the better the model fits the test data. Table 2 shows perplexities of different methods for K = 20 and K = 100 topics.\n50 100 150 200 250 300 350\n1,400\n1,600\n1,800\n2,000\n2,200\nIterations\nPe rp\nle xi\nty\nNYT\nLDA senLDA copLDA segLDAcopp=0 segLDAcopλ=0 segLDAcop\nFigure 2: Perplexity with respect to training iteration on NYT collection (20 topics).\nFrom Table 2, it comes out that the best performing model in terms of perplexity over all datasets and for different number of topics is segLDAcop. Further, segLDAcopλ=0, that uses both document and segment specific topic distributions, performs better than segLDAcopp=0, which in turn outperforms copLDA, bringing evidence that using all possible segmentations rather than only NPs unit extracted using a chunker yields a more flexible and natural topic assignment.\n6Our complete code will be available for research purposes.\n7\n601\n602\n603\n604\n605\n606\n607\n608\n609\n610\n611\n612\n613\n614\n615\n616\n617\n618\n619\n620\n621\n622\n623\n624\n625\n626\n627\n628\n629\n630\n631\n632\n633\n634\n635\n636\n637\n638\n639\n640\n641\n642\n643\n644\n645\n646\n647\n648\n649\n650\n651\n652\n653\n654\n655\n656\n657\n658\n659\n660\n661\n662\n663\n664\n665\n666\n667\n668\n669\n670\n671\n672\n673\n674\n675\n676\n677\n678\n679\n680\n681\n682\n683\n684\n685\n686\n687\n688\n689\n690\n691\n692\n693\n694\n695\n696\n697\n698\n699\nModels Wiki0 Wiki1 Wiki2 Pubmed Reuters 20 100 20 100 20 100 20 100 20 100 LDA 55.3 63.5 42.4 51.4 41.2 48.7 54.1 63.5 75.5 82.7 senLDA 41.4 53.2 33.5 44.5 36.4 40.9 50.2 62.5 69.4 74.2 copLDA 51.2 62.7 43.4 52.1 40.8 46.5 53.5 63.1 75.2 81.5 segLDAcopp=0 59.1 64.2 44.8 51.2 42.3 50.1 55.4 63.1 76.8 82.5 segLDAcopλ=0 61.1 67.4 46.5 53.8 44.1 52.2 57.1 65.2 79.6 84.4 segLDAcop 62.3 68.4 48.4 55.2 44.8 53.5 59.3 66.5 80.2 85.1\nTable 3: MiF score (percent) with respect to different number of topics (20 and 100).\nsegLDAcop also converges faster than the other methods to its minimum as it is shown in Figure 2, depicting the evolution of perplexity of different models over the number of iterations on the NYT collection (a similar behavior is observed on the other collections)."
    }, {
      "heading" : "4.2 Topical induced representation for classification",
      "text" : "Some studies compare topic models using extrinsic tasks such as document classification. In this case, it is possible to reduce the dimensionality of the representation space by using the induced topics (Blei et al., 2003). In this study, we first randomly splitted the datasets, except NYT that does not contain class information, into training (75%) and test (25%) sets. We then applied SVMs with a linear kernel; the value of the hyperparameter C was found by cross-validation over the training set {0.01, 0.1, 1, 10, 100}. For datasets where certain documents have more than one label (Pubmed, Reuters), we used the one-versus-all approach for performing multi-label classification.\nIn Table 3, we report the Micro F1 (MiF) score of different models on the test sets. Again, the best results are obtained with segLDAcop, followed by segLDAcopλ=0. This shows the importance of relying on both document and segment specific topic distributions. As conjectured before, our model is able to captures fine grained topic assignments within documents. In addition, all models relying on an inferred segmentation (segLDAcopp=0, segLDAcopλ=0, segLDAcop) outperform the models relying on fixed segmentations (sentences or NPs). This shows the importance of being able to discover flexible segmentations for assigning topics within documents."
    }, {
      "heading" : "4.3 Topic coherence",
      "text" : "Another common way to evaluate topic models is by examining how coherent the produced topics are. Doing this manually is a time consuming pro-\ncess and cannot scale. To overcome this limitation the task of automatically evaluating the coherence of topics produced by topic models received a lot of attention (Mimno et al., 2011). It has been found that scoring the topics using co-occurrence measures, such as the pointwise mutual information (PMI) between the top-words of a topic, correlates well with human judgments (Newman et al., 2010). For this purpose an external, large corpus is used as a meta-document where the PMI scores of pairs of words are estimated using a sliding window. As discussed above, calculating the co-occurrence measures requires selecting the top-N words of a topic and performing the manual or automatic evaluation. Hence, N is a hyper-parameter to be chosen and its value can impact the results. Very recently, Lau and Baldwin (2016) showed that N actually impacts the quality of the obtained results and, in particular, the correlation with human judgments. In their work, they found that aggregating the topic coherence scores over several topic cardinalities leads to a substantially more stable and robust evaluation.\nFollowing the findings of Lau and Baldwin (2016) and using (Newman et al., 2010)’s equation, we present in Figure 3 the topic coherence scores as measured by the Normalized Pointwise Mutual Information (NPMI) . Their values are in [- 1,1], where in the limit of -1 two words w1 and w2 never occur together, while in the limit of +1 they always occur together (complete co-occurrence). For the reported scores, we aggregate the topic coherence scores over three different topic cardinalities: N ∈ {5, 10, 15}. segLDAcop model which uses copulas and segmentation together, shows the best score for the given reference meta-data (Wikipedia) in all of the datasets. It should be noted that segLDAcopλ=0 which has not copula binder inside the model has less improvement against the segLDAcopp=0 which has the copula. This means using copula has more effect on the topic coherence than only the segment-specific topic distribution.\n8\n701\n702\n703\n704\n705\n706\n707\n708\n709\n710\n711\n712\n713\n714\n715\n716\n717\n718\n719\n720\n721\n722\n723\n724\n725\n726\n727\n728\n729\n730\n731\n732\n733\n734\n735\n736\n737\n738\n739\n740\n741\n742\n743\n744\n745\n746\n747\n748\n749\n750\n751\n752\n753\n754\n755\n756\n757\n758\n759\n760\n761\n762\n763\n764\n765\n766\n767\n768\n769\n770\n771\n772\n773\n774\n775\n776\n777\n778\n779\n780\n781\n782\n783\n784\n785\n786\n787\n788\n789\n790\n791\n792\n793\n794\n795\n796\n797\n798\n799\nWiki0 Wiki1 Wiki2 PubmedReuters NYT\n4\n6\n8\n10\n12\n5.1\n6\n8\n9\n4.4\n7.1\n6.5 6.7\n9.2\n10.4\n6.1\n8.2\n6.2 6.3\n9.4\n10.1\n5.8\n8.5\n6.3\n7.2\n10.1\n10.9\n6.4\n8.9\n6\n6.9\n9.9 10.3\n6\n8.6\n6.9\n7.6\n10.5\n11.5\n6.8\n9.2\nN PM\nI( %\n) LDA senLDA copLDA segLDAcopp=0 segLDAcopλ=0 segLDAcop\nFigure 3: Topic coherence (NPMI) score with respect to 100 of topics."
    }, {
      "heading" : "4.4 Visualization",
      "text" : "In order to illustrate the results obtained by segLDAcop, we display in Figure 4 the top 10 most probable words over 5 topics (K = 20) for the Reuters dataset, for both segLDAcop and LDA. In segLDAcop, topic 1, the top-ranked words are mostly relevant to the topic “date” (e.g., march, january, year, fall, february, week). However, a similar topic learned by LDA appears to involve less such words (year, january, february), indicating a less coherent topic.\nFigure 5 illustrates another aspect of our model, namely the possibility to detect topically coherent segments. In particular, as one can note, the NP Rear Admiral Benjamin Sands is segmented in two parts, the first one, Rear Admiral, corresponding to the title, and the second one, Benjamin Sands, to the first and family names of the person. The\nTopic1 march, fell, rose, january, rise, year, fall, february, pct, week fell, mln, year, january, dlrs, rise, rose, pct, billion, february Topic2 currency, bank, pct, cut, rate, day, prime, exchange, interest, national billion, prime, day, rate, dlrs, pct, reserve, federal, fed, bank Topic3 term, agreement, acquire, buy, sell, unit, acquisition, corp, company, sale term, dlrs, buy, company, sell, unit, corp, acquisition, sale, mln Topic4 approved, american, common, split, merger, company, board, stock, share, shareholder acquire, mln, company, common, stock, shareholder, share, corp, merger, dlrs Topic5 tokyo, life, intent, letter, buy, insurance, yen, japan, dealer, dollar central, european, japan, yen, ec, dollar, bank, rate, dealer, market\nFigure 4: Top-10 words of segLDAcop (left) vs LDA (right) for the Reuters (5 out of 20 topics).\nRear Admiral Benjamin Sands was an officer in the United States\nFigure 5: Topic assignments with segmentation boundaries using segLDAcop. Colors are topics (examples from Wiki0 including stopwords with 20 topics).\ndata-driven approach we have adopted here can discover such fine grained differences, something the approaches based on fixed segmentations (either based on sentences or NPs), are less likely to achieve."
    }, {
      "heading" : "5 Conclusion",
      "text" : "In this paper, we have introduced an LDA-based model that generates topically coherent segments within documents by jointly segmenting documents and assigning topics to their words. The coherence between topics is ensured through Frank’s copula, that binds the topics associated to the words of a segment. In addition, this model relies on both document and segment specific topic distributions so as to capture fine grained differences in topic assignments. We have shown that this model naturally encompasses other state-of-the-art LDA-based models proposed to accomplish the same task, and that it outperforms these models over six publicly available collections in terms of perplexity, Normalized Pointwise Mutual Information (NPMI), a measure used to assess the coherence of topics with documents, and the Micro F1-measure in a text classification context. Our results confirm the importance of a flexible segmentation as well as a binding mechanism to produce topically coherent segments.\nIn the future, we plan on relying on other inference approaches, based for example on variational Bayes known to yield better estimates for perplexity (Asuncion et al., 2009); it is however not certain that the gain in perplexity one can expect from the use of variational Bayes approaches will necessarily result in a gain in, say, topic coherence. Indeed, the impact of the inference approach on the different usages of latent topic models for text collections remains to be better understood.\n9\n801\n802\n803\n804\n805\n806\n807\n808\n809\n810\n811\n812\n813\n814\n815\n816\n817\n818\n819\n820\n821\n822\n823\n824\n825\n826\n827\n828\n829\n830\n831\n832\n833\n834\n835\n836\n837\n838\n839\n840\n841\n842\n843\n844\n845\n846\n847\n848\n849\n850\n851\n852\n853\n854\n855\n856\n857\n858\n859\n860\n861\n862\n863\n864\n865\n866\n867\n868\n869\n870\n871\n872\n873\n874\n875\n876\n877\n878\n879\n880\n881\n882\n883\n884\n885\n886\n887\n888\n889\n890\n891\n892\n893\n894\n895\n896\n897\n898\n899"
    }, {
      "heading" : "A Efficient segmentation",
      "text" : "Let us recall the property presented before:\nProposition A.1. Let lsi be the random variable associated to the length of the segment starting at position i in a sentence of length M (positions go from 1 to M and lsi takes value in {1, · · · , L}). Then P (lsi = l) := g(M+1−i−l);L) g(M+1−i;L) defines a probability distribution over lsi .\nFurthermore, the following process is equivalent to choosing sentence segmentations uniformly from the set of possible segmentations. From pos. 1, repeat till end of sentence: (a) Generate segment length acc. to P; (b) Add segment to current segmentation; (c) Move to position after the segment.\nProof Any segmentation of the sentence of length M starts with either a segment of length 1, a segment of length 2, · · · , or a segment of length L. Thus, g(M ;L) can be defined through the following recurrence relation:\ng(M ;L) = L∑ l=1 g(M − l;L) (1)\n1000\n1001\n1002\n1003\n1004\n1005\n1006\n1007\n1008\n1009\n1010\n1011\n1012\n1013\n1014\n1015\n1016\n1017\n1018\n1019\n1020\n1021\n1022\n1023\n1024\n1025\n1026\n1027\n1028\n1029\n1030\n1031\n1032\n1033\n1034\n1035\n1036\n1037\n1038\n1039\n1040\n1041\n1042\n1043\n1044\n1045\n1046\n1047\n1048\n1049\n1050\n1051\n1052\n1053\n1054\n1055\n1056\n1057\n1058\n1059\n1060\n1061\n1062\n1063\n1064\n1065\n1066\n1067\n1068\n1069\n1070\n1071\n1072\n1073\n1074\n1075\n1076\n1077\n1078\n1079\n1080\n1081\n1082\n1083\n1084\n1085\n1086\n1087\n1088\n1089\n1090\n1091\n1092\n1093\n1094\n1095\n1096\n1097\n1098\n1099\ntogether with the initial values g(1;L), g(2;L), · · · , g(L;L), which can be computed offline (for example, for L = 3, one has: g(1; 3) = 1, g(2; 3) = 2, g(3; 3) = 4). Note that g(1;L) = 1 for all L.\nThus:\nL∑ l=1 P (lsi = l) = L∑ l=1 g(M + 1− i− l);L) g(M + 1− i;L) = 1\ndue to the recurrence relation on g. This proves the first part of the proposition.\nUsing the process described above where segments are generated one after another according to P , for a segmentation S, comprising |S| segments, let us denote by l1, l2, · · · , l|S| the lengths of each segment and by i1, i2, · · · , i|S| the starting positions of each segment (with i1 = 1). One has, as segments are independent of each other:\nP (S) = |S|∏ j=1 P (lsij = lj) = |S|∏ j=1 g(M + 1− (ij + lj);L) g(M + 1− ij ;L)\n= g(M − l1;L) g(M ;L) g(M − l1 − l2;L) g(M − l1;L) · · · = 1 g(M ;L)\nas g(1;L) = 1. This concludes the proof of the proposition. 2\nFurthermore, as one can note from Eq. 1, the various elements needed to compute P (lsi = l) can be efficiently computed, the time complexity being equal to O(M). In addition, as the number of different sentence lengths is limited, one can store the values of g to reuse them during the segmentation phase."
    } ],
    "references" : [ {
      "title" : "Streaming-lda: A copula-based approach to modeling topic dependencies in document streams",
      "author" : [ "Hesam Amoualian", "Marianne Clausel", "Eric Gaussier", "Massih-Reza Amini." ],
      "venue" : "Proceedings of the 22nd International Conference on",
      "citeRegEx" : "Amoualian et al\\.,? 2016",
      "shortCiteRegEx" : "Amoualian et al\\.",
      "year" : 2016
    }, {
      "title" : "On smoothing and inference for topic models",
      "author" : [ "Arthur Asuncion", "Max Welling", "Padhraic Smyth", "Yee Whye Teh." ],
      "venue" : "Proceedings of the 25th Conference on Uncertainty in Artificial Intelligence. AUAI Press, Arling-",
      "citeRegEx" : "Asuncion et al\\.,? 2009",
      "shortCiteRegEx" : "Asuncion et al\\.",
      "year" : 2009
    }, {
      "title" : "On a topic model for sentences",
      "author" : [ "Georgios Balikas", "Massih-Reza Amini", "Marianne Clausel." ],
      "venue" : "Proceedings of the 39th International Conference on Research and Development in Information Retrieval. ACM, New York, NY, USA, SIGIR, pages 921–924.",
      "citeRegEx" : "Balikas et al\\.,? 2016a",
      "shortCiteRegEx" : "Balikas et al\\.",
      "year" : 2016
    }, {
      "title" : "Modeling topic dependencies in semantically coherent text spans with copulas",
      "author" : [ "Georgios Balikas", "Hesam Amoualian", "Marianne Clausel", "Eric Gaussier", "Massih R Amini." ],
      "venue" : "Proceedings of the 26th International Conference on Computational",
      "citeRegEx" : "Balikas et al\\.,? 2016b",
      "shortCiteRegEx" : "Balikas et al\\.",
      "year" : 2016
    }, {
      "title" : "Natural Language Processing with Python",
      "author" : [ "Steven Bird", "Ewan Klein", "Edward Loper." ],
      "venue" : "O’Reilly, Beijing. http://www.nltk.org/book/.",
      "citeRegEx" : "Bird et al\\.,? 2009",
      "shortCiteRegEx" : "Bird et al\\.",
      "year" : 2009
    }, {
      "title" : "Latent dirichlet allocation",
      "author" : [ "David M. Blei", "Andrew Y. Ng", "Michael I. Jordan." ],
      "venue" : "Journal of Machine Learning 3:993–1022. http://dl.acm.org/citation.cfm?id=944919.944937.",
      "citeRegEx" : "Blei et al\\.,? 2003",
      "shortCiteRegEx" : "Blei et al\\.",
      "year" : 2003
    }, {
      "title" : "Syntactic topic models",
      "author" : [ "Jordan Boyd-Graber", "David Blei." ],
      "venue" : "Proceedings of the 21st International Conference on Neural Information Processing Systems. Curran Associates Inc., USA, NIPS, pages 185–192.",
      "citeRegEx" : "Boyd.Graber and Blei.,? 2008",
      "shortCiteRegEx" : "Boyd.Graber and Blei.",
      "year" : 2008
    }, {
      "title" : "Indexing by latent semantic analysis",
      "author" : [ "Scott Deerwester", "Susan T. Dumais", "George W. Furnas", "Thomas K. Landauer", "Richard Harshman." ],
      "venue" : "Journal of the American Society for Information Science 41(6):391–",
      "citeRegEx" : "Deerwester et al\\.,? 1990",
      "shortCiteRegEx" : "Deerwester et al\\.",
      "year" : 1990
    }, {
      "title" : "A Segmented Topic Model Based on the Two-parameter Poisson-Dirichlet Process",
      "author" : [ "Lan Du", "Wray Buntine", "Huidong Jin." ],
      "venue" : "Journal of Machine learning 81(1):5–19. https://doi.org/10.1007/s10994-010-5197-4.",
      "citeRegEx" : "Du et al\\.,? 2010",
      "shortCiteRegEx" : "Du et al\\.",
      "year" : 2010
    }, {
      "title" : "Topic Segmentation with a Structured Topic Model",
      "author" : [ "Lan Du", "Wray Buntine", "Mark Johnson." ],
      "venue" : "Proceedings of The Annual Conference of the North American Chapter of the Association for Computational Linguistics, Human Language Technolo-",
      "citeRegEx" : "Du et al\\.,? 2013",
      "shortCiteRegEx" : "Du et al\\.",
      "year" : 2013
    }, {
      "title" : "Copulas in Machine Learning, Springer Berlin Heidelberg, Berlin, Heidelberg, pages 39–60",
      "author" : [ "Gal Elidan." ],
      "venue" : "https://doi.org/10.1007/978-3-64235407-6_3.",
      "citeRegEx" : "Elidan.,? 2013",
      "shortCiteRegEx" : "Elidan.",
      "year" : 2013
    }, {
      "title" : "Finding scientific topics",
      "author" : [ "Thomas L. Griffiths", "Mark Steyvers." ],
      "venue" : "Journal of the National Academy of Sciences 101(suppl 1):5228–5235. https://doi.org/10.1073/pnas.0307752101.",
      "citeRegEx" : "Griffiths and Steyvers.,? 2004",
      "shortCiteRegEx" : "Griffiths and Steyvers.",
      "year" : 2004
    }, {
      "title" : "Integrating topics and syntax",
      "author" : [ "Thomas L Griffiths", "Mark Steyvers", "David M Blei", "Joshua B Tenenbaum." ],
      "venue" : "L. K. Saul, Y. Weiss, and L. Bottou, editors, Advances in the International Conference on Neural Information Pro-",
      "citeRegEx" : "Griffiths et al\\.,? 2005",
      "shortCiteRegEx" : "Griffiths et al\\.",
      "year" : 2005
    }, {
      "title" : "Nested Archimedean Copulas Meet R: The nacopula Package",
      "author" : [ "Marius Hofert", "Martin Maechler." ],
      "venue" : "Journal of Statistical Software 39(i09):–. https://doi.org/http://hdl.handle.net/10.",
      "citeRegEx" : "Hofert and Maechler.,? 2011",
      "shortCiteRegEx" : "Hofert and Maechler.",
      "year" : 2011
    }, {
      "title" : "Probabilistic latent semantic indexing",
      "author" : [ "Thomas Hofmann." ],
      "venue" : "Proceedings of the 22Nd Annual International Conference on Research and Development in Information Retrieval. ACM, New York, NY, USA, SIGIR, pages 50–57.",
      "citeRegEx" : "Hofmann.,? 1999",
      "shortCiteRegEx" : "Hofmann.",
      "year" : 1999
    }, {
      "title" : "The sensitivity of topic coherence evaluation to topic cardinality",
      "author" : [ "Jey Han Lau", "Timothy Baldwin." ],
      "venue" : "Proceedings of The Annual Conference of the North American Chapter of the Association for Computational Linguistics, Hu-",
      "citeRegEx" : "Lau and Baldwin.,? 2016",
      "shortCiteRegEx" : "Lau and Baldwin.",
      "year" : 2016
    }, {
      "title" : "On collocations and topic models",
      "author" : [ "Jey Han Lau", "Timothy Baldwin", "David Newman." ],
      "venue" : "Journal of ACM Trans. Speech Lang. Process. 10(3):10:1– 10:14. https://doi.org/10.1145/2483969.2483972.",
      "citeRegEx" : "Lau et al\\.,? 2013",
      "shortCiteRegEx" : "Lau et al\\.",
      "year" : 2013
    }, {
      "title" : "Organizing the oca: Learning faceted subjects from a library of digital books",
      "author" : [ "David Mimno", "Andrew McCallum." ],
      "venue" : "Proceedings of the 7th Joint Conference on Digital Libraries. ACM, New York, NY, USA, JCDL ’07, pages 376–385.",
      "citeRegEx" : "Mimno and McCallum.,? 2007",
      "shortCiteRegEx" : "Mimno and McCallum.",
      "year" : 2007
    }, {
      "title" : "Optimizing semantic coherence in topic models",
      "author" : [ "David Mimno", "Hanna M. Wallach", "Edmund Talley", "Miriam Leenders", "Andrew McCallum." ],
      "venue" : "Proceedings of the Conference on Empirical Methods in Natural Language Process-",
      "citeRegEx" : "Mimno et al\\.,? 2011",
      "shortCiteRegEx" : "Mimno et al\\.",
      "year" : 2011
    }, {
      "title" : "LSHTC: A Benchmark for",
      "author" : [ "iotis" ],
      "venue" : null,
      "citeRegEx" : "iotis,? \\Q2015\\E",
      "shortCiteRegEx" : "iotis",
      "year" : 2015
    }, {
      "title" : "A hierarchical bayesian lan",
      "author" : [ ],
      "venue" : null,
      "citeRegEx" : "Teh.,? \\Q2006\\E",
      "shortCiteRegEx" : "Teh.",
      "year" : 2006
    }, {
      "title" : "Topical n-grams: Phrase and topic discovery, with an application to information retrieval",
      "author" : [ "Xuerui Wang", "Andrew McCallum", "Xing Wei." ],
      "venue" : "Proceedings of the 7th International Conference on Data Mining. IEEE Computer Society,",
      "citeRegEx" : "Wang et al\\.,? 2007",
      "shortCiteRegEx" : "Wang et al\\.",
      "year" : 2007
    }, {
      "title" : "Lda-based document models for ad-hoc retrieval",
      "author" : [ "Xing Wei", "W. Bruce Croft." ],
      "venue" : "Proceedings of the 29th Annual International Conference on Research and Development in Information Retrieval. ACM, New York, NY, USA, SIGIR, pages 178–185.",
      "citeRegEx" : "Wei and Croft.,? 2006",
      "shortCiteRegEx" : "Wei and Croft.",
      "year" : 2006
    }, {
      "title" : "Concept over time: the combination of probabilistic topic model with wikipedia knowledge",
      "author" : [ "Liang Yao", "Yin Zhang", "Baogang Wei", "Lei Li", "Fei Wu", "Peng Zhang", "Yali Bian." ],
      "venue" : "Journal of Expert Systems with Applications 60:27 – 38.",
      "citeRegEx" : "Yao et al\\.,? 2016",
      "shortCiteRegEx" : "Yao et al\\.",
      "year" : 2016
    }, {
      "title" : "Learning to cluster web search results",
      "author" : [ "Hua-Jun Zeng", "Qi-Cai He", "Zheng Chen", "Wei-Ying Ma", "Jinwen Ma." ],
      "venue" : "Proceedings of the 27th Annual International Conference on Research and Development in Information Retrieval. ACM,",
      "citeRegEx" : "Zeng et al\\.,? 2004",
      "shortCiteRegEx" : "Zeng et al\\.",
      "year" : 2004
    } ],
    "referenceMentions" : [ {
      "referenceID" : 22,
      "context" : "Many extensions have indeed been proposed for different applications, including ad-hoc information retrieval (Wei and Croft, 2006), clustering search results (Zeng et al.",
      "startOffset" : 109,
      "endOffset" : 130
    }, {
      "referenceID" : 24,
      "context" : "Many extensions have indeed been proposed for different applications, including ad-hoc information retrieval (Wei and Croft, 2006), clustering search results (Zeng et al., 2004) and driving faceted browsing (Mimno and McCallum, 2007).",
      "startOffset" : 158,
      "endOffset" : 177
    }, {
      "referenceID" : 17,
      "context" : ", 2004) and driving faceted browsing (Mimno and McCallum, 2007).",
      "startOffset" : 37,
      "endOffset" : 63
    }, {
      "referenceID" : 12,
      "context" : "In most of these studies, the initial exchangeability assumptions of PLSA and LDA, stipulating that words within a document are interdependent, has led to incoherent topic assignments within semantically meaningful text units, even though the importance of having topically coherent phrases is generally admitted (Griffiths et al., 2005).",
      "startOffset" : 313,
      "endOffset" : 337
    }, {
      "referenceID" : 3,
      "context" : "More recently, (Balikas et al., 2016b) has shown that binding topics, so as to obtain more coherent topic assignments, within such text segments as noun phrases improves the performance (e.",
      "startOffset" : 15,
      "endOffset" : 38
    }, {
      "referenceID" : 3,
      "context" : "Relying on a single topic distribution, as done in most previous studies including (Balikas et al., 2016b), may prevent one from capturing those segment specific topics.",
      "startOffset" : 83,
      "endOffset" : 106
    }, {
      "referenceID" : 10,
      "context" : "The coherence between topics is ensured through copulas (Elidan, 2013) that bind the topics associated to the words of a segment.",
      "startOffset" : 56,
      "endOffset" : 70
    }, {
      "referenceID" : 9,
      "context" : "Since the seminal works of Hofmann (1999) and Blei et al.",
      "startOffset" : 27,
      "endOffset" : 42
    }, {
      "referenceID" : 3,
      "context" : "Since the seminal works of Hofmann (1999) and Blei et al. (2003), there have been several developments in probabilistic topic models.",
      "startOffset" : 46,
      "endOffset" : 65
    }, {
      "referenceID" : 14,
      "context" : "Probabilistic Latent Semantic Analysis (PLSA) proposed by (Hofmann, 1999) is the first probabilistic model that explains the generation of cooccurrence data using latent radom topics and, the EM algorithm for parameter estimation.",
      "startOffset" : 58,
      "endOffset" : 73
    }, {
      "referenceID" : 7,
      "context" : "The model was found more flexible and scalable than the Latent Semantic Analysis (Deerwester et al., 1990), which is based on the singular value decomposition of the document-term matrix, however PLSA is not a generative model as parameter estimation should be performed at each addition of new documents.",
      "startOffset" : 81,
      "endOffset" : 106
    }, {
      "referenceID" : 5,
      "context" : "To overcome this drawback, Blei et al. (2003) proposed the Latent Dirichlet Allocation (LDA) by assuming that the latent topics are random variables sampled from a Dirichlet distribution and that the generated words, occurring in a document, are exchangeable.",
      "startOffset" : 27,
      "endOffset" : 46
    }, {
      "referenceID" : 8,
      "context" : "(2013) following (Du et al., 2010) presented a hierarchical Bayesian model for unsupervised topic segmentation.",
      "startOffset" : 17,
      "endOffset" : 34
    }, {
      "referenceID" : 20,
      "context" : "For inference, a non-parametric Markov Chain inference is used that splits and merges the segments while a PitmanYor process (Teh, 2006) binds the topics.",
      "startOffset" : 125,
      "endOffset" : 136
    }, {
      "referenceID" : 20,
      "context" : "They assume that documents consist of segments and the topic distribution of each segment is generated using a Pitman-Yor process (Teh, 2006).",
      "startOffset" : 130,
      "endOffset" : 141
    }, {
      "referenceID" : 7,
      "context" : "Different attempts to combine LDA-based models with statistical tools to discover document structures have been successfully proposed, such as the study of Griffiths et al. (2005) who investigated the effect of combining a Hidden Markov Model with LDA to capture long and short distance dependencies.",
      "startOffset" : 156,
      "endOffset" : 180
    }, {
      "referenceID" : 2,
      "context" : "Similarly, (Boyd-Graber and Blei, 2008; Balikas et al., 2016a,b) integrated text structure exhibited by a parser or a chunker in their topic models. In this line, Du et al. (2013) following (Du et al.",
      "startOffset" : 40,
      "endOffset" : 180
    }, {
      "referenceID" : 2,
      "context" : "Similarly, (Boyd-Graber and Blei, 2008; Balikas et al., 2016a,b) integrated text structure exhibited by a parser or a chunker in their topic models. In this line, Du et al. (2013) following (Du et al., 2010) presented a hierarchical Bayesian model for unsupervised topic segmentation. This model integrates a boundary sampling method used in a Bayesian segmentation model introduced by Purver et al.(2006) to the topic model.",
      "startOffset" : 40,
      "endOffset" : 406
    }, {
      "referenceID" : 2,
      "context" : "Similarly, (Boyd-Graber and Blei, 2008; Balikas et al., 2016a,b) integrated text structure exhibited by a parser or a chunker in their topic models. In this line, Du et al. (2013) following (Du et al., 2010) presented a hierarchical Bayesian model for unsupervised topic segmentation. This model integrates a boundary sampling method used in a Bayesian segmentation model introduced by Purver et al.(2006) to the topic model. For inference, a non-parametric Markov Chain inference is used that splits and merges the segments while a PitmanYor process (Teh, 2006) binds the topics. Recently, Tamura and Sumita (2016) extended this idea to the bilingual setting.",
      "startOffset" : 40,
      "endOffset" : 616
    }, {
      "referenceID" : 16,
      "context" : "This type of models extract text-spans using ngram counts and word collections and use bigrams to integrate the order of words as well as to capture the topical content of a phrase (Lau et al., 2013).",
      "startOffset" : 181,
      "endOffset" : 199
    }, {
      "referenceID" : 21,
      "context" : "In (Wang et al., 2007), depending on the topic a particular bigram can be either considered as a single token or as two unigrams.",
      "startOffset" : 3,
      "endOffset" : 22
    }, {
      "referenceID" : 16,
      "context" : "This type of models extract text-spans using ngram counts and word collections and use bigrams to integrate the order of words as well as to capture the topical content of a phrase (Lau et al., 2013). In (Wang et al., 2007), depending on the topic a particular bigram can be either considered as a single token or as two unigrams. Further, Wang et al. (2009) merged topic models with a unigram model over sentences that assigns topics to the sentences instead of the words.",
      "startOffset" : 182,
      "endOffset" : 359
    }, {
      "referenceID" : 3,
      "context" : "This view is in line with the one expressed in (Balikas et al., 2016b), in which a latent topic model, referred to as copLDA in the remainder, includes a binding mechanism between topics within coherent text spans, defined in their study as noun phrases (NPs).",
      "startOffset" : 47,
      "endOffset" : 70
    }, {
      "referenceID" : 0,
      "context" : "For latent topic models, as discussed in (Amoualian et al., 2016), Frank’s copula is particularly interesting as (a) it is invariant by permutations and associative, as are the words and topics z in each segment due to the exchangeability assumption, and (b) it relies on a single parameter (denoted λ here) that controls the strength of dependence between the variables and is thus easy to implement.",
      "startOffset" : 41,
      "endOffset" : 65
    }, {
      "referenceID" : 5,
      "context" : "The Gibbs updates for the parameters φ and θ are the same as the ones for standard LDA (Blei et al., 2003).",
      "startOffset" : 87,
      "endOffset" : 106
    }, {
      "referenceID" : 3,
      "context" : "Lastly, for the variables z, we follow the same strategy as the one described in (Balikas et al., 2016b) and based on (Amoualian et al.",
      "startOffset" : 81,
      "endOffset" : 104
    }, {
      "referenceID" : 0,
      "context" : ", 2016b) and based on (Amoualian et al., 2016), leading to: P (Z|Z,W,Θ,Φ, λ) = p(Z|Θ, λ) ∏",
      "startOffset" : 22,
      "endOffset" : 46
    }, {
      "referenceID" : 23,
      "context" : ", 2015), Reuters3 and New York Times (NYT)4 (Yao et al., 2016).",
      "startOffset" : 44,
      "endOffset" : 62
    }, {
      "referenceID" : 2,
      "context" : "The first two collections were considered in (Balikas et al., 2016a), we followed their setup by considering 3 subsets of Wikipedia with different number of classes (namely, Wiki0, Wiki1 and Wiki2).",
      "startOffset" : 45,
      "endOffset" : 68
    }, {
      "referenceID" : 4,
      "context" : "0 as investigated in (Bird et al., 2009) and the NYT dataset is collected from full text of New York Times global news, from January 1st to December 31st, 2011.",
      "startOffset" : 21,
      "endOffset" : 40
    }, {
      "referenceID" : 5,
      "context" : "These collections were processed following (Blei et al., 2003) by removing a standard list of 50 stop words, lemmatizing, lowercasing and keeping only words made of letters.",
      "startOffset" : 43,
      "endOffset" : 62
    }, {
      "referenceID" : 11,
      "context" : "LDA: Standard Latent Dirichlet Allocation implemented using collapsed Gibbs sampling inference (Griffiths and Steyvers, 2004)5.",
      "startOffset" : 95,
      "endOffset" : 125
    }, {
      "referenceID" : 2,
      "context" : "senLDA: Sentence LDA, introduced in (Balikas et al., 2016a), which forces all words within a sentence to be assigned to the same topic.",
      "startOffset" : 36,
      "endOffset" : 59
    }, {
      "referenceID" : 3,
      "context" : "copLDA: Copula LDA, introduced in (Balikas et al., 2016b) already discussed before, which relies on two types of segments, namely NPs (extracted with the nltk.",
      "startOffset" : 34,
      "endOffset" : 57
    }, {
      "referenceID" : 4,
      "context" : "chunk package (Bird et al., 2009)) and single words.",
      "startOffset" : 14,
      "endOffset" : 33
    }, {
      "referenceID" : 1,
      "context" : "In all models α and β play a symmetric role and are respectively fixed to 1/K, following (Asuncion et al., 2009).",
      "startOffset" : 89,
      "endOffset" : 112
    }, {
      "referenceID" : 3,
      "context" : "For copula based models, λ is set to 5, following (Balikas et al., 2016b).",
      "startOffset" : 50,
      "endOffset" : 73
    }, {
      "referenceID" : 13,
      "context" : "For sampling from Frank’s copula, we relied on the R copula package (Hofert and Maechler, 2011) 6.",
      "startOffset" : 68,
      "endOffset" : 95
    }, {
      "referenceID" : 5,
      "context" : "In order to see how well the models fit the data and following (Blei et al., 2003), we first evaluated the methods in terms of perplexity defined as:",
      "startOffset" : 63,
      "endOffset" : 82
    }, {
      "referenceID" : 5,
      "context" : "In this case, it is possible to reduce the dimensionality of the representation space by using the induced topics (Blei et al., 2003).",
      "startOffset" : 114,
      "endOffset" : 133
    }, {
      "referenceID" : 18,
      "context" : "To overcome this limitation the task of automatically evaluating the coherence of topics produced by topic models received a lot of attention (Mimno et al., 2011).",
      "startOffset" : 142,
      "endOffset" : 162
    }, {
      "referenceID" : 15,
      "context" : "Very recently, Lau and Baldwin (2016) showed that N actually impacts the quality of the obtained results and, in particular, the correlation with human judgments.",
      "startOffset" : 15,
      "endOffset" : 38
    }, {
      "referenceID" : 15,
      "context" : "Following the findings of Lau and Baldwin (2016) and using (Newman et al.",
      "startOffset" : 26,
      "endOffset" : 49
    }, {
      "referenceID" : 1,
      "context" : "In the future, we plan on relying on other inference approaches, based for example on variational Bayes known to yield better estimates for perplexity (Asuncion et al., 2009); it is however not certain that the gain in perplexity one can expect from the use of variational Bayes approaches will necessarily result in a gain in, say, topic coherence.",
      "startOffset" : 151,
      "endOffset" : 174
    } ],
    "year" : 2017,
    "abstractText" : "This paper presents an LDA-based model that generates topically coherent segments within documents by jointly segmenting documents and assigning topics to their words. The coherence between topics is ensured through a copula, binding the topics associated to the words of a segment. In addition, this model relies on both document and segment specific topic distributions so as to capture fine grained differences in topic assignments. We show that the proposed model naturally encompasses other state-of-the-art LDA-based models designed for similar tasks. Furthermore, our experiments, conducted on six different publicly available datasets, show the effectiveness of our model in terms of perplexity, Normalized Pointwise Mutual Information, which captures the coherence between the generated topics, and the Micro F1 measure for text classification.",
    "creator" : "LaTeX with hyperref package"
  }
}