{"conference": "ICML", "VERSION": "v1", "DATE_OF_SUBMISSION": "22-May-2012", "title": "Safe Exploration in Markov Decision Processes", "abstract": "In environments with uncertain dynamics exploration is necessary to learn how to perform well. Existing reinforcement learning algorithms provide strong exploration guarantees, but they tend to rely on an ergodicity assumption. The essence of ergodicity is that any state is eventually reachable from any other state by following a suitable policy. This assumption allows for exploration algorithms that operate by simply favoring states that have rarely been visited before. For most physical systems this assumption is impractical as the systems would break before any reasonable exploration has taken place, i.e., most physical systems don't satisfy the ergodicity assumption. In this paper we address the need for safe exploration methods in Markov decision processes. We first propose a general formulation of safety through ergodicity. We show that imposing safety by restricting attention to the resulting set of guaranteed safe policies is NP-hard. We then present an efficient algorithm for guaranteed safe, but potentially suboptimal, exploration. At the core is an optimization formulation in which the constraints restrict attention to a subset of the guaranteed safe policies and the objective favors exploration policies. Our framework is compatible with the majority of previously proposed exploration methods, which rely on an exploration bonus. Our experiments, which include a Martian terrain exploration problem, show that our method is able to explore better than classical exploration methods.", "histories": [["v1", "Tue, 22 May 2012 06:02:09 GMT  (724kb,D)", "https://arxiv.org/abs/1205.4810v1", null], ["v2", "Sat, 30 Jun 2012 09:17:38 GMT  (722kb,D)", "http://arxiv.org/abs/1205.4810v2", null], ["v3", "Fri, 6 Jul 2012 20:56:23 GMT  (725kb,D)", "http://arxiv.org/abs/1205.4810v3", null]], "reviews": [], "SUBJECTS": "cs.LG", "authors": ["teodor mihai moldovan", "pieter abbeel"], "accepted": true, "id": "1205.4810"}
