{"conference": "NIPS", "VERSION": "v1", "DATE_OF_SUBMISSION": "17-Jul-2012", "title": "Approximate Message Passing with Consistent Parameter Estimation and Applications to Sparse Learning", "abstract": "We consider the estimation of an i.i.d. vector $\\xbf \\in \\R^n$ from measurements $\\ybf \\in \\R^m$ obtained by a general cascade model consisting of a known linear transform followed by a probabilistic componentwise (possibly nonlinear) measurement channel. A novel method, called adaptive generalized approximate message passing (Adaptive GAMP), that enables joint learning of the statistics of the prior and measurement channel along with estimation of the unknown vector $\\xbf$ is presented. The proposed algorithm is a generalization of a recently-developed technique by Vila and Schniter that uses expectation-maximization (EM) iterations where the posteriors in the E-steps are computed via approximate message passing. The proposed methodology can be applied to a large class of learning problems including the learning of sparse priors in compressed sensing or identification of linear-nonlinear cascade models in dynamical systems and neural spiking processes. We prove that for large i.i.d. Gaussian transform matrices the asymptotic componentwise behavior of the adaptive GAMP algorithm is predicted by a simple set of scalar state evolution equations. This analysis shows that the adaptive GAMP method can yield asymptotically consistent parameter estimates, which implies that the algorithm achieves a reconstruction quality equivalent to the oracle algorithm that knows the correct parameter values. The adaptive GAMP methodology thus provides a systematic, general and computationally efficient method applicable to a large range of complex linear-nonlinear models with provable guarantees.", "histories": [["v1", "Tue, 17 Jul 2012 01:50:46 GMT  (105kb,D)", "https://arxiv.org/abs/1207.3859v1", "16 pages, 3 figures"], ["v2", "Thu, 19 Jul 2012 13:35:50 GMT  (101kb,D)", "http://arxiv.org/abs/1207.3859v2", "10 pages, 3 figures"], ["v3", "Sat, 1 Dec 2012 23:30:36 GMT  (180kb,D)", "http://arxiv.org/abs/1207.3859v3", "14 pages, 3 figures"]], "COMMENTS": "16 pages, 3 figures", "reviews": [], "SUBJECTS": "cs.IT cs.LG math.IT", "authors": ["ulugbek kamilov", "sundeep rangan", "alyson k fletcher", "michael unser"], "accepted": true, "id": "1207.3859"}
