{"conference": "ICML", "VERSION": "v1", "DATE_OF_SUBMISSION": "19-Jul-2012", "title": "Block-Coordinate Frank-Wolfe Optimization for Structural SVMs", "abstract": "We consider the use of Frank-Wolfe optimization algorithms on the dual formulation of structural SVMs. These yield simple algorithms which only need access to an approximate maximization oracle for the structured prediction problem and thus have wide applicability. This perspective provides insights on previous popular algorithms as we show that batch subgradient as well as the cutting plane algorithms are equivalent to versions of Frank-Wolfe algorithms, enabling us to improve on their convergence analysis by harvesting the Frank-Wolfe literature. Moreover, we propose a new stochastic coordinate descent version of Frank-Wolfe which yields a provably convergent optimization algorithm for structural SVMs with total run-time independent of the number of training examples, like Pegasos, but with duality gap certificate guarantees and step-size robustness thanks to the use of line-search. Our experiments on sequence prediction indicate that this simple algorithm outperforms all other optimization algorithms which only have access to the maximization oracle.", "histories": [["v1", "Thu, 19 Jul 2012 18:02:41 GMT  (2347kb,D)", "https://arxiv.org/abs/1207.4747v1", "13 pages main text + 13 pages appendix (short version). Under review"], ["v2", "Mon, 29 Oct 2012 18:03:32 GMT  (3198kb,D)", "http://arxiv.org/abs/1207.4747v2", "10 pages main text + 17 pages appendix. Under review"], ["v3", "Tue, 30 Oct 2012 19:25:10 GMT  (1599kb,D)", "http://arxiv.org/abs/1207.4747v3", "10 pages main text + 17 pages appendix. Under review. Changes from v1 to v3: 1) Re-organized text for clarity + changed title; 2) Added new experiments (more settings, online EG, matching dataset); 3) Added multiplicative approximation result in theorems; 4) Corrected typo for rate of online EG in Table 1. v2 was missing acknowledgment section"], ["v4", "Mon, 14 Jan 2013 13:26:51 GMT  (1895kb,D)", "http://arxiv.org/abs/1207.4747v4", "Appears in Proceedings of the 30th International Conference on Machine Learning (ICML 2013). 9 pages main text + 22 pages appendix. Changes from v3 to v4: 1) Re-organized appendix; improved &amp; clarified duality gap proofs; re-drew all plots; 2) Changed convention for Cf definition; 3) Added weighted averaging experiments + convergence results; 4) Clarified main text and relationship with appendix"]], "COMMENTS": "13 pages main text + 13 pages appendix (short version). Under review", "reviews": [], "SUBJECTS": "cs.LG math.OC stat.ML", "authors": ["simon lacoste-julien", "martin jaggi", "mark w schmidt", "patrick pletscher"], "accepted": true, "id": "1207.4747"}
