{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "7-May-2013", "title": "High Level Pattern Classification via Tourist Walks in Networks", "abstract": "Complex networks refer to large-scale graphs with nontrivial connection patterns. The salient and interesting features that the complex network study offer in comparison to graph theory are the emphasis on the dynamical properties of the networks and the ability of inherently uncovering pattern formation of the vertices. In this paper, we present a hybrid data classification technique combining a low level and a high level classifier. The low level term can be equipped with any traditional classification techniques, which realize the classification task considering only physical features (e.g., geometrical or statistical features) of the input data. On the other hand, the high level term has the ability of detecting data patterns with semantic meanings. In this way, the classification is realized by means of the extraction of the underlying network's features constructed from the input data. As a result, the high level classification process measures the compliance of the test instances with the pattern formation of the training data. Out of various high level perspectives that can be utilized to capture semantic meaning, we utilize the dynamical features that are generated from a tourist walker in a networked environment. Specifically, a weighted combination of transient and cycle lengths generated by the tourist walk is employed for that end. Interestingly, our study shows that the proposed technique is able to further improve the already optimized performance of traditional classification techniques.", "histories": [["v1", "Tue, 7 May 2013 23:40:08 GMT  (1727kb,D)", "http://arxiv.org/abs/1305.1679v1", "Submitted to the IEEE Transactions on Neural Networks and Learning Systems"]], "COMMENTS": "Submitted to the IEEE Transactions on Neural Networks and Learning Systems", "reviews": [], "SUBJECTS": "cs.AI cs.LG", "authors": ["thiago christiano silva", "liang zhao"], "accepted": false, "id": "1305.1679"}
