{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "14-Jun-2013", "title": "Approximation Algorithms for Bayesian Multi-Armed Bandit Problems", "abstract": "In this paper, we consider several finite-horizon Bayesian multi-armed bandit problems with side constraints which are computationally intractable (NP-Hard) and for which no optimal (or near optimal) algorithms are known to exist with sub-exponential running time. All of these problems violate the \"idling bandit property\", which assumes that the reward from the play of an arm is not contingent upon when the arm is played. Not only are index policies suboptimal in these contexts, there has been little analysis of such policies in these problem settings. We show that if we consider near-optimal policies, in the sense of approximation algorithms, then there exists (near) index policies. Conceptually, if we can find policies that satisfy an approximate version of the idling bandit property, namely, that the reward from the play of an arm depends on when the arm is played to within a constant factor, then we have an avenue towards solving these problems. However such an approximate version of the idling bandit property does not hold on a per-play basis and are shown to hold in a global sense. Clearly, such a property is not necessarily true o arbitrary single arm policies and finding such single arm policies is nontrivial. We show that by restricting the state spaces of arms we can find single arm policies and that these single arm policies can be combined into global (near) index policies where the approximate version of the idling bandit property is true in expectation. The number of different bandit problems that can be addressed by this technique already demonstrate its wide applicability.", "histories": [["v1", "Fri, 14 Jun 2013 22:24:29 GMT  (48kb)", "https://arxiv.org/abs/1306.3525v1", "arXiv admin note: text overlap witharXiv:1011.1161"], ["v2", "Wed, 17 Jul 2013 19:16:47 GMT  (83kb,D)", "http://arxiv.org/abs/1306.3525v2", "arXiv admin note: text overlap witharXiv:1011.1161"]], "COMMENTS": "arXiv admin note: text overlap witharXiv:1011.1161", "reviews": [], "SUBJECTS": "cs.DS cs.LG", "authors": ["sudipto guha", "kamesh munagala"], "accepted": false, "id": "1306.3525"}
