{"conference": "NIPS", "VERSION": "v1", "DATE_OF_SUBMISSION": "12-Jun-2013", "title": "Flexible sampling of discrete data correlations without the marginal distributions", "abstract": "Learning the joint dependence of discrete variables is a fundamental problem in machine learning, with many applications including prediction, clustering and dimensionality reduction. More recently, the framework of copula modeling has gained popularity due to its modular parametrization of joint distributions. Among other properties, copulas provide a recipe for combining flexible models for univariate marginal distributions with parametric families suitable for potentially high dimensional dependence structures. More radically, the extended rank likelihood approach of Hoff (2007) bypasses learning marginal models completely when such information is ancillary to the learning task at hand as in, e.g., standard dimensionality reduction problems or copula parameter estimation. The main idea is to represent data by their observable rank statistics, ignoring any other information from the marginals. Inference is typically done in a Bayesian framework with Gaussian copulas, and it is complicated by the fact this implies sampling within a space where the number of constraints increases quadratically with the number of data points. The result is slow mixing when using off-the-shelf Gibbs sampling. We present an efficient algorithm based on recent advances on constrained Hamiltonian Markov chain Monte Carlo that is simple to implement and does not require paying for a quadratic cost in sample size.", "histories": [["v1", "Wed, 12 Jun 2013 01:13:46 GMT  (2997kb,AD)", "http://arxiv.org/abs/1306.2685v1", null], ["v2", "Thu, 8 Aug 2013 18:23:45 GMT  (3495kb,AD)", "http://arxiv.org/abs/1306.2685v2", "An overhauled version of the experimental section has been added in the supplementary material"], ["v3", "Thu, 14 Nov 2013 15:31:46 GMT  (3356kb,AD)", "http://arxiv.org/abs/1306.2685v3", "An overhauled version of the experimental section moved to the main paper. Old experimental section moved to supplementary material"]], "reviews": [], "SUBJECTS": "stat.ML cs.LG stat.CO", "authors": ["alfredo a kalaitzis", "ricardo bezerra de andrade e silva"], "accepted": true, "id": "1306.2685"}
