{"conference": "ICML", "VERSION": "v1", "DATE_OF_SUBMISSION": "18-Jul-2013", "title": "Large-scale Multi-label Learning with Missing Labels", "abstract": "Multi-label classification problems abound in practice; as a result, many methods have recently been proposed for these problems. However, there are two key challenges that have not been adequately addressed: (a) the number of labels can be numerous, for example, in the millions, and (b) the test data can be riddled with missing labels. In this paper, we study a generic framework for multi-label classification that directly addresses the above challenges. In particular, we pose the problem as one of empirical risk minimization, where the prediction function is parameterized by a low-rank matrix. We show that our approach derives several existing label-compression based algorithms (such as the recently proposed CPLST method (Chen and Lin, 2012) in a principled manner. A key facet of our approach is that we handle missing labels in the training set by applying techniques from the domain of matrix completion. To develop a scalable algorithm that can handle a larger number of classes, we use the alternating minimization method to find the low-rank parameter matrix. Furthermore, for the special case of $L_2$ loss, we show that special structure in the problem can be exploited and the alternating minimization algorithm can be efficiently implemented. Finally, we present empirical results on a variety of benchmark datasets and show that our methods perform significantly better than existing label compression based methods. Moreover, we demonstrate scalability of our approach by applying it to a large Wikipedia based dataset that has 117,564 training data instances and 207,386 labels.", "histories": [["v1", "Thu, 18 Jul 2013 23:55:55 GMT  (601kb,D)", "https://arxiv.org/abs/1307.5101v1", null], ["v2", "Mon, 14 Oct 2013 22:33:17 GMT  (718kb,D)", "http://arxiv.org/abs/1307.5101v2", null], ["v3", "Mon, 25 Nov 2013 16:57:43 GMT  (734kb,D)", "http://arxiv.org/abs/1307.5101v3", null]], "reviews": [], "SUBJECTS": "cs.LG", "authors": ["hsiang-fu yu", "prateek jain 0002", "purushottam kar", "inderjit s dhillon"], "accepted": true, "id": "1307.5101"}
