{"conference": "ICML", "VERSION": "v1", "DATE_OF_SUBMISSION": "14-May-2014", "title": "Improving offline evaluation of contextual bandit algorithms via bootstrapping techniques", "abstract": "In many recommendation applications such as news recommendation, the items that can be rec- ommended come and go at a very fast pace. This is a challenge for recommender systems (RS) to face this setting. Online learning algorithms seem to be the most straight forward solution. The contextual bandit framework was introduced for that very purpose. In general the evaluation of a RS is a critical issue. Live evaluation is of- ten avoided due to the potential loss of revenue, hence the need for offline evaluation methods. Two options are available. Model based meth- ods are biased by nature and are thus difficult to trust when used alone. Data driven methods are therefore what we consider here. Evaluat- ing online learning algorithms with past data is not simple but some methods exist in the litera- ture. Nonetheless their accuracy is not satisfac- tory mainly due to their mechanism of data re- jection that only allow the exploitation of a small fraction of the data. We precisely address this issue in this paper. After highlighting the limita- tions of the previous methods, we present a new method, based on bootstrapping techniques. This new method comes with two important improve- ments: it is much more accurate and it provides a measure of quality of its estimation. The latter is a highly desirable property in order to minimize the risks entailed by putting online a RS for the first time. We provide both theoretical and ex- perimental proofs of its superiority compared to state-of-the-art methods, as well as an analysis of the convergence of the measure of quality.", "histories": [["v1", "Wed, 14 May 2014 15:29:02 GMT  (197kb,D)", "http://arxiv.org/abs/1405.3536v1", null]], "reviews": [], "SUBJECTS": "stat.ML cs.LG", "authors": ["jérémie mary", "philippe preux", "olivier nicol"], "accepted": true, "id": "1405.3536"}
