{"conference": "NIPS", "VERSION": "v1", "DATE_OF_SUBMISSION": "10-Jun-2014", "title": "Identifying and attacking the saddle point problem in high-dimensional non-convex optimization", "abstract": "A central challenge to many fields of science and engineering involves minimizing non-convex error functions over continuous, high dimensional spaces. Gradient descent or quasi-Newton methods are almost ubiquitously used to perform such minimizations, and it is often thought that a main source of difficulty for these local methods to find the global minimum is the proliferation of local minima with much higher error than the global minimum. Here we argue, based on results from statistical physics, random matrix theory, neural network theory, and empirical evidence, that a deeper and more profound difficulty originates from the proliferation of saddle points, not local minima, especially in high dimensional problems of practical interest. Such saddle points are surrounded by high error plateaus that can dramatically slow down learning, and give the illusory impression of the existence of a local minimum. Motivated by these arguments, we propose a new approach to second-order optimization, the saddle-free Newton method, that can rapidly escape high dimensional saddle points, unlike gradient descent and quasi-Newton methods. We apply this algorithm to deep or recurrent neural network training, and provide numerical evidence for its superior optimization performance.", "histories": [["v1", "Tue, 10 Jun 2014 14:52:14 GMT  (1044kb,D)", "http://arxiv.org/abs/1406.2572v1", "The theoretical review and analysis in this article draw heavily fromarXiv:1405.4604[cs.LG]"]], "COMMENTS": "The theoretical review and analysis in this article draw heavily fromarXiv:1405.4604[cs.LG]", "reviews": [], "SUBJECTS": "cs.LG math.OC stat.ML", "authors": ["yann n dauphin", "razvan pascanu", "çaglar gülçehre", "kyunghyun cho", "surya ganguli", "yoshua bengio"], "accepted": true, "id": "1406.2572"}
