{"conference": "nips", "VERSION": "v1", "DATE_OF_SUBMISSION": "6-Nov-2014", "title": "How transferable are features in deep neural networks?", "abstract": "Many deep neural networks trained on natural images exhibit a curious phenomenon in common: on the first layer they learn features similar to Gabor filters and color blobs. Such first-layer features appear not to be specific to a particular dataset or task, but general in that they are applicable to many datasets and tasks. Features must eventually transition from general to specific by the last layer of the network, but this transition has not been studied extensively. In this paper we experimentally quantify the generality versus specificity of neurons in each layer of a deep convolutional neural network and report a few surprising results. Transferability is negatively affected by two distinct issues: (1) the specialization of higher layer neurons to their original task at the expense of performance on the target task, which was expected, and (2) optimization difficulties related to splitting networks between co-adapted neurons, which was not expected. In an example network trained on ImageNet, we demonstrate that either of these two issues may dominate, depending on whether features are transferred from the bottom, middle, or top of the network. We also document that the transferability of features decreases as the distance between the base task and target task increases, but that transferring features even from distant tasks can be better than using random features. A final surprising result is that initializing a network with transferred features from almost any number of layers can produce a boost to generalization that lingers even after fine-tuning to the target dataset.", "histories": [["v1", "Thu, 6 Nov 2014 23:09:37 GMT  (339kb,D)", "http://arxiv.org/abs/1411.1792v1", "To appear in Advances in Neural Information Processing Systems 27 (NIPS 2014)"]], "COMMENTS": "To appear in Advances in Neural Information Processing Systems 27 (NIPS 2014)", "reviews": [], "SUBJECTS": "cs.LG cs.NE", "authors": ["jason yosinski", "jeff clune", "yoshua bengio", "hod lipson"], "accepted": true, "id": "1411.1792"}
