{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "30-Nov-2014", "title": "The Loss Surfaces of Multilayer Networks", "abstract": "We study the connection between the highly non-convex loss function of a simple model of the fully-connected feed-forward neural network and the Hamiltonian of the spherical spin-glass model under the assumptions of: i) variable independence, ii) redundancy in network parametrization, and iii) uniformity. These assumptions enable us to explain the complexity of the fully decoupled neural network through the prism of the results from the random matrix theory. We show that for large-size decoupled networks the lowest critical values of the random loss function are located in a well-defined narrow band lower-bounded by the global minimum. Furthermore, they form a layered structure. We show that the number of local minima outside the narrow band diminishes exponentially with the size of the network. We empirically demonstrate that the mathematical model exhibits similar behavior as the computer simulations, despite the presence of high dependencies in real networks. We conjecture that both simulated annealing and SGD converge to the band containing the largest number of critical points, and that all critical points found there are local minima and correspond to the same high learning quality measured by the test error. This emphasizes a major difference between large- and small-size networks where for the latter poor quality local minima have non-zero probability of being recovered. Simultaneously we prove that recovering the global minimum becomes harder as the network size increases and that it is in practice irrelevant as global minimum often leads to overfitting.", "histories": [["v1", "Sun, 30 Nov 2014 15:48:16 GMT  (294kb,D)", "http://arxiv.org/abs/1412.0233v1", null], ["v2", "Thu, 4 Dec 2014 21:46:57 GMT  (358kb,D)", "http://arxiv.org/abs/1412.0233v2", null], ["v3", "Wed, 21 Jan 2015 22:25:26 GMT  (367kb,D)", "http://arxiv.org/abs/1412.0233v3", null]], "reviews": [], "SUBJECTS": "cs.LG", "authors": ["anna choromanska", "mikael henaff", "michael mathieu", "g\\'erard ben arous", "yann lecun"], "accepted": false, "id": "1412.0233"}
