{"conference": "acl", "VERSION": "v1", "DATE_OF_SUBMISSION": "29-May-2015", "title": "Solving Verbal Comprehension Questions in IQ Test by Knowledge-Powered Word Embedding", "abstract": "Intelligence Quotient (IQ) Test is a set of standardized questions designed to evaluate human intelligence. Verbal comprehension questions appear very frequently in IQ tests, which measure human's verbal ability including the understanding of the words with multiple senses, the synonyms and antonyms, and the analogies among words. In this work, we explore whether such tests can be solved automatically by artificial intelligence technologies, especially the deep learning technologies that are recently developed and successfully applied in a number of fields. However, we found that the task was quite challenging, and simply applying existing technologies (e.g., word embedding) could not achieve a good performance, mainly due to the multiple senses of words and the complex relations among words. To tackle this challenge, we propose a novel framework consisting of three components. First, we build a classifier to recognize the specific type of a verbal question (e.g., analogy, classification, synonym, or antonym). Second, we obtain distributed representations of words and relations by leveraging a novel word embedding method that considers the multi-sense nature of words and the relational knowledge among words (or their senses) contained in dictionaries. Third, for each specific type of questions, we propose a simple yet effective solver based on the obtained distributed word representations and relation representations. According to our experimental results, our proposed framework can not only outperform existing methods for solving verbal comprehension questions but also exceed the average performance of human beings. The results are highly encouraging, indicating that with appropriate uses of the deep learning technologies, we could be a further step closer to the true human intelligence.", "histories": [["v1", "Fri, 29 May 2015 02:46:44 GMT  (138kb,D)", "http://arxiv.org/abs/1505.07909v1", null], ["v2", "Wed, 17 Jun 2015 13:29:41 GMT  (138kb,D)", "http://arxiv.org/abs/1505.07909v2", null], ["v3", "Mon, 6 Jul 2015 08:42:22 GMT  (102kb,D)", "http://arxiv.org/abs/1505.07909v3", null], ["v4", "Tue, 26 Apr 2016 11:37:32 GMT  (121kb)", "http://arxiv.org/abs/1505.07909v4", null]], "reviews": [], "SUBJECTS": "cs.CL cs.IR cs.LG", "authors": ["huazheng wang", "fei tian", "bin gao", "jiang bian", "tie-yan liu"], "accepted": true, "id": "1505.07909"}
