{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "3-Jun-2015", "title": "Cyclical Learning Rates for Training Neural Networks", "abstract": "It is known that the learning rate is the most important hyper-parameter to tune for training deep convolutional neural networks (i.e., a \"guessing game\"). This report describes a new method for setting the learning rate, named cyclical learning rates, that eliminates the need to experimentally find the best values and schedule for the learning rates. Instead of setting the learning rate to fixed values, this method lets the learning rate cyclically vary within reasonable boundary values. This report shows that training with cyclical learning rates achieves near optimal classification accuracy without tuning and often in many fewer iterations. This report also describes a simple way to estimate \"reasonable bounds\" - by linearly increasing the learning rate in one training run of the network for only a few epochs. In addition, cyclical learning rates are demonstrated on training with the CIFAR-10 dataset and the AlexNet and GoogLeNet architectures on the ImageNet dataset. These methods are practical tools for everyone who trains convolutional neural networks.", "histories": [["v1", "Wed, 3 Jun 2015 09:54:31 GMT  (726kb,D)", "http://arxiv.org/abs/1506.01186v1", null], ["v2", "Fri, 5 Jun 2015 20:40:18 GMT  (726kb,D)", "http://arxiv.org/abs/1506.01186v2", "11 pages, 12 figures, 4 tables"], ["v3", "Wed, 26 Oct 2016 19:07:58 GMT  (2002kb,D)", "http://arxiv.org/abs/1506.01186v3", "This is an updated version of this paper, along with a change in title, and was submitted to WACV 2017, Submitted to WACV 2017"], ["v4", "Thu, 29 Dec 2016 15:20:01 GMT  (1189kb,D)", "http://arxiv.org/abs/1506.01186v4", "This is an updated version of this paper and was accepted to WACV 2017"], ["v5", "Thu, 23 Mar 2017 11:38:19 GMT  (2002kb,D)", "http://arxiv.org/abs/1506.01186v5", "Presented at WACV 2017; added instructions to implement CLR in Caffe"], ["v6", "Tue, 4 Apr 2017 11:34:46 GMT  (1210kb,D)", "http://arxiv.org/abs/1506.01186v6", "Presented at WACV 2017; seethis https URLfor instructions to implement CLR in Keras"]], "reviews": [], "SUBJECTS": "cs.CV cs.LG cs.NE", "authors": ["leslie n smith"], "accepted": false, "id": "1506.01186"}
