{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "26-Aug-2015", "title": "Greedy methods, randomization approaches and multi-arm bandit algorithms for efficient sparsity-constrained optimization", "abstract": "Several sparsity-constrained algorithms such as Orthogonal Matching Pursuit or the Frank-Wolfe algorithm with sparsity constraints work by iteratively selecting a novel atom to add to the current non-zero set of variables. This selection step is usually performed by computing the gradient and then by looking for the gradient component with maximal absolute entry. This step can be computationally expensive especially for large-scale and high-dimensional data. In this work, we aim at accelerating these sparsity-constrained optimization algorithms by exploiting the key observation that, for these algorithms to work, one only needs the coordinate of the gradient's top entry. Hence, we introduce algorithms based on greedy methods and randomization approaches that aim at cheaply estimating the gradient and its top entry. Another of our contribution is to cast the problem of finding the best gradient entry as a best arm identification in a multi-armed bandit problem. Owing to this novel insight, we are able to provide a bandit-based algorithm that directly estimates the top entry in a very efficient way. Theoretical results stating that the resulting inexact Frank-Wolfe or Orthogonal Matching Pursuit algorithms act, with high probability, similarly to their exact versions are also given. We have carried out several experiments showing that the greedy deterministic and the bandit approaches we propose can achieve an acceleration of an order of magnitude while being as efficient as the exact gradient when used in algorithms such as", "histories": [["v1", "Wed, 26 Aug 2015 13:01:36 GMT  (139kb)", "https://arxiv.org/abs/1508.06477v1", null], ["v2", "Mon, 22 Aug 2016 07:50:48 GMT  (227kb,D)", "http://arxiv.org/abs/1508.06477v2", null]], "reviews": [], "SUBJECTS": "cs.LG", "authors": ["a rakotomamonjy", "s ko\\c{c}o", "liva ralaivola"], "accepted": false, "id": "1508.06477"}
