{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "17-Sep-2015", "title": "DeXpression: Deep Convolutional Neural Network for Expression Recognition", "abstract": "We propose a convolutional neural network (CNN) architecture for facial expression recognition. The proposed architecture is independent of any hand-crafted feature extraction and performs better than the earlier proposed convolutional neural network based approaches. We visualize the automatically extracted features which have been learned by the network in order to provide a better understanding. The standard datasets, i.e. Extended Cohn-Kanade (CKP) and MMI Facial Expression Databse are used for the quantitative evaluation. On the CKP set the current state of the art approach, using CNNs, achieves an accuracy of 99.2%. For the MMI dataset, currently the best accuracy for emotion recognition is 93.33%. The proposed architecture achieves 99.6% for CKP and 98.63% for MMI, therefore performing better than the state of the art using CNNs. Automatic facial expression recognition has a broad spectrum of applications such as human-computer interaction and safety systems. This is due to the fact that non-verbal cues are important forms of communication and play a pivotal role in interpersonal communication. The performance of the proposed architecture endorses the efficacy and reliable usage of the proposed work for real world applications.", "histories": [["v1", "Thu, 17 Sep 2015 18:49:10 GMT  (1905kb,D)", "http://arxiv.org/abs/1509.05371v1", "Under consideration for publication in Pattern Recognition Letters"], ["v2", "Wed, 17 Aug 2016 19:34:55 GMT  (1905kb,D)", "http://arxiv.org/abs/1509.05371v2", "Under consideration for publication in Pattern Recognition Letters"]], "COMMENTS": "Under consideration for publication in Pattern Recognition Letters", "reviews": [], "SUBJECTS": "cs.CV cs.LG", "authors": ["peter burkert", "felix trier", "muhammad zeshan afzal", "reas dengel", "marcus liwicki"], "accepted": false, "id": "1509.05371"}
