{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "12-Oct-2015", "title": "Evaluating Real-time Anomaly Detection Algorithms - the Numenta Anomaly Benchmark", "abstract": "Much of the world's data is streaming, time-series data, where anomalies give significant information in critical situations; examples abound in domains such as finance, IT, security, medical, and energy. Yet detecting anomalies in streaming data is a difficult task, requiring detectors to process data in real-time, not batches, and learn while simultaneously making predictions. There are no benchmarks to adequately test and score the efficacy of real-time anomaly detectors. Here we propose the Numenta Anomaly Benchmark (NAB), which attempts to provide a controlled and repeatable environment of open-source tools to test and measure anomaly detection algorithms on streaming data. The perfect detector would detect all anomalies as soon as possible, trigger no false alarms, work with real-world time-series data across a variety of domains, and automatically adapt to changing statistics. Rewarding these characteristics is formalized in NAB, using a scoring algorithm designed for streaming data. NAB evaluates detectors on a benchmark dataset with labeled, real-world time-series data. We present these components, and give results and analyses for several open source, commercially-used algorithms. The goal for NAB is to provide a standard, open source framework with which the research community can compare and evaluate different algorithms for detecting anomalies in streaming data.", "histories": [["v1", "Mon, 12 Oct 2015 15:30:34 GMT  (2335kb)", "http://arxiv.org/abs/1510.03336v1", "14th International Conference on Machine Learning and Applications (IEEE ICMLA), 2015"], ["v2", "Tue, 13 Oct 2015 23:09:58 GMT  (2328kb)", "http://arxiv.org/abs/1510.03336v2", "14th International Conference on Machine Learning and Applications (IEEE ICMLA), 2015. Minor typos fixed in v2"], ["v3", "Mon, 16 Nov 2015 20:52:44 GMT  (997kb)", "http://arxiv.org/abs/1510.03336v3", "14th International Conference on Machine Learning and Applications (IEEE ICMLA), 2015. Typo in equation fixed in v3"], ["v4", "Tue, 17 Nov 2015 17:17:06 GMT  (2313kb)", "http://arxiv.org/abs/1510.03336v4", "14th International Conference on Machine Learning and Applications (IEEE ICMLA), 2015. Fixed typo in equation and formatting"]], "COMMENTS": "14th International Conference on Machine Learning and Applications (IEEE ICMLA), 2015", "reviews": [], "SUBJECTS": "cs.AI cs.LG", "authors": ["alexander lavin", "subutai ahmad"], "accepted": false, "id": "1510.03336"}
