{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "21-Oct-2015", "title": "Time-Sensitive Bayesian Information Aggregation for Crowdsourcing Systems", "abstract": "Crowdsourcing systems commonly face the problem of aggregating multiple judgments provided by possibly unreliable workers. In addition, several aspects of the design of efficient crowdsourcing processes, such as defining worker's bonuses, fair prices and time limits of the tasks, involve the knowledge of the actual duration of a specific task. In this work, we introduce a new time{sensitive Bayesian aggregation method that simultaneously estimates a task's duration and obtains reliable aggregations of crowdsourced judgments. Our method builds on the key insight that the time taken by a worker to perform a task is an important indicator of the likely quality of the produced judgment. To capture this, our model uses latent variables to represent the uncertainty about the workers' completion time, the tasks' duration and the workers' accuracy. To relate the quality of a judgment to the time a worker spends on a task, our model assumes that each task is completed within a latent time window within which all workers with a propensity to valid labelling are expected to submit their judgments. In contrast, workers with a lower propensity to valid labelling, such as spammers, bots or lazy labellers, are assumed to perform tasks considerably faster or slower than the time required by normal workers. Specifically, we use efficient message- passing Bayesian inference to learn approximate posterior probabilities of (i) the confusion matrix of each worker, (ii) the propensity to valid labelling of each worker, (iii) the unbiased duration of each task and (iv) the true label of each task. Using two real-world public datasets for entity linking tasks, we show that our method produces up to 15% more accurate classifications and up to 100% more informative estimates of a task's duration compared to state{of{the{art methods.", "histories": [["v1", "Wed, 21 Oct 2015 16:42:55 GMT  (855kb,D)", "https://arxiv.org/abs/1510.06335v1", null], ["v2", "Mon, 18 Apr 2016 21:09:58 GMT  (2418kb,D)", "http://arxiv.org/abs/1510.06335v2", null]], "reviews": [], "SUBJECTS": "cs.AI cs.LG", "authors": ["matteo venanzi", "john guiver", "pushmeet kohli", "nick jennings"], "accepted": false, "id": "1510.06335"}
