{"conference": "NIPS", "VERSION": "v1", "DATE_OF_SUBMISSION": "2-Nov-2015", "title": "BinaryConnect: Training Deep Neural Networks with binary weights during propagations", "abstract": "Deep Neural Networks (DNN) have achieved state-of-the-art results in a wide range of tasks, with the best results obtained with large training sets and large models. In the past, GPUs enabled these breakthroughs because of their greater computational speed. In the future, faster computation at both training and test time is likely to be crucial for further progress and for consumer applications on low-power devices. As a result, there is much interest in research and development of dedicated hardware for Deep Learning (DL). Binary weights, i.e., weights which are constrained to only two possible values (e.g. -1 or 1), would bring great benefits to specialized DL hardware by replacing many multiply-accumulate operations by simple accumulations, as multipliers are the most space and power-hungry components of the digital implementation of neural networks. We introduce BinaryConnect, a method which consists in training a DNN with binary weights during the forward and backward propagations, while retaining precision of the stored weights in which gradients are accumulated. Like other dropout schemes, we show that BinaryConnect acts as regularizer and we obtain near state-of-the-art results with BinaryConnect on the permutation-invariant MNIST, CIFAR-10 and SVHN.", "histories": [["v1", "Mon, 2 Nov 2015 02:50:05 GMT  (1190kb,D)", "http://arxiv.org/abs/1511.00363v1", "Accepted at NIPS 2015, 9 pages, 3 figures"], ["v2", "Thu, 12 Nov 2015 23:31:09 GMT  (1190kb,D)", "http://arxiv.org/abs/1511.00363v2", "Accepted at NIPS 2015, 9 pages, 3 figures"], ["v3", "Mon, 18 Apr 2016 13:11:45 GMT  (1190kb,D)", "http://arxiv.org/abs/1511.00363v3", "Accepted at NIPS 2015, 9 pages, 3 figures"]], "COMMENTS": "Accepted at NIPS 2015, 9 pages, 3 figures", "reviews": [], "SUBJECTS": "cs.LG cs.CV cs.NE", "authors": ["matthieu courbariaux", "yoshua bengio", "jean-pierre david"], "accepted": true, "id": "1511.00363"}
