{"conference": "ICML", "VERSION": "v1", "DATE_OF_SUBMISSION": "19-Nov-2015", "title": "Structured Prediction Energy Networks", "abstract": "We introduce structured prediction energy networks (SPENs), a flexible framework for structured prediction. A deep architecture is used to define an energy function of candidate labels, and then predictions are produced by using back-propagation to iteratively optimize the energy with respect to the labels. This deep architecture captures dependencies between labels that would lead to intractable graphical models, and performs structure learning by automatically learning discriminative features of the structured output. One natural application of our technique is multi-label classification, which traditionally has required strict prior assumptions about the interactions between labels to ensure tractable learning and prediction problems. We are able to apply SPENs to multi-label problems with substantially larger label sets than previous applications of structured prediction, while modeling high-order interactions using minimal structural assumptions. Overall, deep learning provides remarkable tools for learning features of the inputs to a prediction problem, and this work extends these techniques to learning features of the outputs. Our experiments provide impressive performance on a variety of benchmark multi-label classification tasks, demonstrate that our technique can be used to provide interpretable structure learning, and illuminate fundamental trade-offs between feed-forward and iterative structured prediction techniques.", "histories": [["v1", "Thu, 19 Nov 2015 20:39:59 GMT  (65kb,D)", "http://arxiv.org/abs/1511.06350v1", "Under review as a conference paper at ICLR 2016"], ["v2", "Thu, 7 Jan 2016 16:28:36 GMT  (87kb,D)", "http://arxiv.org/abs/1511.06350v2", "Updated version of ICLR 2016 submission"], ["v3", "Thu, 23 Jun 2016 20:21:11 GMT  (201kb,D)", "http://arxiv.org/abs/1511.06350v3", "ICML 2016"]], "COMMENTS": "Under review as a conference paper at ICLR 2016", "reviews": [], "SUBJECTS": "cs.LG stat.ML", "authors": ["david belanger", "andrew mccallum"], "accepted": true, "id": "1511.06350"}
