{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "14-Jan-2016", "title": "Dynamic Privacy For Distributed Machine Learning Over Network", "abstract": "Privacy-preserving distributed machine learning becomes increasingly important due to the rapid growth of amount of data and the importance of distributed learning. This paper develops algorithms to provide privacy-preserving learning for classification problem using the regularized empirical risk minimization (ERM) objective function in a distributed fashion. We use the definition of differential privacy, developed by Dwork et al. privacy to capture the notion of privacy of our algorithm. We provide two methods. We first propose the dual variable perturbation} which perturbs the dual variable before next intermediate minimization of augmented Lagrange function over the classifier in every ADMM iteration. In the second method, we apply the output perturbation to the primal variable before releasing it to neighboring nodes. We call the second method primal variable perturbation. Under certain conditions on the convexity and differentiability of the loss function and regularizer, our algorithms is proved to provide differential privacy through the entire learning process. We also provide theoretical results for the accuracy of the algorithm, and prove that both algorithms converges in distribution. The theoretical results show that the dual variable perturbation outperforms the primal case. The tradeoff between privacy and accuracy is examined in the numerical experiment. Our experiment shows that both algorithms performs similar in managing the privacy-accuracy tradeoff, and primal variable perturbaiton is slightly better than the dual case.", "histories": [["v1", "Thu, 14 Jan 2016 02:20:46 GMT  (636kb,D)", "http://arxiv.org/abs/1601.03466v1", "33 pages, 8 figures"], ["v2", "Mon, 15 Feb 2016 05:20:29 GMT  (3223kb,D)", "http://arxiv.org/abs/1601.03466v2", "22 pages, 8 figures Corrected typos. Revised argument in section 4, results unchanged"], ["v3", "Wed, 9 Mar 2016 21:51:12 GMT  (3297kb,D)", "http://arxiv.org/abs/1601.03466v3", "15 pages, 5 figures Corrected typos. Revised argument in section 3, 4, and Appendix, results unchanged"]], "COMMENTS": "33 pages, 8 figures", "reviews": [], "SUBJECTS": "cs.LG", "authors": ["tao zhang", "quanyan zhu"], "accepted": false, "id": "1601.03466"}
