{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "18-Feb-2016", "title": "Adaptive Least Mean Squares Estimation of Graph Signals", "abstract": "In many applications spanning from sensor to social networks, transportation systems, gene regulatory networks or big data, the signals of interest are defined over the vertices of a graph. The aim of this paper is to propose a least mean square (LMS) strategy for adaptive estimation of signals defined over graphs. Assuming the graph signal to be band-limited, over a known bandwidth, the method enables reconstruction, with guaranteed performance in terms of mean-square error, and tracking from a limited number of observations over a subset of vertices. A detailed mean square analysis provides the performance of the proposed method, and leads to several insights for designing useful sampling strategies for graph signals. Numerical results validate our theoretical findings, and illustrate the performance of the proposed method. Furthermore, to cope with the case where the bandwidth is not known beforehand, we propose a method that performs a sparse online estimation of the signal support in the (graph) frequency domain, which enables online adaptation of the graph sampling strategy. Finally, we apply the proposed method to build the power spatial density cartography of a given operational region in a cognitive network environment.", "histories": [["v1", "Thu, 18 Feb 2016 07:34:04 GMT  (290kb)", "http://arxiv.org/abs/1602.05703v1", "Submitted to IEEE Transactions on Signal and Information Processing over Networks. arXiv admin note: text overlap witharXiv:1211.6950by other authors without attribution"], ["v2", "Fri, 19 Feb 2016 10:15:47 GMT  (171kb)", "http://arxiv.org/abs/1602.05703v2", "Submitted to IEEE Transactions on Signal and Information Processing over Networks"], ["v3", "Mon, 11 Jul 2016 15:40:59 GMT  (120kb)", "http://arxiv.org/abs/1602.05703v3", "Submitted to IEEE Transactions on Signal and Information Processing over Networks"]], "COMMENTS": "Submitted to IEEE Transactions on Signal and Information Processing over Networks. arXiv admin note: text overlap witharXiv:1211.6950by other authors without attribution", "reviews": [], "SUBJECTS": "cs.LG cs.SY", "authors": ["paolo di lorenzo", "sergio barbarossa", "paolo banelli", "stefania sardellitti"], "accepted": false, "id": "1602.05703"}
