{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "24-Mar-2016", "title": "Probabilistic Reasoning via Deep Learning: Neural Association Models", "abstract": "In this paper, we propose a new deep learning approach, called neural association model (NAM), for probabilistic reasoning in artificial intelligence. We propose to use neural networks to model association between any two events in a domain. Neural networks take one event as input and compute a conditional probability of the other event to model how likely these two events are associated. The actual meaning of the conditional probabilities varies between applications and depends on how the models are trained. In this work, as two case studies, we have investigated two NAM structures, namely deep neural networks (DNNs) and relation modulated neural nets (RMNNs), on several probabilistic reasoning tasks in AI, including recognizing textual entailment, triple classification in multirelational knowledge bases and common-sense reasoning. Experimental results on several popular data sets derived from WordNet, FreeBase and ConceptNet have all demonstrated that both DNNs and RMNNs perform equally well and they can significantly outperform the conventional methods available for these reasoning tasks. Moreover, comparing with DNNs, RMNNs are superior in knowledge transfer, where a pre-trained model can be quickly extended to an unseen relation after observing only a few training samples.", "histories": [["v1", "Thu, 24 Mar 2016 18:54:18 GMT  (314kb,D)", "https://arxiv.org/abs/1603.07704v1", "Probabilistic reasoning, Deep learning"], ["v2", "Wed, 3 Aug 2016 14:31:17 GMT  (1461kb,D)", "http://arxiv.org/abs/1603.07704v2", "Probabilistic reasoning, Winograd Schema Challenge, Deep learning, Neural Networks, Distributed Representation"]], "COMMENTS": "Probabilistic reasoning, Deep learning", "reviews": [], "SUBJECTS": "cs.AI cs.LG cs.NE", "authors": ["quan liu", "hui jiang", "rew evdokimov", "zhen-hua ling", "xiaodan zhu", "si wei", "yu hu"], "accepted": false, "id": "1603.07704"}
