{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "12-Apr-2016", "title": "An incremental linear-time learning algorithm for the Optimum-Path Forest classifier", "abstract": "We present a classification method with linear-time incremental capabilities based on the Optimum-Path Forest (OPF) classifier. The OPF considers instances as nodes of a fully-connected training graph, where the edges' weights are the distances between two nodes' feature vectors. Upon this graph, a minimum spanning tree is built, and every edge connecting instances of different classes is removed, with those nodes becoming prototypes or roots of a tree. A new instance is classified by discovering which tree it would conquer. In this paper we describe a new training algorithm with incremental capabilities while keeping the properties of the OPF. New instances can be inserted in the model into one of the existing trees; substitute the prototype of a tree; or split a tree. This incremental method was tested for accuracy and running time against both full retraining using the original OPF and an adaptation of the Differential Image Foresting Transform. The method updates the training model in linear-time, while keeping similar accuracies when compared with the original model, which runs in quadratic-time.", "histories": [["v1", "Tue, 12 Apr 2016 11:31:23 GMT  (242kb,D)", "https://arxiv.org/abs/1604.03346v1", null], ["v2", "Wed, 22 Jun 2016 15:47:21 GMT  (483kb,D)", "http://arxiv.org/abs/1604.03346v2", null], ["v3", "Fri, 29 Jul 2016 15:54:04 GMT  (243kb,D)", "http://arxiv.org/abs/1604.03346v3", "submitted to Journal"], ["v4", "Fri, 12 Aug 2016 13:14:10 GMT  (243kb,D)", "http://arxiv.org/abs/1604.03346v4", "submitted to Journal"], ["v5", "Wed, 23 Nov 2016 12:08:23 GMT  (253kb,D)", "http://arxiv.org/abs/1604.03346v5", "submitted to IPL Journal for consideration in Nov/2016"]], "reviews": [], "SUBJECTS": "cs.LG cs.CV", "authors": ["moacir ponti", "mateus riva"], "accepted": false, "id": "1604.03346"}
