{"conference": "ACL", "VERSION": "v1", "DATE_OF_SUBMISSION": "4-Apr-2016", "title": "Achieving Open Vocabulary Neural Machine Translation with Hybrid Word-Character Models", "abstract": "Nearly all previous work in neural machine translation (NMT) has used quite restricted vocabularies, perhaps with a subsequent method to patch in unknown words. This paper presents a novel word-character solution to achieving open vocabulary NMT. We build hybrid systems that translate mostly at the word level and consult the character components for rare words. Our character-level recurrent neural networks compute source word representations and recover unknown target words when needed. The two-fold advantage of such a hybrid approach is that it is much faster and easier to train than character-based ones; at the same time, it never produces unknown words as in the case of word-based models. On the WMT'15 English to Czech translation task, this hybrid approach offers a boost of up to +7.9 BLEU points over models that do not handle unknown words. Our best hybrid system has established a new state-of-the-art result with 19.9 BLEU score. We demonstrate that our character models can successfully learn to not only generate well-formed words for Czech, a highly-inflected language with a very complex vocabulary, but also build correct representations for English source words.", "histories": [["v1", "Mon, 4 Apr 2016 09:30:54 GMT  (53kb)", "http://arxiv.org/abs/1604.00788v1", "11pages, 3 figures. ACL 2016 submission + source embedding analysis and better results"], ["v2", "Thu, 23 Jun 2016 00:50:19 GMT  (60kb)", "http://arxiv.org/abs/1604.00788v2", "11pages, 4 figures. ACL 2016 camera-ready version. SOTA WMT'15 English-Czech 20.7 BLEU (+2.1-11.4 points)"]], "COMMENTS": "11pages, 3 figures. ACL 2016 submission + source embedding analysis and better results", "reviews": [], "SUBJECTS": "cs.CL cs.LG", "authors": ["minh-thang luong", "christopher d manning"], "accepted": true, "id": "1604.00788"}
