{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "23-Jun-2016", "title": "Is a Picture Worth Ten Thousand Words in a Review Dataset?", "abstract": "While textual reviews have become prominent in many recommendation-based systems, automated frameworks to provide relevant visual cues against text reviews where pictures are not available is a new form of task confronted by data mining and machine learning researchers. Suggestions of pictures that are relevant to the content of a review could significantly benefit the users by increasing the effectiveness of a review. We propose a deep learning-based framework to automatically: (1) tag the images available in a review dataset, (2) generate a caption for each image that does not have one, and (3) enhance each review by recommending relevant images that might not be uploaded by the corresponding reviewer. We evaluate the proposed framework using the Yelp Challenge Dataset. While a subset of the images in this particular dataset are correctly captioned, the majority of the pictures do not have any associated text. Moreover, there is no mapping between reviews and images. Each image has a corresponding business-tag where the picture was taken, though. The overall data setting and unavailability of crucial pieces required for a mapping make the problem of recommending images for reviews a major challenge. Qualitative and quantitative evaluations indicate that our proposed framework provides high quality enhancements through automatic captioning, tagging, and recommendation for mapping reviews and images.", "histories": [["v1", "Thu, 23 Jun 2016 22:04:08 GMT  (4716kb,D)", "http://arxiv.org/abs/1606.07496v1", "10 pages, 11 figures, \"for associated results, see http://this http URL\" \"submitted to DLRS 2016 workshop\""]], "COMMENTS": "10 pages, 11 figures, \"for associated results, see http://this http URL\" \"submitted to DLRS 2016 workshop\"", "reviews": [], "SUBJECTS": "cs.CV cs.CL cs.IR cs.LG cs.NE", "authors": ["roberto camacho barranco", "laura m rodriguez", "rebecca urbina", "m shahriar hossain the university of texas at el paso)"], "accepted": false, "id": "1606.07496"}
