{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "23-Jun-2016", "title": "Learning Dynamic Classes of Events using Stacked Multilayer Perceptron Networks", "abstract": "People often use a web search engine to find information about events of interest, for example, sport competitions, political elections, festivals and entertainment news. In this paper, we study a problem of detecting event-related queries, which is the first step before selecting a suitable time-aware retrieval model. In general, event-related information needs can be observed in query streams through various temporal patterns of user search behavior, e.g., spiky peaks for popular events, and periodicities for repetitive events. However, it is also common that users search for non-popular events, which may not exhibit temporal variations in query streams, e.g., past events recently occurred, historical events triggered by anniversaries or similar events, and future events anticipated to happen. To address the challenge of detecting dynamic classes of events, we propose a novel deep learning model to classify a given query into a predetermined set of multiple event types. Our proposed model, a Stacked Multilayer Perceptron (S-MLP) network, consists of multilayer perceptron used as a basic learning unit. We assemble stacked units to further learn complex relationships between neutrons in successive layers. To evaluate our proposed model, we conduct experiments using real-world queries and a set of manually created ground truth. Preliminary results have shown that our proposed deep learning model outperforms the state-of-the-art classification models significantly.", "histories": [["v1", "Thu, 23 Jun 2016 08:16:38 GMT  (1258kb)", "https://arxiv.org/abs/1606.07219v1", "Neu-IR '16 SIGIR Workshop on Neural Information Retrieval, 5 pages, 4 figures"], ["v2", "Fri, 1 Jul 2016 21:53:43 GMT  (3518kb)", "http://arxiv.org/abs/1606.07219v2", "Neu-IR '16 SIGIR Workshop on Neural Information Retrieval, 6 pages, 4 figures"]], "COMMENTS": "Neu-IR '16 SIGIR Workshop on Neural Information Retrieval, 5 pages, 4 figures", "reviews": [], "SUBJECTS": "cs.IR cs.LG", "authors": ["nattiya kanhabua", "huamin ren", "thomas b moeslund"], "accepted": false, "id": "1606.07219"}
