{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "20-Sep-2016", "title": "Recognizing Detailed Human Context In-the-Wild from Smartphones and Smartwatches", "abstract": "We demonstrate that a person's behavioral and environmental context can be automatically recognized by harnessing the sensors built into smartphones and smartwatches. We propose a generic system that can simultaneously recognize many contextual attributes from diverse behavioral domains. By fusing complementary information from different types of sensors our system successfully recognizes fine details of work and leisure activities, body movement, transportation, and more. Health monitoring, clinical intervention, aging care, personal assistance and many more applications will benefit from automatic, frequent and detailed context recognition.", "histories": [["v1", "Tue, 20 Sep 2016 20:56:07 GMT  (2312kb,D)", "http://arxiv.org/abs/1609.06354v1", "This paper was submitted to IEEE Pervasive Computing magazine on September 20th, 2016"], ["v2", "Thu, 29 Dec 2016 22:47:22 GMT  (2314kb,D)", "http://arxiv.org/abs/1609.06354v2", "This paper was originally submitted to IEEE Pervasive Computing magazine on September 20th, 2016. This version is the major revision (following first review). This revision was submitted to IEEE Pervasive Computing on December 28th, 2016"], ["v3", "Wed, 17 May 2017 21:44:18 GMT  (640kb,D)", "http://arxiv.org/abs/1609.06354v3", "This paper was originally submitted to IEEE Pervasive Computing magazine on September 20th, 2016. After a major revision and a minor revision, the paper was accepted in April 2017. It is currently under the editing process"], ["v4", "Sat, 30 Sep 2017 15:25:23 GMT  (640kb,D)", "http://arxiv.org/abs/1609.06354v4", "This paper was accepted and is to appear in IEEE Pervasive Computing, vol. 16, no. 4, October-December 2017, pp. 62-74"]], "COMMENTS": "This paper was submitted to IEEE Pervasive Computing magazine on September 20th, 2016", "reviews": [], "SUBJECTS": "cs.AI cs.CY cs.HC cs.LG", "authors": ["yonatan vaizman", "katherine ellis", "gert lanckriet"], "accepted": false, "id": "1609.06354"}
