{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "12-Sep-2016", "title": "Sensor-based Gait Parameter Extraction with Deep Convolutional Neural Networks", "abstract": "Measurement of stride-related, biomechanical parameters is the common rationale for objective gait impairment scoring. State-of-the-art double integration approaches to extract these parameters from inertial sensor data are, however, limited in their clinical applicability due to the underlying assumptions. To overcome this, we present a method to translate the abstract information provided by wearable sensors to context-related expert features based on deep convolutional neural networks. Regarding mobile gait analysis, this enables integration-free and data-driven extraction of a set of 8 spatio-temporal stride parameters. To this end, two modelling approaches are compared: A combined network estimating all parameters of interest and an ensemble approach that spawns less complex networks for each parameter individually. The ensemble approach is outperforming the combined modelling in the current application. On a clinically relevant and publicly available benchmark dataset, we estimate stride length, width and medio-lateral change in foot angle up to ${-0.15\\pm6.09}$ cm, ${-0.09\\pm4.22}$ cm and ${0.13 \\pm 3.78^\\circ}$ respectively. Stride, swing and stance time as well as heel and toe contact times are estimated up to ${\\pm 0.07}$, ${\\pm0.05}$, ${\\pm 0.07}$, ${\\pm0.07}$ and ${\\pm0.12}$ s respectively. This is comparable to and in parts outperforming or defining state-of-the-art. Our results further indicate that the proposed change in methodology could substitute assumption-driven double-integration methods and enable mobile assessment of spatio-temporal stride parameters in clinically critical situations as e.g. in the case of spastic gait impairments.", "histories": [["v1", "Mon, 12 Sep 2016 09:33:57 GMT  (2035kb,D)", "https://arxiv.org/abs/1609.03323v1", null], ["v2", "Tue, 11 Oct 2016 10:56:32 GMT  (2035kb,D)", "http://arxiv.org/abs/1609.03323v2", null], ["v3", "Fri, 13 Jan 2017 12:30:39 GMT  (2076kb,D)", "http://arxiv.org/abs/1609.03323v3", "in IEEE Journal of Biomedical and Health Informatics (2016)"]], "reviews": [], "SUBJECTS": "cs.LG", "authors": ["julius hannink", "thomas kautz", "cristian f pasluosta", "karl-g\\\"unter ga{\\ss}mann", "jochen klucken", "bjoern m eskofier"], "accepted": false, "id": "1609.03323"}
