{"conference": "ICML", "VERSION": "v1", "DATE_OF_SUBMISSION": "15-Oct-2016", "title": "Towards K-means-friendly Spaces: Simultaneous Deep Learning and Clustering", "abstract": "Most learning approaches treat dimensionality reduction (DR) and clustering separately (i.e., sequentially), but recent research has shown that optimizing the two tasks jointly can substantially improve the performance of both. The premise behind the latter genre is that the data samples are obtained via linear transformation of latent representations that are easy to cluster; but in practice, the transformation from the latent space to the data can be more complicated. In this work, we assume that this transformation is an unknown and possibly nonlinear function. To recover the `clustering-friendly' latent representations and to better cluster the data, we propose a joint DR and K-means clustering approach in which DR is accomplished via learning a deep neural network (DNN). The motivation is to keep the advantages of jointly optimizing the two tasks, while exploiting the deep neural network's ability to approximate any nonlinear function. This way, the proposed approach can work well for a broad class of generative models. Towards this end, we carefully design the DNN structure and the associated joint optimization criterion, and propose an effective and scalable algorithm to handle the formulated optimization problem. Experiments using five different real datasets are employed to showcase the effectiveness of the proposed approach.", "histories": [["v1", "Sat, 15 Oct 2016 22:51:06 GMT  (5826kb,D)", "http://arxiv.org/abs/1610.04794v1", "Main paper: 9 pages; Supplementary material: 3 pages"], ["v2", "Tue, 13 Jun 2017 22:40:26 GMT  (646kb,D)", "http://arxiv.org/abs/1610.04794v2", "Final ICML2017 version. Main paper: 10 pages; Supplementary material: 4 pages"]], "COMMENTS": "Main paper: 9 pages; Supplementary material: 3 pages", "reviews": [], "SUBJECTS": "cs.LG", "authors": ["bo yang", "xiao fu", "nicholas d sidiropoulos", "mingyi hong"], "accepted": true, "id": "1610.04794"}
