{"conference": "iclr", "VERSION": "v1", "DATE_OF_SUBMISSION": "7-Nov-2016", "title": "Q-Prop: Sample-Efficient Policy Gradient with An Off-Policy Critic", "abstract": "Model-free deep reinforcement learning (RL) methods have been successful in a wide variety of simulated domains. However, a major obstacle facing deep RL in the real world is the high sample complexity of such methods. Unbiased batch policy-gradient methods offer stable learning, but at the cost of high variance, which often requires large batches, while TD-style methods, such as off-policy actor-critic and Q-learning, are more sample-efficient but biased, and often require costly hyperparameter sweeps to stabilize. In this work, we aim to develop methods that combine the stability of unbiased policy gradients with the efficiency of off-policy RL. We present Q-Prop, a policy gradient method that uses a Taylor expansion of the off-policy critic as a control variate. Q-Prop is both sample efficient and stable, and effectively combines the benefits of on-policy and off-policy methods. We analyze the connection between Q-Prop and existing model-free algorithms, and use control variate theory to derive two variants of Q-Prop with conservative and aggressive adaptation. We show that conservative Q-Prop provides substantial gains in sample efficiency over trust region policy optimization (TRPO) with generalized advantage estimation (GAE), and improves stability over deep deterministic policy gradient (DDPG), the state-of-the-art on-policy and off-policy methods, on OpenAI Gym's MuJoCo continuous control environments.", "histories": [["v1", "Mon, 7 Nov 2016 20:09:16 GMT  (778kb,D)", "http://arxiv.org/abs/1611.02247v1", null], ["v2", "Thu, 17 Nov 2016 21:57:19 GMT  (781kb,D)", "http://arxiv.org/abs/1611.02247v2", null], ["v3", "Mon, 27 Feb 2017 21:48:25 GMT  (788kb,D)", "http://arxiv.org/abs/1611.02247v3", "Conference Paper at the International Conference on Learning Representations (ICLR) 2017"]], "reviews": [], "SUBJECTS": "cs.LG", "authors": ["shixiang gu", "timothy lillicrap", "zoubin ghahramani", "richard e turner", "sergey levine"], "accepted": true, "id": "1611.02247"}
