{"conference": "AAAI", "VERSION": "v1", "DATE_OF_SUBMISSION": "18-Nov-2016", "title": "A Generalized Stochastic Variational Bayesian Hyperparameter Learning Framework for Sparse Spectrum Gaussian Process Regression", "abstract": "While much research effort has been dedicated to scaling up sparse Gaussian process (GP) models based on inducing variables for big data, little attention is afforded to the other less explored class of low-rank GP approximations that exploit the sparse spectral representation of a GP kernel. This paper presents such an effort to advance the state of the art of sparse spectrum GP models to achieve competitive predictive performance for massive datasets. Our generalized framework of stochastic variational Bayesian sparse spectrum GP (sVBSSGP) models addresses their shortcomings by adopting a Bayesian treatment of the spectral frequencies to avoid overfitting, modeling these frequencies jointly in its variational distribution to enable their interaction a posteriori, and exploiting local data for boosting the predictive performance. However, such structural improvements result in a variational lower bound that is intractable to be optimized. To resolve this, we exploit a variational parameterization trick to make it amenable to stochastic optimization. Interestingly, the resulting stochastic gradient has a linearly decomposable structure that can be exploited to refine our stochastic optimization method to incur constant time per iteration while preserving its property of being an unbiased estimator of the exact gradient of the variational lower bound. Empirical evaluation on real-world datasets shows that sVBSSGP outperforms state-of-the-art stochastic implementations of sparse GP models.", "histories": [["v1", "Fri, 18 Nov 2016 14:00:48 GMT  (111kb,D)", "http://arxiv.org/abs/1611.06080v1", "31st AAAI Conference on Artificial Intelligence (AAAI 2017), Extended version with proofs, 11 pages"]], "COMMENTS": "31st AAAI Conference on Artificial Intelligence (AAAI 2017), Extended version with proofs, 11 pages", "reviews": [], "SUBJECTS": "stat.ML cs.LG", "authors": ["quang minh hoang", "trong nghia hoang", "kian hsiang low"], "accepted": true, "id": "1611.06080"}
