{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "10-Nov-2016", "title": "Using Neural Networks to Compute Approximate and Guaranteed Feasible Hamilton-Jacobi-Bellman PDE Solutions", "abstract": "Hamilton-Jacobi (HJ) reachability is a powerful tool that provides performance and safety guarantees for dynamical systems. Unfortunately, using the state-of-the-art dynamic programming-based approaches, HJ reachability is intractable for systems with more than five dimensions because its computational complexity scales exponentially with system dimension. To sidestep the curse of dimensionality, we propose an algorithm that leverages a neural network to approximate the minimum time-to-reach function to synthesize controls. We show that our neural network generates near optimal controls which are guaranteed to successfully drive the system to a target state. Our framework is not dependent on state space discretization, leading to a significant reduction in computation time and space complexity in comparison with dynamic programming-based approaches. Using this grid-free approach also enables us to plan over longer time horizons with relatively little additional computation overhead. Unlike many previous neural network reachability formulations, our approximation is conservative and hence any trajectories we generate will be strictly feasible. For demonstration, we specialize our new general framework to the Dubins car model and discuss how the general framework can be applied to other models with higher-dimensional state spaces.", "histories": [["v1", "Thu, 10 Nov 2016 01:48:39 GMT  (3022kb,D)", "http://arxiv.org/abs/1611.03158v1", "Submitted to HSCC 2017"], ["v2", "Mon, 27 Mar 2017 05:21:42 GMT  (5055kb,D)", "http://arxiv.org/abs/1611.03158v2", "Submitted to IEEE Conference on Decision and Control, 2017"]], "COMMENTS": "Submitted to HSCC 2017", "reviews": [], "SUBJECTS": "cs.LG", "authors": ["frank jiang", "glen chou", "mo chen", "claire j tomlin"], "accepted": false, "id": "1611.03158"}
