{"conference": "EMNLP", "VERSION": "v1", "DATE_OF_SUBMISSION": "1-Dec-2016", "title": "Piecewise Latent Variables for Neural Variational Text Processing", "abstract": "Recent advances in neural variational inference have facilitated efficient training of powerful directed graphical models with continuous latent variables, such as variational autoencoders. However, these models usually assume simple, uni-modal priors - such as the multivariate Gaussian distribution - yet many real-world data distributions are highly complex and multi-modal. Examples of complex and multi-modal distributions range from topics in newswire text to conversational dialogue responses. When such latent variable models are applied to these domains, the restriction of the simple, uni-modal prior hinders the overall expressivity of the learned model as it cannot possibly capture more complex aspects of the data distribution. To overcome this critical restriction, we propose a flexible, simple prior distribution which can be learned efficiently and potentially capture an exponential number of modes of a target distribution. We develop the multi-modal variational encoder-decoder framework and investigate the effectiveness of the proposed prior in several natural language processing modeling tasks, including document modeling and dialogue modeling.", "histories": [["v1", "Thu, 1 Dec 2016 18:49:23 GMT  (192kb,D)", "http://arxiv.org/abs/1612.00377v1", "18 pages, 2 figures, 4 tables; under review at ICLR 2017"], ["v2", "Fri, 9 Dec 2016 03:18:54 GMT  (192kb,D)", "http://arxiv.org/abs/1612.00377v2", "18 pages, 2 figures, 4 tables; under review at ICLR 2017"], ["v3", "Thu, 13 Jul 2017 19:25:58 GMT  (1016kb,D)", "http://arxiv.org/abs/1612.00377v3", "19 pages, 2 figures, 8 tables; EMNLP 2017"], ["v4", "Sat, 23 Sep 2017 13:33:55 GMT  (1029kb,D)", "http://arxiv.org/abs/1612.00377v4", "19 pages, 2 figures, 8 tables; EMNLP 2017"]], "COMMENTS": "18 pages, 2 figures, 4 tables; under review at ICLR 2017", "reviews": [], "SUBJECTS": "cs.CL cs.AI cs.LG cs.NE", "authors": ["iulian vlad serban", "alexander g ororbia ii", "joelle pineau", "aaron c courville"], "accepted": true, "id": "1612.00377"}
