{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "22-Feb-2017", "title": "Regularizing Face Verification Nets For Pain Intensity Regression", "abstract": "Limited annotated data is available for the research of estimating facial expression intensities, which makes the training of deep networks for automated expression assessment very challenging. Fortunately, fine-tuning from a data-extensive pre-trained domain such as face verification can alleviate the problem. In this paper, we propose a transferred network that fine-tunes a state-of-the-art face verification network using expression-intensity labeled data with a regression layer. In this way, the expression regression task can benefit from the rich feature representations trained on a huge amount of data for face verification. The proposed transferred deep regressor is applied in estimating the intensity of facial action units (2017 EmotionNet Challenge) and in particular pain intensity estimation (UNBS-McMaster Shoulder-Pain dataset). It wins the second place in the challenge and achieves the state-of-the-art performance on Shoulder-Pain dataset. Particularly for Shoulder-Pain with the imbalance issue of different pain levels, a new weighted evaluation metric is proposed.", "histories": [["v1", "Wed, 22 Feb 2017 18:15:42 GMT  (1234kb,D)", "http://arxiv.org/abs/1702.06925v1", "5 pages, 3 figure; submitted to IEEE ICIP 2017 which does not perform blind reviews"], ["v2", "Tue, 9 May 2017 17:58:58 GMT  (1235kb,D)", "http://arxiv.org/abs/1702.06925v2", "5 pages, 3 figure; To appear in IEEE ICIP 2017"], ["v3", "Thu, 1 Jun 2017 17:49:56 GMT  (1228kb,D)", "http://arxiv.org/abs/1702.06925v3", "5 pages, 3 figure; Camera-ready version to appear at IEEE ICIP 2017"]], "COMMENTS": "5 pages, 3 figure; submitted to IEEE ICIP 2017 which does not perform blind reviews", "reviews": [], "SUBJECTS": "cs.CV cs.AI cs.LG cs.MM", "authors": ["feng wang", "xiang xiang", "chang liu", "trac d tran", "austin reiter", "gregory d hager", "harry quon", "jian cheng", "alan l yuille"], "accepted": false, "id": "1702.06925"}
