{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "7-Mar-2017", "title": "PathTrack: Fast Trajectory Annotation with Path Supervision", "abstract": "Progress in Multiple Object Tracking (MOT) has been limited by the size of the available datasets. We present an efficient framework to annotate trajectories and use it to produce a MOT dataset of unprecedented size. A novel path supervision paradigm lets the annotator loosely track the object with a cursor while watching the video. This results in a path annotation for each object in the sequence. These path annotations, together with object detections, are fed into a two-step optimization to produce full bounding-box trajectories. Our experiments on existing datasets prove that our framework produces more accurate annotations than the state of the art and this in a fraction of the time. We further validate our approach by generating the PathTrack dataset, with more than 15,000 person trajectories in 720 sequences. We believe tracking approaches can benefit from a larger dataset like this one, just as was the case in object recognition. We show its potential by using it to retrain an off-the-shelf person matching network, originally trained on the MOT15 dataset, almost halving the misclassification rate. Additionally, training on our data consistently improves tracking results, both on our dataset and on MOT15. In the latter, where we improve the top-performing tracker (NOMT) dropping the number of ID Switches by 18% and fragments by 5%.", "histories": [["v1", "Tue, 7 Mar 2017 15:36:39 GMT  (5042kb,D)", "https://arxiv.org/abs/1703.02437v1", "10 pages, 7 figures, ICCV submission"], ["v2", "Wed, 22 Mar 2017 07:08:34 GMT  (4472kb,D)", "http://arxiv.org/abs/1703.02437v2", "10 pages, ICCV submission"]], "COMMENTS": "10 pages, 7 figures, ICCV submission", "reviews": [], "SUBJECTS": "cs.CV cs.LG cs.MM", "authors": ["santiago manen", "michael gygli", "dengxin dai", "luc van gool"], "accepted": false, "id": "1703.02437"}
