{"conference": "ICML", "VERSION": "v1", "DATE_OF_SUBMISSION": "6-Mar-2017", "title": "Measuring Sample Quality with Kernels", "abstract": "Approximate Markov chain Monte Carlo (MCMC) offers the promise of more rapid sampling at the cost of more biased inference. Since standard MCMC diagnostics fail to detect these biases, researchers have developed computable Stein discrepancy measures that provably determine the convergence of a sample to its target distribution. This approach was recently combined with the theory of reproducing kernels to define a closed-form kernel Stein discrepancy (KSD) computable by summing kernel evaluations across pairs of sample points. We develop a theory of weak convergence for KSDs based on Stein's method, demonstrate that commonly used KSDs fail to detect non-convergence even for Gaussian targets, and show that kernels with slowly decaying tails provably determine convergence for a large class of target distributions. The resulting convergence-determining KSDs are suitable for comparing biased, exact, and deterministic sample sequences and simpler to compute and parallelize than alternative Stein discrepancies. We use our tools to compare biased samplers, select sampler hyperparameters, and improve upon existing KSD approaches to one-sample hypothesis testing and sample quality improvement.", "histories": [["v1", "Mon, 6 Mar 2017 03:22:39 GMT  (1796kb,D)", "https://arxiv.org/abs/1703.01717v1", null], ["v2", "Mon, 12 Jun 2017 06:04:43 GMT  (1834kb,D)", "http://arxiv.org/abs/1703.01717v2", null], ["v3", "Fri, 7 Jul 2017 20:41:24 GMT  (1834kb,D)", "http://arxiv.org/abs/1703.01717v3", null], ["v4", "Tue, 11 Jul 2017 23:30:56 GMT  (1835kb,D)", "http://arxiv.org/abs/1703.01717v4", null], ["v5", "Fri, 21 Jul 2017 04:38:46 GMT  (1835kb,D)", "http://arxiv.org/abs/1703.01717v5", null], ["v6", "Thu, 3 Aug 2017 21:23:32 GMT  (1835kb,D)", "http://arxiv.org/abs/1703.01717v6", null], ["v7", "Sat, 19 Aug 2017 01:35:40 GMT  (1835kb,D)", "http://arxiv.org/abs/1703.01717v7", null], ["v8", "Wed, 13 Sep 2017 20:51:38 GMT  (1835kb,D)", "http://arxiv.org/abs/1703.01717v8", null]], "reviews": [], "SUBJECTS": "stat.ML cs.LG", "authors": ["jackson gorham", "lester w mackey"], "accepted": true, "id": "1703.01717"}
