{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "6-Mar-2017", "title": "Metric Learning for Generalizing Spatial Relations to New Objects", "abstract": "Human-centered environments are rich with a wide variety of spatial relations between everyday objects. For autonomous robots to operate effectively in such environments, they should be able to reason about these relations and generalize them to objects with different shapes and sizes. For example, having learned to place a toy inside a basket, a robot should be able to generalize this concept using a spoon and a cup. This requires a robot to have the flexibility to learn arbitrary relations in a lifelong manner, making it challenging for an expert to pre-program it with sufficient knowledge to do so beforehand. In this paper, we address the problem of learning spatial relations by introducing a novel method from the perspective of distance metric learning. Our approach enables a robot to reason about the similarity between pairwise spatial relations, thereby enabling it to use its previous knowledge when presented with a new relation to imitate. We show how this makes it possible to learn arbitrary spatial relations from non-expert users using a small number of examples and in an interactive manner. Our extensive evaluation with real-world data demonstrates the effectiveness of our method in reasoning about a continuous spectrum of spatial relations and generalizing them to new objects.", "histories": [["v1", "Mon, 6 Mar 2017 16:13:17 GMT  (5474kb,D)", "https://arxiv.org/abs/1703.01946v1", "Submission to the IEEE/RSJ International Conference on Intelligent Robots and Systems"], ["v2", "Tue, 7 Mar 2017 12:47:56 GMT  (5474kb,D)", "http://arxiv.org/abs/1703.01946v2", "Under review at the 2017 IEEE/RSJ International Conference on Intelligent Robots and Systems. The corresponding demo video can be found atthis http URL"], ["v3", "Mon, 24 Jul 2017 12:24:31 GMT  (5739kb,D)", "http://arxiv.org/abs/1703.01946v3", "Accepted at the 2017 IEEE/RSJ International Conference on Intelligent Robots and Systems. The new Freiburg Spatial Relations Dataset and a demo video of our approach running on the PR-2 robot are available at our project website:this http URL"]], "COMMENTS": "Submission to the IEEE/RSJ International Conference on Intelligent Robots and Systems", "reviews": [], "SUBJECTS": "cs.RO cs.AI cs.LG", "authors": ["oier mees", "nichola abdo", "mladen mazuran", "wolfram burgard"], "accepted": false, "id": "1703.01946"}
