{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "21-Mar-2017", "title": "How far are we from solving the 2D & 3D Face Alignment problem? (and a dataset of 230,000 3D facial landmarks)", "abstract": "This paper investigates how far a very deep neural network is from attaining close to saturating performance on existing 2D and 3D face alignment datasets. To this end, we make the following three contributions: (a) we construct, for the first time, a very strong baseline by combining a state-of-the-art architecture for landmark localization with a state-of-the-art residual block, train it on a very large yet synthetically expanded 2D facial landmark dataset and finally evaluate it on all other 2D facial landmark datasets. (b) We create a guided by 2D landmarks network which converts 2D landmark annotations to 3D and unifies all existing datasets, leading to the creation of LS3D-W, the largest and most challenging 3D facial landmark dataset to date (~230,000 images). (c) Following that, we train a neural network for 3D face alignment and evaluate it on the newly introduced LS3D-W. (d) We further look into the effect of all \"traditional\" factors affecting face alignment performance like large pose, initialization and resolution, and introduce a \"new\" one, namely the size of the network. (e) We show that both 2D and 3D face alignment networks achieve performance of remarkable accuracy which is probably close to saturating the datasets used. Demo code and pre-trained models can be downloaded from", "histories": [["v1", "Tue, 21 Mar 2017 17:37:36 GMT  (3753kb,D)", "https://arxiv.org/abs/1703.07332v1", null], ["v2", "Mon, 7 Aug 2017 15:03:19 GMT  (6693kb,D)", "http://arxiv.org/abs/1703.07332v2", "accepted to ICCV 2017"], ["v3", "Thu, 7 Sep 2017 16:21:37 GMT  (6695kb,D)", "http://arxiv.org/abs/1703.07332v3", "accepted to ICCV 2017"]], "reviews": [], "SUBJECTS": "cs.CV cs.LG", "authors": ["adrian bulat", "georgios tzimiropoulos"], "accepted": false, "id": "1703.07332"}
