{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "27-Apr-2017", "title": "DeepCCI: End-to-end Deep Learning for Chemical-Chemical Interaction Prediction", "abstract": "Chemical-chemical interaction (CCI) plays a key role in predicting candidate drugs, toxicity, therapeutic effects, and biological functions. CCI was created from text mining, experiments, similarities, and databases; to date, no learning-based CCI prediction method exist. In chemical analyses, computational approaches are required. The recent remarkable growth and outstanding performance of deep learning have attracted considerable esearch attention. However,even in state-of-the-art drug analyses, deep learning continues to be used only as a classifier. Nevertheless, its purpose includes not only simple classification, but also automated feature extraction. In this paper, we propose the first end-to-end learning method for CCI, named DeepCCI. Hidden features are derived from a simplified molecular input line entry system (SMILES), which is a string notation representing the chemical structure, instead of learning from crafted features. To discover hidden representations for the SMILES strings, we use convolutional neural networks (CNNs). To guarantee the commutative property for homogeneous interaction, we apply model sharing and hidden representation merging techniques. The performance of DeepCCI was compared with a plain deep classifier and conventional machine learning methods. The proposed DeepCCI showed the best performance in all seven evaluation metrics used. In addition, the commutative property was experimentally validated. The automatically extracted features through end-to-end SMILES learning alleviates the significant efforts required for manual feature engineering. It is expected to improve prediction performance, in drug analyses.", "histories": [["v1", "Thu, 27 Apr 2017 05:03:08 GMT  (1106kb,D)", "http://arxiv.org/abs/1704.08432v1", null], ["v2", "Tue, 27 Jun 2017 04:28:17 GMT  (1275kb,D)", "http://arxiv.org/abs/1704.08432v2", "ACM-BCB 2017"]], "reviews": [], "SUBJECTS": "cs.LG", "authors": ["sunyoung kwon", "sungroh yoon"], "accepted": false, "id": "1704.08432"}
