{"conference": "AAAI", "VERSION": "v1", "DATE_OF_SUBMISSION": "23-Apr-2017", "title": "Misspecified Linear Bandits", "abstract": "We consider the problem of online learning in misspecified linear stochastic multi-armed bandit problems. Regret guarantees for state-of-the-art linear bandit algorithms such as Optimism in the Face of Uncertainty Linear bandit (OFUL) hold under the assumption that the arms expected rewards are perfectly linear in their features. It is, however, of interest to investigate the impact of potential misspecification in linear bandit models, where the expected rewards are perturbed away from the linear subspace determined by the arms features. Although OFUL has recently been shown to be robust to relatively small deviations from linearity, we show that any linear bandit algorithm that enjoys optimal regret performance in the perfectly linear setting (e.g., OFUL) must suffer linear regret under a sparse additive perturbation of the linear model. In an attempt to overcome this negative result, we define a natural class of bandit models characterized by a non-sparse deviation from linearity. We argue that the OFUL algorithm can fail to achieve sublinear regret even under models that have non-sparse deviation.We finally develop a novel bandit algorithm, comprising a hypothesis test for linearity followed by a decision to use either the OFUL or Upper Confidence Bound (UCB) algorithm. For perfectly linear bandit models, the algorithm provably exhibits OFULs favorable regret performance, while for misspecified models satisfying the non-sparse deviation property, the algorithm avoids the linear regret phenomenon and falls back on UCBs sublinear regret scaling. Numerical experiments on synthetic data, and on recommendation data from the public Yahoo! Learning to Rank Challenge dataset, empirically support our findings.", "histories": [["v1", "Sun, 23 Apr 2017 04:37:57 GMT  (599kb,D)", "http://arxiv.org/abs/1704.06880v1", "Thirty-First AAAI Conference on Artificial Intelligence, 2017"]], "COMMENTS": "Thirty-First AAAI Conference on Artificial Intelligence, 2017", "reviews": [], "SUBJECTS": "cs.LG", "authors": ["avishek ghosh", "sayak ray chowdhury", "aditya gopalan"], "accepted": true, "id": "1704.06880"}
