{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "27-Apr-2017", "title": "OMNIRank: Risk Quantification for P2P Platforms with Deep Learning", "abstract": "P2P lending presents as an innovative and flexible alternative for conventional lending institutions like banks, where lenders and borrowers directly make transactions and benefit each other without complicated verifications. However, due to lack of specialized laws, delegated monitoring and effective managements, P2P platforms may spawn potential risks, such as withdraw failures, investigation involvements and even runaway bosses, which cause great losses to lenders and are especially serious and notorious in China. Although there are abundant public information and data available on the Internet related to P2P platforms, challenges of multi-sourcing and heterogeneity matter. In this paper, we promote a novel deep learning model, OMNIRank, which comprehends multi-dimensional features of P2P platforms for risk quantification and produces scores for ranking. We first construct a large-scale flexible crawling framework and obtain great amounts of multi-source heterogeneous data of domestic P2P platforms since 2007 from the Internet. Purifications like duplication and noise removal, null handing, format unification and fusion are applied to improve data qualities. Then we extract deep features of P2P platforms via text comprehension, topic modeling, knowledge graph and sentiment analysis, which are delivered as inputs to OMNIRank, a deep learning model for risk quantification of P2P platforms. Finally, according to rankings generated by OMNIRank, we conduct flourish data visualizations and interactions, providing lenders with comprehensive information supports, decision suggestions and safety guarantees.", "histories": [["v1", "Thu, 27 Apr 2017 03:15:38 GMT  (4882kb)", "http://arxiv.org/abs/1705.03497v1", "9 pages, in Chinese, 7 figures, CCFBD2016"]], "COMMENTS": "9 pages, in Chinese, 7 figures, CCFBD2016", "reviews": [], "SUBJECTS": "cs.CY cs.LG", "authors": ["honglun zhang", "haiyang wang", "xiaming chen", "yongkun wang", "yaohui jin"], "accepted": false, "id": "1705.03497"}
