{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "2-May-2017", "title": "Show, Adapt and Tell: Adversarial Training of Cross-domain Image Captioner", "abstract": "Impressive image captioning results are achieved in domains with plenty of training image and sentence pairs (e.g., MSCOCO). However, transferring to a target domain with significant domain shifts but no paired training data (referred to as cross-domain image captioning) remains largely unexplored. We propose a novel adversarial training procedure to leverage unpaired data in the target domain. Two critic networks are introduced to guide the captioner, namely domain critic and multi-modal critic. The domain critic assesses whether the generated sentences are indistinguishable from sentences in the target domain. The multi-modal critic assesses whether an image and its generated sentence are a valid pair. During training, the critics and captioner act as adversaries -- captioner aims to generate indistinguishable sentences, whereas critics aim at distinguishing them. The assessment improves the captioner through policy gradient updates. During inference, we further propose a novel critic-based planning method to select high-quality sentences without additional supervision (e.g., tags). To evaluate, we use MSCOCO as the source domain and four other datasets (CUB-200-2011, Oxford-102, TGIF, and Flickr30k) as the target domains. Our method consistently performs well on all datasets. In particular, on CUB-200-2011, we achieve 21.8% CIDEr-D improvement after adaptation. Utilizing critics during inference further gives another 4.5% boost.", "histories": [["v1", "Tue, 2 May 2017 12:06:54 GMT  (1542kb,D)", "http://arxiv.org/abs/1705.00930v1", "10 pages, 6 figures"], ["v2", "Mon, 14 Aug 2017 15:54:32 GMT  (2599kb,D)", "http://arxiv.org/abs/1705.00930v2", "ICCV 2017"]], "COMMENTS": "10 pages, 6 figures", "reviews": [], "SUBJECTS": "cs.CV cs.AI cs.LG", "authors": ["tseng-hung chen", "yuan-hong liao", "ching-yao chuang", "wan-ting hsu", "jianlong fu", "min sun"], "accepted": false, "id": "1705.00930"}
