{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "13-Jun-2017", "title": "MNL-Bandit: A Dynamic Learning Approach to Assortment Selection", "abstract": "We consider a dynamic assortment selection problem, where in every round the retailer offers a subset (assortment) of $N$ substitutable products to a consumer, who selects one of these products according to a multinomial logit (MNL) choice model. The retailer observes this choice and the objective is to dynamically learn the model parameters, while optimizing cumulative revenues over a selling horizon of length $T$. We refer to this exploration-exploitation formulation as the MNL-Bandit problem. Existing methods for this problem follow an \"explore-then-exploit\" approach, which estimate parameters to a desired accuracy and then, treating these estimates as if they are the correct parameter values, offers the optimal assortment based on these estimates. These approaches require certain a priori knowledge of \"separability\", determined by the true parameters of the underlying MNL model, and this in turn is critical in determining the length of the exploration period. (Separability refers to the distinguishability of the true optimal assortment from the other sub-optimal alternatives.) In this paper, we give an efficient algorithm that simultaneously explores and exploits, achieving performance independent of the underlying parameters. The algorithm can be implemented in a fully online manner, without knowledge of the horizon length $T$. Furthermore, the algorithm is adaptive in the sense that its performance is near-optimal in both the \"well separated\" case, as well as the general parameter setting where this separation need not hold.", "histories": [["v1", "Tue, 13 Jun 2017 00:54:47 GMT  (737kb,D)", "http://arxiv.org/abs/1706.03880v1", null]], "reviews": [], "SUBJECTS": "cs.LG", "authors": ["shipra agrawal", "vashist avadhanula", "vineet goyal", "assaf zeevi"], "accepted": false, "id": "1706.03880"}
