{"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "23-Aug-2017", "title": "Generating Visual Representations for Zero-Shot Classification", "abstract": "This paper addresses the task of learning an image clas-sifier when some categories are defined by semantic descriptions only (e.g. visual attributes) while the others are defined by exemplar images as well. This task is often referred to as the Zero-Shot classification task (ZSC). Most of the previous methods rely on learning a common embedding space allowing to compare visual features of unknown categories with semantic descriptions. This paper argues that these approaches are limited as i) efficient discrimi-native classifiers can't be used ii) classification tasks with seen and unseen categories (Generalized Zero-Shot Classification or GZSC) can't be addressed efficiently. In contrast , this paper suggests to address ZSC and GZSC by i) learning a conditional generator using seen classes ii) generate artificial training examples for the categories without exemplars. ZSC is then turned into a standard supervised learning problem. Experiments with 4 generative models and 5 datasets experimentally validate the approach, giving state-of-the-art results on both ZSC and GZSC.", "histories": [["v1", "Wed, 23 Aug 2017 12:23:51 GMT  (3632kb,D)", "http://arxiv.org/abs/1708.06975v1", "International Conference on Computer Vision (ICCV) Workshops : TASK-CV: Transferring and Adapting Source Knowledge in Computer Vision, Oct 2017, venise, Italy. International Conference on Computer Vision (ICCV) Workshops, 2017"], ["v2", "Mon, 28 Aug 2017 12:56:18 GMT  (3549kb,D)", "http://arxiv.org/abs/1708.06975v2", "International Conference on Computer Vision (ICCV) Workshops : TASK-CV: Transferring and Adapting Source Knowledge in Computer Vision, Oct 2017, venise, Italy. International Conference on Computer Vision (ICCV) Workshops, 2017"]], "COMMENTS": "International Conference on Computer Vision (ICCV) Workshops : TASK-CV: Transferring and Adapting Source Knowledge in Computer Vision, Oct 2017, venise, Italy. International Conference on Computer Vision (ICCV) Workshops, 2017", "reviews": [], "SUBJECTS": "cs.CV cs.AI cs.LG", "authors": ["maxime bucher", "st\\'ephane herbin", "fr\\'ed\\'eric jurie"], "accepted": false, "id": "1708.06975"}
