{"conference": "nips", "VERSION": "v1", "DATE_OF_SUBMISSION": "8-Sep-2017", "title": "The Expressive Power of Neural Networks: A View from the Width", "abstract": "The expressive power of neural networks is important for understanding deep learning. Most existing works consider this problem from the view of the depth of a network. In this paper, we study how width affects the expressiveness of neural networks. Classical results state that \\emph{depth-bounded} (e.g. depth-$2$) networks with suitable activation functions are universal approximators. We show a universal approximation theorem for \\emph{width-bounded} ReLU networks: width-$(n+4)$ ReLU networks, where $n$ is the input dimension, are universal approximators. Moreover, except for a measure zero set, all functions cannot be approximated by width-$n$ ReLU networks, which exhibits a phase transition. Several recent works demonstrate the benefits of depth by proving the depth-efficiency of neural networks. That is, there are classes of deep networks which cannot be realized by any shallow network whose size is no more than an \\emph{exponential} bound. Here we pose the dual question on the width-efficiency of ReLU networks: Are there wide networks that cannot be realized by narrow networks whose size is not substantially larger? We show that there exist classes of wide networks which cannot be realized by any narrow network whose depth is no more than a \\emph{polynomial} bound. On the other hand, we demonstrate by extensive experiments that narrow networks whose size exceed the polynomial bound by a constant factor can approximate wide and shallow network with high accuracy. Our results provide more comprehensive evidence that depth is more effective than width for the expressiveness of ReLU networks.", "histories": [["v1", "Fri, 8 Sep 2017 05:00:20 GMT  (1261kb,D)", "http://arxiv.org/abs/1709.02540v1", "accepted by NIPS 2017"], ["v2", "Thu, 28 Sep 2017 01:28:09 GMT  (1261kb,D)", "http://arxiv.org/abs/1709.02540v2", "accepted by NIPS 2017 ( with some typos fixed)"], ["v3", "Wed, 1 Nov 2017 08:50:32 GMT  (3296kb,D)", "http://arxiv.org/abs/1709.02540v3", "accepted by NIPS 2017 ( with some typos fixed)"]], "COMMENTS": "accepted by NIPS 2017", "reviews": [], "SUBJECTS": "cs.LG", "authors": ["zhou lu", "hongming pu", "feicheng wang", "zhiqiang hu", "liwei wang"], "accepted": true, "id": "1709.02540"}
