{
  "name" : "1011.0415.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Learning Networks of Stochastic Differential Equations",
    "authors" : [ "José Bento", "Morteza Ibrahimi" ],
    "emails" : [ "jbento@stanford.edu", "ibrahimi@stanford.edu", "montanari@stanford.edu" ],
    "sections" : [ {
      "heading" : null,
      "text" : "ar X\niv :1\n01 1.\n04 15\nv1 [\nm at\nkeywords: Gaussian processes, model selection and structure learning, graphical models, sparsity and feature selection."
    }, {
      "heading" : "1 Introduction and main results",
      "text" : "Let G = (V,E) be a directed graph with weight A0ij ∈ R associated to the directed edge (j, i) from j ∈ V to i ∈ V . To each node i ∈ V in this network is associated an independent standard Brownian motion bi and a variable xi taking values in R and evolving according to\ndxi(t) = ∑\nj∈∂+i\nA0ijxj(t) dt+ dbi(t) ,\nwhere ∂+i = {j ∈ V : (j, i) ∈ E} is the set of ‘parents’ of i. Without loss of generality we shall take V = [p] ≡ {1, . . . , p}. In words, the rate of change of xi is given by a weighted sum of the current values of its neighbors, corrupted by white noise. In matrix notation, the same system is then represented by\ndx(t) = A0x(t) dt+ db(t) , (1)\nwith x(t) ∈ Rp, b(t) a p-dimensional standard Brownian motion and A0 ∈ Rp×p a matrix with entries {A0ij}i,j∈[p] whose sparsity pattern is given by the graphG. We assume that the linear system ẋ(t) = A0x(t) is stable (i.e. that the spectrum of A0 is contained in {z ∈ C : Re(z) < 0}). Further, we assume that x(t = 0) is in its stationary state. More precisely, x(0) is a Gaussian random variable\nindependent of b(t), distributed according to the invariant measure. Under the stability assumption, this a mild restriction, since the system converges exponentially to stationarity.\nA portion of time length T of the system trajectory {x(t)}t∈[0,T ] is observed and we ask under which conditions these data are sufficient to reconstruct the graph G (i.e., the sparsity pattern of A0). We are particularly interested in computationally efficient procedures, and in characterizing the scaling of the learning time for large networks. Can the network structure be learnt in a time scaling linearly with the number of its degrees of freedom?\nAs an example application, chemical reactions can be conveniently modeled by systems of nonlinear stochastic differential equations, whose variables encode the densities of various chemical species [1, 2]. Complex biological networks might involve hundreds of such species [3], and learning stochastic models from data is an important (and challenging) computational task [4]. Considering one such chemical reaction network in proximity of an equilibrium point, the model (1) can be used to trace fluctuations of the species counts with respect to the equilibrium values. The network G would represent in this case the interactions between different chemical factors. Work in this area focused so-far on low-dimensional networks, i.e. on methods that are guaranteed to be correct for fixed p, as T → ∞, while we will tackle here the regime in which both p and T diverge. Before stating our results, it is useful to stress a few important differences with respect to classical graphical model learning problems:\n(i) Samples are not independent. This can (and does) increase the sample complexity.\n(ii) On the other hand, infinitely many samples are given as data (in fact a collection indexed by the continuous parameter t ∈ [0, T ]). Of course one can select a finite subsample, for instance at regularly spaced times {x(i η)}i=0,1,.... This raises the question as to whether the learning performances depend on the choice of the spacing η.\n(iii) In particular, one expects that choosing η sufficiently large as to make the configurations in the subsample approximately independent can be harmful. Indeed, the matrix A0 contains more information than the stationary distribution of the above process (1), and only the latter can be learned from independent samples.\n(iv) On the other hand, letting η → 0, one can produce an arbitrarily large number of distinct samples. However, samples become more dependent, and intuitively one expects that there is limited information to be harnessed from a given time interval T .\nOur results confirm in a detailed and quantitative way these intuitions."
    }, {
      "heading" : "1.1 Results: Regularized least squares",
      "text" : "Regularized least squares is an efficient and well-studied method for support recovery. We will discuss relations with existing literature in Section 1.3.\nIn the present case, the algorithm reconstructs independently each row of the matrix A0. The rth row, A0r , is estimated by solving the following convex optimization problem for Ar ∈ Rp\nminimize L(Ar; {x(t)}t∈[0,T ]) + λ‖Ar‖1 , (2) where the likelihood function L is defined by\nL(Ar; {x(t)}t∈[0,T ]) = 1\n2T\n∫ T\n0\n(A∗rx(t)) 2 dt− 1\nT\n∫ T\n0\n(A∗rx(t)) dxr(t) . (3)\n(Here and below M∗ denotes the transpose of matrix/vector M .) To see that this likelihood function is indeed related to least squares, one can formally write ẋr(t) = dxr(t)/dt and complete the square for the right hand side of Eq. (3), thus getting the integral ∫ (A∗rx(t) − ẋr(t))2dt − ∫ ẋr(t)\n2 dt. The first term is a sum of square residuals, and the second is independent of A. Finally the ℓ1 regularization term in Eq. (2) has the role of shrinking to 0 a subset of the entries Aij thus effectively selecting the structure.\nLet S0 be the support of row A0r, and assume |S0| ≤ k. We will refer to the vector sign(A0r) as to the signed support of A0r (where sign(0) = 0 by convention). Let λmax(M) and λmin(M) stand for\nthe maximum and minimum eigenvalue of a square matrix M respectively. Further, denote by Amin the smallest absolute value among the non-zero entries of row A0r.\nWhen stable, the diffusion process (1) has a unique stationary measure which is Gaussian with covariance Q0 ∈ Rp×p given by the solution of Lyapunov’s equation [5]\nA0Q0 +Q0(A0)∗ + I = 0. (4)\nOur guarantee for regularized least squares is stated in terms of two properties of the covariance Q0 and one assumption on ρmin(A0) (given a matrix M , we denote by ML,R its submatrix ML,R ≡ (Mij)i∈L,j∈R):\n(a) We denote by Cmin ≡ λmin(Q0S0,S0) the minimum eigenvalue of the restriction of Q0 to the support S0 and assume Cmin > 0. (b) We define the incoherence parameter α by letting |||Q0(S0)C ,S0 ( Q0S0,S0\n)−1 |||∞ = 1− α, and assume α > 0. (Here ||| · |||∞ is the operator sup norm.) (c) We define ρmin(A0) = −λmax((A0 + A0∗)/2) and assume ρmin(A0) > 0. Note this is a stronger form of stability assumption.\nOur main result is to show that there exists a well defined time complexity, i.e. a minimum time interval T such that, observing the system for time T enables us to reconstruct the network with high probability. This result is stated in the following theorem. Theorem 1.1. Consider the problem of learning the support S0 of row A0r of the matrix A\n0 from a sample trajectory {x(t)}t∈[0,T ] distributed according to the model (1). If\nT > 104k2(k ρmin(A 0)−2 +A−2min)\nα2ρmin(A0)C2min log (4pk δ ) , (5)\nthen there exists λ such that ℓ1-regularized least squares recovers the signed support of A0r with probability larger than 1− δ. This is achieved by taking λ = √ 36 log(4p/δ)/(Tα2ρmin(A0)) .\nThe time complexity is logarithmic in the number of variables and polynomial in the support size. Further, it is roughly inversely proportional to ρmin(A0), which is quite satisfying conceptually, since ρmin(A0)−1 controls the relaxation time of the mixes."
    }, {
      "heading" : "1.2 Overview of other results",
      "text" : "So far we focused on continuous-time dynamics. While, this is useful in order to obtain elegant statements, much of the paper is in fact devoted to the analysis of the following discrete-time dynamics, with parameter η > 0:\nx(t) = x(t − 1) + ηA0x(t− 1) + w(t), t ∈ N0 . (6) Here x(t) ∈ Rp is the vector collecting the dynamical variables, A0 ∈ Rp×p specifies the dynamics as above, and {w(t)}t≥0 is a sequence of i.i.d. normal vectors with covariance η Ip×p (i.e. with independent components of variance η). We assume that consecutive samples {x(t)}0≤t≤n are given and will ask under which conditions regularized least squares reconstructs the support of A0.\nThe parameter η has the meaning of a time-step size. The continuous-time model (1) is recovered, in a sense made precise below, by letting η → 0. Indeed we will prove reconstruction guarantees that are uniform in this limit as long as the product nη (which corresponds to the time interval T in the previous section) is kept constant. For a formal statement we refer to Theorem 3.1. Theorem 1.1 is indeed proved by carefully controlling this limit. The mathematical challenge in this problem is related to the fundamental fact that the samples {x(t)}0≤t≤n are dependent (and strongly dependent as η → 0). Discrete time models of the form (6) can arise either because the system under study evolves by discrete steps, or because we are subsampling a continuous time system modeled as in Eq. (1). Notice that in the latter case the matrices A0 appearing in Eq. (6) and (1) coincide only to the zeroth order in η. Neglecting this technical complication, the uniformity of our reconstruction guarantees as η → 0 has an appealing interpretation already mentioned above. Whenever the samples spacing is not too large, the time complexity (i.e. the product nη) is roughly independent of the spacing itself."
    }, {
      "heading" : "1.3 Related work",
      "text" : "A substantial amount of work has been devoted to the analysis of ℓ1 regularized least squares, and its variants [6, 7, 8, 9, 10]. The most closely related results are the one concerning high-dimensional consistency for support recovery [11, 12]. Our proof follows indeed the line of work developed in these papers, with two important challenges. First, the design matrix is in our case produced by a stochastic diffusion, and it does not necessarily satisfies the irrepresentability conditions used by these works. Second, the observations are not corrupted by i.i.d. noise (since successive configurations are correlated) and therefore elementary concentration inequalities are not sufficient.\nLearning sparse graphical models via ℓ1 regularization is also a topic with significant literature. In the Gaussian case, the graphical LASSO was proposed to reconstruct the model from i.i.d. samples [13]. In the context of binary pairwise graphical models, Ref. [11] proves high-dimensional consistency of regularized logistic regression for structural learning, under a suitable irrepresentability conditions on a modified covariance. Also this paper focuses on i.i.d. samples.\nMost of these proofs builds on the technique of [12]. A naive adaptation to the present case allows to prove some performance guarantee for the discrete-time setting. However the resulting bounds are not uniform as η → 0 for nη = T fixed. In particular, they do not allow to prove an analogous of our continuous time result, Theorem 1.1. A large part of our effort is devoted to producing more accurate probability estimates that capture the correct scaling for small η.\nSimilar issues were explored in the study of stochastic differential equations, whereby one is often interested in tracking some slow degrees of freedom while ‘averaging out’ the fast ones [14]. The relevance of this time-scale separation for learning was addressed in [15]. Let us however emphasize that these works focus once more on system with a fixed (small) number of dimensions p.\nFinally, the related topic of learning graphical models for autoregressive processes was studied recently in [16, 17]. The convex relaxation proposed in these papers is different from the one developed here. Further, no model selection guarantee was proved in [16, 17]."
    }, {
      "heading" : "2 Illustration of the main results",
      "text" : "It might be difficult to get a clear intuition of Theorem 1.1, mainly because of conditions (a) and (b), which introduce parameters Cmin and α. The same difficulty arises with analogous results on the high-dimensional consistency of the LASSO [11, 12]. In this section we provide concrete illustration both via numerical simulations, and by checking the condition on specific classes of graphs."
    }, {
      "heading" : "2.1 Learning the laplacian of graphs with bounded degree",
      "text" : "Given a simple graph G = (V , E) on vertex set V = [p], its laplacian ∆G is the symmetric p × p matrix which is equal to the adjacency matrix of G outside the diagonal, and with entries ∆Gii = −deg(i) on the diagonal [18]. (Here deg(i) denotes the degree of vertex i.) It is well known that ∆G is negative semidefinite, with one eigenvalue equal to 0, whose multiplicity is equal to the number of connected components of G. The matrix A0 = −mI + ∆G fits into the setting of Theorem 1.1 for m > 0. The corresponding model (1.1) describes the over-damped dynamics of a network of masses connected by springs of unit strength, and connected by a spring of strength m to the origin. We obtain the following result. Theorem 2.1. Let G be a simple connected graph of maximum vertex degree k and consider the model (1.1) with A0 = −mI +∆G where ∆G is the laplacian of G and m > 0. If\nT ≥ 2 · 105k2 (k +m\nm\n)5 (k +m2) log (4pk δ ) , (7)\nthen there exists λ such that ℓ1-regularized least squares recovers the signed support of A0r with probability larger than 1− δ. This is achieved by taking λ = √ 36(k +m)2 log(4p/δ)/(Tm3).\nIn other words, for m bounded away from 0 and ∞, regularized least squares regression correctly reconstructs the graph G from a trajectory of time length which is polynomial in the degree and logarithmic in the system size. Notice that once the graph is known, the laplacian ∆G is uniquely determined. Also, the proof technique used for this example is generalizable to other graphs as well."
    }, {
      "heading" : "2.2 Numerical illustrations",
      "text" : "In this section we present numerical validation of the proposed method on synthetic data. The results confirm our observations in Theorems 1.1 and 3.1, below, namely that the time complexity scales logarithmically with the number of nodes in the network p, given a constant maximum degree. Also, the time complexity is roughly independent of the sampling rate. In Fig. 1 and 2 we consider the discrete-time setting, generating data as follows. We draw A0 as a random sparse matrix in {0, 1}p×p with elements chosen independently at random with P(A0ij = 1) = k/p, k = 5. The process xn0 ≡ {x(t)}0≤t≤n is then generated according to Eq. (6). We solve the regularized least square problem (the cost function is given explicitly in Eq. (8) for the discrete-time case) for different values of n, the number of observations, and record if the correct support is recovered for a random row r using the optimum value of the parameter λ. An estimate of the probability of successful recovery is obtained by repeating this experiment. Note that we are estimating here an average probability of success over randomly generated matrices.\nThe left plot in Fig.1 depicts the probability of success vs. nη for η = 0.1 and different values of p. Each curve is obtained using 211 instances, and each instance is generated using a new random matrix A0. The right plot in Fig.1 is the corresponding curve of the sample complexity vs. p where sample complexity is defined as the minimum value of nη with probability of success of 90%. As predicted by Theorem 2.1 the curve shows the logarithmic scaling of the sample complexity with p.\nIn Fig. 2 we turn to the continuous-time model (1). Trajectories are generated by discretizing this stochastic differential equation with step δ much smaller than the sampling rate η. We draw random matrices A0 as above and plot the probability of success for p = 16, k = 4 and different values of η, as a function of T . We used 211 instances for each curve. As predicted by Theorem 1.1, for a fixed observation interval T , the probability of success converges to some limiting value as η → 0."
    }, {
      "heading" : "3 Discrete-time model: Statement of the results",
      "text" : "Consider a system evolving in discrete time according to the model (6), and let xn0 ≡ {x(t)}0≤t≤n be the observed portion of the trajectory. The rth row A0r is estimated by solving the following convex optimization problem for Ar ∈ Rp\nminimize L(Ar;x n 0 ) + λ‖Ar‖1 , (8)\nwhere\nL(Ar;x n 0 ) ≡\n1\n2η2n\nn−1∑\nt=0\n{xr(t+ 1)− xr(t)− η A∗rx(t)}2 . (9)\nApart from an additive constant, the η → 0 limit of this cost function can be shown to coincide with the cost function in the continuous time case, cf. Eq. (3). Indeed the proof of Theorem 1.1 will amount to a more precise version of this statement. Furthermore, L(Ar;xn0 ) is easily seen to be the log-likelihood of Ar within model (6).\nAs before, we let S0 be the support of row A0r, and assume |S0| ≤ k. Under the model (6) x(t) has a Gaussian stationary state distribution with covariance Q0 determined by the following modified Lyapunov equation\nA0Q0 +Q0(A0)∗ + ηA0Q0(A0)∗ + I = 0 . (10)\nIt will be clear from the context whether A0/Q0 refers to the dynamics/stationary matrix from the continuous or discrete time system. We assume conditions (a) and (b) introduced in Section 1.1, and adopt the notations already introduced there. We use as a shorthand notation σmax ≡ σmax(I+η A0) where σmax(.) is the maximum singular value. Also define D ≡ ( 1 − σmax ) /η . We will assume D > 0. As in the previous section, we assume the model (6) is initiated in the stationary state.\nTheorem 3.1. Consider the problem of learning the support S0 of row A0r from the discrete-time trajectory {x(t)}0≤t≤n. If\nnη > 104k2(kD−2 +A−2min)\nα2DC2min log (4pk δ ) , (11)\nthen there exists λ such that ℓ1-regularized least squares recovers the signed support of A0r with probability larger than 1− δ. This is achieved by taking λ = √ (36 log(4p/δ))/(Dα2nη).\nIn other words the discrete-time sample complexity, n, is logarithmic in the model dimension, polynomial in the maximum network degree and inversely proportional to the time spacing between samples. The last point is particularly important. It enables us to derive the bound on the continuoustime sample complexity as the limit η → 0 of the discrete-time sample complexity. It also confirms our intuition mentioned in the Introduction: although one can produce an arbitrary large number of samples by sampling the continuous process with finer resolutions, there is limited amount of information that can be harnessed from a given time interval [0, T ]."
    }, {
      "heading" : "4 Proofs",
      "text" : "In the following we denote by X ∈ Rn×p the matrix whose (t + 1)th column corresponds to the configuration x(t), i.e. X = [x(0), x(1), . . . , x(n− 1)]. Further ∆X ∈ Rn×p is the matrix containing configuration changes, namely ∆X = [x(1) − x(0), . . . , x(n) − x(n − 1)]. Finally we write W = [w(1), . . . , w(n− 1)] for the matrix containing the Gaussian noise realization. Equivalently,\nW = ∆X − ηAX . The rth row of W is denoted by Wr.\nIn order to lighten the notation, we will omit the reference to xn0 in the likelihood function (9) and simply write L(Ar). We define its normalized gradient and Hessian by\nĜ = −∇L(A0r) = 1\nnη XW ∗r , Q̂ = ∇2L(A0r) =\n1 n XX∗ . (12)"
    }, {
      "heading" : "4.1 Discrete time",
      "text" : "In this Section we outline our prove for our main result for discrete-time dynamics, i.e., Theorem 3.1. We start by stating a set of sufficient conditions for regularized least squares to work. Then we present a series of concentration lemmas to be used to prove the validity of these conditions, and finally we sketch the outline of the proof.\nAs mentioned, the proof strategy, and in particular the following proposition which provides a compact set of sufficient conditions for the support to be recovered correctly is analogous to the one in [12]. A proof of this proposition can be found in the supplementary material. Proposition 4.1. Let α,Cmin > 0 be be defined by\nλmin(Q 0 S0,S0) ≡ Cmin , |||Q0(S0)C ,S0 ( Q0S0,S0 )−1 |||∞ ≡ 1− α . (13) If the following conditions hold then the regularized least square solution (8) correctly recover the signed support sign(A0r):\n‖Ĝ‖∞ ≤ λα\n3 , ‖ĜS0‖∞ ≤ AminCmin 4k − λ, (14)\n|||Q̂(S0)C ,S0 −Q0(S0)C ,S0 |||∞ ≤ α\n12 Cmin√ k , |||Q̂S0,S0 −Q0S0,S0 |||∞ ≤ α 12 Cmin√ k . (15)\nFurther the same statement holds for the continuous model 3, provided Ĝ and Q̂ are the gradient and the hessian of the likelihood (3).\nThe proof of Theorem 3.1 consists in checking that, under the hypothesis (11) on the number of consecutive configurations, conditions (14) to (15) will hold with high probability. Checking these conditions can be regarded in turn as concentration-of-measure statements. Indeed, if expectation is taken with respect to a stationary trajectory, we have E{Ĝ} = 0, E{Q̂} = Q0."
    }, {
      "heading" : "4.1.1 Technical lemmas",
      "text" : "In this section we will state the necessary concentration lemmas for proving Theorem 3.1. These are non-trivial because Ĝ, Q̂ are quadratic functions of dependent random variables ( the samples {x(t)}0≤t≤n ) . The proofs of Proposition 4.2, of Proposition 4.3, and Corollary 4.4 can be found in the supplementary material provided.\nOur first Proposition implies concentration of Ĝ around 0. Proposition 4.2. Let S ⊆ [p] be any set of vertices and ǫ < 1/2. If σmax ≡ σmax(I + η A0) < 1, then\nP { ‖ĜS‖∞ > ǫ } ≤ 2|S| e−n(1−σmax) ǫ2/4. (16)\nWe furthermore need to bound the matrix norms as per (15) in proposition 4.1. First we relate bounds on |||Q̂JS − Q0JS |||∞ with bounds on |Q̂ij − Q0ij |, (i ∈ J, i ∈ S) where J and S are any subsets of {1, ..., p}. We have,\nP(|||Q̂JS −Q0JS)|||∞ > ǫ) ≤ |J ||S|max i,j∈J P(|Q̂ij −Q0ij | > ǫ/|S|). (17)\nThen, we bound |Q̂ij −Q0ij | using the following proposition Proposition 4.3. Let i, j ∈ {1, ..., p}, σmax ≡ σmax(I + ηA0) < 1, T = ηn > 3/D and 0 < ǫ < 2/D where D = (1− σmax)/η then,\nP(|Q̂ij −Q0ij)| > ǫ) ≤ 2e − n 32η2 (1−σmax) 3ǫ2 . (18)\nFinally, the next corollary follows from Proposition 4.3 and Eq. (17). Corollary 4.4. Let J, S (|S| ≤ k) be any two subsets of {1, ..., p} and σmax ≡ σmax(I+ ηA0) < 1, ǫ < 2k/D and nη > 3/D (where D = (1− σmax)/η) then,\nP(|||Q̂JS −Q0JS |||∞ > ǫ) ≤ 2|J |ke − n 32k2η2 (1−σmax) 3ǫ2 . (19)"
    }, {
      "heading" : "4.1.2 Outline of the proof of Theorem 3.1",
      "text" : "With these concentration bounds we can now easily prove Theorem 3.1. All we need to do is to compute the probability that the conditions given by Proposition 4.1 hold. From the statement of the theorem we have that the first two conditions (α,Cmin > 0) of Proposition 4.1 hold. In order to make the first condition on Ĝ imply the second condition on Ĝ we assume that λα/3 ≤ (AminCmin)/(4k)− λ which is guaranteed to hold if\nλ ≤ AminCmin/8k. (20)\nWe also combine the two last conditions on Q̂, thus obtaining the following\n|||Q̂[p],S0 −Q0[p],S0|||∞ ≤ α\n12 Cmin√ k , (21)\nsince [p] = S0 ∪ (S0)C . We then impose that both the probability of the condition on Q̂ failing and the probability of the condition on Ĝ failing are upper bounded by δ/2 using Proposition 4.2 and Corollary 4.4. It is shown in the supplementary material that this is satisfied if condition (11) holds."
    }, {
      "heading" : "4.2 Outline of the proof of Theorem 1.1",
      "text" : "To prove Theorem 1.1 we recall that Proposition 4.1 holds provided the appropriate continuous time expressions are used for Ĝ and Q̂, namely\nĜ = −∇L(A0r) = 1\nT\n∫ T\n0\nx(t) dbr(t) , Q̂ = ∇2L(A0r) = 1\nT\n∫ T\n0\nx(t)x(t)∗ dt . (22)\nThese are of course random variables. In order to distinguish these from the discrete time version, we will adopt the notation Ĝn, Q̂n for the latter. We claim that these random variables can be coupled (i.e. defined on the same probability space) in such a way that Ĝn → Ĝ and Q̂n → Q̂ almost surely as n → ∞ for fixed T . Under assumption (5), it is easy to show that (11) holds for all n > n0 with n0 a sufficiently large constant (for a proof see the provided supplementary material). Therefore, by the proof of Theorem 3.1, the conditions in Proposition 4.1 hold for gradient Ĝn and hessian Q̂n for any n ≥ n0, with probability larger than 1 − δ. But by the claimed convergence Ĝn → Ĝ and Q̂n → Q̂, they hold also for Ĝ and Q̂ with probability at least 1− δ which proves the theorem.\nWe are left with the task of showing that the discrete and continuous time processes can be coupled in such a way that Ĝn → Ĝ and Q̂n → Q̂. With slight abuse of notation, the state of the discrete time system (6) will be denoted by x(i) where i ∈ N and the state of continuous time system (1) by x(t) where t ∈ R. We denote by Q0 the solution of (4) and by Q0(η) the solution of (10). It is easy to check that Q0(η) → Q0 as η → 0 by the uniqueness of stationary state distribution. The initial state of the continuous time system x(t = 0) is a N(0, Q0) random variable independent of b(t) and the initial state of the discrete time system is defined to be x(i = 0) = (Q0(η))1/2(Q0)−1/2x(t = 0). At subsequent times, x(i) and x(t) are assumed are generated by the respective dynamical systems using the same matrix A0 using common randomness provided by the standard Brownian motion {b(t)}0≤t≤T in Rp. In order to couple x(t) and x(i), we construct w(i), the noise driving the discrete time system, by letting w(i) ≡ (b(T i/n)− b(T (i− 1)/n)).\nThe almost sure convergence Ĝn → Ĝ and Q̂n → Q̂ follows then from standard convergence of random walk to Brownian motion."
    }, {
      "heading" : "Acknowledgments",
      "text" : "This work was partially supported by a Terman fellowship, the NSF CAREER award CCF-0743978 and the NSF grant DMS-0806211 and by a Portuguese Doctoral FCT fellowship."
    }, {
      "heading" : "A Learning networks of stochastic differential equations: Supplementary materials",
      "text" : "In order to prove Proposition 4.1 we first introduce two technical lemmas.\nLemma A.1. For any subset S ⊆ [p] the following decomposition holds,\nQ̂SC ,S ( Q̂S,S )−1 = T1 + T2 + T3 +Q 0 SC ,S ( Q0S,S )−1 , (23)\nwhere,\nT1 = Q 0 SC ,S (( Q̂S,S )−1 − ( Q0S,S )−1 ) , (24) T2 = (Q̂SC ,S −Q0SC ,S) ( Q0S,S )−1 , (25) T3 = (Q̂SC ,S −Q0SC ,S) (( Q̂S,S )−1 − ( Q0S,S )−1 ) . (26)\n(27)\nIn addition, if |||Q0SC ,S ( Q0S,S )−1 |||∞ < 1 and λmin(Q̂S,S) ≥ Cmin/2 > 0 the following relations hold,\n|||T1|||∞ ≤ 2 √ k\nCmin |||Q̂S,S −Q0S,S|||∞, (28)\n|||T2|||∞ ≤ √ k\nCmin |||Q̂SC ,S −Q0SC ,S |||∞, (29)\n|||T3|||∞ ≤ 2 √ k\nC2min |||Q̂SC ,S −Q0SC ,S |||∞|||Q̂S,S −Q0S,S|||∞. (30)\nThe following lemma taken from the proofs of Proposition 1 in [19] and Proposition 1 in [12] respectively is the crux to guaranteeing correct signed-support reconstruction of A0r .\nLemma A.2. If Q̂S0,S0 > 0, then the dual vector ẑ from the KKT conditions of the optimization problem (8) satisfies the following inequality,\n‖ẑ(S0)C‖∞ ≤ |||Q̂(S0)C ,S0 ( Q̂S0,S0 )−1 |||∞ ( 1 +\n‖ĜS0‖∞ λ\n) +\n‖Ĝ(S0)C‖∞ λ . (31)\nIn addition, if\n‖ĜS0‖∞ ≤ Aminλmin(Q̂S0,S0)\n2k − λ (32)\nthen ‖A0r − Âr‖∞ ≤ Amin/2. The same result holds for problem (2).\nProof of Proposition 4.1: To guarantee that our estimated support is at least contained in the true support we need to impose that ‖ẑSC‖∞ < 1. To guarantee that we do not introduce extra elements in estimating the support and also to determine the correct sign of the solution we need to impose that ‖A0r− Âr‖∞ ≤ Amin/2. Now notice that since λmin(Q0S0,S0) = Cmin the relation λmin(Q̂S0,S0) ≥ Cmin/2 is guaranteed as long as |||Q̂S0,S0 − Q0S0,S0 |||∞ ≤ Cmin/2. Using Lemma A.1 it is easy to see that the bounds of Proposition 4.1 lead to the conditions of Lemma A.2 being verified. Thus, these lead to a correct recovery of the signed structure of A0r .\nLemma A.3. Let r, j ∈ [p] and let ρ(τ) represent a p × p matrix with all rows equal to zero except the rth row which equals the jth row of (I + ηA0) τ (the τ th power of I + ηA0 ). Let\nR̃(j) ∈ R(n+m+1)×(n+m+1) be defined as,\nR̃ =  \n0 0 . . . 0 0 0 . . . 0 0 ... ... . . . ... ... ... . . . ... ...\n0 0 . . . 0 0 0 . . . 0 0 ρ(m) ρ(m− 1) . . . ρ(1) ρ(0) 0 . . . 0 0 ρ(m+ 1) ρ(m) . . . ρ(2) ρ(1) ρ(0) . . . 0 0 ... ... . . . ... ... ... . . . 0 0 ρ(m+ n− 1) ρ(m+ n− 2) . . . ρ(n) ρ(n− 1) ρ(n− 2) . . . ρ(0) 0\n  . (33)\nDefine R(j) = 1/2(R̃ + R̃∗) and let νi denote its ith eigenvalue and assume σmax ≡ σmax(I + ηA0) < 1. Then,\np(n+m+1)∑\ni=1\nνi = 0, (34)\nmax i\n|νi| ≤ 1\n1− σmax , (35)\np(n+m+1)∑\ni=1\nν2i ≤ 1\n2\nn\n1− σmax . (36)\nProof. First it is immediate to see that ∑p(n+m+1)\ni=1 νi = Tr(R) = 0. Let I1τ represent a p × p matrix with zeros everywhere and ones in the block-position where ρ(τ) appears and I2τ represent a similar matrix but with ones in the block-position where ρ(τ)∗ appears. Then R can be written as,\nR = 1\n2\n( m+n−1∑\nτ=0\nI1τ ⊗ ρ(τ) + I2τ ⊗ ρ(τ)∗ ) , (37)\nwhere ⊗ denotes the Kronecker product of matrices. This expression can be used to compute an upper bound on |νi|. Namely,\nmax i\n|νi| = σmax(R) ≤ ∞∑\nτ=0\nσmax(I1τ ⊗ ρ(τ)) ≤ ∞∑\nτ=0\nσmax(I1τ )σmax(ρ(τ)) (38)\n≤ ∞∑\nτ=0\nσmax(ρ(τ)) ≤ ∞∑\nτ=0\nστmax = 1\n1− σmax(ϕ∗) . (39)\nFor the other bound we do, (n+m+1)p∑\ni=1\nν2i = Tr(R 2) ≤ 1\n4 n 2\n∞∑\nτ=0\nTr(ρ(τ)ρ(τ)∗) (40)\n= 1\n2 n\n∞∑\nτ=0\n‖ρ(τ)‖22 (41)\n≤ 1 2 n\n∞∑\nτ=0\nσ2τmax ≤ 1\n2\nn\n1− σmax , (42)\nwhere in the last step we used the fact that 0 ≤ σmax < 1.\nLemma A.4. Let j ∈ [p]. Define ρ(τ) ∈ R1×p to be the jth row of (I+ηA0)τ . Let Φj ∈ Rn×(n+m) be defined as,\nΦj =   ρ(m) ρ(m− 1) . . . ρ(1) ρ(0) 0 . . . 0 ρ(m+ 1) ρ(m) . . . ρ(2) ρ(1) ρ(0) . . . 0\n... ...\n. . . ...\n... ... . . . 0 ρ(m+ n− 1) ρ(m+ n− 2) . . . ρ(n) ρ(n− 1) ρ(n− 2) . . . ρ(0)\n  ,\n(43)\nLet νl denote the lth eigenvalue of the matrix R(i, j) = 1/2(Φ∗jΦi + Φ ∗ iΦj) ∈ R(n+m)×(n+m) (where i ∈ [p]) and assume σmax ≡ σmax(I + ηA0) < 1 then,\n|νl| ≤ 1\n(1− σmax)2 , (44)\n1\nn\n(n+m)p∑\nl=1\nν2l ≤ 2 (1− σmax)3 ( 1 + 3 2n\n1\n1− σmax\n) . (45)\nProof. The first bound can be proved in a trivial manner. In fact, since for any matrix A and B we have σmax(A+B) ≤ σmax(A) + σmax(B) and σmax(AB) ≤ σmax(A)σmax(B) we can write\nmax l\n|νl| = σmax(1/2(Φ∗jΦi + Φ∗iΦj)) ≤ 1/2(σmax(Φ∗jΦi) + σmax(Φ∗iΦj)) (46)\n≤ σmax(Φ∗iΦj) ≤ σmax(Φi)σmax(Φj) ≤ 1\n(1− σmax)2 , (47)\nwhere in the last inequality we used the fact σmax(Φj) ≤ 1/(1 − σmax). The proof of this is just a copy of the proof of the bound (35) in Lemma A.3.\nBefore we prove the second bound let us introduce some notation to differentiate ρ(τ) associated with Φj from ρ(τ) associated with Φi. Let us call them ρ(τ, j) and ρ(τ, i) respectively. Now notice that Φ∗iΦj can be written as a block matrix\n( Ã D̃\nC̃ B̃\n) (48)\nwhere Ã, B̃, C̃ and D̃ are matrix blocks where each block is a p by p matrix. Ã has p × p blocks, B̃ has n× n blocks, C̃ has n×m blocks and D̃ has m × n blocks. If we index the blocks of each matrix with the indices x, y these can be described in the following way\nÃxy =\nm∑\ns=1\nρ(m− x+ s, i)∗ρ(m− y + s, j) (49)\nB̃xy =\nn−x∑\ns=0\nρ(s, i)∗ρ(s+ x− y, j), x ≥ y (50)\nB̃xy =\nn−y∑\ns=0\nρ(s+ y − x, i)∗ρ(s, j), x ≤ y (51)\nC̃xy =\nn−x∑\ns=0\nρ(s, i)∗ρ(m− y + x+ s, j) (52)\nD̃xy =\nn−y∑\ns=0\nρ(m− x+ y + s, i)∗ρ(s, j). (53)\nWith this in mind and denoting by A,B,C and D the symmetrized versions of these same matrices (e.g.: A = 1/2(Ã+ Ã∗)) we can write,\n(n+m)p∑\nl=1\nν2l = Tr(R(i, j) 2) = Tr(A2) + Tr(B2) + 2Tr(CD). (54)\nWe now compute a bound for each one of the terms. We exemplify in detail the calculation of the first bound only. First write,\nTr(A2) =\nm∑\nx=1\nm∑\ny=1\nTr(AxyA ∗ xy). (55)\nNow notice that each Tr(AxyA∗xy) is a sum over τ1, τ2 ∈ [p] of terms of the type,\n(ρ(m− x+ τ1, i)∗ρ(m− y + τ1, j) + ρ(m− x+ τ1, j)∗ρ(m− y + τ1, i))× (56) ×(ρ(m− y + τ2, j)∗ρ(m− x+ τ2, i) + ρ(m− y + τ2, i)∗ρ(m− x+ τ2, j)). (57)\nThe trace of a matrix of this type can be easily upper bounded by\n(σmax) m−x+τ1+m−y+τ1+m−y+τ2+m−x+τ2 = (σmax) 2(m−x)+2(m−y)+2τ1+2τ2 (58)\nwhich finally leads to\nTr(A2) ≤ 1 (1 − σmax)4 . (59)\nDoing a similar thing to the other terms leads to\nTr(B2) ≤ n,n∑\nx,y\n∑\nτ1,τ2\nσ2τ1+2τ2+2|x−y|max ≤ 2n\n(1− σmax)3 (60)\nTr(DC) =\nm∑\nx=1\nn∑\ny=1\nTr(CxyDyx) ≤ m,n,n−y,n−y∑\nx,y,τ1,τ2\nσ2(m−x)+2y+2τ1+2τ2max ≤ 1\n(1− σmax)4 . (61)\nPutting all these together leads to the desired bound.\nProof of Proposition 4.2: We will start by proving that this exact same bound holds when the probability of the event {‖ĜS‖∞ > ǫ} is computed with respect to a trajectory {x(t)}nt=0 that is initiated at instant t = −m with the value w(−m). In other words, x(−m) = w(−m). Assume we have done so. Now notice that as m → ∞, X converges in distribution to n consecutive samples from the model (6) when this is initiated from stationary state. Since ‖ĜS‖∞ is a continuous function of X = [x(0), ..., x(n − 1)], by the Continuous Mapping Theorem, ‖ĜS‖∞ converges in distribution to the corresponding random variable in the case when the trajectory {x(i)}ni=0 is initiated from stationary state. Since the probability bound does not depend on m we have that this same bound holds for stationary trajectories too.\nWe now prove our claim. Recall that Ĝj = (XjW ∗r )/(nη). Since X is a linear function of the independent gaussian random variables W we can write XjW ∗r = ηz\n∗R(j)z, where z ∈ Rp(n+m+1) is a vector of i.i.d. N(0, 1) random variables and R(j) ∈ Rp(n+m+1)×p(n+m+1) is the symmetric matrix defined in Lemma A.3.\nNow apply the standard Bernstein method. First by union bound we have\nP { ‖ĜS‖∞ > ǫ } ≤ 2|S| max j∈S P { z∗R(j)z > nǫ } .\nNext denoting by {νi}1≤i≤p(n+m+1) the eigenvalues of R(j), we have, for any γ > 0,\nP { z∗R(j)z > nǫ } = P\n{ p(n+m+1)∑\ni=1\nνiz 2 i > nǫ\n}\n≤ e−nγǫ p(n+m+1)∏\ni=1\nE { eγνiz 2 i }\n= exp  −n ( γǫ+ 1\n2n\n(n+m+1)p∑\ni=1\nlog(1− 2νiγ) )   .\nLet γ = 12 (1−σmax)ǫ. Using the bound obtained for |maxi νi| in Eq. (35), Lemma A.3, |2νiγ| ≤ ǫ. Now notice that if |x| < 1/2 then log(1 − x) > −x − x2. Thus, if we assume ǫ < 1/2 and given\nthat ∑(n+m+1)p\ni=1 νi = 0 (see Eq. (34)) we can continue the chain of inequalities,\nP(‖ĜS‖∞ > ǫ) ≤ 2|S|max j exp\n −n(γǫ− 2γ2 1\nn\n(n+m+1)p∑\ni=1\nν2i )\n  (62)\n≤ 2|S| exp ( −n(1\n2 (1− σmax)ǫ2 −\n1 4 (1− σmax)2ǫ2(1 − σmax)−1)\n) (63)\n≤ 2|S| exp ( −n 4 (1− σmax)ǫ2 ) . (64)\nwhere the second inequality is obtained using the bound in Eq. (36).\nProof of Proposition 4.3: The proof is very similar to that of proposition 4.2. We will first show that the bound\nP(|Q̂ij − E(Q̂ij)| > ǫ) ≤ 2e− n 32η2 (1−σmax) 3ǫ2 , (65)\nholds in the case where the probability measure and expectation are taken with respect to trajectories {x(i)}ni=0 that started at time instant t = −m with x(−m) = w(−m). Assume we have done so. Now notice that as m → ∞, X converges in distribution to n consecutive samples from the model 6 when this is initiated from stationary state. In addition, as m → ∞, we have from lemma A.5 that E(Q̂ij) → Q0ij . Since Q̂ij is a continuous function of X = [x(0), ..., x(n−1)], a simple application of the Continuous Mapping Theorem plus the fact that the upper bound is continuous in ǫ leads us to conclude that the bound also holds when the system is initiated from stationary state.\nTo prove our previous statement first recall the definition of Q̂ and notice that we can write,\nQ̂ij = η\nn z∗R(i, j)z, (66)\nwhere z ∈ Rm+n is a vector of i.i.d. N(0, 1) and R(i, j) ∈ R(n+m)×(n+m) is defined has in lemma A.4. Letting νl denote the lth eigenvalue of the symmetric matrix R(i, j) we can further write,\nQ̂ij − E(Q̂ij) = η\nn\n(n+m)p∑\nl=1\nνl(z 2 l − 1). (67)\nBy Lemma A.4 we know that,\n|νl| ≤ 1\n(1− σmax)2 , (68)\n1\nn\n(n+m)p∑\nl=1\nν2l ≤ 2 (1− σmax)3 ( 1 + 3 2n\n1\n1− σmax\n) ≤ 3\n(1− σmax)3 , (69)\nwhere we applied T > 3/D in the last line.\nNow we are done since applying Bernstein trick, this time with γ = 1/8 (1−σmax)3ǫ/η, and making again use of the fact that log(1− x) > −x− x2 for |x| < 1/2 we get,\nP(Q̂ij − E(Q̂ij) > ǫ) = P( (n+m)p∑\nl=1\nνl(z 2 l − 1) > ǫn/η) (70)\n≤ e− γǫn η e−γ ∑(n+m)p l=1 νl + e−1/2 ∑(m+n)p l=1 log(1−2γνl) (71)\n≤ e− γǫn η\n−γ ∑(n+m)p l=1 νl+γ ∑(n+m)p l=1 νl+2γ 2 ∑(n+m)p\nl=1 ν 2 l (72)\n≤ e− n 32η2 (1−σmax) 3ǫ2 , (73)\nwhere had to assume that ǫ < 2/D in order to apply the bound on log(1 − x). An analogous reasoning leads us to,\nP(Q̂ij − E(Q̂ij) < −ǫ) ≤ e− n 32η2 (1−σmax) 3ǫ2 (74)\nand the results follows.\nLemma A.5. As before, assume σmax ≡ σmax(I + ηA0) < 1 and consider that model (6) was initiated at time −m with w(−m), that is, x(−m) = w(−m) then\n|E(Q̂ij)−Q0ij | ≤ 1\nn+m\nη\n(1 − σmax)2 . (75)\nProof. Let ρ = I + ηA0. Since,\nQ0ij = η\n∞∑\nl=0\n(ρlρ∗l)ij , (76)\nand\nE(Q̂ij) = η\nn+m−1∑\nl=0\nm+ n− l n+m (ρlρ∗l)ij , (77)\nwe can write,\nQ0ij − E(Q̂ij) = η ( ∞∑\nl=m+n\n(ρlρ∗l)ij +\nn+m−1∑\nl=1\nl\nm+ n (ρlρ∗l)ij\n) . (78)\nUsing the fact that for any matrix A and B maxij(Aij) ≤ σmax(A), σmax(AB) ≤ σmax(A)σmax(B) and σmax(A + B) ≤ σmax(A) + σmax(B) and introducing the notation ζ = ρ2 we can write,\n|E(Q̂ij)−Q0ij | ≤ η ( ζn+m\n1− ζ + ζ n+m\nm+n−2∑\nl=0\nζl ) =\nη(ζ2 + ζn+m − 2ζm+n+1) (m+ n)(1− ζ)2 (79)\n≤ η (m+ n)(1 − σmax)2 , (80)\nwhere we used the fact that for ζ ∈ [0, 1] and n ∈ N we have 1−ζ ≥ 1− √ ζ and ζ2+ζn−2ζ1+n ≤ 1.\nProof of Theorem 3.1:\nIn order to prove Theorem 3.1 we need to compute the probability that the conditions given by Proposition 4.1 hold. From the statement of the theorem we have that the first two conditions (α,Cmin > 0) of Proposition 4.1 hold. In order to make the first condition on Ĝ imply the second condition on Ĝ we assume that\nλα 3 ≤ AminCmin 4k − λ (81)\nwhich is guaranteed to hold if λ ≤ AminCmin/8k. (82)\nWe also combine the two last conditions on Q̂ to\n|||Q̂[p],S0 −Q0[p],S0|||∞ ≤ α\n12 Cmin√ k . (83)\nWhere [p] = S0 ∪ (S0)c. We then impose that both the probability of the condition on Q̂ failing and the probability of the condition on Ĝ failing are upper bounded by δ/2. Using Proposition 4.2 we see that the condition on Ĝ fails with probability smaller than δ/2 given that the following is satisfied\nλ2 = 36α−2(nηD)−1 log(4p/δ). (84)\nBut we also want (82) to be satisfied and so substituting λ from the previous expression in (82) we conclude that n must satisfy\nn ≥ 2304k2Cmin−2Amin−2α−2(Dη)−1 log(4p/δ). (85)\nIn addition, the application of the probability bound in Proposition 4.2 requires that\nλ2α2\n9 < 1/4 (86)\nso we need to impose further that,\nn ≥ 16(Dη)−1 log(4p/δ). (87) To use Corollary 4.4 for computing the probability that the condition on Q̂ holds we need,\nnη > 3/D, (88)\nand αCmin\n12 √ k < 2kD−1. (89)\nThe last expression imposes the following conditions on k,\nk3/2 > 24−1αCminD. (90)\nThe probability of the condition on Q̂ will be upper bounded by δ/2 if\nn > 4608η−1k3α−2Cmin −2D−3 log 4pk/δ. (91)\nThe restriction (90) on k looks unfortunate but since k ≥ 1 we can actually show it always holds. Just notice α < 1 and that\nσmax(Q 0 S0,S0) ≤ σmax(Q0) ≤\nη\n1− σmax ⇔ D ≤ σ−1max(Q0S0,S0) (92)\ntherefore CminD ≤ σmin(Q0S0,S0)/σmax(Q0S0,S0) ≤ 1. This last expression also allows us to simplify the four restrictions on n into a single one that dominates them. In fact, since CminD ≤ 1 we also have C−2minD\n−2 ≥ C−1minD−1 ≥ 1 and this allows us to conclude that the only two conditions on n that we actually need to impose are the one at Equations (85), and (91). A little more of algebra shows that these two inequalities are satisfied if\nnη > 104k2(kD−2 +A−2min)\nα2DC2min log(4pk/δ). (93)\nThis conclude the proof of Theorem 3.1.\nLemma A.6. Let σmax ≡ σmax(I + ηA0) and ρmin(A0) = −λmax((A0 + (A0)∗)/2) > 0 then,\n−λmin ( A0 + (A0)∗\n2\n) ≥ lim sup\nη→0\n1− σmax η , (94)\nlim inf η→0 1− σmax η\n≥ −λmax ( A0 + (A0)∗\n2\n) . (95)\nProof.\n1− σmax η = 1− λ1/2max((I + ηA0)∗(I + ηA0)) η (96)\n= 1− λ1/2max(I + η(A0 + (A0)∗) + η2(A0)∗A0)\nη (97)\n= 1− (1 + ηu∗(A0 + (A0)∗ + η(A0)∗A0)u)1/2\nη , (98)\nwhere u is some unit vector that depends on η. Thus, since √ 1 + x = 1 + x/2 +O(x2),\nlim inf η→0 1− σmax η = − lim sup η→0\nu∗ ( A0 + (A0)∗\n2\n) u ≥ −λmax ( A0 + (A0)∗\n2\n) . (99)\nThe other inequality is proved in a similar way.\nProof of Theorem 2.1:\nIn order to prove Theorem 2.1 we first state and prove the following lemma,\nLemma A.7. Let G be a simple connected graph of vertex degree bounded above by k. Let Ã be its adjacency matrix and A0 = −hI + Ã with h > k then for this A0 the system in (1) has Q0 = −(1/2)(A0)−1 and,\n|||Q0(S0)C ,S0(Q0S0,S0)−1|||∞ = |||(A0(S0)C ,(S0)C )−1A0(S0)C ,S0 |||∞ ≤ k/h. (100)\nProof. Ã is symmetric so A0 is symmetric. Since Ã is irreducible and non-negative, PerronFrobenious theorem tells that λmax(Ã) ≤ k and consequently λmax(A0) ≤ −h + λmax(Ã) ≤ −h + k. Thus h > k implies that A0 is negative definite and using equation (4) we can compute Q0 = −(1/2)(A0)−1. Now notice that, by the block matrix inverse formula, we have\n(Q0S0,S0) −1 = −2C−1, (101)\nQ0(S0)C ,S0 = 1\n2 ((A0(S0)C ,(S0)C ) −1A0(S0)C ,S0C), (102)\nwhere C = A0S0,S0 −A0S0,(S0)C (A0(S0)C ,(S0)C )−1A0(S0)C ,S0 and thus\n|||Q0(S0)C ,S0(Q0S0,S0)−1|||∞ = |||(A0(S0)C ,(S0)C )−1A0(S0)C ,S0 |||∞. (103)\nRecall the definition of |||B|||∞, |||B|||∞ = max\ni\n∑\nj\n|Bij |. (104)\nLet z = h−1 and write,\n(A0(S0)C ,(S0)C ) −1 = −z(I − zÃ(S0)C ,(S0)C )−1 = −z\n∞∑\nn=0\n(zÃ(S0)C ,(S0)C ) n, (105)\nA0(S0)C ,S0 = z −1zÃ(S0)C ,S0 . (106)\nThis allows us to conclude that |||(A0(S0)C ,(S0)C )−1A0(S0)C ,S0 |||∞ is in fact the maximum over all path generating functions of paths starting from a node i ∈ (S0)C and hitting S0 for a first time. Let Ωi denote this set of paths, ω a general path in G and |ω| its length. Let k1, ..., k|ω| denote the degree of each vertex visited by ω and note that km ≤ k, ∀m. Then each of these path generating functions can be written in the following form,\n∑\nω∈Ωi\nz|ω| ≤ ∑\nω∈Ωi\n1\nk1...k|ω| (kz)|ω| = EG((kz) Ti,S0 ), (107)\nwhere Ti,S0 is the first hitting time of the set S0 by a random walk that starts at node i ∈ S0C and moves with equal probability to each neighboring node. But Ti,S0 ≥ 1 and kz < 1 so the previous expression is upper bounded by kz.\nNow what remains to complete the proof of Theorem 2.1 is to compute the quantities α, Amin, ρmin(A\n0) and Cmin in Theorem 1.1 . From Lemma A.7 we know that α = 1− k/(k+m). Clearly, Amin = 1. We also have that ρmin(A0) = σmin(A0) ≥ k + m − σmax(Ã) ≥ m + k − k = m. Finally,\nλmin(Q 0 S0,S0) =\n1 2 λmin(−(A0)−1) = 1 2\n1 λmax(−A0) ≥ 1 2\n1 m+ k + k ≥ 1 4(m+ k) (108)\nwhere in the last step we made use of the fact that m + k > k. Substituting these values in the inequality from Theorem 1.1 gives the desired result."
    } ],
    "references" : [ ],
    "referenceMentions" : [ ],
    "year" : 2010,
    "abstractText" : "We consider linear models for stochastic dynamics. To any such model can be as-<lb>sociated a network (namely a directed graph) describing which degrees of freedom<lb>interact under the dynamics. We tackle the problem of learning such a network<lb>from observation of the system trajectory over a time interval T .<lb>We analyze the l1-regularized least squares algorithm and, in the setting in which<lb>the underlying network is sparse, we prove performance guarantees that are uni-<lb>form in the sampling rate as long as this is sufficiently high. This result substan-<lb>tiates the notion of a well defined ‘time complexity’ for the network inference<lb>problem. keywords: Gaussian processes, model selection and structure learning, graphical models, sparsity<lb>and feature selection.",
    "creator" : "LaTeX with hyperref package"
  }
}