{
  "name" : "1106.3395.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Decoding finger movements from ECoG signals using switching linear models",
    "authors" : [ "Rémi Flamary" ],
    "emails" : [ "remi.flamary@insa-rouen.fr", "alain.rakoto@insa-rouen.fr" ],
    "sections" : [ {
      "heading" : null,
      "text" : "ar X\niv :1\n10 6.\n33 95\nv1 [\ncs .L\nG ]\n1 7\nJu n"
    }, {
      "heading" : "1 Introduction",
      "text" : "Some people who suffer some neurological diseases can be highly paralyzed because they do not have anymore control on their muscles. Therefore, their only way to communicate is by using their electroencephalogram signals. BrainComputer interfaces (BCI) research aim at developing systems that help those disabled people communicating with machines. Non-invasive BCIs have recently received a lot of interest because of their easy protocol for sensors implantation on the scalp surface [1,2]. Furthermore, although the electroencephalogram signals have been recorded through the skull, those BCI have shown great performance capabilities, and can be used by real Amyotrophic Lateral Sclerosis (ALS) patients [3,4].\nHowever, non-invasive recordings still show some drawbacks including poor signal to noise ratio and poor spatial resolution. Hence, in order to overcome these difficulties, invasive BCI may be used. For instance, Electrocorticographic recordings (ECoG) have recently received a great amount of interest owing to their semi-invasive nature as they are recorded from the cortical surface. Indeed, they offer higher spatial resolution and they are far less sensitive to artifact noise. Feasibility of invasive-based BCI have been proven by several recent papers [5,6,7,8]. In many of these papers, the BCI paradigm considered is motor imagery yielding thus to a binary decision BCI.\nA recent breakthrough has been made by Schalk et al. [9] which has proven that ECoG recordings can lead to multiple-degree BCI control. Followed by\nPistohl et al. [10], these two works have considered the problem of predicting arm movements from ECoG signals. Both approaches are based on estimating a linear relation between features extracted from ECoG signals and the actual arm movement.\nIn this work, we investigate a finer degree of resolution in BCI control by addressing the problem of estimating finger flexions through ECoG signals. Indeed, we propose in this paper a method for decoding finger movements from ECoG data based on switching models. The underlying idea of switching models is the hypothesis that movements of each of the five fingers are triggered by an internal discrete state that can be estimated and that all finger movements depend on that internal state. While such an idea of switching models have already been successfully used for arm movement prediction on monkeys from micro-electrode array measures [11], here, we develop a specific approach adapted to finger movements. The global method has been tested on the 4th Dataset of the BCI Competition IV[12].\nThe paper is organized as follows : First, we present the dataset from the BCI Competition IV used in this paper, then we explain our decoding method used to obtain finger flexion from ECoG signals. Finally we present the results obtained with our method and we discuss several ways of improving them."
    }, {
      "heading" : "2 Dataset",
      "text" : "For this work, the fourth dataset from the BCI Competition IV [12] was used. The subjects were 3 epileptic patients who had platinium electrode grids placed on the surface of their brain. The number of electrodes vary between 48 to 64 depending on the subject and their position on the cortex was unknown.\nElectrocorticographic (ECoG) signals of the subject were recorded at a 1KHz sampling using BCI2000 [13]. A band-pass filter from 0.15 to 200Hz was applied to the ECoG signals. The finger flexion of the subject was recorded at 25Hz and up-sampled to 1KHz. Due to the acquisition process, a delay appears between the finger movement and the measured ECoG signal. To correct this time-lag we apply the 37 ms delay proposed in the dataset description [12] to the ECoG signals.\nThe BCI Competition dataset consists in a 10 minutes recording per subject. 6 minutes 40 seconds (400,000 samples) were given for the learning models and the remaining 3 minutes 20 seconds (200,000 samples) were used for testing. However, since the finger flexion signals have been up-sampled and thus are partly composed of artificial samples, we have down-sampled the number of points by a factor of 4 leading to a training set of size 100,000 and a testing set of size 50,000. The 100,000 samples provided for learning have been splitted in a training (75,000) and validation set (25,000). Then, all parameters of the approach have been optimized in order to maximize the performance on the validation set. Note that all results presented in the paper have been obtained using the testing set provided by the competition (after up-sampling then back by a factor of 4).\nIn this competition, method performance was measured through the crosscorrelation between the measured and the estimated finger flexion. The correlation were averaged across fingers and across subject to obtain the overall method performance. Note that the fourth finger was not used for evaluation in the competition since its movements were proven to be correlated with the other one movements [12]."
    }, {
      "heading" : "3 Finger flexion decoding using switching linear models",
      "text" : "This section presents the full methodology we have used for addressing the problem of estimating finger flexions from ECoG signals. In the first part, we propose an overview of the switching models. Then, we describe how we learn the function that estimates which finger is about to move. Afterwards, we detail the linear models associated to each moving finger. Finally, we briefly detail how the complete method works in the decoding stage."
    }, {
      "heading" : "3.1 Overview",
      "text" : "In order to obtain an efficient prediction of finger flexions, we have made the hypothesis that for such movements the brain can be understood as a switching model. This translates into the assumption that the measured ECoG signals and the finger movements are intrinsically related by an internal state k. In our case, this state corresponds to each finger moving, k = 1 for the thumb to k = 5 for the baby finger or k = 6 for no finger movement. Here, we used mutually-exclusive states because the experimental set-up considered specifies that only one or no finger is moving. Figure 1 gives the picture of our finger movement decoding scheme. Basically, the idea is that based on some features extracted from the ECoG signals, the internal hidden state triggering the switching finger models can be estimated. Then, this state allows the system to select an appropriate model Hk(x̃) for estimating all finger flexions, with x̃ being a feature vector.\nFor the complete model, we need to estimate the function f(·) that maps the ECoG features to an internal state k ∈ {1, · · · , 6} and the functions Hk(·) that relates the brain signals to all finger flexion amplitudes. The next paragraphs present how we have modeled these functions and how we have estimated them from the data."
    }, {
      "heading" : "3.2 Moving finger estimation",
      "text" : "The methodology used for learning the f(·) function which estimates the moving finger is given in the sequel.\nFeature extraction For this problem of estimating the moving finger, the features we used are based on smoothed Auto-Regressive (AR) coefficient of the signal. The global overview of the feature extraction procedure is given in\nFigure 2. For a single channel, the procedure is the following. The signal from that channel is divided in non-overlapping window of 300 samples. For each window, an auto-regressive model has been estimated. Thus, AR coefficients are obtained at every 300 samples (denoted by the vertical dashed line and the cross in Figure 2). In order to have a continuous AR coefficients value, a smoothing spline-based interpolation between two consecutive AR coefficients has been used. Note that instead of interpolating, we could have computed the AR coefficients at each time instant, however, the approach we propose here has the double advantage of being less-computationally demanding and of providing some smoothed (and thus more robust to noise) AR coefficients. Finally, only the two first AR coefficients are used as features. Signal dynamics have been taken into account by applying a similar procedure to shifted version of the signal at (+ts and −ts). Hence, for measurements involving 48 channels, the feature vector at a time instant t is obtained by concatenating features extracted from all channels, leading to a resulting vector of size 48× 3× 2 = 240.\nChannel Selection Actually, we do not consider in the model all the channels. Indeed, a channel selection algorithm has been run in order to reduce the number\nof channels. For this channel selection procedure, the feature vector xt at time t has been computed as described above, except that we have not considered the shifted signal versions and used only the first AR coefficient.\nThen, for each finger, based on the training set, we estimated a linear regression y = xtck where x ∈ R\nchan is a feature vector of number of channels dimension, y = {1,−1} stating if the considered finger is moving or not. Once, we have estimated the coefficient vector ck for each finger, we selected the K channels that present the largest values of :\n6∑\nk=1\n|ck|\nwhere the absolute value is considered as element-wise. This channel selection allows us to reduce substantially the number of channels so as to minimize the computational effort needed for estimating and evaluating the function f(·) and it yields better performance. K has been chosen so that the cross-correlation on the validation set is maximal.\nModel estimation The model for estimating which finger is moving is a more sophisticated version of the one used above for channel selection. At first, since the finger movements are mutually-exclusive, we have considered a winner-takesall strategy :\nf(x) = argmax k=1,··· ,6 fk(x) (1)\nHere again, fk(x) is a linear model that is trained by presenting couples of feature vector and a state y = {1,−1}. The main differences between the channel selection procedure and the one used for learning fk(·) are that : the features here take into account some dynamics of the ECoG signals and a finer feature selection has been performed by means of a simultaneous sparse approximation method.\nLet us consider the training examples {xt,yt} ℓ t=1 where xt ∈ R d, yt,k = {1,−1}, being the k-th entry of vector yt, t denoting the time instant and k denoting all possible states (including no finger moving). yt,k tells us whether the finger k is moving at time t. Now, let us define the matrix Y, X and C as :\n[Y]t,k = yt,k [X]t,j = xt,j [C]j,k = cj,k\nwhere xt,j and cj,k are the j-th components of respectively xt and ck. The aim of simultaneous sparse approximation is to learn the coefficient matrix C while yielding the same sparsity profile in the different finger models. The task boils down to the following optimization problem:x\nĈ = argmin C\n‖Y −XC‖2F + λs ∑\ni\n‖Ci,·‖2 (2)\nwhere λs is a trade-off parameter that has to be appropriately tuned and Ci,· being the i-th row of C. Note that our penalty term is a mixed ℓ1 − ℓ2 norm similar to those used for group-lasso. Owing to the ℓ1 penalty on the ℓ2 row-norm, such a penalty tends to induce row-sparse matrixC. Problem (2) has been solved using the block-coordinate descent algorithm proposed by Rakotomamonjy [14]."
    }, {
      "heading" : "3.3 Learning finger flexion models",
      "text" : "Here, we discuss the model relating the ECoG data and finger movements for every possible values of k. In other words, supposing that a given finger, say the index, is going to move (as predicted by our finger moving estimation), we built an estimation of all finger movements. Hence, for each k, we are going to learn a linear model gk,j(x̃) = x̃ Th (k) j with j = 1, · · · , 5, x̃ a feature vector and h (k) j a weighting vector indexed by the moving finger k and the finger j which flexions are to estimate. We have chosen a linear model since they have been shown to provide good performances for decoding movements from ECoG [10,9].\nAt a time t, the feature vector xt has been obtained by following the same line as Pistohl et al. [10]. Indeed, we use filtered time-samples as features. xt has been built in the following way. All channels have been filtered with a SavitskyGolay (third order, 0.4 s width) low-pass filter. Then, xt is composed of the concatenation of the time samples at t, t− τ and t+ τ for all smoothed signals\nat all channels. Samples at t−τ and t+τ have been used in order to to take into account some temporal delays between the brain activity and finger movements.\nNow, let us detail how, for a given moving finger k, the weight matrix Hk =\n[h (k) 1 · · ·h (k) 5 ] has been learned. For a given finger k, we have used as a training set all samples xt where that finger is known to be moving. For this purpose, we have manually segmented the signals and extracted the appropriate signal segments, needed for building the target matrix Ỹk, which contains all finger positions, and for extracting the feature matrix X̃k. This training samples extraction stage is illustrated on Figure 3. Then for learning the global linear model, we have solved the following multi-dimensional ridge regression problem.\nmin Hk\n‖Ỹk − X̃kHk‖ 2 F + λk‖Hk‖ 2 F (3)\nwith λk being a regularization parameter that has to be tuned.\nFor this problem of finger movements estimation, we also noted that feature selection helps in improving performance. Again, we have used the estimated weighting matrix Ĥ coefficients for pruning the model. Indeed, we have kept in the model the M features which correspond to the M largest entries of vector∑5\ni=1 |ĥ (k) i |. For possible k and subjects, M is chosen as to minimize a validation error. Note that such an approach for pruning model can be interpreted as a shrinkage of a least-square parameters."
    }, {
      "heading" : "3.4 Decoding finger movement",
      "text" : "When all models have been learned, the decoding scheme is the one given in Figure 1. Given the two feature vectors xt and x̃t at a time t, the finger position estimation is obtained as:\nŷ = x̃Tt Ĥk̂ with k̂ = argmax k xttck (4)\nwith ŷ being a row vector containing the estimated finger movement, k̂ the finger that is supposed to move, x̃t the extracted feature at time t and Ĥk̂ the estimated linear model for state k."
    }, {
      "heading" : "4 Results",
      "text" : "In this section we present the performance of our switching model decoder. At first, we explain how all parameters of the models have been set. Then, we present some results which help us understanding the contribution of the different parts of our models, Finally, we evaluate our approach and compare ourselves to the BCI competition results."
    }, {
      "heading" : "4.1 Parameter selection",
      "text" : "The parameters used in the moving finger estimation are selected by a validation method on the last part of the training set (75,000 for the training, 25,000 for validation). We suppose that the size of the set is important enough to avoid over-fitting. Using this method, we select the number of selected channels, the time-lag ts used in feature extraction and the regularization term λs of Eq. (2).\nSimilarly, all parameters(τ , the number of selected channels and λk) needed for estimating Hk have been set so that they optimize the model performance of on the validation sets. For this model selection part, the size of training and validation sets vary according to k and they are summarized in Table 1 for subject 1."
    }, {
      "heading" : "4.2 Evaluating of the linear models Hk",
      "text" : "Models Hk correspond to the linear regressions between the ECoG features and the finger flexions when the k-th finger is moving. The signals used for evaluating these models are extracted in the same manner as the learning sets yk and X̃k (see Figure 4) but by assuming that the true segmentation of finger movements are known. To evaluate these models, we measure the cross-correlation between the true yk and estimated finger flexion X̃kĥ k k only when the finger k is moving. The correlations can be seen on Table 2. We observe that by using a linear regression between the ECoG signals and the finger flexions, we achieve a correlation of 0.46 (averaged across fingers and subjects). This results correspond to those obtained for the arm trajectory prediction (Schalk [9] obtained 0.5 and Pistohl [10] obtained 0.43)."
    }, {
      "heading" : "4.3 Evaluating the switching decoder method",
      "text" : "In order to evaluate the efficiency of the switching model decoder and each block of the decoder contribution. We report three different results: first, for a given finger, we compute the estimated finger flexion using a linear model learned on all samples (including those where the considered finger is not moving), then we decode finger flexions with our switching decoder while assuming that the exact sequence of hidden states is known1 and finally we use our switching decoder with the estimated hidden states.\nFor a sake of baseline comparison with our switching models decoder, we have estimated the finger flexions by means of a single linear model which has been trained using all the time samples. The obtained correlation are given in Table 3a and the regression result can be seen on the upper plots of Figure 5. We can see that the correlation obtained are rather low due the fact that without switching models the amplitude of the flexion signals remains small.\nThe switching model decoder is a two-part process as it requires to have the linear models Hk and the sequence of hidden states. First we apply the decoder using the true sequence obtained thanks to the actual finger flexion. Suppose that we have the exact sequence k and we apply the switching decoder with this sequence. We know that these results may never be attained as it supposes the sequence labeling method to be perfect but it gives a interesting idea of the maximal performance that our method can provide for given linear models Hk. Results can be seen in the middle plots of Figure 5 and correlations are in Table 3b. We obtain a high accuracy accross all subjects with an average correlation of 0.61 when using an exact sequence. This proves that the switching model can be efficiently used for decoding ECoG signals. Note that by using switching linear models, we include a switching mean that induce a high accuracy of correlation.\n1 This is possible since the finger movements on the test set are now available\nFinally, we use our global method for obtaining the finger movement estimation. In other words, we used the switching models Hk to decode the signals with Equation (4) and the estimated sequence k̂. The finger movement estimation can be seen on the lower plot of Figure 5b and the correlation measures are in Table 3c. As expected, the accuracy is lower than the one obtained with the true segmentation. However, we obtained an average correlation of 0.42 which is far better than when using a global regression approach. These predictions of the finger flexions were presented in the BCI Competition and achieved the second place. Note that the last 3 fingers have the lowest correlation. Those one are highly physically correlated and they are much more difficult to discriminate than the two first ones. The first finger is by far the best estimated one as we obtained a correlation averaged accross subject of 0.56 ."
    }, {
      "heading" : "4.4 Discussion and future works",
      "text" : "The results presented in the previous section corresponds to the method used for the BCI Competition.\nWe first note that the best performance obtained by Liang et al. [15] gives a correlation of about 0.46. Their method considers an amplitude modulation along time to cope with the abrupt change in the finger flexions amplitude along time. Such an approach is somewhat similar to ours since they try to distinguish situations where fingers are moving or not.\nThen, we believe that our approach can be improved in several ways.\nIndeed, we choose to use linear models depending on the internal states, but [10] proposed to use a kalman filter for the decoding of movement. This\napproach may be extended to using switching kalman filters in the switching model decoder.\nFurthermore, our approach for estimating the sequence of hidden states can be highly improved. Liang [15] proposed to use Power Spectral Densities of the ECoG channel as features and we believe that these features may be added and used in the sequence labeling. In our method the features are low-pass filtered in order to increase recognition performance, but other sequence labeling methods like HMM [11] have been used in BCI. Other sequence labeling methods like Conditional Random Fields [16] known to outperform HMM in some case or Sequence SVM [17] may be used to get a better sequence of hidden states.\nAnother interesting approach that may be investigated is the mixture of sources approach. Indeed, one may considered that each moving finger is associated to a source of ECoG signals. Then, the problem of identifying which finger is moving may boil down to a source separation problem."
    }, {
      "heading" : "5 Conclusions",
      "text" : "In this paper, we present a method for the decoding finger flexions from ECoG signals. The decoder is based on switching linear models. Our approach has been tested on a the BCI Competition IV Dataset 4 and achieved the second place in the competition. Results show that the switching model approach produce\nbetter result than using a unique model. Furthermore an accurate finger flexion estimation may be achieved when using an exact sequence of hidden states showing the interest of the switching models.\nIn future works, we plan to improve the result of the switching models decoder by two different approaches. On the one hand, we can use more general models than linear ones for the movement prediction (switching kalman filters, nonlinear regression). On the other hand we can improve the sequence labeling along time with new approach and by using new features extracted from the ECoG signals."
    } ],
    "references" : [ {
      "title" : "Control of a two-dimensional movement signal by a noninvasive brain-computer interface in humans",
      "author" : [ "J.R. Wolpaw", "D.J. McFarland" ],
      "venue" : "Proceedings of the National Academy of Sciences of the United States of America 101(51)",
      "citeRegEx" : "1",
      "shortCiteRegEx" : null,
      "year" : 2004
    }, {
      "title" : "The BCI competition 2003: progress and perspectives in detection and discrimination of EEG single trials",
      "author" : [ "B. Blankertz", "K.R. Muller", "G. Curio", "T. Vaughan", "G. Schalk", "J. Wolpaw", "A. Schlogl", "C. Neuper", "G. Pfurtscheller", "T. Hinterberger", "M. Schroder", "N. Birbaumer" ],
      "venue" : "IEEE Transactions on Biomedical Engineering 51(6)",
      "citeRegEx" : "2",
      "shortCiteRegEx" : null,
      "year" : 2004
    }, {
      "title" : "A p300-based brain-computer interface: Initial tests by als patients",
      "author" : [ "E. Sellers", "E. Donchin" ],
      "venue" : "Clinical Neurophysiology 117(3)",
      "citeRegEx" : "3",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "A braincomputer interface for people with amyotrophic lateral sclerosis",
      "author" : [ "F. Nijboer", "E. Sellers", "J. Mellinger", "M. Jordan", "T. Matuz", "A. Furdea", "U. Mochty", "D. Krusienski", "T. Vaughan", "J. Wolpaw", "N. Birbaumer", "A. Kubler" ],
      "venue" : "Clinical Neurophysiology 119(8)",
      "citeRegEx" : "4",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "A brain-computer interface using electrocorticographic signals in humans",
      "author" : [ "G.S.E. Leuthardt", "J. Wolpaw", "J. Ojemann", "D. Moran" ],
      "venue" : "Journal of Neural Engineering 1",
      "citeRegEx" : "5",
      "shortCiteRegEx" : null,
      "year" : 2004
    }, {
      "title" : "Classifying eeg and ecog signals without subject training for fast bci implementation: Comparison of non-paralysed and completely paralysed subjects",
      "author" : [ "N. Hill", "T. Lal", "M. Schroeder", "T. Hinterberger", "B. Wilhem", "F. Nijboer", "U. Mochty", "G. Widman", "C. Elger", "B. Scholkoepf", "A. Kuebler", "N. Birbaumer" ],
      "venue" : "IEEE Transactions on Neural Systems and Rehabilitation Engineering 14(2)",
      "citeRegEx" : "6",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Classifying Event-Related Desynchronization in EEG, ECoG and MEG signals",
      "author" : [ "N. Hill", "T. Lal", "M. Tangermann", "T. Hinterberger", "G. Widman", "Elger", "B. Scholkoepf", "N. Birbaumer" ],
      "venue" : "Toward Brain-Computer Interfacing. MIT Press",
      "citeRegEx" : "7",
      "shortCiteRegEx" : null,
      "year" : 2007
    }, {
      "title" : "Generalized features for electrocorticographic bci",
      "author" : [ "P. Shenoy", "K. Miller", "J. Ojemann", "R. Rao" ],
      "venue" : "IEEE Trans. On Biomedical Engineering 55",
      "citeRegEx" : "8",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "Decoding twodimensional movement trajectories using electrocorticographic signals in humans",
      "author" : [ "G. Schalk", "J. Kubanek", "K.J. Miller", "N.R. Anderson", "E.C. Leuthardt", "J.G. Ojemann", "D. Limbrick", "D. Moran", "L.A. Gerhardt", "J.R. Wolpaw" ],
      "venue" : "Journal of Neural Engineering 4(3)",
      "citeRegEx" : "9",
      "shortCiteRegEx" : null,
      "year" : 2007
    }, {
      "title" : "Prediction of arm movement trajectories from ecog-recordings in humans",
      "author" : [ "T. Pistohl", "T. Ball", "A. Schulze-Bonhage", "A. Aertsen", "C. Mehring" ],
      "venue" : "Journal of Neuroscience Methods 167(1)",
      "citeRegEx" : "10",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "Independently coupled hmm switching classifier for a bimodel brainmachine interface",
      "author" : [ "S. Darmanjian", "S.P. Kim", "M.C. Nechyba", "J. Principe", "J. Wessberg", "M.A.L. Nicolelis" ],
      "venue" : "Machine Learning for Signal Processing, 2006. Proceedings of the 2006 16th IEEE Signal Processing Society Workshop on.",
      "citeRegEx" : "11",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Prediction of finger flexion: 4th brain-computer interface data competition",
      "author" : [ "K.J. Miller", "G.Shalk" ],
      "venue" : "BCI Competition IV",
      "citeRegEx" : "12",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "Bci2000: a general-purpose brain-computer interface (bci) system",
      "author" : [ "G. Schalk", "D. McFarland", "T. Hinterberger", "N. Birbaumer", "J. Wolpaw" ],
      "venue" : "Biomedical Engineering, IEEE Transactions on 51(6)",
      "citeRegEx" : "13",
      "shortCiteRegEx" : null,
      "year" : 2004
    }, {
      "title" : "Algorithms for multiple basis pursuit denoising",
      "author" : [ "A. Rakotomamonjy" ],
      "venue" : "Workshop on Sparse Approximation.",
      "citeRegEx" : "14",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "Decoding finger flexion using amplitude modulation from band-specific ecog",
      "author" : [ "N. Liang", "L. Bougrain" ],
      "venue" : "European Symposium on Artificial Neural Networks ESANN.",
      "citeRegEx" : "15",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "Conditional random fields: Probabilistic models for segmenting and labeling sequence data",
      "author" : [ "J. Lafferty", "A.McCallum", "F. Pereira" ],
      "venue" : "Proc. 18th International Conf. on Machine Learning.",
      "citeRegEx" : "16",
      "shortCiteRegEx" : null,
      "year" : 2001
    }, {
      "title" : "Sequence labelling svms trained in one pass",
      "author" : [ "A. Bordes", "N. Usunier", "L. Bottou" ],
      "venue" : "In Daelemans, W., Goethals, B., Morik, K., eds.: Machine Learning and Knowledge Discovery in Databases: ECML PKDD 2008. Lecture Notes in Computer Science, LNCS 5211, Springer",
      "citeRegEx" : "17",
      "shortCiteRegEx" : null,
      "year" : 2008
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "Non-invasive BCIs have recently received a lot of interest because of their easy protocol for sensors implantation on the scalp surface [1,2].",
      "startOffset" : 136,
      "endOffset" : 141
    }, {
      "referenceID" : 1,
      "context" : "Non-invasive BCIs have recently received a lot of interest because of their easy protocol for sensors implantation on the scalp surface [1,2].",
      "startOffset" : 136,
      "endOffset" : 141
    }, {
      "referenceID" : 2,
      "context" : "Furthermore, although the electroencephalogram signals have been recorded through the skull, those BCI have shown great performance capabilities, and can be used by real Amyotrophic Lateral Sclerosis (ALS) patients [3,4].",
      "startOffset" : 215,
      "endOffset" : 220
    }, {
      "referenceID" : 3,
      "context" : "Furthermore, although the electroencephalogram signals have been recorded through the skull, those BCI have shown great performance capabilities, and can be used by real Amyotrophic Lateral Sclerosis (ALS) patients [3,4].",
      "startOffset" : 215,
      "endOffset" : 220
    }, {
      "referenceID" : 4,
      "context" : "Feasibility of invasive-based BCI have been proven by several recent papers [5,6,7,8].",
      "startOffset" : 76,
      "endOffset" : 85
    }, {
      "referenceID" : 5,
      "context" : "Feasibility of invasive-based BCI have been proven by several recent papers [5,6,7,8].",
      "startOffset" : 76,
      "endOffset" : 85
    }, {
      "referenceID" : 6,
      "context" : "Feasibility of invasive-based BCI have been proven by several recent papers [5,6,7,8].",
      "startOffset" : 76,
      "endOffset" : 85
    }, {
      "referenceID" : 7,
      "context" : "Feasibility of invasive-based BCI have been proven by several recent papers [5,6,7,8].",
      "startOffset" : 76,
      "endOffset" : 85
    }, {
      "referenceID" : 8,
      "context" : "[9] which has proven that ECoG recordings can lead to multiple-degree BCI control.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 9,
      "context" : "[10], these two works have considered the problem of predicting arm movements from ECoG signals.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 10,
      "context" : "While such an idea of switching models have already been successfully used for arm movement prediction on monkeys from micro-electrode array measures [11], here, we develop a specific approach adapted to finger movements.",
      "startOffset" : 150,
      "endOffset" : 154
    }, {
      "referenceID" : 11,
      "context" : "The global method has been tested on the 4th Dataset of the BCI Competition IV[12].",
      "startOffset" : 78,
      "endOffset" : 82
    }, {
      "referenceID" : 11,
      "context" : "For this work, the fourth dataset from the BCI Competition IV [12] was used.",
      "startOffset" : 62,
      "endOffset" : 66
    }, {
      "referenceID" : 12,
      "context" : "Electrocorticographic (ECoG) signals of the subject were recorded at a 1KHz sampling using BCI2000 [13].",
      "startOffset" : 99,
      "endOffset" : 103
    }, {
      "referenceID" : 11,
      "context" : "To correct this time-lag we apply the 37 ms delay proposed in the dataset description [12] to the ECoG signals.",
      "startOffset" : 86,
      "endOffset" : 90
    }, {
      "referenceID" : 11,
      "context" : "Note that the fourth finger was not used for evaluation in the competition since its movements were proven to be correlated with the other one movements [12].",
      "startOffset" : 153,
      "endOffset" : 157
    }, {
      "referenceID" : 13,
      "context" : "Problem (2) has been solved using the block-coordinate descent algorithm proposed by Rakotomamonjy [14].",
      "startOffset" : 99,
      "endOffset" : 103
    }, {
      "referenceID" : 9,
      "context" : "We have chosen a linear model since they have been shown to provide good performances for decoding movements from ECoG [10,9].",
      "startOffset" : 119,
      "endOffset" : 125
    }, {
      "referenceID" : 8,
      "context" : "We have chosen a linear model since they have been shown to provide good performances for decoding movements from ECoG [10,9].",
      "startOffset" : 119,
      "endOffset" : 125
    }, {
      "referenceID" : 9,
      "context" : "[10].",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 8,
      "context" : "This results correspond to those obtained for the arm trajectory prediction (Schalk [9] obtained 0.",
      "startOffset" : 84,
      "endOffset" : 87
    }, {
      "referenceID" : 9,
      "context" : "5 and Pistohl [10] obtained 0.",
      "startOffset" : 14,
      "endOffset" : 18
    }, {
      "referenceID" : 14,
      "context" : "[15] gives a correlation of about 0.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 9,
      "context" : "Indeed, we choose to use linear models depending on the internal states, but [10] proposed to use a kalman filter for the decoding of movement.",
      "startOffset" : 77,
      "endOffset" : 81
    }, {
      "referenceID" : 14,
      "context" : "Liang [15] proposed to use Power Spectral Densities of the ECoG channel as features and we believe that these features may be added and used in the sequence labeling.",
      "startOffset" : 6,
      "endOffset" : 10
    }, {
      "referenceID" : 10,
      "context" : "In our method the features are low-pass filtered in order to increase recognition performance, but other sequence labeling methods like HMM [11] have been used in BCI.",
      "startOffset" : 140,
      "endOffset" : 144
    }, {
      "referenceID" : 15,
      "context" : "Other sequence labeling methods like Conditional Random Fields [16] known to outperform HMM in some case or Sequence SVM [17] may be used to get a better sequence of hidden states.",
      "startOffset" : 63,
      "endOffset" : 67
    }, {
      "referenceID" : 16,
      "context" : "Other sequence labeling methods like Conditional Random Fields [16] known to outperform HMM in some case or Sequence SVM [17] may be used to get a better sequence of hidden states.",
      "startOffset" : 121,
      "endOffset" : 125
    } ],
    "year" : 2011,
    "abstractText" : "One of the major challenges of ECoG-based Brain-Machine Interfaces is the movement prediction of a human subject. Several methods exist to predict an arm 2-D trajectory. The fourth BCI Competition gives a dataset in which the aim is to predict individual finger movements (5-D trajectory). The difficulty lies in the fact that there is no simple relation between ECoG signals and finger movement. We propose in this paper to decode finger flexions using switching models. This method permits to simplify the system as it is now described as an ensemble of linear models depending on an internal state. We show that an interesting accuracy prediction can be obtained by such a model.",
    "creator" : "LaTeX with hyperref package"
  }
}