{
  "name" : "1109.2141.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Efficiency versus Convergence of Boolean Kernels for On-Line Learning Algorithms",
    "authors" : [ "Roni Khardon", "Dan Roth", "Rocco A. Servedio" ],
    "emails" : [ "roni@cs.tufts.edu", "danr@cs.uiuc.edu", "rocco@cs.columbia.edu" ],
    "sections" : [ {
      "heading" : null,
      "text" : "We first describe several kernel functions which capture either limited forms of conjunctions or all conjunctions. We show that these kernels can be used to efficiently run the Perceptron algorithm over a feature space of exponentially many conjunctions; however we also show that using such kernels, the Perceptron algorithm can provably make an exponential number of mistakes even when learning simple functions.\nWe then consider the question of whether kernel functions can analogously be used to run the multiplicative-update Winnow algorithm over an expanded feature space of exponentially many conjunctions. Known upper bounds imply that the Winnow algorithm can learn Disjunctive Normal Form (DNF) formulae with a polynomial mistake bound in this setting. However, we prove that it is computationally hard to simulate Winnow’s behavior for learning DNF over such a feature set. This implies that the kernel functions which correspond to running Winnow for this problem are not efficiently computable, and that there is no general construction that can run Winnow with kernels."
    }, {
      "heading" : "1. Introduction",
      "text" : "The problem of classifying objects into one of two classes being “positive” and “negative” examples of a concept is often studied in machine learning. The task in machine learning is to extract such a classifier from given pre-classified examples - the problem of learning from data. When each example is represented by a set of n numerical features, an example\nc©2005 AI Access Foundation. All rights reserved.\ncan be seen as a point in Euclidean space ℜn. A common representation for classifiers in this case is a hyperplane of dimension (n − 1) which splits the domain of examples into two areas of positive and negative examples. Such a representation is known as a linear threshold function, and many learning algorithms that output a hypothesis represented in this manner have been developed, analyzed, implemented, and applied in practice. Of particular interest in this paper are the well known Perceptron (Rosenblatt, 1958; Block, 1962; Novikoff, 1963) and Winnow (Littlestone, 1988) algorithms that have been intensively studied in the literature.\nIt is also well known that the expressiveness of linear threshold functions is quite limited (Minsky & Papert, 1968). Despite this fact, both Perceptron and Winnow have been applied successfully in recent years to several large scale real world classification problems. As one example, the SNoW system (Roth, 1998; Carlson, Cumby, Rosen, & Roth, 1999) has successfully applied variations of Perceptron and Winnow to problems in natural language processing. The SNoW system extracts basic Boolean features x1, . . . , xn from labeled pieces of text data in order to represent the examples, thus the features have numerical values restricted to {0, 1}. There are several ways to enhance the set of basic features x1, . . . , xn for Perceptron or Winnow. One idea is to expand the set of basic features x1, . . . , xn using conjunctions such as (x1∧x3∧x4) and use these expanded higher-dimensional examples, in which each conjunction plays the role of a basic feature, as the examples for Perceptron or Winnow. This is in fact the approach which the SNoW system takes running Perceptron or Winnow over a space of restricted conjunctions of these basic features. This idea is closely related to the use of kernel methods, see e.g. the book of Cristianini and Shawe-Taylor (2000), where a feature expansion is done implicitly through the kernel function. The approach clearly leads to an increase in expressiveness and thus may improve performance. However, it also dramatically increases the number of features (from n to 3n if all conjunctions are used), and thus may adversely affect both the computation time and convergence rate of learning. The paper provides a theoretical study of the performance of Perceptron and Winnow when run over expanded feature spaces such as these."
    }, {
      "heading" : "1.1 Background: On-Line Learning with Perceptron and Winnow",
      "text" : "Before describing our results, we recall some necessary background on the on-line learning model (Littlestone, 1988) and the Perceptron and Winnow algorithms.\nGiven an instance space X of possible examples, a concept is a mapping of instances into one of two (or more) classes. A concept class C ⊆ 2X is simply a set of concepts. In on-line learning a concept class C is fixed in advance and an adversary can pick a concept c ∈ C. The learning is then modeled as a repeated game where in each iteration the adversary picks an example x ∈ X, the learner gives a guess for the value of c(x) and is then told the correct value. We count one mistake for each iteration in which the value is not predicted correctly. A learning algorithm learns a concept class C with mistake bound M if for any choice of c ∈ C and any (arbitrarily long) sequence of examples, the learner is guaranteed to make at most M mistakes.\nIn this paper we consider the case where the examples are given by Boolean features, that is X = {0, 1}n, and we have two class labels denoted by −1 and 1. Thus for x ∈ {0, 1}n, a labeled example 〈x, 1〉 is a positive example, and a labeled example 〈x,−1〉 is a negative\nexample. The concepts we consider are built using logical combinations of the n base features and we are interested in mistake bounds that are polynomial in n."
    }, {
      "heading" : "1.1.1 Perceptron",
      "text" : "Throughout its execution Perceptron maintains a weight vector w ∈ ℜN which is initially (0, . . . , 0). Upon receiving an example x ∈ ℜN the algorithm predicts according to the linear threshold function w · x ≥ 0. If the prediction is 1 and the label is −1 (false positive prediction) then the vector w is set to w−x, while if the prediction is −1 and the label is 1 (false negative) then w is set to w + x. No change is made to w if the prediction is correct. Many variants of this basic algorithm have been proposed and studied and in particular one can add a non zero threshold as well as a learning rate that controls the size of update to w. Some of these are discussed further in Section 3.\nThe famous Perceptron Convergence Theorem (Rosenblatt, 1958; Block, 1962; Novikoff, 1963) bounds the number of mistakes which the Perceptron algorithm can make:\nTheorem 1 Let 〈x1, y1〉, . . . , 〈x t, yt〉 be a sequence of labeled examples with x i ∈ ℜN , ‖xi‖ ≤"
    }, {
      "heading" : "R and yi ∈ {−1, 1} for all i. Let u ∈ ℜ",
      "text" : "N , ξ > 0 be such that yi(u · x i) ≥ ξ for all i. Then Perceptron makes at most R 2‖u‖2\nξ2 mistakes on this example sequence."
    }, {
      "heading" : "1.1.2 Winnow",
      "text" : "The Winnow algorithm (Littlestone, 1988) has a very similar structure. Winnow maintains a hypothesis vector w ∈ ℜN which is initially w = (1, . . . , 1). Winnow is parameterized by a promotion factor α > 1 and a threshold θ > 0; upon receiving an example x ∈ {0, 1}N Winnow predicts according to the threshold function w ·x ≥ θ. If the prediction is 1 and the label is −1 then for all i such that xi = 1 the value of wi is set to wi/α; this is a demotion step. If the prediction is −1 and the label is 1 then for all i such that xi = 1 the value of wi is set to αwi; this is a promotion step. No change is made to w if the prediction is correct.\nFor our purposes the following mistake bound, implicit in Littlestone’s work (1988), is of interest:\nTheorem 2 Let the target function be a k-literal monotone disjunction f(x1, . . . , xN ) = xi1 ∨ · · · ∨ xik . For any sequence of examples in {0, 1}\nN labeled according to f the number of prediction mistakes made by Winnow(α, θ) is at most αα−1 · N θ + k(α + 1)(1 + logα θ)."
    }, {
      "heading" : "1.2 Our Results",
      "text" : "We are interested in the computational efficiency and convergence of the Perceptron and Winnow algorithms when run over expanded feature spaces of conjunctions. Specifically, we study the use of kernel functions to expand the feature space and thus enhance the learning abilities of Perceptron and Winnow; we refer to these enhanced algorithms as kernel Perceptron and kernel Winnow.\nOur first result (cf. also the papers of Sadohara, 1991; Watkins, 1999; and Kowalczyk et al., 2001) uses kernel functions to show that it is possible to efficiently run the kernel Perceptron algorithm over an exponential number of conjunctive features.\nResult 1: (see Theorem 3) There is an algorithm that simulates Perceptron over the 3ndimensional feature space of all conjunctions of n basic features. Given a sequence of t labeled examples in {0, 1}n the prediction and update for each example take poly(n, t) time steps. We also prove variants of this result in which the expanded feature space consists of all monotone conjunctions or all conjunctions of some bounded size.\nThis result is closely related to one of the main open problems in learning theory: efficient learnability of disjunctions of conjunctions, or DNF (Disjunctive Normal Form) expressions.1 Since linear threshold elements can represent disjunctions (e.g. x1 ∨ x2 ∨ x3 is true iff x1 + x2 + x3 ≥ 1), Theorem 1 and Result 1 imply that kernel Perceptron can be used to learn DNF. However, in this framework the values of N and R in Theorem 1 can be exponentially large (note that we have N = 3n and R = 2n/2 if all conjunctions are used), and hence the mistake bound given by Theorem 1 is exponential rather than polynomial in n. The question thus arises whether the exponential upper bound implied by Theorem 1 is essentially tight for the kernel Perceptron algorithm in the context of DNF learning. We give an affirmative answer, thus showing that kernel Perceptron cannot efficiently learn DNF.\nResult 2: There is a monotone DNF f over x1, . . . , xn and a sequence of examples labeled according to f which causes the kernel Perceptron algorithm to make 2Ω(n) mistakes. This result holds for generalized versions of the Perceptron algorithm where a fixed or updated threshold and a learning rate are used. We also give a variant of this result showing that kernel Perceptron fails in the Probably Approximately Correct (PAC) learning model (Valiant, 1984) as well.\nTurning to Winnow, an attractive feature of Theorem 2 is that for suitable α, θ the bound is logarithmic in the total number of features N (e.g. α = 2 and θ = N). Therefore, as noted by several researchers (Maass & Warmuth, 1998), if a Winnow analogue of Theorem 3 could be obtained this would imply that DNF can be learned by a computationally efficient algorithm with a poly(n)-mistake bound. However, we give strong evidence that no such Winnow analogue of Theorem 3 can exist.\nResult 3: There is no polynomial time algorithm which simulates Winnow over exponentially many monotone conjunctive features for learning monotone DNF unless every problem in the complexity class #P can be solved in polynomial time. This result holds for a wide range of parameter settings in the Winnow algorithm.\nWe observe that, in contrast to this negative result, Maass and Warmuth have shown that the Winnow algorithm can be simulated efficiently over exponentially many conjunctive features for learning some simple geometric concept classes (Maass & Warmuth, 1998).\nOur results thus indicate a tradeoff between computational efficiency and convergence of kernel algorithms for rich classes of Boolean functions such as DNF formulas; the kernel\n1. Angluin (1990) proved that DNF expressions cannot be learned efficiently using equivalence queries whose hypotheses are themselves DNF expressions. Since the model of exact learning from equivalence queries only is equivalent to the mistake bound model which we consider in this paper, her result implies that no online algorithm which uses DNF formulas as hypotheses can efficiently learn DNF. However, this result does not preclude the efficient learnability of DNF using a different class of hypotheses. The kernel Perceptron algorithm generates hypotheses which are thresholds of conjunctions rather than DNF formulas, and thus Angluin’s negative results do not apply here.\nPerceptron algorithm is computationally efficient to run but has exponentially slow convergence, whereas kernel Winnow has rapid convergence but seems to require exponential runtime."
    }, {
      "heading" : "2. Kernel Perceptron with Many Features",
      "text" : "It is well known that the hypothesis w of the Perceptron algorithm is a linear combination of the previous examples on which mistakes were made (Cristianini & Shaw-Taylor, 2000). More precisely, if we let L(v) ∈ {−1, 1} denote the label of example v, then we have that w = ∑\nv∈M L(v)v where M is the set of examples on which the algorithm made a mistake. Thus the prediction of Perceptron on x is 1 iff w ·x = ( ∑\nv∈M L(v)v)·x = ∑\nv∈M L(v)(v ·x) ≥ 0.\nFor an example x ∈ {0, 1}n let φ(x) denote its transformation into an enhanced feature space such as the space of all conjunctions. To run the Perceptron algorithm over the enhanced space we must predict 1 iff wφ · φ(x) ≥ 0 where wφ is the weight vector in the enhanced space; from the above discussion this holds iff ∑\nv∈M L(v)(φ(v) · φ(x)) ≥ 0. Denoting K(v, x) = φ(v) · φ(x) this holds iff ∑\nv∈M L(v)K(v, x) ≥ 0.\nThus we never need to construct the enhanced feature space explicitly; in order to run Perceptron we need only be able to compute the kernel function K(v, x) efficiently. This is the idea behind all so-called kernel methods, which can be applied to any algorithm (such as support vector machines) whose prediction is a function of inner products of examples. A more detailed discussion is given in the book of Cristianini and Shawe-Taylor (2000). Thus the next theorem is simply obtained by presenting a kernel function capturing all conjunctions.\nTheorem 3 There is an algorithm that simulates Perceptron over the feature spaces of (1) all conjunctions, (2) all monotone conjunctions, (3) conjunctions of size ≤ k, and (4) monotone conjunctions of size ≤ k. Given a sequence of t labeled examples in {0, 1}n the prediction and update for each example take poly(n, t) time steps.\nProof: For case (1) φ(·) includes all 3n conjunctions (with positive and negative literals) and K(x, y) must compute the number of conjunctions which are true in both x and y. Clearly, any literal in such a conjunction must satisfy both x and y and thus the corresponding bit in x, y must have the same value. Thus each conjunction true in both x and y corresponds to a subset of such bits. Counting all these conjunctions gives K(x, y) = 2same(x,y) where same(x, y) is the number of original features that have the same value in x and y, i.e. the number of bit positions i which have xi = yi. This kernel has been obtained independently by Sadohara (2001).\nTo express all monotone monomials as in (2) we take K(x, y) = 2|x∩y| where |x ∩ y| is the number of active features common to both x and y, i.e. the number of bit positions which have xi = yi = 1.\nSimilarly, for case (3) the number of conjunctions that satisfy both x and y is K(x, y) = ∑k\nl=0 (same(x,y) l ) . This kernel is reported also by Watkins (1999). For case (4) we have\nK(x, y) = ∑k\nl=0 (|x∩y| l ) . ✷"
    }, {
      "heading" : "3. Kernel Perceptron with Many Mistakes",
      "text" : "In this section we describe a simple monotone DNF target function and a sequence of labeled examples which causes the monotone monomials kernel Perceptron algorithm to make exponentially many mistakes.\nFor x, y ∈ {0, 1}n we write |x| to denote the number of 1’s in x and, as described above, |x∩y| to denote the number of bit positions i which have xi = yi = 1. We need the following well-known tail bound on sums of independent random variables which can be found in, e.g., Section 9.3 of the book by Kearns and Vazirani (1994):\nFact 4 Let X1, . . . , Xm be a sequence of m independent 0/1-valued random variables, each of which has E[Xi] = p. Let X denote ∑m i=1 Xi, so E[X] = pm. Then for 0 ≤ γ ≤ 1, we have\nPr[X > (1 + γ)pm] ≤ e−mpγ 2/3 and Pr[X < (1 − γ)pm] ≤ e−mpγ 2/2.\nWe also use the following combinatorial property:\nLemma 5 There is a set S of n-bit strings S = {x1, . . . , xt} ⊂ {0, 1}n with t = en/9600 such that |xi| = n/20 for 1 ≤ i ≤ t and |xi ∩ xj | ≤ n/80 for 1 ≤ i < j ≤ t.\nProof: We use the probabilistic method. For each i = 1, . . . , t let xi ∈ {0, 1}n be chosen by independently setting each bit to 1 with probability 1/10. For any i it is clear that E[|xi|] = n/10. Applying Fact 4, we have that Pr[|xi| < n/20] ≤ e−n/80, and thus the probability that any xi satisfies |xi| < n/20 is at most te−n/80. Similarly, for any i 6= j we have E[|xi ∩ xj |] = n/100. Applying Fact 4 we have that Pr[|xi ∩ xj | > n/80] ≤ e−n/4800, and thus the probability that any xi, xj with i 6= j satisfies |xi ∩ xj | > n/80 is at most (t 2 ) e−n/4800. For t = en/9600 the value of (t 2 )\ne−n/4800 + te−n/80 is less than 1. Thus for some choice of x1, . . . , xt we have each |xi| ≥ n/20 and |xi ∩ xj | ≤ n/80. For any xi which has |xi| > n/20 we can set |xi| − n/20 of the 1s to 0s, and the lemma is proved. ✷\nNow using the previous lemma we can construct a difficult data set for kernel Perceptron:\nTheorem 6 There is a monotone DNF f over x1, . . . , xn and a sequence of examples labeled according to f which causes the kernel Perceptron algorithm to make 2Ω(n) mistakes.\nProof: The target DNF with which we will use is very simple: it is the single conjunction x1x2 . . . xn. While the original Perceptron algorithm over the n features x1, . . . , xn is easily seen to make at most poly(n) mistakes for this target function, we now show that the monotone kernel Perceptron algorithm which runs over a feature space of all 2n monotone monomials can make 2 + en/9600 mistakes.\nRecall that at the beginning of the Perceptron algorithm’s execution all 2n coordinates of wφ are 0. The first example is the negative example 0n. The only monomial true in this example is the empty monomial which is true in every example. Since wφ · φ(x) = 0 Perceptron incorrectly predicts 1 on this example. The resulting update causes the coefficient wφ∅ corresponding to the empty monomial to become −1 but all 2 n − 1 other coordinates of wφ remain 0. The next example is the positive example 1n. For this example we have wφ · φ(x) = −1 so Perceptron incorrectly predicts −1. Since all 2n monotone conjunctions\nare satisfied by this example the resulting update causes wφ∅ to become 0 and all 2 n − 1 other coordinates of wφ to become 1. The next en/9600 examples are the vectors x1, . . . , xt described in Lemma 5. Since each such example has |xi| = n/20 each example is negative; however as we now show the Perceptron algorithm will predict 1 on each of these examples.\nFix any value 1 ≤ i ≤ en/9600 and consider the hypothesis vector wφ just before example xi is received. Since |xi| = n/20 the value of wφ · φ(xi) is a sum of the 2n/20 different coordinates wφT which correspond to the monomials satisfied by x i. More precisely we have wφ · φ(xi) = ∑\nT∈Ai w φ T + ∑ T∈Bi w φ T where Ai contains the monomials which are satisfied\nby xi and xj for some j 6= i and Bi contains the monomials which are satisfied by x i but no xj with j 6= i. We lower bound the two sums separately. Let T be any monomial in Ai. By Lemma 5 any T ∈ Ai contains at most n/80 variables and thus there can be at most ∑n/80\nr=0 (n/20 r )\nmonomials in Ai. Using the well known bound ∑αℓ\nj=0 (ℓ j ) = 2(H(α)+o(1))ℓ where 0 < α ≤ 1/2 and H(p) = −p log p − (1 − p) log(1 − p) is the binary entropy function, which can be found e.g. as Theorem 1.4.5 of the book by Van Lint (1992), there can be at most 20.8113·(n/20)+o(n) < 20.041n terms in Ai. Moreover the value of each wφT must be at least −e n/9600 since wφT decreases by at most 1 for each example, and hence ∑\nT∈Ai w φ T ≥ −e n/960020.041n > −20.042n. On the other hand, any T ∈ Bi\nis false in all other examples and therefore wφT has not been demoted and w φ T = 1. By Lemma 5 for any r > n/80 every r-variable monomial satisfied by xi must belong to Bi, and hence ∑\nT∈Bi w φ T ≥ ∑n/20 r=n/80+1 (n/20 r ) > 20.049n. Combining these inequalities we have\nw · xi ≥ −20.042n + 20.049n > 0 and hence the Perceptron prediction on xi is 1. ✷\nRemark 7 At first sight it might seem that the result is limited to a simple special case of the perceptron algorithm. Several variations exist that use: an added feature with a fixed value that enables the algorithm to update the threshold indirectly (via a weight ŵ), a non zero fixed (initial) threshold θ, and a learning rate α, and in particular all these three can be used simultaneously. The generalized algorithm predicts according to the hypothesis w · x + ŵ ≥ θ and updates w ← w + αx and ŵ ← ŵ + α for promotions and similarly for demotions. We show here that exponential lower bounds on the number of mistakes can be derived for the more general algorithm as well. First, note that since our kernel includes a feature for the empty monomial which is always true, the first parameter is already accounted for. For the other two parameters note that there is a degree of freedom between the learning rate α and fixed threshold θ since multiplying both by the same factor does not change the hypothesis and therefore it suffices to consider the threshold only. We consider several cases for the value of the threshold. If θ satisfies 0 ≤ θ ≤ 20.047 then we use the same sequence of examples. After the first two examples the algorithm makes a promotion on 1n (it may or may not update on 0n but that is not important). For the examples in the sequence the bounds on ∑\nT∈Ai w φ T and ∑ T∈Bi w φ T are still valid so the\nfinal inequality in the proof becomes w · xi ≥ −20.042n + 20.049n > 20.047n which is true for sufficiently large n. If θ > 20.047n then we can construct the following scenario. We use the function f = x1 ∨ x2 ∨ . . . ∨ xn, and the sequence of examples includes θ 2 − 1 repetitions of the same example x where the first bit is 1 and all other bits are 0. The example x satisfies exactly 2 monomials and therefore the algorithm will make mistakes on all the examples in the sequence. If θ < 0 then the initial hypothesis misclassifies 0n. We start the example\nsequence by repeating the example 0n until it is classified correctly, that is ⌈−θ⌉ times. If the threshold is large in absolute value e.g. θ < −20.042n we are done. Otherwise we continue with the example 1n. Since all weights except for the empty monomial are zero at this stage the examples 0n and 1n are classified in the same way so 1n is misclassified and therefore the algorithm makes a promotion. The argument for the rest of the sequence is as above (except for adding a term for the empty monomial) and the final inequality becomes w ·xi ≥ −20.042n−20.042n +20.049n > −20.042n so each of the examples is misclassified. Thus in all cases kernel Perceptron may make an exponential number of mistakes."
    }, {
      "heading" : "3.1 A Negative Result for the PAC Model",
      "text" : "The proof above can be adapted to give a negative result for kernel Perceptron in the PAC learning model (Valiant, 1984). In this model each example x is independently drawn from a fixed probability distribution D and with high probability the learner must construct a hypothesis h which has high accuracy relative to the target concept c under distribution D. See the Kearns-Vazirani text (1994) for a detailed discussion of the PAC learning model.\nLet D be the probability distribution over {0, 1}n which assigns weight 1/4 to the example 0n, weight 1/4 to the example 1n, and weight 12 1 en/9600 to each of the en/9600 examples x1, . . . , xt.\nTheorem 8 If kernel Perceptron is run using a sample of polynomial size p(n) then with probability at least 1/16 the error of its final hypothesis is at least 0.49.\nProof: With probability 1/16, the first two examples received from D will be 0n and then 1n. Thus, with probability 1/16, after two examples (as in the proof above) the Perceptron algorithm will have wφ∅ = 0 and all other coefficients of w φ equal to 1.\nConsider the sequence of examples following these two examples. First note that in any trial, any occurrence of an example other than 1n (i.e. any occurrence either of some xi or of the 0n example) can decrease ∑\nT⊆[n] w θ T by at most 2 n/20. Since after the first two examples\nwe have wφ ·φ(1n) = ∑ T⊆[n] w θ T = 2 n− 1, it follows that at least 219n/20 − 1 more examples must occur before the 1n example will be incorrectly classified as a negative example. Since we will only consider the performance of the algorithm for p(n) < 219n/20 − 1 steps, we may ignore all subsequent occurrences of 1n since they will not change the algorithm’s hypothesis.\nNow observe that on the first example which is not 1n the algorithm will perform a demotion resulting in wφ∅ = −1 (possibly changing other coefficients as well). Since no promotions will be performed on the rest of the sample, we get wφ∅ ≤ −1 for the rest of the learning process. It follows that all future occurrences of the example 0n are correctly classified and thus we may ignore them as well.\nConsidering examples xi from the sequence constructed above, we may ignore any example that is correctly classified since no update is made on it. It follows that when the perceptron algorithm has gone over all examples, its hypothesis is formed by demotions on examples in the sequence of xi’s. The only difference from the scenario above is that the algorithm may make several demotions on the same example if it occurs multiple times in the sample. However, an inspection of the proof above shows that for any xi that has not been seen by the algorithm, the bounds on ∑\nT∈Ai w φ T and ∑ T∈Bi w φ T are still valid and\ntherefore xi will be misclassified. Since the sample is of size p(n) and the sequence is of size en/9600 the probability weight of examples in the sample is at most 0.01 for sufficiently large n so the error of the hypothesis is at least 0.49. ✷"
    }, {
      "heading" : "4. Computational Hardness of Kernel Winnow",
      "text" : "In this section, for x ∈ {0, 1}n we let φ(x) denote the (2n − 1)-element vector whose coordinates are all nonempty monomials (monotone conjunctions) over x1, . . . , xn. We say that a sequence of labeled examples 〈x1, b1〉, . . . , 〈x\nt, bt〉 is monotone consistent if it is consistent with some monotone function, i.e. xik ≤ x j k for all k = 1, . . . , n implies bi ≤ bj . If S is monotone consistent and has t labeled examples then clearly there is a monotone DNF formula consistent with S which contains at most t conjunctions. We consider the following problem:\nKERNEL WINNOW PREDICTION(α, θ) (KWP) Instance: Monotone consistent sequence S = 〈x1, b1〉, . . . , 〈x\nt, bt〉 of labeled examples with each xi ∈ {0, 1}m and each bi ∈ {−1, 1}; unlabeled example z ∈ {0, 1}\nm. Question: Is wφ · φ(z) ≥ θ, where wφ is the N = (2m − 1)-dimensional hypothesis vector generated by running Winnow(α, θ) on the example sequence 〈φ(x1), b1〉, . . . 〈φ(x t), bt〉?\nIn order to run Winnow over all 2m − 1 nonempty monomials to learn monotone DNF, one must be able to solve KWP efficiently. Our main result in this section is a proof that KWP is computationally hard for a wide range of parameter settings which yield a polynomial mistake bound for Winnow via Theorem 2.\nRecall that #P is the class of all counting problems associated with NP decision problems; it is well known that if every function in #P is computable in polynomial time then P = NP. See the book of Papadimitriou (1994) or the paper of Valiant (1979) for details on #P. The following problem is #P-hard (Valiant, 1979):\nMONOTONE 2-SAT (M2SAT) Instance: Monotone 2-CNF Boolean formula F = c1 ∧ c2 ∧ . . . ∧ cr with ci = (yi1 ∨ yi2) and each yij ∈ {y1, . . . , yn}; integer K such that 1 ≤ K ≤ 2\nn. Question: Is |F−1(1)| ≥ K, i.e. does F have at least K satisfying assignments in {0, 1}n?\nTheorem 9 Fix any ǫ > 0. Let N = 2m − 1, let α ≥ 1 + 1/m1−ǫ, and let θ ≥ 1 be such that max( αα−1 · N θ , (α + 1)(1 + logα θ)) = poly(m). If there is a polynomial time algorithm for KWP(α, θ), then every function in #P is computable in polynomial time.\nProof: For N,α and θ as described in the theorem a routine calculation shows that\n1 + 1/m1−ǫ ≤ α ≤ poly(m) and 2m\npoly(m) ≤ θ ≤ 2poly(m). (1)\nThe proof is a reduction from the problem M2SAT. The high level idea of the proof is simple: let (F,K) be an instance of M2SAT where F is defined over variables y1, . . . , yn. The Winnow algorithm maintains a weight wφT for each monomial T over variables x1, . . . , xn. We define a 1-1 correspondence between these monomials T and truth assignments yT ∈ {0, 1}n\nfor F, and we give a sequence of examples for Winnow which causes wφT ≈ 0 if F (y T ) = 0 and wφT = 1 if F (y T ) = 1. The value of wφ · φ(z) is thus related to |F−1(1)|. Note that if we could control θ as well this would be sufficient since we could use θ = K and the result will follow. However θ is a parameter of the algorithm. We therefore have to make additional updates so that wφ · φ(z) ≈ θ + (|F−1(1)| − K) so that wφ · φ(z) ≥ θ if and only if |F−1(1)| ≥ K. The details are somewhat involved since we must track the resolution of approximations of the different values so that the final inner product will indeed give a correct result with respect to the threshold.\nGeneral setup of the construction. In more detail, let\n• U = n + 1 + ⌈(⌈logα 4⌉ + 1) logα⌉,\n• V = ⌈ n+1logα⌉ + 1,\n• W = ⌈U+2logα⌉ + 1\nand let m be defined as\nm = n + U + 6V n2 + 6UW + 3. (2)\nSince α ≥ 1 + 1/m1−ǫ, using the fact that log(1 + x) ≥ x/2 for 0 < x < 1 we have that logα ≥ 1/(2m1−ǫ), and from this it easily follows that m as specified above is polynomial in n. We describe a polynomial time transformation which maps an n-variable instance (F,K) of M2SAT to an m-variable instance (S, z) of KWP(α, θ) where S = 〈x1, b1〉, . . . , 〈x\nt, bt〉 is monotone consistent, each xi and z belong to {0, 1}m, and wφ · φ(z) ≥ θ if and only if |F−1(1)| ≥ K.\nThe Winnow variables x1, . . . , xm are divided into three sets A,B and C where A = {x1, . . . , xn}, B = {xn+1, . . . , xn+U} and C = {xn+U+1, . . . , xm}. The unlabeled example z is 1n+U0m−n−U , i.e. all variables in A and B are set to 1 and all variables in C are set to 0. We thus have wφ·φ(z) = MA+MB+MAB where MA = ∑ ∅6=T⊆Aw φ T , MB = ∑ ∅6=T⊆B w φ T and MAB = ∑ T⊆A∪B,T∩A 6=∅,T∩B 6=∅w φ T . We refer to monomials ∅ 6= T ⊆ A as type-A monomials, monomials ∅ 6= T ⊆ B as type-B monomials, and monomials T ⊆ A∪B, T∩A 6= ∅, T∩B 6= ∅ as type-AB monomials.\nThe example sequence S is divided into four stages. Stage 1 results in MA ≈ |F −1(1)|; as described below the n variables in A correspond to the n variables in the CNF formula F. Stage 2 results in MA ≈ α\nq|F−1(1)| for some positive integer q which we specify later. Stages 3 and 4 together result in MB +MAB ≈ θ−α\nqK. Thus the final value of wφ ·φ(z) is approximately θ + αq(|F−1(1)| −K), so we have wφ · φ(z) ≥ θ if and only if |F−1(1)| ≥ K.\nSince all variables in C are 0 in z, if T includes a variable in C then the value of wφT does not affect wφ · φ(z). The variables in C are “slack variables” which (i) make Winnow perform the correct promotions/demotions and (ii) ensure that S is monotone consistent.\nStage 1: Setting MA ≈ |F −1(1)|. We define the following correspondence between truth assignments yT ∈ {0, 1}n and monomials T ⊆ A : yTi = 0 if and only if xi is not present in T. For each clause yi1 ∨ yi2 in F, Stage 1 contains V negative examples such that xi1 = xi2 = 0 and xi = 1 for all other xi ∈ A. We show below that (1) Winnow makes a false positive prediction on each of these examples and (2) in Stage 1 Winnow never does a\npromotion on any example which has any variable in A set to 1. Consider any yT such that F (yT ) = 0. Since our examples include an example yS such that yT ≤ yS the monomial T is demoted at least V times. As a result after Stage 1 we will have that for all T , wφT = 1 if F (yT ) = 1 and 0 < wφT ≤ α −V if F (yT ) = 0. Thus we will have MA = |F\n−1(1)| + γ1 for some 0 < γ1 < 2\nnα−V < 12 . We now show how the Stage 1 examples cause Winnow to make a false positive prediction on negative examples which have xi1 = xi2 = 0 and xi = 1 for all other i in A as described above. For each such negative example in Stage 1 six new slack variables xβ+1, . . . , xβ+6 ∈ C are used as follows: Stage 1 has ⌈logα(θ/3)⌉ repeated instances of the positive example which has xβ+1 = xβ+2 = 1 and all other bits 0. These examples cause promotions which result in θ ≤ wφxβ+1 + w φ xβ+2 + wφxβ+1xβ+2 < αθ and hence w φ xβ+1\n≥ θ/3. Two other groups of similar examples (the first with xβ+3 = xβ+4 = 1, the second with xβ+5 = xβ+6 = 1) cause wφxβ+3 ≥ θ/3 and w φ xβ+5\n≥ θ/3. The next example in S is the negative example which has xi1 = xi2 = 0, xi = 1 for all other xi in A, xβ+1 = xβ+3 = xβ+5 = 1 and all other bits 0. For this example wφ · φ(x) > wφxβ+1 + w φ xβ+3\n+ wφxβ+5 ≥ θ so Winnow makes a false positive prediction.\nSince F has at most n2 clauses and there are V negative examples per clause, this construction can be carried out using 6V n2 slack variables xn+U+1, . . . , xn+U+6V n2 . We thus have (1) and (2) as claimed above.\nStage 2: Setting MA ≈ α q|F −1(1)|. The first Stage 2 example is a positive example with xi = 1 for all xi ∈ A, xn+U+6V n2+1 = 1 and all other bits 0. Since each of the 2 n monomials which contain xn+U+6V n2+1 and are satisfied by this example have w φ T = 1, we have wφ · φ(x) = 2n + |F−1(1)| + γ1 < 2 n+1. Since θ > 2m/poly(m) > 2n+1 (recall from equation (2) that m > 6n2), after the resulting promotion we have wφ · φ(x) = α(2n + |F−1(1)| + γ1) < α2 n+1. Let\nq = ⌈logα(θ/2 n+1)⌉ − 1\nso that\nαq2n+1 < θ ≤ αq+12n+1. (3)\nStage 2 consists of q repeated instances of the positive example described above. After these promotions we have wφ · φ(x) = αq(2n + |F−1(1)| + γ1) < α\nq2n+1 < θ. Since 1 < |F−1(1)| + γ1 < 2 n we also have\nαq < MA = α q(|F−1(1)| + γ1) < α q2n < θ/2. (4)\nEquation (4) gives the value which MA will have throughout the rest of the argument.\nSome Calculations for Stages 3 and 4. At the start of Stage 3 each type-B and typeAB monomial T has wφT = 1. There are n variables in A and U variables in B so at the start of Stage 3 we have MB = 2 U − 1 and MAB = (2 n − 1)(2U − 1). Since no example in Stages 3 or 4 satisfies any xi in A, at the end of Stage 4 MA will still be α q(|F−1(1)| + γ1) and MAB will still be (2 n − 1)(2U − 1). Therefore at the end of Stage 4 we have\nwφ · φ(z) = MB + α q(|F−1(1)| + γ1) + (2 n − 1)(2U − 1).\nTo simplify notation let\nD = θ − (2n − 1)(2U − 1) − αqK.\nIdeally at the end of Stage 4 the value of MB would be D−α qγ1 since this would imply that wφ ·φ(z) = θ+αq(|F−1(1)| −K) which is at least θ if and only if |F−1(1)| ≥ K. However it is not necessary for MB to assume this exact value, since |F\n−1(1)| must be an integer and 0 < γ1 < 1 2 . As long as\nD ≤ MB < D + 1\n2 αq (5)\nwe get that\nθ + αq(|F−1(1)| −K + γ1) < w φ · φ(z) < θ + αq(|F−1(1)| −K + γ1 +\n1 2 ).\nNow if |F−1(1)| ≥ K we clearly have wφ · φ(z) ≥ θ. On the other hand if |F−1(1)| < K then since |F−1(1)| is an integer value |F−1(1)| ≤ K−1 and we get wφ ·φ(z) < θ. Therefore all that remains is to construct the examples in Stages 3 and 4 so that that MB satisfies Equation (5).\nWe next calculate an appropriate granularity for D. Note that K ≤ 2n, so by Equation (3) we have that θ − αqK > θ/2. Now recall from Equations (2) and (1) that m > n + U + 6n2 and θ > 2m/poly(m), so θ/2 ≥ 2n+U+6n 2\n/poly(m) ≫ 2n2U . Consequently we certainly have that D > θ/4, and from Equation (3) we have that D > θ/4 > αq2n−1 > 14α\nq. Let\nc = ⌈logα 4⌉,\nso that we have\nαq−c ≤ 1\n4 αq < D. (6)\nThere is a unique smallest positive integer p > 1 which satisfies D ≤ pαq−c < D+ 14α q. The Stage 3 examples will result in MB satisfying p < MB < p + 1 4 . We now have that:\nαq−c < D ≤ pαq−c < D + 1\n4 αq\n≤ θ − 3\n4 αq (7)\n≤ αq+12n+1 − 3αq−c (8) = αq−c · (αc+12n+1 − 3). (9)\nHere (7) holds since K ≥ 1, and thus (by definition of D) we have D + αq ≤ θ which is equivalent to Equation (7). Inequality (8) follows from Equations (6) and (3).\nHence we have that\n1 < p ≤ αc+12n+1 − 3 ≤ 2n+1+⌈(c+1) logα⌉ − 3 = 2U − 3, (10)\nwhere the second inequality in the above chain follows from Equation (9). We now use the following lemma:\nLemma 10 For all ℓ ≥ 1, for all 1 ≤ p ≤ 2ℓ − 1, there is a monotone CNF Fℓ,p over ℓ Boolean variables which has at most ℓ clauses, has exactly p satisfying assignments in {0, 1}ℓ, and can be constructed from ℓ and p in poly(ℓ) time.\nProof: The proof is by induction on ℓ. For the base case ℓ = 1 we have p = 1 and Fℓ,p = x1. Assuming the lemma is true for ℓ = 1, . . . , k we now prove it for ℓ = k + 1 :\nIf 1 ≤ p ≤ 2k − 1 then the desired CNF is Fk+1,p = xk+1 ∧Fk,p. Since Fk,p has at most k clauses Fk+1,p has at most k + 1 clauses. If 2\nk + 1 ≤ p ≤ 2k+1 − 1 then the desired CNF is Fk+1,p = xk+1 ∨Fk,p−2k . By distributing xk over each clause of Fk,p−2k we can write Fk+1,p as a CNF with at most k clauses. If p = 2k then Fk,p = x1. ✷\nStage 3: Setting MB ≈ p. Let FU,p be an r-clause monotone CNF formula over the U variables in B which has p satisfying assignments. Similar to Stage 1, for each clause of FU,p, Stage 3 has W negative examples corresponding to that clause, and as in Stage 1 slack variables in C are used to ensure that Winnow makes a false positive prediction on each such negative example. Thus the examples in Stage 3 cause MB = p + γ2 where 0 < γ2 < 2\nUα−W < 14 . Since six slack variables in C are used for each negative example and there are rW ≤ UW negative examples, the slack variables xn+U+6V n2+2, . . . , xm−2 are sufficient for Stage 3.\nStage 4: Setting MB + MAB ≈ θ − α qK. All that remains is to perform q − c promotions on examples which have each xi in B set to 1. This will cause MB to equal (p + γ2)α q−c. By the inequalities established above, this will give us\nD ≤ pαq−c < (p + γ2)α q−c = MB < D +\n1 4 αq + γ2α q−c < D + 1 2 αq\nwhich is as desired.\nIn order to guarantee q − c promotions we use two sequences of examples of length q − ⌈U−nlogα ⌉ and ⌈ U−n logα ⌉ − c respectively. We first show that these are positive numbers. It follows directly from the definitions U = n + 1 + ⌈(⌈logα 4⌉ + 1) logα⌉ and c = ⌈logα 4⌉ that U−nlogα ≥ c. Since θ > 2 6n2 (by definition of m and Equation (1)) and α is bounded by a polynomial in m, we clearly have that log(θ/2n+1) > U − n + log(α). Now since q = ⌈logα(θ/2 n+1)⌉−1 this implies that q > log(θ/2 n+1) log(α) −1 > ⌈ U−n logα ⌉, so that q−⌈ U−n logα⌉ > 0.\nThe first q − ⌈U−nlogα ⌉ examples in Stage 4 are all the same positive example which has each xi in B set to 1 and xm−1 = 1. The first time this example is received, we have wφ · φ(x) = 2U + p + γ2 < 2 U+1. Since θ > 26n 2\n, by inspection of U we have 2U+1 < θ, so Winnow performs a promotion. Similarly, after q − ⌈U−nlogα ⌉ occurrences of this example, we have\nwφ · φ(x) = αq−⌈ U−n log α ⌉ (2U + p + γ2) < α q−⌈U−n log α ⌉ 2U+1 ≤ αq2n+1 < θ\nso promotions are indeed performed at each occurrence, and\nMB = α q−⌈U−n log α ⌉ (p + γ2).\nThe remaining examples in Stage 4 are ⌈U−nlogα⌉ − c repetitions of the positive example x which has each xi in B set to 1 and xm = 1. If promotions occurred on each repetition of\nthis example then we would have wφ ·φ(x) = α⌈ U−n log α ⌉−c (2U +α q−⌈U−n log α ⌉ (p+ γ2)), so we need only show that this quantity is less than θ. We reexpress this quantity as α ⌈U−n log α ⌉−c\n2U + αq−c(p + γ2). We have\nαq−c(p + γ2) < pα q−c +\n1 4 αq−c\n≤ θ − 3\n4 αq +\n1\n16 αq (11)\n< θ − 1\n2 αq\nwhere (11) follows from (7) and the definition of c. Finally, we have that α ⌈U−n log α ⌉−c\n2U ≤ α ·22U−n−c logα < α ·22U−n−2 < 12α θ 2n+1 < 12α q, where the last inequality is by Equation (3) and the previous inequality is by inspection of the values of α, θ and U . Combining the two bounds above we see that indeed wφ · φ(x) < θ.\nFinally, we observe that by construction the example sequence S is monotone consistent. Since m = poly(n) and S contains poly(n) examples the transformation from M2SAT to KWP(α, θ) is polynomial-time computable and the theorem is proved. ✷(Theorem 9)"
    }, {
      "heading" : "5. Conclusion",
      "text" : "Linear threshold functions are a weak representation language for which we have interesting learning algorithms. Therefore, if linear learning algorithms are to learn expressive functions, it is necessary to expand the feature space over which they are applied. This work explores the tradeoff between computational efficiency and convergence when using expanded feature spaces that capture conjunctions of base features.\nWe have shown that while each iteration of the kernel Perceptron algorithm can be executed efficiently, the algorithm can provably require exponentially many updates even when learning a function as simple as f(x) = x1x2 . . . xn. On the other hand, the kernel Winnow algorithm has a polynomial mistake bound for learning polynomial-size monotone DNF, but our results show that under a widely accepted computational hardness assumption it is impossible to efficiently simulate the execution of kernel Winnow. The latter also implies that there is no general construction that will run Winnow using kernel functions.\nOur results indicate that additive and multiplicative update algorithms lie on opposite extremes of the tradeoff between computational efficiency and convergence; we believe that this fact could have significant practical implications. By demonstrating the provable limitations of using kernel functions which correspond to high-degree feature expansions, our results also lend theoretical justification to the common practice of using a small degree in similar feature expansions such as the well-known polynomial kernel.2\nSince the publication of the initial conference version of this work (Khardon, Roth, & Servedio, 2002), several authors have explored closely related ideas. One can show that our construction for the negative results for Perceptron does not extend (either in the PAC or\n2. Our Boolean kernels are different than standard polynomial kernels in that all the conjunctions are weighted equally, and also in that we allow negations.\nonline setting) to related algorithms such as Support Vector Machines which work by constructing a maximum margin hypothesis consistent with the examples. The paper (Khardon & Servedio, 2003) gives an analysis of the PAC learning performance of maximum margin algorithms with the monotone monomials kernel, and derives several negative results thus giving further negative evidence for the monomial kernel. In the paper (Cumby & Roth, 2003) a kernel for expressions in description logic (generalizing the monomials kernel) is developed and successfully applied for natural language and molecular problems. Takimoto and Warmuth (2003) study the use of multiplicative update algorithms other than Winnow (such as weighted majority) and obtain some positive results by restricting the type of loss function used to be additive over base features. Chawla et al. (2004) have studied Monte Carlo estimation approaches to approximately simulate the Winnow algorithm’s performance when run over a space of exponentially many features. The use of kernel methods for logic learning and developing alternative methods for feature expansion with multiplicative update algorithms remain interesting and challenging problems to be investigated."
    }, {
      "heading" : "Acknowledgments",
      "text" : "This work was partly done while Khardon was at the University of Edinburgh and partly while Servedio was at Harvard University. The authors gratefully acknowledge financial support for this work by EPSRC grant GR/N03167, NSF grant IIS-0099446 and a Research Semester Fellowship Award from Tufts University (Khardon), NSF grants ITR-IIS00-85836, ITR-IIS-0085980 and IIS-9984168 (Roth), and NSF grant CCR-98-77049 and NSF Mathematical Sciences Postdoctoral Fellowship (Servedio)."
    } ],
    "references" : [ {
      "title" : "Negative results for equivalence queries",
      "author" : [ "D. Angluin" ],
      "venue" : "Machine Learning, 2, 121–150. Block, H. (1962). The perceptron: a model for brain functioning. Reviews of Modern",
      "citeRegEx" : "Angluin,? 1990",
      "shortCiteRegEx" : "Angluin",
      "year" : 1990
    }, {
      "title" : "The SNoW learning architecture",
      "author" : [ "A. Carlson", "C. Cumby", "J. Rosen", "D. Roth" ],
      "venue" : null,
      "citeRegEx" : "Carlson et al\\.,? \\Q1999\\E",
      "shortCiteRegEx" : "Carlson et al\\.",
      "year" : 1999
    }, {
      "title" : "UIUCDCS-R-99-2101, UIUC Computer Science",
      "author" : [ "Tech. rep" ],
      "venue" : null,
      "citeRegEx" : "rep.,? \\Q2004\\E",
      "shortCiteRegEx" : "rep.",
      "year" : 2004
    }, {
      "title" : "On kernel methods for relational learning",
      "author" : [ "C. Cambridge Press. Cumby", "D. Roth" ],
      "venue" : null,
      "citeRegEx" : "Cumby and Roth,? \\Q2003\\E",
      "shortCiteRegEx" : "Cumby and Roth",
      "year" : 2003
    }, {
      "title" : "Efficiency versus convergence of Boolean kernels for on-line learning algorithms",
      "author" : [ "R. Khardon", "D. Roth", "R. Servedio" ],
      "venue" : "Advances in Neural Information Processing Systems",
      "citeRegEx" : "Khardon et al\\.,? \\Q2002\\E",
      "shortCiteRegEx" : "Khardon et al\\.",
      "year" : 2002
    }, {
      "title" : "Maximum margin algorithms with Boolean kernels",
      "author" : [ "R. Khardon", "R. Servedio" ],
      "venue" : "In Proceedings of the Sixteenth Annual Conference on Computational Learning Theory,",
      "citeRegEx" : "Khardon and Servedio,? \\Q2003\\E",
      "shortCiteRegEx" : "Khardon and Servedio",
      "year" : 2003
    }, {
      "title" : "Introduction to Coding Theory",
      "author" : [ "J.V. Lint" ],
      "venue" : "Springer-Verlag.",
      "citeRegEx" : "Lint,? 1992",
      "shortCiteRegEx" : "Lint",
      "year" : 1992
    }, {
      "title" : "Learning quickly when irrelevant attributes abound: A new linearthreshold algorithm",
      "author" : [ "N. Littlestone" ],
      "venue" : "Machine Learning, 2, 285–318.",
      "citeRegEx" : "Littlestone,? 1988",
      "shortCiteRegEx" : "Littlestone",
      "year" : 1988
    }, {
      "title" : "Efficient learning with virtual threshold gates",
      "author" : [ "W. Maass", "M.K. Warmuth" ],
      "venue" : "Information and Computation,",
      "citeRegEx" : "Maass and Warmuth,? \\Q1998\\E",
      "shortCiteRegEx" : "Maass and Warmuth",
      "year" : 1998
    }, {
      "title" : "Perceptrons: an introduction to computational geometry",
      "author" : [ "M. Minsky", "S. Papert" ],
      "venue" : null,
      "citeRegEx" : "Minsky and Papert,? \\Q1968\\E",
      "shortCiteRegEx" : "Minsky and Papert",
      "year" : 1968
    }, {
      "title" : "On convergence proofs for perceptrons",
      "author" : [ "A. Novikoff" ],
      "venue" : "Proceeding of the Symposium on the Mathematical Theory of Automata, Vol. 12, pp. 615–622.",
      "citeRegEx" : "Novikoff,? 1963",
      "shortCiteRegEx" : "Novikoff",
      "year" : 1963
    }, {
      "title" : "Computational Complexity",
      "author" : [ "C. Papadimitriou" ],
      "venue" : "Addison-Wesley.",
      "citeRegEx" : "Papadimitriou,? 1994",
      "shortCiteRegEx" : "Papadimitriou",
      "year" : 1994
    }, {
      "title" : "The Perceptron: a probabilistic model for information storage and organization in the brain",
      "author" : [ "F. Rosenblatt" ],
      "venue" : "Psychological Review, 65, 386–407.",
      "citeRegEx" : "Rosenblatt,? 1958",
      "shortCiteRegEx" : "Rosenblatt",
      "year" : 1958
    }, {
      "title" : "Learning to resolve natural language ambiguities: A unified approach",
      "author" : [ "D. Roth" ],
      "venue" : "Proc. of the American Association of Artificial Intelligence, pp. 806–813.",
      "citeRegEx" : "Roth,? 1998",
      "shortCiteRegEx" : "Roth",
      "year" : 1998
    }, {
      "title" : "Learning of Boolean functions using support vector machines",
      "author" : [ "K. Sadohara" ],
      "venue" : "Proc. of the Conference on Algorithmic Learning Theory, pp. 106–118. Springer. LNAI 2225.",
      "citeRegEx" : "Sadohara,? 2001",
      "shortCiteRegEx" : "Sadohara",
      "year" : 2001
    }, {
      "title" : "Path kernels and multiplicative updates",
      "author" : [ "E. Takimoto", "M. Warmuth" ],
      "venue" : "Journal of Machine Learning Research,",
      "citeRegEx" : "Takimoto and Warmuth,? \\Q2003\\E",
      "shortCiteRegEx" : "Takimoto and Warmuth",
      "year" : 2003
    }, {
      "title" : "The complexity of enumeration and reliability problems",
      "author" : [ "L.G. Valiant" ],
      "venue" : "SIAM Journal of Computing, 8, 410–421.",
      "citeRegEx" : "Valiant,? 1979",
      "shortCiteRegEx" : "Valiant",
      "year" : 1979
    }, {
      "title" : "A theory of the learnable",
      "author" : [ "L.G. Valiant" ],
      "venue" : "Communications of the ACM, 27 (11), 1134–1142.",
      "citeRegEx" : "Valiant,? 1984",
      "shortCiteRegEx" : "Valiant",
      "year" : 1984
    }, {
      "title" : "Kernels from matching operations",
      "author" : [ "C. Watkins" ],
      "venue" : "Tech. rep. CSD-TR-98-07, Computer Science Department, Royal Holloway, University of London. 356",
      "citeRegEx" : "Watkins,? 1999",
      "shortCiteRegEx" : "Watkins",
      "year" : 1999
    } ],
    "referenceMentions" : [ {
      "referenceID" : 12,
      "context" : "Of particular interest in this paper are the well known Perceptron (Rosenblatt, 1958; Block, 1962; Novikoff, 1963) and Winnow (Littlestone, 1988) algorithms that have been intensively studied in the literature.",
      "startOffset" : 67,
      "endOffset" : 114
    }, {
      "referenceID" : 10,
      "context" : "Of particular interest in this paper are the well known Perceptron (Rosenblatt, 1958; Block, 1962; Novikoff, 1963) and Winnow (Littlestone, 1988) algorithms that have been intensively studied in the literature.",
      "startOffset" : 67,
      "endOffset" : 114
    }, {
      "referenceID" : 7,
      "context" : "Of particular interest in this paper are the well known Perceptron (Rosenblatt, 1958; Block, 1962; Novikoff, 1963) and Winnow (Littlestone, 1988) algorithms that have been intensively studied in the literature.",
      "startOffset" : 126,
      "endOffset" : 145
    }, {
      "referenceID" : 13,
      "context" : "As one example, the SNoW system (Roth, 1998; Carlson, Cumby, Rosen, & Roth, 1999) has successfully applied variations of Perceptron and Winnow to problems in natural language processing.",
      "startOffset" : 32,
      "endOffset" : 81
    }, {
      "referenceID" : 2,
      "context" : "A common representation for classifiers in this case is a hyperplane of dimension (n − 1) which splits the domain of examples into two areas of positive and negative examples. Such a representation is known as a linear threshold function, and many learning algorithms that output a hypothesis represented in this manner have been developed, analyzed, implemented, and applied in practice. Of particular interest in this paper are the well known Perceptron (Rosenblatt, 1958; Block, 1962; Novikoff, 1963) and Winnow (Littlestone, 1988) algorithms that have been intensively studied in the literature. It is also well known that the expressiveness of linear threshold functions is quite limited (Minsky & Papert, 1968). Despite this fact, both Perceptron and Winnow have been applied successfully in recent years to several large scale real world classification problems. As one example, the SNoW system (Roth, 1998; Carlson, Cumby, Rosen, & Roth, 1999) has successfully applied variations of Perceptron and Winnow to problems in natural language processing. The SNoW system extracts basic Boolean features x1, . . . , xn from labeled pieces of text data in order to represent the examples, thus the features have numerical values restricted to {0, 1}. There are several ways to enhance the set of basic features x1, . . . , xn for Perceptron or Winnow. One idea is to expand the set of basic features x1, . . . , xn using conjunctions such as (x1∧x3∧x4) and use these expanded higher-dimensional examples, in which each conjunction plays the role of a basic feature, as the examples for Perceptron or Winnow. This is in fact the approach which the SNoW system takes running Perceptron or Winnow over a space of restricted conjunctions of these basic features. This idea is closely related to the use of kernel methods, see e.g. the book of Cristianini and Shawe-Taylor (2000), where a feature expansion is done implicitly through the kernel function.",
      "startOffset" : 9,
      "endOffset" : 1875
    }, {
      "referenceID" : 7,
      "context" : "Before describing our results, we recall some necessary background on the on-line learning model (Littlestone, 1988) and the Perceptron and Winnow algorithms.",
      "startOffset" : 97,
      "endOffset" : 116
    }, {
      "referenceID" : 12,
      "context" : "The famous Perceptron Convergence Theorem (Rosenblatt, 1958; Block, 1962; Novikoff, 1963) bounds the number of mistakes which the Perceptron algorithm can make:",
      "startOffset" : 42,
      "endOffset" : 89
    }, {
      "referenceID" : 10,
      "context" : "The famous Perceptron Convergence Theorem (Rosenblatt, 1958; Block, 1962; Novikoff, 1963) bounds the number of mistakes which the Perceptron algorithm can make:",
      "startOffset" : 42,
      "endOffset" : 89
    }, {
      "referenceID" : 7,
      "context" : "The Winnow algorithm (Littlestone, 1988) has a very similar structure.",
      "startOffset" : 21,
      "endOffset" : 40
    }, {
      "referenceID" : 7,
      "context" : "The Winnow algorithm (Littlestone, 1988) has a very similar structure. Winnow maintains a hypothesis vector w ∈ RN which is initially w = (1, . . . , 1). Winnow is parameterized by a promotion factor α > 1 and a threshold θ > 0; upon receiving an example x ∈ {0, 1}N Winnow predicts according to the threshold function w ·x ≥ θ. If the prediction is 1 and the label is −1 then for all i such that xi = 1 the value of wi is set to wi/α; this is a demotion step. If the prediction is −1 and the label is 1 then for all i such that xi = 1 the value of wi is set to αwi; this is a promotion step. No change is made to w if the prediction is correct. For our purposes the following mistake bound, implicit in Littlestone’s work (1988), is of interest:",
      "startOffset" : 22,
      "endOffset" : 730
    }, {
      "referenceID" : 18,
      "context" : "Our first result (cf. also the papers of Sadohara, 1991; Watkins, 1999; and Kowalczyk et al., 2001) uses kernel functions to show that it is possible to efficiently run the kernel Perceptron algorithm over an exponential number of conjunctive features.",
      "startOffset" : 17,
      "endOffset" : 99
    }, {
      "referenceID" : 17,
      "context" : "We also give a variant of this result showing that kernel Perceptron fails in the Probably Approximately Correct (PAC) learning model (Valiant, 1984) as well.",
      "startOffset" : 134,
      "endOffset" : 149
    }, {
      "referenceID" : 0,
      "context" : "Angluin (1990) proved that DNF expressions cannot be learned efficiently using equivalence queries whose hypotheses are themselves DNF expressions.",
      "startOffset" : 0,
      "endOffset" : 15
    }, {
      "referenceID" : 14,
      "context" : "This kernel has been obtained independently by Sadohara (2001). To express all monotone monomials as in (2) we take K(x, y) = 2|x∩y| where |x ∩ y| is the number of active features common to both x and y, i.",
      "startOffset" : 47,
      "endOffset" : 63
    }, {
      "referenceID" : 2,
      "context" : "This kernel is reported also by Watkins (1999). For case (4) we have K(x, y) = ∑k l=0 (|x∩y| l )",
      "startOffset" : 15,
      "endOffset" : 47
    }, {
      "referenceID" : 6,
      "context" : "5 of the book by Van Lint (1992), there can be at most 20.",
      "startOffset" : 21,
      "endOffset" : 33
    }, {
      "referenceID" : 17,
      "context" : "The proof above can be adapted to give a negative result for kernel Perceptron in the PAC learning model (Valiant, 1984).",
      "startOffset" : 105,
      "endOffset" : 120
    }, {
      "referenceID" : 16,
      "context" : "The proof above can be adapted to give a negative result for kernel Perceptron in the PAC learning model (Valiant, 1984). In this model each example x is independently drawn from a fixed probability distribution D and with high probability the learner must construct a hypothesis h which has high accuracy relative to the target concept c under distribution D. See the Kearns-Vazirani text (1994) for a detailed discussion of the PAC learning model.",
      "startOffset" : 106,
      "endOffset" : 397
    }, {
      "referenceID" : 16,
      "context" : "The following problem is #P-hard (Valiant, 1979):",
      "startOffset" : 33,
      "endOffset" : 48
    }, {
      "referenceID" : 11,
      "context" : "See the book of Papadimitriou (1994) or the paper of Valiant (1979) for details on #P.",
      "startOffset" : 16,
      "endOffset" : 37
    }, {
      "referenceID" : 11,
      "context" : "See the book of Papadimitriou (1994) or the paper of Valiant (1979) for details on #P.",
      "startOffset" : 16,
      "endOffset" : 68
    }, {
      "referenceID" : 13,
      "context" : "In the paper (Cumby & Roth, 2003) a kernel for expressions in description logic (generalizing the monomials kernel) is developed and successfully applied for natural language and molecular problems. Takimoto and Warmuth (2003) study the use of multiplicative update algorithms other than Winnow (such as weighted majority) and obtain some positive results by restricting the type of loss function used to be additive over base features.",
      "startOffset" : 22,
      "endOffset" : 227
    }, {
      "referenceID" : 13,
      "context" : "In the paper (Cumby & Roth, 2003) a kernel for expressions in description logic (generalizing the monomials kernel) is developed and successfully applied for natural language and molecular problems. Takimoto and Warmuth (2003) study the use of multiplicative update algorithms other than Winnow (such as weighted majority) and obtain some positive results by restricting the type of loss function used to be additive over base features. Chawla et al. (2004) have studied Monte Carlo estimation approaches to approximately simulate the Winnow algorithm’s performance when run over a space of exponentially many features.",
      "startOffset" : 22,
      "endOffset" : 458
    } ],
    "year" : 2011,
    "abstractText" : "The paper studies machine learning problems where each example is described using a set of Boolean features and where hypotheses are represented by linear threshold elements. One method of increasing the expressiveness of learned hypotheses in this context is to expand the feature set to include conjunctions of basic features. This can be done explicitly or where possible by using a kernel function. Focusing on the well known Perceptron and Winnow algorithms, the paper demonstrates a tradeoff between the computational efficiency with which the algorithm can be run over the expanded feature space and the generalization ability of the corresponding learning algorithm. We first describe several kernel functions which capture either limited forms of conjunctions or all conjunctions. We show that these kernels can be used to efficiently run the Perceptron algorithm over a feature space of exponentially many conjunctions; however we also show that using such kernels, the Perceptron algorithm can provably make an exponential number of mistakes even when learning simple functions. We then consider the question of whether kernel functions can analogously be used to run the multiplicative-update Winnow algorithm over an expanded feature space of exponentially many conjunctions. Known upper bounds imply that the Winnow algorithm can learn Disjunctive Normal Form (DNF) formulae with a polynomial mistake bound in this setting. However, we prove that it is computationally hard to simulate Winnow’s behavior for learning DNF over such a feature set. This implies that the kernel functions which correspond to running Winnow for this problem are not efficiently computable, and that there is no general construction that can run Winnow with kernels.",
    "creator" : "dvips(k) 5.86 Copyright 1999 Radical Eye Software"
  }
}