{
  "name" : "1205.0079.pdf",
  "metadata" : {
    "source" : "META",
    "title" : "Complexity Analysis of the Lasso Regularization Path",
    "authors" : [ ],
    "emails" : [ "julien@stat.berkeley.edu", "binyu@stat.berkeley.edu" ],
    "sections" : [ {
      "heading" : null,
      "text" : "ar X\niv :1\n20 5.\n00 79\nv2 [\nst at\n.M L\n] 1\n9 M\nay 2\n01 2\n√ ε) linear segments can always\nbe obtained, where every point on the path is guaranteed to be optimal up to a relative ε-duality gap. We complete our theoretical analysis with a practical algorithm to compute these approximate paths."
    }, {
      "heading" : "1. Introduction",
      "text" : "Without a priori knowledge about data, it is often difficult to estimate a model or make predictions, either because the number of observations is too small, or the problem dimension too high. When a problem solution is known to be sparse, sparsity-inducing penalties have proven to be useful to improve both the quality of the prediction and its intepretability. In particular, the ℓ1-norm has been used for that purpose in the Lasso formulation (Tibshirani, 1996).\nControlling the regularization often requires to tune a parameter. In a few cases, the regularization path— that is, the set of solutions for all values of the regularization parameter, can be shown to be piecewise linear (Rosset & Zhu, 2007). This property is exploited in homotopy methods, which consist of following the piecewise linear path by computing the direction of the current linear segment and the points where the direction changes (also known as kinks). Piecewise linearity of regularization paths was discovered by Markowitz (1952) for portfolio selection; it was similarly exploited\nAppearing in Proceedings of the 29 th International Conference on Machine Learning, Edinburgh, Scotland, UK, 2012. Copyright 2012 by the author(s)/owner(s).\nby Osborne et al. (2000) and Efron et al. (2004) for the Lasso, and by Hastie et al. (2004) for the support vector machine (SVM). As observed by Gärtner et al. (2010), all of these examples are in fact particular instances of parametric quadratic programming formulations, for which path-following algorithms appear early in the optimization literature (Ritter, 1962).\nIn this paper, we study the number of linear segments of the Lasso regularization path. Even though experience with data suggests that this number is linear in the problem size (Rosset & Zhu, 2007), it is known that discrepancies can be observed between worst-case and empirical complexities. This is notably the case for the simplex algorithm (Dantzig, 1951), which performs empirically well for solving linear programs even though it suffers from exponential worst-case complexity (Klee & Minty, 1972). Similarly, by using geometrical tools originally developed to analyze the simplex algorithm, Gärtner et al. (2010) have shown that the complexity of the SVM regularization path can be exponential. However, to the best of our knowledge, none of these results do apply to the Lasso regularization path, whose theoretical complexity remains unknown. The goal of our paper is to fill in this gap.\nOur first contribution is to show that in the worst-case the number of linear segments of the Lasso regularization path is exactly (3p+1)/2, where p is the number of variables (predictors). We remark that our proof is constructive and significantly different than the ones proposed by Klee & Minty (1972) for the simplex algorithm and by Gärtner et al. (2010) for SVMs. Our approach does not rely on geometry but on an adversarial scheme. Given a Lasso problem with p variables, we show how to build a new problem with p+1 variables increasing the complexity of the path by a multiplicative factor. It results in explicit pathological examples that are surprisingly simple, unlike pathological examples for the simplex algorithm or SVMs.\nWorst-case complexity analyses are by nature pessimistic. Our second contribution on approximate regularization paths is more optimistic. In fact, we show\nthat an approximate path for the Lasso with at most O(1/ √ ε) segments can always be obtained, where every point on the path is guaranteed to be optimal up to a relative ε-duality gap. We follow in part the methodology of Giesen et al. (2010) and Jaggi (2011), who have presented weaker results but in a more general setting for parameterized convex optimization problems. Our analysis builds upon approximate optimality conditions, which we maintain along the path, leading to a practical approximate homotopy algorithm.\nThe paper is organized as follows: Section 2 presents some brief overview of the Lasso. Section 3 is devoted to our worst-case complexity analysis, and Section 4 to our results on approximate regularization paths."
    }, {
      "heading" : "2. Background on the Lasso",
      "text" : "In this section, we present the Lasso formulation of Tibshirani (1996) and well known facts, which we exploit later in our analysis. For self-containedness and clarity reasons we include simple proofs of these results. Let y be a vector in Rn and X = [x1, . . . ,xp] be a matrix in Rn×p. The Lasso is formulated as:\nmin w∈Rp\n1 2 ‖y −Xw‖22 + λ‖w‖1, (1)\nwhere the ℓ1-norm induces sparsity in the solution w and λ>0 controls the amount of regularization. Under a few assumptions, which are detailed in the sequel, the solution of this problem is unique. We denote it by w⋆(λ) and define the regularization path P as the set of all solutions for all positive values of λ:1\nP , {w⋆(λ) : λ > 0}. The following lemma presents classical optimality and uniqueness conditions for the Lasso solution (see Fuchs, 2005), which are useful to characterize P : Lemma 1 (Optimality Conditions of the Lasso). A vector w⋆ in Rp is a solution of Eq. (1) if and only if for all j in {1, . . . , p},\nxj⊤(y −Xw⋆) = λ sign(w⋆j ) if w⋆j 6= 0, |xj⊤(y −Xw⋆)| ≤ λ otherwise. (2)\nDefine J , {j ∈ {1, . . . , p} : |xj⊤(y − Xw⋆)| = λ}. Assuming the matrix XJ = [x\nj ]j∈J to be full rank, the solution is unique and we have\nw⋆J = (X ⊤ J XJ) −1(X⊤J y − ληJ), (3) where η , sign(X⊤(y−Xw⋆)) is in {−1; 0;+1}p, and the notation uJ for a vector u denotes the vector of size |J | recording the entries of u indexed by J .\n1For technicality reasons, we enforce λ>0 even though the limit w⋆(0+) , limλ→0+ w ⋆(λ) may exist.\nProof. Eq. (2) can be obtained by considering subgradient optimality conditions. These can be written as 0 ∈ {−X⊤(y − Xw⋆) + λp : p ∈ ∂‖w⋆‖1}, where ∂‖w⋆‖1 denotes the subdifferential of the ℓ1norm at w⋆. A classical result (Borwein & Lewis, 2006) says that the subgradients p are the vectors in Rp such that for all j in {1, . . . , p}, pj = sign(w⋆j ) if w⋆j 6= 0, and |pj | ≤ 1 otherwise. This gives Eq. (2). The equalities in Eq. (2) define a linear system that has a unique solution given by (3) when XJ is full rank.\nLet us now show the uniqueness of the Lasso solution. Consider another solution w′⋆ and choose a scalar θ in (0, 1). By convexity, wθ⋆ , θw⋆ + (1 − θ)w′⋆ is also a solution. For all j /∈ J , we have |xj⊤(y −Xwθ⋆)| ≤ θ|xj⊤(y−Xw⋆)|+(1− θ)|xj⊤(y−Xw′⋆)| < λ. Combining this inequality with the conditions (2), we necessarily have wθ⋆\nJ∁ = w⋆ J∁ = 0,2 and the vector wθ⋆J is\nalso a solution of the following reduced problem:\nmin w̃∈R|J|\n1 2 ‖y−XJw̃‖22 + λ‖w̃‖1.\nWhen XJ is full rank, the Hessian X ⊤ J XJ is positive definite and this reduced problem is strictly convex. Thus, it admits a unique solution wθ⋆J = w ⋆ J . It is then easy to conclude that w⋆ = wθ⋆ = w′⋆.\nWith the assumption that the matrixXJ is always fullrank, we can formally recall a well-known property of the Lasso (see Markowitz, 1952; Osborne et al., 2000; Efron et al., 2004) in the following lemma:\nLemma 2 (Piecewise Linearity of the Path). Assume that for any λ > 0 and solution of Eq. (1) the matrix XJ defined in Lemma 1 is full-rank. Then, the regularization path {w⋆(λ) : λ > 0} is well defined, unique and continuous piecewise linear.\nProof. The existence/uniqueness of the regularization path was shown in Lemma 1.\nLet us define {η⋆(λ) , sign(w⋆(λ)) : λ > 0} the set of sparsity patterns. Let us now consider λ1 < λ2 such that η⋆(λ1) = η\n⋆(λ2). For all θ ∈ [0, 1], it is easy to see that the solution wθ⋆ , θw⋆(λ1) + (1 − θ)w⋆(λ2) satisfies the optimality conditions of Lemma 1 for λ = θλ1+(1−θ)λ2, and that w⋆(θλ1 + (1−θ)λ2)= wθ⋆. This shows that whenever two solutions w⋆(λ1) and w⋆(λ2) have the same signs for λ1 6=λ2, the regularization path between λ1 and λ2 is a linear segment. As an important consequence, the number of linear segments of the path is smaller than 3p, the number of possible sparsity patterns in {−1, 0, 1}p. The path P is therefore piecewise linear with a finite number of kinks.\n2J∁ denotes the complement of the set J in {1, . . . , p}.\nMoreover, since the function λ → w⋆(λ) is piecewise linear, it is piecewise continuous and has right and left limits for every λ > 0. It is easy to show that these limits satisfy the optimality conditions of Eq. (2). By uniqueness of the Lasso solution, they are equal to w⋆(λ) and the function is in fact continuous.\nAssuming again that XJ is always full rank, we can now present in Algorithm 1 the homotopy method (Osborne et al., 2000; Efron et al., 2004).\nAlgorithm 1 Homotopy Algorithm for the Lasso.\n1: Inputs: a vector y in Rn; a matrix X in Rn×p; 2: initialization: set λ to ‖X⊤y‖∞; we have\nw⋆(λ) = 0 (trivial solution); 3: set J , {j0} such that |xj0⊤y| = λ; 4: while λ > 0 do 5: Set η , sign(X⊤(y−Xw⋆(λ)); 6: compute the direction of the path:\n{ w⋆J(λ) = (X ⊤ J XJ ) −1(X⊤J y−ληJ) w⋆\nJ∁ (λ) = 0.\n7: Find the smallest step τ > 0 such that: • there exists j ∈ J∁ such that |xj⊤(y−Xw⋆(λ−τ))| = λ−τ ; add j to J ; • there exists j in J such that w⋆j (λ) 6= 0 and w⋆j (λ−τ) = 0; remove j from J ; 8: replace λ by λ− τ ; record the pair (λ,w⋆(λ)); 9: end while\n10: Return: sequence of recorded values (λ,w⋆(λ)).\nIt can be shown that this algorithmmaintains the optimality conditions of Lemma 1 when λ decreases. Two assumptions have nevertheless to be made for the algorithm to be correct. First, (XTJXJ ) has to be invertible, which is a reasonable assumption commonly made when working with real data and when one is interested in sparse solutions. When (XTJXJ ) becomes ill-conditioned, which may typically occur for small values of λ, the algorithm has to stop and the path is truncated. Second, one assumes in Step 7 of the algorithm that the value τ corresponds to a single event |xj⊤(y−Xw⋆(λ−τ))| = λ−τ for j in J∁ orw⋆j (λ−τ) hits zero for j in J . In other words, variables enter or exit the path one at a time. Even though this assumption is reasonable most of the time, it can be problematic from a numerical point of view in rare cases. When the length of a linear segment of P is smaller than the numerical precision, the algorithm can fail. In contrast, our approximate homotopy algorithm presented in Section 4 is robust to this issue. In the next section, we present our worst-case complexity analysis of the regularization path, showing that Algorithm 1 can have exponential complexity."
    }, {
      "heading" : "3. Worst-Case Complexity",
      "text" : "We denote by {η⋆(λ) , sign(w⋆(λ)) : λ > 0} the set of sparsity patterns in {−1, 0, 1}p encountered along the path P . We have seen in the proof of Lemma 2 that whenever η⋆(λ1) = η\n⋆(λ2), for λ1, λ2 > 0, then η ⋆(λ) = η⋆(λ1) for all λ ∈ [λ1, λ2], and thus the number of linear segments of P is upper-bounded by 3p. With an additional argument, we can further reduce this number, as stated in the following proposition:\nProposition 1 (Upper-bound Complexity). Let assume the same conditions as in Lemma 2. The number of linear segments in the regularization path of the Lasso is less than (3p + 1)/2.\nProof. We have already noticed that the number of linear segments of the path is at most 3p. Let us consider η ⋆(λ1) 6=0 for λ1>0. We now show that for all λ2>0, we have η⋆(λ2) 6=−η⋆(λ1), and therefore the number of different sparsity patterns on the path P is in fact less than or equal to (3p+1)/2.\nLet us assume that there exists λ2 > 0 with η ⋆(λ2) = −η⋆(λ1), and look for a contradiction. We define the set J ′ , {j ∈ {1, . . . , p} : η⋆j (λ1) 6= 0}, and consider the solution of the reduced problem for all λ ≥ 0:\nw̃⋆(λ) , argmin w̃∈R|J′|\n1 2 ‖y −XJ′w̃‖22 + λ‖w̃‖1,\nwhich is well defined since the optimization problem is strictly convex (the conditions of Lemma 2 imply that XJ′ is full rank). We remark that w̃\n⋆(λ1) = w⋆J′(λ1), and w̃ ⋆(λ2) = w ⋆ J′(λ2). Given the optimality conditions of Lemma 1, it is then easy to show that w̃⋆(0) = (X⊤J′XJ′) −1X⊤J′y = λ2 λ1+λ2 w̃⋆(λ1) +\nλ1 λ1+λ2 w̃⋆(λ2). Since the signs of w̃ ⋆(λ1) and w̃ ⋆(λ2) are opposite to each other and non-zero, we have ‖w̃⋆(0)‖1 < ‖w̃⋆(λ1)‖1. Independently, it is also easy to show that the function λ → ‖w̃⋆(λ)‖1 should be non-increasing, and we obtain a contradiction.\nIn the next proposition, we present our adversarial strategy to build a pathological regularization path. Given a Lasso problem with p variables and a path P , we design an additional variable along with an extra dimension, such that the number of kinks of the new path P̃ increases by a multiplicative factor compared to P . We call our strategy “adversarial” since it consists of iteratively designing “pathological” variables.\nProposition 2 (Adversarial Strategy). Let us consider y in Rn and X in Rn×p such that the conditions of Lemma 2 are satisfied and y is in the span of X. We denote by P the regularization path of the Lasso problem corresponding to (y,X), by k the\nnumber of linear segments of P, and by λ1 > 0 the smallest value of the parameter λ corresponding to a kink of P. We define the vector ỹ in Rn+1 and the matrix X̃ in R(n+1)×(p+1) as follows:\nỹ ,\n[ y\nyn+1\n]\n, X̃ , [ X 2αy 0 αyn+1 ] ,\nwhere yn+1 6= 0 and 0 < α < λ1/(2y⊤y + y2n+1).\nThen, the regularization path P̃ of the Lasso problem associated to (ỹ, X̃) exists and has 3k−1 linear segments. Moreover, let us consider {η1 =0,η2, . . . ,ηk} the sequence of sparsity patterns in {−1, 0, 1}p of P (the signs of the solutions w⋆(λ)), ordered from large to small values of λ. The sequence of sparsity patterns in {−1, 0, 1}p+1 of the new path P̃ is the following:\n{ first k patterns\n︷ ︸︸ ︷ [ η 1\n0\n]\n,\n[ η 2\n0\n]\n, . . . ,\n[ η k\n0\n]\n,\nmiddle k patterns ︷ ︸︸ ︷ [ η k\n1\n]\n,\n[ η k−1\n1\n]\n, . . . , [ η 1=0 1 ] ,\n[ −η2 1 ] , [ −η3 1 ] , . . . , [ −ηk 1 ] ︸ ︷︷ ︸\nlast k−1 patterns\n}\n. (4)\nLet us first make some remarks about this proposition: • According to Eq. (4) the sparsity patterns of the new path P̃ are related to those of P . More precisely, they have either the form [ηi⊤, 0]⊤ or [±ηi⊤, 1]⊤, where ηi is a sparsity pattern in {−1, 0, 1}p of P .\n• The last column of X̃ involves a factor α that controls its norm. With α small enough, the (p+1)-th variable enters late the path P̃ . As shown in Eq. (4), the first k sparsity patterns of P̃ do not involve this variable and are exactly the same as those of P .\n• Let us give some intuition about the pathological behavior of the path P̃ . The first k kinks of P̃ are the same as those of P , and after these first k kinks we have y ≈ Xw⋆(λ). Then, the (p+1)-th variable enters the path and we heuristically have\nX̃\n[ w⋆(λ)\n0\n]\n+\n[ 0\nyn+1\n] ≈ ỹ ≈ X̃ [ −w⋆(λ) 1/α ] . (5)\nThe left side of Eq. (5) tells us that when the (p+1)th variable is inactive, the coefficients associated to the first p variables should be close to w⋆(λ). At the same time, the right side of Eq. (5) tells us that when the (p+1)-th variable is active, these same p coefficients should be instead close to −w⋆(λ). According to Eq. (4), the signs of these p coefficients along the path switch from ηk=sign(w⋆(λ)) to −ηk by following the sequence ηk,ηk−1, . . . , (η1 =0 =−η1),−η2, . . . ,−ηk, resulting in a path with 3k−1 linear segments. The proof below more rigorously describes this strategy:\nProof. Existence of the new regularization path: Let us rewrite the Lasso problem for (ỹ, X̃).\nmin w̃∈Rp,w̃∈R\n1\n2\n∥ ∥ ∥ ∥ ỹ − X̃ [ w̃ w̃ ]∥ ∥ ∥ ∥ 2\n2\n+ λ ∥ ∥ ∥ ∥ [ w̃ w̃ ]∥ ∥ ∥ ∥ 1 ,\n= min w̃∈Rp,w̃∈R\n1 2 ‖(1−2αw̃)y−Xw̃‖22+ 1 2 (yn+1−αyn+1w̃)2\n+λ‖w̃‖1+λ|w̃|. (6)\nLet (w̃⋆, w̃⋆) be a solution for a given λ > 0. By fixing w̃ = w̃⋆ in Eq. (6) and optimizing with respect to w̃, we obtain an equivalent problem to (6):\nmin w̃′∈Rp\n1 2 ‖y−Xw̃′‖22 +\nλ\n|1− 2αw̃⋆| ‖w̃ ′‖1,\nwith the change of variable w̃ = (1 − 2αw̃⋆)w̃′ and assuming 1− 2αw̃⋆ 6= 0. The solution of this problem is unique since it is a point of P and we therefore have\nw̃⋆ =\n{ (1− 2αw̃⋆)w⋆ (\nλ |1−2αw̃⋆|\n)\nif w̃⋆ 6= 12α 0 otherwise .\n(7) Since the last column of X̃ is not in the span of the first p columns by construction of X̃, it is then easy to see that the conditions of Lemma 2 are necessarily satisfied and therefore (w̃⋆, w̃⋆) is in fact the unique solution of Eq. (6). Since this is true for all λ > 0, the regularization path is well defined, and we denote from now on the above solutions by w̃⋆(λ) and w̃⋆(λ).\nMaximum number of linear segments: We now show that the number of linear segments of the path is upper-bounded by 3k−1. Eq. (7) shows that sign(w̃⋆(λ)) has the form ±ηi, where ηi in {−1, 0, 1}p is one of the k sparsity patterns from P , whereas we have three possibilities for sign(w̃⋆(λ)), namely {−1, 0,+1}. Since one can not have two non-zero sparsity patterns that are opposite to each other on the same path, as shown in the proof of Proposition 1, the number of possible sparsity patterns reduces to 3k−1. Characterization of the first k linear segments: Let us consider λ≥ λ1 and show that w̃⋆(λ) =w⋆(λ) and w̃⋆(λ)=0 by checking the optimality conditions of Lemma 1. The first p equalities/inequalities in Eq. (2) are easy to verify, the last one being also satisfied:\n|2αy⊤(y−Xw⋆(λ))+αy2n+1| ≤ 2α‖y‖22 + αy2n+1 < λ1,\nwhere the last inequality is obtained from the definition of α. Since this inequality is strict, this also ensures that there exists 0 < λ′1 < λ1 such that w̃⋆(λ) = w⋆(λ) and w̃⋆(λ) = 0 for all λ ≥ λ′1. We have therefore shown that the first k sparsity patterns of the regularization path are given in Eq. (4).\nCharacterization of the last 2k−1 segments: We mainly use here the form of Eq. (7) and a few continuity arguments to characterize the rest of the path. First, we remark that for all β in [0, 1α ), there exists a value for λ > 0 such that w̃⋆(λ) = β. This is true because: (i) λ→ w̃⋆(λ) is continuous; (ii) w̃⋆(λ1)= 0; (iii) w̃⋆(0+)= 1α . Point (i) was shown in Lemma 2, point (ii) in the previous paragraph, and point (iii) is necessary to have the term (yn+1−αyn+1w̃)2 in Eq. (6) go to 0 when λ goes to 0+.\nWe now consider two values λ′1, λ ′ 2 > 0 such that w̃⋆(λ′1) = 0, w̃ ⋆(λ′2) = 1 2α and w̃\n⋆(λ) ∈ (0, 12α ) for all λ ∈ (λ′1, λ′2). On this open interval, we have that (1 − 2αw̃⋆(λ))> 0, and the continuous function λ → λ/|(1− 2αw̃⋆(λ))| ranges from λ′1 to +∞. Combining this observation with Eq. (7), we obtain that all sparsity patterns of the form [ηi⊤, 1]⊤ for i in {1, . . . , k} appear on the regularization path. With similar continuity arguments, it is easy to show that all sparsity patterns of the form [−ηi⊤, 1]⊤ for i in {1, . . . , k} appear on the path as well.\nWe had previously identified k of the sparsity patterns, and now have identified 2k−1 different ones. Since we have at most 3k−1 linear segments, the set of sparsity patterns on the path P̃ is entirely characterized. The fact that the sequence of sparsity patterns is the one given in Eq. (4) can easily be shown by reusing similar continuity arguments.\nWith this proposition in hand, we can now state the main result of this section:\nTheorem 1 (Worst-case Complexity). In the worst case, the regularization path of the Lasso has exactly (3p + 1)/2 linear segments.\nProof. We start with n = p = 1, and define y = [1], and X= [1], leading to a path with k = 2 segments. We then recursively apply Proposition 2, keeping n=p, choosing at iteration p + 1, yp+1 = 1, and a factor α=αp+1 satisfying the conditions of Proposition 2. Denoting by kp the number of linear segments at iteration p, we have that kp+1 =3kp−1, and it is easy to show that kp=(3\np+1)/2. According to Proposition 1, this is the longest possible regularization path. Note that this example has a particularly simple shape:\ny ,\n\n      1 1 1 ... 1\n\n      , X ,\n\n      α1 2α2 2α3 . . . 2αp 0 α2 2α3 . . . 2αp 0 0 α3 . . . 2αp ... ... ... . . . ...\n0 0 0 . . . αp\n\n      ."
    }, {
      "heading" : "3.1. Numerical Simulations",
      "text" : "We have implemented Algorithm 1 in Matlab, optimizing numerical precision regardless of computational efficiency, which has allowed us to check our theoretical results for small values of p. For instance, we obtain a path with (3p + 1)/2 = 88 574 linear segments for p = 11, and present such a pathological path in Figure 1. Note that when p gets larger, these examples quickly lead to precision issues where some kinks are very close to each other. Our implementation and our pathological examples will be made publicly available. In the next section, we present more optimistic results on approximate regularization paths."
    }, {
      "heading" : "4. Approximate Homotopy",
      "text" : "We now present another complexity analysis when exact solutions of Eq. (1) are not required. We follow in part the methodology of Giesen et al. (2010), later refined by Jaggi (2011), on approximate regularization paths of parameterized convex functions. Their results are quite general but, as we show later, we obtain stronger results with an analysis tailored to the Lasso.\nA natural tool to guarantee the quality of approximate solutions is the duality gap. Writing the Lagrangian of problem (1) and minimizing with respect to the primal variable w yields the following dual formulation of (1):\nmax κ∈Rn −1 2 κ ⊤ κ− κ⊤y s.t. ‖X⊤κ‖∞ ≤ λ, (8)\nwhere κ in Rn is a dual variable. Let us denote by fλ(w) the objective function of the primal problem (1) and by gλ(κ) the objective function of the dual (8). Given a pair of feasible primal and dual variables (w,κ), the difference δλ(w,κ) , fλ(w) − gλ(κ) is called a duality gap and provides an optimality guar-\nantee (see Borwein & Lewis, 2006):\n0 ≤ fλ(w) − fλ(w⋆(λ)) ≤ δλ(w,κ). In plain words, it upper bounds the difference between the current value of the objective function fλ(w) and the optimal value of the objective function fλ(w\n⋆(λ)). In this paper, we use a relative duality gap criterion to guarantee the quality of an approximate solution:3\nDefinition 1 (ε-approximate Solution). let ε be in [0, 1]. A vector w in Rp is said to be an εapproximate solution of problem (1) if there exists κ in Rn such that ‖X⊤κ‖∞≤λ and δλ(w,κ)≤εfλ(w). Given a set P̃ , {w̃(λ) ∈ Rp : λ > 0}, we say that P̃ is an ε-approximate regularization path if any point w̃(λ) of P̃ is an ε-approximate solution for problem (1).\nOur goal is now to build ε-approximate regularization paths and study their complexity. To that effect, we introduce approximate optimality conditions based on small perturbations of those given in Lemma 1:\nDefinition 2 (OPTλ(ε1, ε2) Condition). Let ε1≥0 and ε2≥−ε1. A vector w in Rp satisfies the OPTλ(ε1, ε2) condition if and only if for all 1≤j≤p, λ(1−ε2)≤xj⊤(y−Xw) sign(wj)≤λ(1+ε1) if wj 6=0,\n|xj⊤(y−Xw)|≤λ(1+ε1) otherwise. (9)\nNote that when ε1 = ε2 =0, this condition reduces to the exact optimality conditions of Lemma 1. Of interest for us is the relation between Definitions 1 and 2. Let us consider a vector w such that OPTλ(ε1, ε2) is satisfied. Then, the vector κ , 11+ε1 (Xw−y) is feasible for the dual (8) and we can compute a duality gap:\nδλ(w,κ) = fλ(w) − gλ(κ)\n= 1\n2 (1 + ε1)\n2 κ ⊤ κ+ λ‖w‖1 +\n1 2 κ ⊤ κ+ κ⊤y\n= ε21 2 κ ⊤ κ+ λ‖w‖1 + κ⊤ ( y + (1 + ε1)κ ) = ε21\n(1 + ε1)2 1 2 ‖y −Xw‖22 + λ‖w‖1 + κ⊤Xw.\nFrom Eq. (9), it is easy to show that λ‖w‖1+κ⊤Xw ≤ ε1+ε2 1+ε1 λ‖w‖1, and we can obtain the following bound:\nδλ(w,κ) ≤ max ( ε21 (1 + ε1)2 , ε1 + ε2 1 + ε1 ) fλ(w). (10)\nFrom this upper bound, we derive our first result:\n3Note that our criterion is not exactly the same as in Jaggi (2011). Whereas Jaggi (2011) consider a formulation where the ℓ1-norm appears in a constraint, Eq. (1) involves an ℓ1-penalty. Even though these formulations have the same regularization path, they involve slightly different objective functions, dual formulations, and duality gaps.\nProposition 3 (Approximate Analysis). Let y be in Rn and X in Rn×p such that the conditions of Lemma 2 are satisfied. Let λ∞,‖X⊤y‖∞ be the value of λ corresponding to the start of the path, and λ1 > 0 be the one corresponding to the last kink. For all ε∈(0, 1), there exists an ε-approximate regularization path with at most ⌈ log(λ∞/λ1)√\nε\n⌉\nlinear segments.\nProof. From Eq. (9), one can show by a simple calculation that an exact solution w⋆(λ) for a given λ satisfies OPTλ(1−ε3)(ε3/(1−ε3),−ε3/(1−ε3)). According to Eq. (10), there exists a dual variable κ such that δλ(1−ε3)(w\n⋆(λ),κ)≤ ε23. Thus, for any λ′ chosen in [λ, λ(1−√ε)], the solutionw⋆(λ) is an ε-approximate solution for the parameter λ′. Between λ∞ and λ1, we can obtain an ε-approximate piecewise linear (in fact piecewise constant) regularization path by sampling solutions w⋆(λ) for λ in {λ∞, λ∞(1− √ ε), . . . , λ∞(1−√\nε)k, λ1} with λ∞(1− √ ε)k+1 ≤ λ1. The number of segments of the corresponding approximate path is at most ⌊ − log(λ∞/λ1) log(1−√ε) ⌋ +1≤ ⌈ log(λ∞/λ1)√ ε ⌉ .\nNote that the term λ∞/λ1 is possibly large, but it is controlled by a logarithmic function and can be considered as constant for finite precision machines. In other words, the complexity of the approximate path is upper-bounded by O(1/ √ ε). In contrast, the analysis of Giesen et al. (2010) and Jaggi (2011) give us: • an approximate path with O(1/ε) linear segments can be obtained with a weaker approximation guarantee than ours. Namely, a bound δ≤ ε along the path, where δ is a duality gap, whereas we use relative duality gaps of the form δ≤ εfλ(w);4 Interestingly, this bound is proven to be optimal in the context of parameterized convex functions on the ℓ1-ball. Our result show that such bound can be improved for the Lasso.\n• a methodology to obtain relative duality gaps along the path, which can easily provide complexity bounds for the full path of different problems, notably support vector machines, but not for the Lasso.\nProposition 3 is optimistic, but not practical since it requires sampling exact solutions of the path P . We introduce an approximate homotopy method in Algorithm 2 which does not require computing exact solutions and still enjoys a similar complexity. It exploits the piecewise linearity of the path, but uses a firstorder method (Beck & Teboulle, 2009; Fu, 1998) when the linear segments of the path are too short.\n4When there exists m,M>0 such that m<fλ<M , the relative duality gap guarantee is similar (up to a constant) to the simple bound δ ≤ ε. However, we have for the Lasso that fλ(w\n⋆(λ)) → 0 when λ goes to 0+, as long as y is in the span of X. Note that as noticed in footnote 3, Jaggi (2011) uses a slightly different duality gap than ours.\nAlgorithm 2 Approximate Homotopy for the Lasso.\n1: Inputs: a vector y in Rn, a matrix X in Rn×p, the required precision ε ∈ [0, 1]; λ1 > 0; 2: initialization: set λ to ‖X⊤y‖∞; set w̃(λ) = 0; 3: set θ = 1 + ε/2−√ε/2; 4: set J , {j0} such that |xj0⊤y| = λ; 5: while λ ≥ λ1 do 6: if (X⊤J XJ ) is not invertible then go to 12; 7: set η̃ , (1/λ)X⊤(y−Xw̃(λ)); 8: compute the approximate direction of the path:\n{ w̃J(λ) = (X ⊤ J XJ ) −1(X⊤J y−λη̃J) w̃J∁(λ) = 0.\nFind the smallest step τ > 0 such that: • there exists j in J∁ such that |xj⊤(y−Xw̃(λ−τ))|=(λ−τ)(1+ ε2 ); add j to J ; • there exists j in J such that w̃j(λ) 6= 0 and w̃j(λ−τ)=0; remove j from J ;\n9: if τ ≥ λθ√ε then 10: replace λ by λ− τ ; 11: else 12: replace λ by λ(1 − θ√ε); 13: use a first-order optimization method to find a solution w̃(λ) satisfying OPTλ(ε/2, ε/2); 14: set J = {j ∈ {1, . . . , p} : w̃j(λ) 6= 0}. 15: end if 16: record the pair (λ, w̃(λ)); 17: end while 18: Return: sequence of recorded values (λ, w̃(λ)).\nNote that when ε = 0, Algorithm 2 reduces to Algorithm 1. Our approach exploits the following ideas, which we formally prove in the sequel. Assume that w̃(λ) satisfies OPTλ(ε/2, ε/2). Then,\n• w̃(λ) is an ε-approximation for all λ′ in [λ, λ(1− θ √ ε)]. This guarantees us that one can always make step sizes for λ greater than or equal to λθ √ ε;\n• the direction followed in Step 8 maintains OPTλ(ε/2, ε/2), but when two kinks are too close to each other—that is, τ < λθ √ ε, we directly look for a solution for the parameter λ′ = λ(1−θ√ε) that satisfies OPTλ′(ε/2, ε/2). Any first-order method can be used for that purpose, e.g., a proximal gradient method (Beck & Teboulle, 2009), using the current value w̃(λ) as a warm start. Note also that when (X⊤J XJ ) is not invertible, the method uses first-order steps. The next proposition precisely describes the guarantees of our algorithm.\nProposition 4 (Analysis of Algorithm 2). Let y be in Rn and X in Rn×p. For all λ1>0 and ε∈ (0, 1), Algorithm 2 returns an ε-approximate regularization path on [λ∞, λ1]. Moreover, it terminates in at most ⌈ log(λ∞/λ1)\nθ √ ε\n⌉\niterations, where λ∞ , ‖X⊤y‖∞.\nProof. We first show that any solution on the path is an ε-approximate solution. First, it is easy to check thatOPTλ(ε/2, ε/2) is always satisfied at Step 6. This is either a consequence of Step 13, or because the direction w̃J (λ ′) = (X⊤J XJ ) −1(X⊤J y−λ′η̃J ) maintains OPTλ′(ε/2, ε/2) when λ ′ varies between λ and λ−τ . From Eq. (10), we obtain that w̃(λ) is an εapproximate solution whenever OPTλ(ε/2, ε/2) is satisfied. Thus, we only need to check that w̃(λ) is also an ε-approximate solution for λ′ in [λ, λ(1 − θ√ε)]: for ε3 ≥ 0, it is easy to check that OPTλ(ε/2, ε/2) implies OPTλ(1−ε3)((ε/2+ε3)/(1−ε3), (ε/2−ε3)/(1−ε3)). Setting ε3 = θ √ ε and using Eq. (10), it is possible to show that the desired condition is satisfied. Since the step size for λ is always greater than λθ √ ε, the maximum number of iterations is upper-bounded by ⌊ − log(λ∞/λ1) log(1−θ√ε) ⌋ + 1 ≤ ⌈ log(λ∞/λ1) θ √ ε ⌉\nWe remark that the scalar θ is very close to 1 and therefore the complexity is similar to the one of Proposition 3, with a logarithmic function controlling the possibly large term λ∞/λ1. This algorithm is practical in different aspects: (i) it is almost as simple to implement as the homotopy method; (ii) it is robust to cases where two kinks are too close for the classical homotopy method to work; (iii) it provides optimality guarantees along the path; (iv) whenever possible, it explicitly exploits the piecewise linearity of the path. We next present experiments to verify our analysis."
    }, {
      "heading" : "4.1. Numerical Simulations",
      "text" : "We have implemented Algorithm 2 with a few modifications to the code used in Section 3.1. The inner solver is a coordinate descent algorithm (see Fu, 1998), with a stopping criterion based on Definition 2.\nWe consider 4 datasets. The first one dubbed SYNTH consists of a pure noise fitting scenario with no statistical meaning. The entries of the corresponding vector y and matrix X are i.i.d. draws from a standard normal distribution. The next dataset is called PATHOL and is a pathological example obtained from the analysis of Section 3. Finally, we consider two datasets based on real data, respectively dubbed MADELON5 and PCMAC6. For each dataset, we center and normalize the columns of X and the vector y, and choose the parameter λ1 corresponding to the last kink of the true path.\nFor all datasets, we compute the full regularization path using Algorithm 1 and several ε-approximate regularization paths using Algorithm 2. Note that\n5http://www.nipsfsc.ecs.soton.ac.uk/datasets/. 6http://featureselection.asu.edu/datasets.php.\nthe path of PCMAC was stopped around λ ≈ 10−4 where the matrix X⊤J XJ became ill-conditioned and the Lasso solution dense. As a simple sanity check, we first experimentally verify the correctness of Propositions 3 and 4, by sampling solutions on the approximate path we obtain, computing duality gaps, and checking that the solutions are indeed ε-approximate. We conclude that our experimental results match our theoretical analysis. We present the different path complexities in Table 1.\nInterestingly, the complexity of the pathological example significantly reduces when one is looking for an approximate solution. For example, for ε=10−3, the complexity of the approximate path is less than 0.5% the one of the full path. This significantly contrasts with the pessimistic result obtained in Section 3. As expected, the two examples based on real data exhibit a path complexity of the same order of the problem size, which also significantly reduces when ε increases."
    }, {
      "heading" : "5. Conclusion",
      "text" : "We have presented new results on the regularization path and thus on homotopy methods for the Lasso. First, we have shown that the path has an exponential worst-case complexity, which, as far as we know, had never been formally proved before. Our second result is more optimistic, and shows that when an exact path is not required, only a relatively small number of points on the path need to be computed. Finally, we propose a practical approximate homotopy algorithm, which can provide such approximate paths at a desired precision."
    }, {
      "heading" : "Acknowledgments",
      "text" : "This paper was supported in part by NSF grants SES0835531, CCF-0939370, DMS-1107000, DMS-0907632, and by ARO-W911NF-11-1-0114."
    } ],
    "references" : [ {
      "title" : "A fast iterative shrinkagethresholding algorithm for linear inverse problems",
      "author" : [ "A. Beck", "M. Teboulle" ],
      "venue" : "SIAM J. Imaging Sci.,",
      "citeRegEx" : "Beck and Teboulle,? \\Q2009\\E",
      "shortCiteRegEx" : "Beck and Teboulle",
      "year" : 2009
    }, {
      "title" : "Convex analysis and nonlinear optimization: theory and examples",
      "author" : [ "J.M. Borwein", "A.S. Lewis" ],
      "venue" : null,
      "citeRegEx" : "Borwein and Lewis,? \\Q2006\\E",
      "shortCiteRegEx" : "Borwein and Lewis",
      "year" : 2006
    }, {
      "title" : "Maximization of a linear function of variables subject to linear inequalities",
      "author" : [ "G.B. Dantzig" ],
      "venue" : "In Koopmans, T .C. (ed.), Activity Analysis of Production and Allocation, pp. 339–347.Wiley,",
      "citeRegEx" : "Dantzig,? \\Q1951\\E",
      "shortCiteRegEx" : "Dantzig",
      "year" : 1951
    }, {
      "title" : "Penalized regressions: The bridge versus the Lasso",
      "author" : [ "W.J. Fu" ],
      "venue" : "J. Comput. Graph. Stat.,",
      "citeRegEx" : "Fu,? \\Q1998\\E",
      "shortCiteRegEx" : "Fu",
      "year" : 1998
    }, {
      "title" : "Recovery of exact sparse representations in the presence of bounded noise",
      "author" : [ "J.J. Fuchs" ],
      "venue" : "IEEE T. Inform. Theory.,",
      "citeRegEx" : "Fuchs,? \\Q2005\\E",
      "shortCiteRegEx" : "Fuchs",
      "year" : 2005
    }, {
      "title" : "An exponential lower bound on the complexity of regularization",
      "author" : [ "B. Gärtner", "M. Jaggi", "C. Maria" ],
      "venue" : "paths. preprint arXiv:0903.4817v2,",
      "citeRegEx" : "Gärtner et al\\.,? \\Q2010\\E",
      "shortCiteRegEx" : "Gärtner et al\\.",
      "year" : 2010
    }, {
      "title" : "Approximating parameterized convex optimization problems",
      "author" : [ "J. Giesen", "M. Jaggi", "S. Laue" ],
      "venue" : "In Algorithms - ESA, Lectures Notes Comp. Sci",
      "citeRegEx" : "Giesen et al\\.,? \\Q2010\\E",
      "shortCiteRegEx" : "Giesen et al\\.",
      "year" : 2010
    }, {
      "title" : "The entire regularization path for the support vector machine",
      "author" : [ "T. Hastie", "S. Rosset", "R. Tibshirani", "J. Zhu" ],
      "venue" : "J. Mach. Learn. Res.,",
      "citeRegEx" : "Hastie et al\\.,? \\Q2004\\E",
      "shortCiteRegEx" : "Hastie et al\\.",
      "year" : 2004
    }, {
      "title" : "Sparse Convex Optimization Methods for Machine Learning",
      "author" : [ "M. Jaggi" ],
      "venue" : "PhD thesis, ETH Zürich,",
      "citeRegEx" : "Jaggi,? \\Q2011\\E",
      "shortCiteRegEx" : "Jaggi",
      "year" : 2011
    }, {
      "title" : "How good is the simplex algorithm",
      "author" : [ "V. Klee", "G.J. Minty" ],
      "venue" : "In Shisha, O. (ed.), Inequalities,",
      "citeRegEx" : "Klee and Minty,? \\Q1972\\E",
      "shortCiteRegEx" : "Klee and Minty",
      "year" : 1972
    }, {
      "title" : "A new approach to variable selection in least squares problems",
      "author" : [ "M. Osborne", "B. Presnell", "B. Turlach" ],
      "venue" : "IMA J. Numer. Anal.,",
      "citeRegEx" : "Osborne et al\\.,? \\Q2000\\E",
      "shortCiteRegEx" : "Osborne et al\\.",
      "year" : 2000
    }, {
      "title" : "Ein verfahren zur lösung parameterabhängiger, nichtlinearer maximum-probleme",
      "author" : [ "K. Ritter" ],
      "venue" : "Math. Method Oper. Res.,",
      "citeRegEx" : "Ritter,? \\Q1962\\E",
      "shortCiteRegEx" : "Ritter",
      "year" : 1962
    }, {
      "title" : "Piecewise linear regularized solution paths",
      "author" : [ "S. Rosset", "J. Zhu" ],
      "venue" : "Ann. Stat.,",
      "citeRegEx" : "Rosset and Zhu,? \\Q2007\\E",
      "shortCiteRegEx" : "Rosset and Zhu",
      "year" : 2007
    }, {
      "title" : "Regression shrinkage and selection via the Lasso",
      "author" : [ "R. Tibshirani" ],
      "venue" : "J. Roy. Stat. Soc. B,",
      "citeRegEx" : "Tibshirani,? \\Q1996\\E",
      "shortCiteRegEx" : "Tibshirani",
      "year" : 1996
    } ],
    "referenceMentions" : [ {
      "referenceID" : 13,
      "context" : "In particular, the l1-norm has been used for that purpose in the Lasso formulation (Tibshirani, 1996).",
      "startOffset" : 83,
      "endOffset" : 101
    }, {
      "referenceID" : 11,
      "context" : "(2010), all of these examples are in fact particular instances of parametric quadratic programming formulations, for which path-following algorithms appear early in the optimization literature (Ritter, 1962).",
      "startOffset" : 193,
      "endOffset" : 207
    }, {
      "referenceID" : 8,
      "context" : "by Osborne et al. (2000) and Efron et al.",
      "startOffset" : 3,
      "endOffset" : 25
    }, {
      "referenceID" : 8,
      "context" : "by Osborne et al. (2000) and Efron et al. (2004) for the Lasso, and by Hastie et al.",
      "startOffset" : 3,
      "endOffset" : 49
    }, {
      "referenceID" : 6,
      "context" : "(2004) for the Lasso, and by Hastie et al. (2004) for the support vector machine (SVM).",
      "startOffset" : 29,
      "endOffset" : 50
    }, {
      "referenceID" : 5,
      "context" : "As observed by Gärtner et al. (2010), all of these examples are in fact particular instances of parametric quadratic programming formulations, for which path-following algorithms appear early in the optimization literature (Ritter, 1962).",
      "startOffset" : 15,
      "endOffset" : 37
    }, {
      "referenceID" : 2,
      "context" : "This is notably the case for the simplex algorithm (Dantzig, 1951), which performs empirically well for solving linear programs even though it suffers from exponential worst-case complexity (Klee & Minty, 1972).",
      "startOffset" : 51,
      "endOffset" : 66
    }, {
      "referenceID" : 2,
      "context" : "This is notably the case for the simplex algorithm (Dantzig, 1951), which performs empirically well for solving linear programs even though it suffers from exponential worst-case complexity (Klee & Minty, 1972). Similarly, by using geometrical tools originally developed to analyze the simplex algorithm, Gärtner et al. (2010) have shown that the complexity of the SVM regularization path can be exponential.",
      "startOffset" : 52,
      "endOffset" : 327
    }, {
      "referenceID" : 5,
      "context" : "We remark that our proof is constructive and significantly different than the ones proposed by Klee & Minty (1972) for the simplex algorithm and by Gärtner et al. (2010) for SVMs.",
      "startOffset" : 148,
      "endOffset" : 170
    }, {
      "referenceID" : 6,
      "context" : "We follow in part the methodology of Giesen et al. (2010) and Jaggi (2011), who have presented weaker results but in a more general setting for parameterized convex optimization problems.",
      "startOffset" : 37,
      "endOffset" : 58
    }, {
      "referenceID" : 6,
      "context" : "We follow in part the methodology of Giesen et al. (2010) and Jaggi (2011), who have presented weaker results but in a more general setting for parameterized convex optimization problems.",
      "startOffset" : 37,
      "endOffset" : 75
    }, {
      "referenceID" : 13,
      "context" : "In this section, we present the Lasso formulation of Tibshirani (1996) and well known facts, which we exploit later in our analysis.",
      "startOffset" : 53,
      "endOffset" : 71
    }, {
      "referenceID" : 10,
      "context" : "With the assumption that the matrixXJ is always fullrank, we can formally recall a well-known property of the Lasso (see Markowitz, 1952; Osborne et al., 2000; Efron et al., 2004) in the following lemma:",
      "startOffset" : 116,
      "endOffset" : 179
    }, {
      "referenceID" : 10,
      "context" : "Assuming again that XJ is always full rank, we can now present in Algorithm 1 the homotopy method (Osborne et al., 2000; Efron et al., 2004).",
      "startOffset" : 98,
      "endOffset" : 140
    }, {
      "referenceID" : 6,
      "context" : "We follow in part the methodology of Giesen et al. (2010), later refined by Jaggi (2011), on approximate regularization paths of parameterized convex functions.",
      "startOffset" : 37,
      "endOffset" : 58
    }, {
      "referenceID" : 6,
      "context" : "We follow in part the methodology of Giesen et al. (2010), later refined by Jaggi (2011), on approximate regularization paths of parameterized convex functions.",
      "startOffset" : 37,
      "endOffset" : 89
    }, {
      "referenceID" : 8,
      "context" : "Note that our criterion is not exactly the same as in Jaggi (2011). Whereas Jaggi (2011) consider a formulation where the l1-norm appears in a constraint, Eq.",
      "startOffset" : 54,
      "endOffset" : 67
    }, {
      "referenceID" : 8,
      "context" : "Note that our criterion is not exactly the same as in Jaggi (2011). Whereas Jaggi (2011) consider a formulation where the l1-norm appears in a constraint, Eq.",
      "startOffset" : 54,
      "endOffset" : 89
    }, {
      "referenceID" : 6,
      "context" : "In contrast, the analysis of Giesen et al. (2010) and Jaggi (2011) give us: • an approximate path with O(1/ε) linear segments can be obtained with a weaker approximation guarantee than ours.",
      "startOffset" : 29,
      "endOffset" : 50
    }, {
      "referenceID" : 6,
      "context" : "In contrast, the analysis of Giesen et al. (2010) and Jaggi (2011) give us: • an approximate path with O(1/ε) linear segments can be obtained with a weaker approximation guarantee than ours.",
      "startOffset" : 29,
      "endOffset" : 67
    }, {
      "referenceID" : 3,
      "context" : "It exploits the piecewise linearity of the path, but uses a firstorder method (Beck & Teboulle, 2009; Fu, 1998) when the linear segments of the path are too short.",
      "startOffset" : 78,
      "endOffset" : 111
    }, {
      "referenceID" : 8,
      "context" : "Note that as noticed in footnote 3, Jaggi (2011) uses a slightly different duality gap than ours.",
      "startOffset" : 36,
      "endOffset" : 49
    } ],
    "year" : 2012,
    "abstractText" : "The regularization path of the Lasso can be shown to be piecewise linear, making it possible to “follow” and explicitly compute the entire path. We analyze in this paper this popular strategy, and prove that its worst case complexity is exponential in the number of variables. We then oppose this pessimistic result to an (optimistic) approximate analysis: We show that an approximate path with at most O(1/ √ ε) linear segments can always be obtained, where every point on the path is guaranteed to be optimal up to a relative ε-duality gap. We complete our theoretical analysis with a practical algorithm to compute these approximate paths.",
    "creator" : "LaTeX with hyperref package"
  }
}