{
  "name" : "1206.4660.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Learning with Augmented Features for Heterogeneous Domain Adaptation",
    "authors" : [ "Lixin Duan", "Dong Xu", "Ivor W. Tsang" ],
    "emails" : [ "S080003@ntu.edu.sg", "DongXu@ntu.edu.sg", "IvorTsang@ntu.edu.sg" ],
    "sections" : [ {
      "heading" : "1. Introduction",
      "text" : "In real-world applications, it is often expensive and time-consuming to collect the labeled data. Transfer\nAppearing in Proceedings of the 29 th International Conference on Machine Learning, Edinburgh, Scotland, UK, 2012. Copyright 2012 by the author(s)/owner(s).\nlearning (a.k.a., domain adaptation), as a new machine learning strategy, has attracted growing attention because it can learn robust classifiers with very few labeled data from the target domain by leveraging a large amount of labeled data from other existing domains (a.k.a., source domains).\nDomain adaptation methods have been successfully used for different research fields such as natural language processing and computer vision (Blitzer et al., 2006; 2007; Daumé III, 2007; Duan et al., 2010; 2012b;a; Wu & Dietterich, 2004). However, all those methods assume that the data from different domains are represented by the same type of features with the same dimension. Thus, they cannot deal with the problem where the dimensions of data from the source and target domains are different, which is known as heterogeneous domain adaptation (HDA) (Dai et al., 2009; Yang et al., 2009).\nIn the literature, a few works have been proposed for the HDA problem. Dai et al. (2009) proposed to learn a feature translator between the source and target domains by assuming that the data from both domains share co-occurrence attributes (i.e., text data). The same assumption was also used in (Yang et al., 2009; Zhu et al., 2011) for text-aid image clustering and classification. However, this assumption may not be well satisfied in many applications such as the object recognition task where only visual features are used. Based on structural correspondence learning (Blitzer et al., 2006), two methods (Prettenhofer & Stein, 2010; Wei & Pal, 2010) were recently proposed to extract the so-called pivot features from the source and target domains, which is specifically designed for the cross-language text classification task. And these pivot features are constructed by text words which have explicit semantic meanings.\nFor more general HDA tasks, Shi et al. (2010) proposed a method called Heterogeneous Spectral Mapping\n(HeMap) to discover a common feature subspace by learning two feature mapping matrices as well as the optimal projection of the data from both domains, in which the valuable label information is not exploited. Harel and Mannor (2011) learned rotation matrices to match source data distributions to that of the target domain. However, this method does not use the valuable training labels, either. Wang et al. (2011) used the class labels of the training data to learn the manifold alignment by simultaneously maximizing the intradomain similarity and the inter-domain dissimilarity. By kernelizing the method in (Saenko et al., 2010), Kulis et al. (2011) proposed to learn an asymmetric kernel transformation to transfer feature knowledge between the data from the source and target domains.\nIn this work, we propose a new method called Heterogeneous Feature Augmentation (HFA) for heterogeneous domain adaptation. Considering the data from different domains are represented by features with different dimensions, we first transform the data from the source and target domains into a common subspace by using two different projection matrices P and Q. Then, we propose two new feature mapping functions to augment the transformed data with their original features and zeros. With the new augmented feature representations, we propose to learn the projection matrices P andQ by using the standard SVM with the hinge loss function in a linear case. We also describe its kernelization in order to efficiently cope with the data with very high dimension. To simplify the nontrivial optimization problem in HFA, we introduce an intermediate variable H called as a transformation metric to combine P and Q. We then develop an alternating optimization algorithm to simultaneously solve for the dual problem of SVM and the optimal transformation metric H.\nWe summarize the main contributions of this work:\n• The newly proposed augmented features in our HFA method can be readily incorporated into different methods (e.g., SVM and SVR) to effectively utilize the patterns from two domains, making them applicable to the HDA task.\n• We simplify the nontrivial optimization problem by defining a transformation metric H and develop an effective alternating optimization algorithm. With the introduction of H, we do not explicitly solve for P and Q, which makes the common subspace invisible to us.\n• Promising results on two benchmark datasets clearly demonstrate the effectiveness of HFA for object recognition and text categorization."
    }, {
      "heading" : "2. Kernel Learning for Heterogeneous Domain Adaptation",
      "text" : "In the remainder of this paper, we use the superscript ′ to denote the transpose of a vector or a matrix. We define In as the n× n identity matrix and On×m as a n×m matrix of all zeros. We also define 0n,1n ∈ Rn as the n × 1 column vectors of all zeros and all ones, respectively. The inequality a ≤ b means that ai ≤ bi for i = 1, . . . , n. Moreover, a ◦ b denotes the elementwise product between vectors a and b, i.e., a ◦ b = [a1b1, . . . , anbn]\n′. And H ≽ 0 means that the matrix H is positive semidefinite.\nIn this work, we assume there are only one source domain and one target domain. For some given class, we are provided with a set of labeled training samples { (xsi , ysi )| ns i=1} from the source domain as well as a limited number of labeled samples { (xti, yti)| nt i=1} from the target domain, where ysi and y t i are the labels of the samples xsi and x t i, respectively, and y s i , y t i ∈ {1,−1}. The dimensions of xsi and xti are ds and dt, respectively. Note that in the HDA problem, ds ̸= dt."
    }, {
      "heading" : "2.1. Heterogeneous Feature Augmentation",
      "text" : "Daume III (2007) proposed Feature Replication (FR) to augment the original feature space Rd into a larger space R3d by replicating the source and target data for homogeneous domain adaptation. Specifically, for any data point x ∈ Rd, the feature mapping functions φs and φt for the source and target domains are defined as φs(x) = [x ′,x′,0d] ′ and φt(x) = [x ′,0d,x ′]′. Note that it is not meaningful to directly use the method in (Daumé III, 2007) for the HDA task by simply padding zeros to make the dimensions of the data from two domains become the same, because there would be no correspondences between the heterogeneous features in this case.\nTo effectively utilize the heterogeneous features from two domains, we first introduce a common subspace for the source and target data for our HDA task, in which the heterogeneous features from two domains can be compared. We define the common subspace as Rdc , where any source sample xs and target sample xt can be projected onto it by using two projection matrices P ∈ Rdc×ds and Q ∈ Rdc×dt , respectively. Note that promising results have been shown by incorporating original features into feature augmentation (Daumé III, 2007; Pan et al., 2010) to enhance the similarities between data from the same domain. Motivated by (Daumé III, 2007; Pan et al., 2010), we also incorporate original features in this work and then augment any source and target domain samples xs ∈ Rds and xt ∈ Rdt by using our newly proposed\nfeature mapping functions φs and φt as follows:\nφs(x s) = Pxsxs 0dt  and φt(xt) = Qxt0ds xt  . (1) After introducingP andQ, the data from two domains can be readily compared in the common subspace. It is worth mentioning that our newly proposed augmented features for the source and target samples in (1) can be readily incorporated into different methods (e.g., SVM and SVR), making these methods applicable for the HDA problem.\nIn the next subsection, we take SVM with the hinge loss as a showcase of our Heterogeneous Feature Augmentation method (HFA for short). As it is nontrivial to solve for the projection matrices P and Q in our learning problem, we simplify the optimization problem by introducing an intermediate variable H = [P,Q]′[P,Q] such that we only need to solve for H rather than P and Q. In this way, the common subspace becomes invisible to us, which is therefore referred to as latent common subspace in this work."
    }, {
      "heading" : "2.2. Proposed Method",
      "text" : "We define feature weight vector w = [w′c,w ′ s,w ′ t] ′ for the augmented feature space, where wc,ws and wt are also weight vectors that are defined for the common subspace, the source domain and the target domain, respectively. We then propose to learn the projection matrices P and Q as well as the weight vector w by minimizing the structural risk functional of SVM. Formally, we present the formulation of our HFA method for the HDA problem as follows:\nmin P,Q min w,b,ξsi ,ξ t i\n1 2 ∥w∥2 + C ( ns∑ i=1 ξsi + nt∑ i=1 ξti ) , (2)\ns.t. ysi (w ′φs(x s i ) + b) ≥ 1− ξsi , ξsi ≥ 0; (3)\nyti(w ′φt(x t i) + b) ≥ 1− ξti , ξti ≥ 0; (4) ∥P∥2F ≤ λp, ∥Q∥2F ≤ λq,\nwhere C > 0 is a regularization parameter that regulates the loss on the training samples, and λp, λq > 0 are predefined to control the complexities of P and Q, respectively.\nTo solve (2), we first derive the dual form of the inner optimization problem in (2) with respect to w, b, ξsi and ξti . Specifically, we introduce dual variables {αsi | ns i=1} and {αti| nt i=1} for the constraints in (3) and (4), respectively. By setting the derivatives of the Lagrangian of (2) with respect to w, b, ξsi and ξ t i to zeros, we obtain the Karush-Kuhn-Tucker (KKT) conditions as: w = ∑ns i=1 α s i y s iφs(x s i ) + ∑nt i=1 α t iy t iφt(x\nt i),∑ns\ni=1 α s i y s i + ∑nt i=1 α t iy t i = 0 and 0 ≤ αsi , αti ≤ C.\nWith the KKT conditions, we arrive at the alternative optimization problem as follows:\nmin P,Q max α\n1′ns+ntα− 1 2 (α ◦ y)′KP,Q(α ◦ y), (5)\ns.t. y′α = 0, 0ns+nt ≤ α ≤ C1ns+nt , ∥P∥2F ≤ λp, ∥Q∥2F ≤ λq,\nwhere α = [αs1, . . . , α s ns , α t 1, . . . , α t nt ] ′ is a vector of the dual variables, y = [ys1, . . . , y s ns , y t 1, . . . , y t nt ] ′ is a label vector,\nKP,Q =\n[ X′s(Ins +P ′P)Xs X ′ sP\n′QXt X′tQ ′PXs X ′ t(Int +Q ′Q)Xt ] is the derived kernel matrix.\nA straightforward solution to the optimization problem in (5) would be to iteratively update one of the variables α,P and Q by fixing the others. However, the dimension of the common subspace (i.e., dc) must be given beforehand in this case, and it is nontrivial to determine the optimal dc. Observing that in the kernel matrix KP,Q in (5), the projection matrices P and Q always appear in the forms of P′P,P′Q,Q′P and Q′Q, we then replace these multiplications by defining an intermediate variable H = [P,Q]′[P,Q] ∈ R(ds+dt)×(ds+dt). Obviously, H is positive semidefinite, i.e., H ≽ 0. With the introduction of H, we can throw away the parameter dc. Moreover, the common subspace becomes latent, because we do not need to explicitly solve for P and Q any more.\nWith the definition of H, we convert the optimization problem in (5) to the final formulation of our proposed HFA method as follows:\nmin H≽0 max α\n1′ns+ntα− 1 2 (α ◦ y)′KH(α ◦ y), (6)\ns.t. y′α = 0, 0ns+nt ≤ α ≤ C1ns+nt , trace(H) ≤ λ,\nwhere KH =\n[ X′sXs + L ′ sHLs L ′ sHLt\nL′tHLs X ′ tXt + L ′ tHLt\n] ,\nLs =\n[ Ids\nOdt×ds\n] Xs, Lt = [ Ods×dt Idt ] Xt and λ =\nλp + λq. Note that given α, the optimization problem in (6) becomes the following Semidefinite Programming (SDP) problem (Vandenberghe & Boyd, 1996) by defining β = α ◦ y:\nmin H≽0 −1 2 β′KHβ, s.t. trace(H) ≤ λ. (7)\nThus far, we have successfully converted our original HDA problem, which learns two projection matrices P and Q, into a new problem of learning a transformation metric H. We emphasize that this new problem has two main advantages: i) it avoids determining the optimal dimension of the common subspace beforehand; and ii) as the common subspace\nbecomes latent after the introduction of H, we only have to optimize α and H for our proposed method.\nDiscussion: There are two major limitations to the current formulation of HFA in (6): i) The transformation metric H is linear, which may not be effective for some tasks. ii) The size of H grows with the dimensions of the source and target data (i.e., ds and dt). Therefore, it is computationally infeasible to learn the linear metric H in the SDP problem (7) for some real-world applications (e.g., text categorization) with very high dimensional data. In order to effectively deal with high dimensional data, inspired by (Kulis et al., 2011), in the next subsection we will apply kernelization to the data from the source and target domains and show that (7) can be solved in a kernel space by learning a nonlinear transformation metric with its size independent of the feature dimension."
    }, {
      "heading" : "2.3. Nonlinear Feature Transformation",
      "text" : "Note that the size of the linear transformation metric H is proportional to the feature dimension, and thus it is computationally infeasible for data with a very high dimension. In this section, we will show that by applying kernelization, the transformation metric is independent of the feature dimension and grows only with the number of training data.\nAs any arbitrary feature mapping function ϕ can be used to derive a corresponding kernel space for the source and target data, we can replace their linear inner products with some kernel function k. Let us denote Φs = [ϕ(x s 1), . . . , ϕ(x s ns)] and Φt = [ϕ(xt1), . . . , ϕ(x t nt)] as the matrices of the source and target training data after mapping them into a nonlinear feature space by using ϕ, respectively. We also define Ks = Φ ′ sΦs and Kt = Φ ′ tΦt as the kernel matrices of the training data from the source and target domains, respectively. Moreover, we denote the corresponding projection matrices for the source and target data respectively as Pϕ and Qϕ.\nTheorem 1. Assume Ks and Kt be positive definite. There exist two matrices P̃ ∈ Rdc×ns and Q̃ ∈ Rdc×nt such that any feasible solution Pϕ and Qϕ to the kernelized version of (2) can be written in the form of Pϕ = P̃K −1/2 s Φ′s and Qϕ = Q̃K −1/2 t Φ ′ t, respectively.\nProof. The proof can be analogously derived as for Lemma 3.1 in (Kulis et al., 2011).\nWith Theorem 1, it is easy to verify that ∥P̃∥2F = ∥Pϕ∥2F ≤ λp and ∥Q̃∥2F = ∥Qϕ∥2F ≤ λq. Here, we apply the same trick as in Section 2.2 to avoid determining dc for the latent common subspace. That is, we define the nonlinear transformation metric H̃ = [P̃, Q̃]′[P̃, Q̃] ∈ R(ns+nt)×(ns+nt), and thus the size of\nAlgorithm 1 Heterogeneous Feature Augmentation Input: Labeled source samples { (xsi , ysi )| ns i=1} and labeled target samples { (xti, yti)| nt i=1} Initialization: τ ← 1, H̃[τ ] ← λns+nt Ins+nt With H̃[τ ], solve for α[τ ] in the inner optimization problem of (8) by using SVM; while τ < Tmax do\nUpdate H̃[τ+1] by using the projected gradient descent method with (10); With H̃[τ+1], solve for α[τ+1] in the inner optimization problem of (8) by using SVM; if the objective value of (8) converges then\nbreak; end τ ← τ + 1;\nend\nOutput: H̃[τ ] and α[τ ]\nH̃ is independent of the feature dimension. We also have H̃ ≽ 0 and trace(H̃) ≤ λp + λq = λ.\nTherefore, the formulation of our proposed HFA method after applying kernelization becomes:\nmin H̃≽0 max α\n1′ns+ntα− 1 2 (α ◦ y)′KH̃(α ◦ y), (8)\ns.t. y′α = 0, 0ns+nt ≤ α ≤ C1ns+nt , trace(H̃) ≤ λ,\nwhere KH̃ =\n[ Ks + L̃ ′ sH̃L̃s L̃ ′ sH̃L̃t\nL̃′tH̃L̃s Kt + L̃ ′ tH̃L̃t ] , L̃s =[\nIns Ont×ns\n] K 1/2 s and L̃t = [ Ons×nt Int ] K 1/2 t . For a given\nα, we also arrive at an SDP problem as follows by defining β = α ◦ y:\nmin H̃≽0 −1 2 β′KH̃β, s.t. trace(H̃) ≤ λ. (9)"
    }, {
      "heading" : "2.4. Detailed Solution",
      "text" : "For our proposed HFA method, we develop an alternating optimization algorithm by iteratively updating α and H̃ to effectively solve the problem in (8). Specifically, when updating α at the τ -th iteration, we fix H̃[τ ] and solve for α[τ ] in (8) by using the standard SVM with the kernel matrix KH̃[τ] . While updating H̃, we fix α[τ ] and solve for H̃[τ+1] via SDP optimization in (9). The optimization procedure will be terminated when the value of the objective function in (8) converges.\nIn order to efficiently solve the SDP problem in (9), we also develop a simple projected gradient descent method to update H̃. Let us define βs = [β1, . . . , βns ] ′ and βt = [βns+1, . . . , βns+nt ] ′. Denoting G(H̃) as the\nobjective function of (9), we first obtain the derivative of G(H̃) with respect to H̃ as follows:\n∂G ∂H̃ = −1 2 (L̃sβs + L̃tβt)(L̃sβs + L̃tβt) ′.\nThen at the τ -th iteration, H̃ will be updated by using the following equation:\nH̃[τ+1] = H̃[τ ] − η[τ ] ∂G\n∂H̃ ∣∣∣ H̃=H̃[τ] , (10)\nwhere η[τ ] is the step size at the τ -th iteration, which can be found by using the standard line search method (Boyd & Vandenberghe, 2004).\nWe summarize the proposed alternating optimization algorithm for HFA in Algorithm 1. After obtaining the optimal solution α and H̃ to (8), we can predict any test data point x from the target domain by using the following target decision function:\nf(x) = w′ϕ(x) + b\n= (( β′sL̃ ′ s+β ′ tL̃ ′ t ) H̃ [ Ons×nt Int ] +β′t ) kt+b,(11)\nwhere kt = [k(x t 1,x), . . . , k(x t nt ,x)] ′ and k(xi,xj) = ϕ(xi)\n′ϕ(xj) is a predefined kernel function for two data samples xi and xj with the same feature dimension."
    }, {
      "heading" : "3. Related Work",
      "text" : "The pioneer works (Dai et al., 2009; Prettenhofer & Stein, 2010; Wei & Pal, 2010; Yang et al., 2009; Zhu et al., 2011) are limited to some specific HDA tasks, because they required additional information to transfer the source knowledge to the target domain.\nTo handle more general HDA tasks, other methods have been proposed to explicitly discover a common subspace (Shi et al., 2010; Wang & Mahadevan, 2011). Shi et al. (2010) proposed to learn feature mapping matrices without using the valuable data label information. While Wang et al. (2011) used the class labels of data, they assumed the data should have a manifold structure. Such manifold assumption may not exist in real-world applications.\nRecently, Kulis et al. (2011) proposed a nonlinear metric learning method to learn an asymmetric feature transformation for the source and target data with high dimensions. And the learned transformation metric is universal for all classes. However, when there exist many classes, a universal metric may not be sufficiently good for feature transformation between data from all classes. In contrast, our method incorporates the proposed augmented features into SVM to learn an individual model for each class."
    }, {
      "heading" : "4. Experiments",
      "text" : "In this section, we evaluate our proposed HFA method for object recognition and multilingual text categorization. We focus on the heterogeneous domain adaptation problem where there exist only one source domain and one target domain in which only a limited number of labeled target training samples are available. Moreover, we assume that the test data from the target domain are unseen during the training phase."
    }, {
      "heading" : "4.1. Setup",
      "text" : "Object recognition: We employ a recently released dataset1 used in (Saenko et al., 2010; Kulis et al., 2011) for this task. This dataset contains a total of 4106 images with 31 categories from three sources: amazon (web images downloaded from an online merchant), dslr (high-resolution images taken from a digital DLR camera) and webcam (low-resolution images taken from a web camera). We follow the same protocols in the previous work (Kulis et al., 2011). Specifically, SURF features (Bay et al., 2006) are extracted for all the images. The images from amazon and webcam are clustered into 800 visual words by using k-means. After vector quantization, each image is represented as a 800 dimensional histogram feature. Similarly, we represented each image from dslr as a 600-dimensional histogram feature.\nIn the experiments, dslr is used as the target domain, while amazon and webcam are considered as two individual source domains. We strictly follow the setting in (Saenko et al., 2010; Kulis et al., 2011) and randomly select 20 (resp., 8) training images per category for the source domain amazon (resp., webcam). For the target domain dslr, 3 training images are randomly selected from each category, and the remaining dslr images are used for testing. See Table 1 for a summarization of this dataset.\nText categorization: We use the Reuters multilingual dataset2 (Amini et al., 2009), which is collected by sampling parts of the Reuters RCV1 and RCV2 collections. It contains about 11K newswire articles\n1http://www.icsi.berkeley.edu/~saenko/projects. html\n2http://multilingreuters.iit.nrc.ca/ ReutersMultiLingualMultiView.htm\nfrom 6 classes in 5 languages (i.e., English, French, German, Italian and Spanish). While each document was also translated into the other four languages in this dataset, we do not use the translated documents in this work. All documents are represented as a bag of words and the TF-IDF are extracted.\nWe take Spanish as the target domain in the experiments and other four languages as individual source domains. For each class, we randomly sample 100 training documents from the source domain and m training documents from the target domain, where m = 5, 7, 10, 15 and 20. And the remaining documents in the target domain are used as the test data. Note that the method (Wang & Mahadevan, 2011) cannot handle the original high dimensional TF-IDF features. In order to compare our HFA method with theirs (Wang & Mahadevan, 2011), for documents written in each language, we perform PCA with 60% energy preserved on the TF-IDF features. We summarize this dataset in Table 2.\nBaselines: As the source and target data have different dimensions, they cannot be directly combined to train any classifiers for the target domain. Considering the number of training samples is much lower than the feature dimension, we compare our HFA method by applying kernelization with a number of baseline algorithms listed below:\n• SVM T: It utilizes the labeled samples only from the target domain to train a standard SVM classifier for each category/class. Note it is not reported in (Kulis et al., 2011).\n• KCCA (Shawe-Taylor & Cristianini, 2004): It learns a common feature subspace by maximizing the correlation between the source and target training data without using any label information. The data from both domains are projected into the common subspace. Note that KCCA was originally proposed for multi-view learning. Following (Kulis et al., 2011), we also report its results in this work.\n• HeMap (Shi et al., 2010): It finds the projection matrices for a common feature subspace as\nwell as learns the optimal projected data from both domains. But the label information of training data from both domains is not used.\n• DAMA (Wang & Mahadevan, 2011): It learns a common feature subspace by utilizing the class labels of the source and target training data for manifold alignment.\n• ARC-t (Kulis et al., 2011): It uses the labeled training data from both domains to learn an asymmetric transformation metric between the different feature spaces.\nFor KCCA, HeMap and DAMA, after learning the projection matrices, we apply SVM to train their final classifiers by using the projected training data from both domains for a given category/class. For ARC-t, we construct the kernel matrix based on the learned asymmetric transformation metric, and then SVM is also applied to train its final classifier. For all methods, we set the regularization parameter C = 1 in SVM and use the RBF kernel for fair comparison. As we only have a very limited number of labeled training samples in the target domain, the cross-validation technique cannot be effectively employed to determine the optimal parameters. Instead, for our HFA method, we empirically fix the parameter λ as 100 for the object dataset and 1 for the Reuters multilingual dataset. For other methods, we validate all their parameters chosen from {0.01, 0.1, 1, 10, 100} based on the test data and report their best results.\nEvaluation metric: Following (Kulis et al., 2011), for each method we measure the classification accuracy over all categories/classes on both datasets. We randomly sample the training data for ten times and report the mean classification accuracies of all methods over the ten rounds of experiments."
    }, {
      "heading" : "4.2. Classification Results",
      "text" : "Object recognition: We report the mean and standard deviations of classification accuracies for all methods on the object dataset (Saenko et al., 2010) in Table 3. From the results, SVM T outperforms KCCA and HeMap by using only 3 labeled training samples from the target domain. The explanation is that KCCA and HeMap do not utilize the label information of the target training data to learn the feature mapping matrices. As a result, the learned common subspace is not sufficient to preserve a similar data structure as in the original feature spaces of the source and target data, which results in poor classification performances. DAMA performs only slightly better that SVM T, possibly due to the lack of\nTable 3. Means and standard deviations of classification accuracies (%) of all methods on the object dataset by using 3 labeled training samples per class from the target domain dslr. Results in boldface are significantly better than the others, judged by the t-test with a significance level at 0.05. For KCCA and ARC-t, the numbers in the parentheses are the results reported in (Kulis et al., 2011).\nSource Domain SVM T KCCA HeMap DAMA ARC-t HFA amazon\n52.9± 3.1 46.3± 2.7 (51.0) 42.8± 2.4 53.3± 2.3 53.1± 2.4 (53.2) 55.4± 2.8 webcam 46.7± 2.8 42.2± 2.6 53.2± 3.2 53.0± 3.2 54.3± 3.7\nTable 4. Means and standard deviations of classification accuracies (%) of all methods on the Reuters multilingual dataset by using 10 labeled training samples per class from the target domain Spanish. Results in boldface are significantly better than the others, judged by the t-test with a significance level at 0.05.\nSource Domain SVM T KCCA HeMap DAMA ARC-t HFA English\n72.6± 2.3 71.4± 3.2 65.7± 3.1 72.4± 2.4 72.9± 2.0 75.3± 1.7 French 72.8± 2.8 64.2± 4.2 72.8± 2.0 73.5± 1.8 75.7± 1.6 German 73.8± 2.2 64.6± 3.6 72.9± 2.3 74.7± 1.6 76.1± 1.5 Italian 73.8± 2.1 65.8± 2.3 73.3± 2.1 74.0± 2.0 75.8± 1.8\nthe strong manifold structure on this dataset. Both results of ARC-t implemented by ourselves and reported in (Kulis et al., 2011) are only comparable with those of SVM T, which shows that ARC-t is less effective for HDA on this dataset. Our HFA method outperforms the other methods under both settings, which clearly demonstrate the effectiveness of our proposed method for HDA by learning with augmented features.\nText categorization: Table 4 shows the mean and standard deviations of classification accuracies for all methods on the Reuters multilingual dataset (Amini et al., 2009) by using m = 20 labeled training samples per class from the target domain. We have a similar observation as on the object dataset that SVM T still outperforms HeMap in terms of classification accuracy. It is interesting to observe that KCCA is generally better than SVM T, which shows that it can learn a good common feature subspace on this dataset. Moreover, by using the label information, both DAMA and ARC-t perform better than SVM T under almost all the settings. Our proposed HFA method still achieves significantly better performances than others on this dataset, when judged by the t-test\nwith a significance level at 0.05.\nWe also plot the classification results of SVM T, KCCA, DAMA, ARC-t and our HFA method with respect to the number of target training samples per class (i.e., m = 5, 7, 10, 15 and 20) for each source domain in Figure 2. We do not report the results of HeMap, as they are much worse than the other methods. From the results, the performances of all methods increase when using a larger m. And the two HDA methods DAMA and ARC-t generally achieve better mean classification accuracies than SVM T except for the setting using English as the source domain. Our HFA method generally outperforms all other methods according to mean classification accuracy."
    }, {
      "heading" : "4.3. Convergence Analysis",
      "text" : "To analyze the convergence of the proposed Algorithm 1 for our HFA method, we take one setting from each of the datasets as the showcase. For the object dataset, we use the category “back pack” and the source domain amazon; for the Reuters multilingual dataset, the class “C15” is used together with the source domain English. From the results, Algorithm 1 generally takes less than 80 (resp., 40) iterations before its convergence on the object dataset (resp., the Reuters multilingual dataset). We have similar observations for other categories/classes on the two datasets as well."
    }, {
      "heading" : "5. Conclusions and Future Work",
      "text" : "We have proposed a new method called Heterogeneous Feature Augmentation (HFA) for heterogeneous domain adaptation. In HFA, we augment the heterogeneous features from the source and target domains by using two newly proposed feature mapping functions, respectively. With the augmented features, we propose\nto find the two projection matrices for the source and target data by using the standard SVM with the hinge loss in both linear and nonlinear cases. Moreover, a socalled transformation metric is introduced to simply our formulated optimization problem of HFA such that it can be effectively solved by our developed alternating optimization algorithm. Promising results of HFA have been achieved on two benchmark datasets for object recognition and text classification."
    }, {
      "heading" : "Acknowledgement",
      "text" : "This work is supported by the Singapore National Research Foundation under its Interactive & Digital Media (IDM) Public Sector R&D Funding Initiative (administered by the IDM Programme Office) and AcRF Tier-1 Research Grant (RG15/08)."
    } ],
    "references" : [ {
      "title" : "Learning from multiple partially observed views – an application to multilingual text categorization",
      "author" : [ "M. Amini", "N. Usunier", "C. Goutte" ],
      "venue" : "In NIPS,",
      "citeRegEx" : "Amini et al\\.,? \\Q2009\\E",
      "shortCiteRegEx" : "Amini et al\\.",
      "year" : 2009
    }, {
      "title" : "Surf: Speeded up robust features",
      "author" : [ "H. Bay", "T. Tuytelaars", "Gool", "L. Van" ],
      "venue" : "In ECCV,",
      "citeRegEx" : "Bay et al\\.,? \\Q2006\\E",
      "shortCiteRegEx" : "Bay et al\\.",
      "year" : 2006
    }, {
      "title" : "Domain adaptation with structural correspondence learning",
      "author" : [ "J. Blitzer", "R. McDonald", "F. Pereira" ],
      "venue" : "In EMNLP,",
      "citeRegEx" : "Blitzer et al\\.,? \\Q2006\\E",
      "shortCiteRegEx" : "Blitzer et al\\.",
      "year" : 2006
    }, {
      "title" : "Biographies, bollywood, boom-boxes and blenders: Domain adaptation for sentiment classification",
      "author" : [ "J. Blitzer", "M. Dredze", "F. Pereira" ],
      "venue" : "In ACL,",
      "citeRegEx" : "Blitzer et al\\.,? \\Q2007\\E",
      "shortCiteRegEx" : "Blitzer et al\\.",
      "year" : 2007
    }, {
      "title" : "Convex Optimization",
      "author" : [ "Boyd", "Stephen", "Vandenberghe", "Lieven" ],
      "venue" : null,
      "citeRegEx" : "Boyd et al\\.,? \\Q2004\\E",
      "shortCiteRegEx" : "Boyd et al\\.",
      "year" : 2004
    }, {
      "title" : "Translated learning: Transfer learning across different feature spaces",
      "author" : [ "W. Dai", "Y. Chen", "Xue", "G.-R", "Q. Yang", "Y. Yu" ],
      "venue" : "In NIPS,",
      "citeRegEx" : "Dai et al\\.,? \\Q2009\\E",
      "shortCiteRegEx" : "Dai et al\\.",
      "year" : 2009
    }, {
      "title" : "Frustratingly easy domain adaptation",
      "author" : [ "III H. Daumé" ],
      "venue" : "In ACL,",
      "citeRegEx" : "Daumé,? \\Q2007\\E",
      "shortCiteRegEx" : "Daumé",
      "year" : 2007
    }, {
      "title" : "Visual event recognition in videos by learning from web data",
      "author" : [ "L. Duan", "D. Xu", "I.W. Tsang", "J. Luo" ],
      "venue" : "In CVPR,",
      "citeRegEx" : "Duan et al\\.,? \\Q2010\\E",
      "shortCiteRegEx" : "Duan et al\\.",
      "year" : 2010
    }, {
      "title" : "Domain transfer multiple kernel learning",
      "author" : [ "L. Duan", "I.W. Tsang", "D. Xu" ],
      "venue" : "T-PAMI,",
      "citeRegEx" : "Duan et al\\.,? \\Q2012\\E",
      "shortCiteRegEx" : "Duan et al\\.",
      "year" : 2012
    }, {
      "title" : "Domain adaptation from multiple sources: A domain-dependent regularization approach. T-NNLS",
      "author" : [ "L. Duan", "D. Xu", "I.W. Tsang" ],
      "venue" : null,
      "citeRegEx" : "Duan et al\\.,? \\Q2012\\E",
      "shortCiteRegEx" : "Duan et al\\.",
      "year" : 2012
    }, {
      "title" : "Learning from multiple outlooks",
      "author" : [ "M. Harel", "S. Mannor" ],
      "venue" : "In ICML,",
      "citeRegEx" : "Harel and Mannor,? \\Q2011\\E",
      "shortCiteRegEx" : "Harel and Mannor",
      "year" : 2011
    }, {
      "title" : "What you saw is not what you get: Domain adaptation using asymmetric kernel transforms",
      "author" : [ "B. Kulis", "K. Saenko", "T. Darrell" ],
      "venue" : "In CVPR,",
      "citeRegEx" : "Kulis et al\\.,? \\Q2011\\E",
      "shortCiteRegEx" : "Kulis et al\\.",
      "year" : 2011
    }, {
      "title" : "Cross-domain sentiment classification via spectral feature alignment",
      "author" : [ "S.J. Pan", "X. Ni", "Sun", "J.-T", "Q. Yang", "Z. Chen" ],
      "venue" : "In WWW,",
      "citeRegEx" : "Pan et al\\.,? \\Q2010\\E",
      "shortCiteRegEx" : "Pan et al\\.",
      "year" : 2010
    }, {
      "title" : "Cross-language text classification using structural correspondence learning",
      "author" : [ "P. Prettenhofer", "B. Stein" ],
      "venue" : "In ACL,",
      "citeRegEx" : "Prettenhofer and Stein,? \\Q2010\\E",
      "shortCiteRegEx" : "Prettenhofer and Stein",
      "year" : 2010
    }, {
      "title" : "Adapting visual category models to new domains",
      "author" : [ "K. Saenko", "B. Kulis", "M. Fritz", "T. Darrell" ],
      "venue" : "In ECCV,",
      "citeRegEx" : "Saenko et al\\.,? \\Q2010\\E",
      "shortCiteRegEx" : "Saenko et al\\.",
      "year" : 2010
    }, {
      "title" : "Kernel Methods for Pattern Analysis",
      "author" : [ "J. Shawe-Taylor", "N. Cristianini" ],
      "venue" : null,
      "citeRegEx" : "Shawe.Taylor and Cristianini,? \\Q2004\\E",
      "shortCiteRegEx" : "Shawe.Taylor and Cristianini",
      "year" : 2004
    }, {
      "title" : "Transfer learning on heterogenous feature spaces via spectral transformation",
      "author" : [ "X. Shi", "Q. Liu", "W. Fan", "P.S. Yu", "R. Zhu" ],
      "venue" : "In ICDM,",
      "citeRegEx" : "Shi et al\\.,? \\Q2010\\E",
      "shortCiteRegEx" : "Shi et al\\.",
      "year" : 2010
    }, {
      "title" : "Heterogeneous domain adaptation using manifold alignment",
      "author" : [ "C. Wang", "S. Mahadevan" ],
      "venue" : "In IJCAI,",
      "citeRegEx" : "Wang and Mahadevan,? \\Q2011\\E",
      "shortCiteRegEx" : "Wang and Mahadevan",
      "year" : 2011
    }, {
      "title" : "Cross-lingual adaptation: An experiment on sentiment classifications",
      "author" : [ "B. Wei", "C. Pal" ],
      "venue" : "In ACL,",
      "citeRegEx" : "Wei and Pal,? \\Q2010\\E",
      "shortCiteRegEx" : "Wei and Pal",
      "year" : 2010
    }, {
      "title" : "Improving svm accuracy by training on auxiliary data sources",
      "author" : [ "P. Wu", "T.G. Dietterich" ],
      "venue" : "In ICML,",
      "citeRegEx" : "Wu and Dietterich,? \\Q2004\\E",
      "shortCiteRegEx" : "Wu and Dietterich",
      "year" : 2004
    }, {
      "title" : "Heterogeneous transfer learning for image clustering via the social web",
      "author" : [ "Q. Yang", "Y. Chen", "Xue", "G.-R", "W. Dai", "Y. Yu" ],
      "venue" : "ACL/IJCNLP,",
      "citeRegEx" : "Yang et al\\.,? \\Q2009\\E",
      "shortCiteRegEx" : "Yang et al\\.",
      "year" : 2009
    }, {
      "title" : "Heterogeneous transfer learning for image classification",
      "author" : [ "Y. Zhu", "Y. Chen", "Z. Lu", "S.J. Pan", "Xue", "G.-R", "Y. Yu", "Q. Yang" ],
      "venue" : "In AAAI,",
      "citeRegEx" : "Zhu et al\\.,? \\Q2011\\E",
      "shortCiteRegEx" : "Zhu et al\\.",
      "year" : 2011
    } ],
    "referenceMentions" : [ {
      "referenceID" : 2,
      "context" : "Domain adaptation methods have been successfully used for different research fields such as natural language processing and computer vision (Blitzer et al., 2006; 2007; Daumé III, 2007; Duan et al., 2010; 2012b;a; Wu & Dietterich, 2004).",
      "startOffset" : 140,
      "endOffset" : 236
    }, {
      "referenceID" : 7,
      "context" : "Domain adaptation methods have been successfully used for different research fields such as natural language processing and computer vision (Blitzer et al., 2006; 2007; Daumé III, 2007; Duan et al., 2010; 2012b;a; Wu & Dietterich, 2004).",
      "startOffset" : 140,
      "endOffset" : 236
    }, {
      "referenceID" : 5,
      "context" : "Thus, they cannot deal with the problem where the dimensions of data from the source and target domains are different, which is known as heterogeneous domain adaptation (HDA) (Dai et al., 2009; Yang et al., 2009).",
      "startOffset" : 175,
      "endOffset" : 212
    }, {
      "referenceID" : 20,
      "context" : "Thus, they cannot deal with the problem where the dimensions of data from the source and target domains are different, which is known as heterogeneous domain adaptation (HDA) (Dai et al., 2009; Yang et al., 2009).",
      "startOffset" : 175,
      "endOffset" : 212
    }, {
      "referenceID" : 20,
      "context" : "The same assumption was also used in (Yang et al., 2009; Zhu et al., 2011) for text-aid image clustering and classification.",
      "startOffset" : 37,
      "endOffset" : 74
    }, {
      "referenceID" : 21,
      "context" : "The same assumption was also used in (Yang et al., 2009; Zhu et al., 2011) for text-aid image clustering and classification.",
      "startOffset" : 37,
      "endOffset" : 74
    }, {
      "referenceID" : 2,
      "context" : "Based on structural correspondence learning (Blitzer et al., 2006), two methods (Prettenhofer & Stein, 2010; Wei & Pal, 2010) were recently proposed to extract the so-called pivot features from the source and target domains, which is specifically designed for the cross-language text classification task.",
      "startOffset" : 44,
      "endOffset" : 66
    }, {
      "referenceID" : 3,
      "context" : "Dai et al. (2009) proposed to learn a feature translator between the source and target domains by assuming that the data from both domains share co-occurrence attributes (i.",
      "startOffset" : 0,
      "endOffset" : 18
    }, {
      "referenceID" : 16,
      "context" : "For more general HDA tasks, Shi et al. (2010) proposed a method called Heterogeneous Spectral Mapping",
      "startOffset" : 28,
      "endOffset" : 46
    }, {
      "referenceID" : 14,
      "context" : "By kernelizing the method in (Saenko et al., 2010), Kulis et al.",
      "startOffset" : 29,
      "endOffset" : 50
    }, {
      "referenceID" : 10,
      "context" : "Harel and Mannor (2011) learned rotation matrices to match source data distributions to that of the target domain.",
      "startOffset" : 0,
      "endOffset" : 24
    }, {
      "referenceID" : 10,
      "context" : "Harel and Mannor (2011) learned rotation matrices to match source data distributions to that of the target domain. However, this method does not use the valuable training labels, either. Wang et al. (2011) used the class labels of the training data to learn the manifold alignment by simultaneously maximizing the intradomain similarity and the inter-domain dissimilarity.",
      "startOffset" : 0,
      "endOffset" : 206
    }, {
      "referenceID" : 10,
      "context" : "Harel and Mannor (2011) learned rotation matrices to match source data distributions to that of the target domain. However, this method does not use the valuable training labels, either. Wang et al. (2011) used the class labels of the training data to learn the manifold alignment by simultaneously maximizing the intradomain similarity and the inter-domain dissimilarity. By kernelizing the method in (Saenko et al., 2010), Kulis et al. (2011) proposed to learn an asymmetric kernel transformation to transfer feature knowledge between the data from the source and target domains.",
      "startOffset" : 0,
      "endOffset" : 445
    }, {
      "referenceID" : 12,
      "context" : "Note that promising results have been shown by incorporating original features into feature augmentation (Daumé III, 2007; Pan et al., 2010) to enhance the similarities between data from the same domain.",
      "startOffset" : 105,
      "endOffset" : 140
    }, {
      "referenceID" : 12,
      "context" : "Motivated by (Daumé III, 2007; Pan et al., 2010), we also incorporate original features in this work and then augment any source and target domain samples x ∈ Rs and x ∈ Rt by using our newly proposed",
      "startOffset" : 13,
      "endOffset" : 48
    }, {
      "referenceID" : 11,
      "context" : "In order to effectively deal with high dimensional data, inspired by (Kulis et al., 2011), in the next subsection we will apply kernelization to the data from the source and target domains and show that (7) can be solved in a kernel space by learning a nonlinear transformation metric with its size independent of the feature dimension.",
      "startOffset" : 69,
      "endOffset" : 89
    }, {
      "referenceID" : 11,
      "context" : "1 in (Kulis et al., 2011).",
      "startOffset" : 5,
      "endOffset" : 25
    }, {
      "referenceID" : 5,
      "context" : "The pioneer works (Dai et al., 2009; Prettenhofer & Stein, 2010; Wei & Pal, 2010; Yang et al., 2009; Zhu et al., 2011) are limited to some specific HDA tasks, because they required additional information to transfer the source knowledge to the target domain.",
      "startOffset" : 18,
      "endOffset" : 118
    }, {
      "referenceID" : 20,
      "context" : "The pioneer works (Dai et al., 2009; Prettenhofer & Stein, 2010; Wei & Pal, 2010; Yang et al., 2009; Zhu et al., 2011) are limited to some specific HDA tasks, because they required additional information to transfer the source knowledge to the target domain.",
      "startOffset" : 18,
      "endOffset" : 118
    }, {
      "referenceID" : 21,
      "context" : "The pioneer works (Dai et al., 2009; Prettenhofer & Stein, 2010; Wei & Pal, 2010; Yang et al., 2009; Zhu et al., 2011) are limited to some specific HDA tasks, because they required additional information to transfer the source knowledge to the target domain.",
      "startOffset" : 18,
      "endOffset" : 118
    }, {
      "referenceID" : 16,
      "context" : "To handle more general HDA tasks, other methods have been proposed to explicitly discover a common subspace (Shi et al., 2010; Wang & Mahadevan, 2011).",
      "startOffset" : 108,
      "endOffset" : 150
    }, {
      "referenceID" : 16,
      "context" : "To handle more general HDA tasks, other methods have been proposed to explicitly discover a common subspace (Shi et al., 2010; Wang & Mahadevan, 2011). Shi et al. (2010) proposed to learn feature mapping matrices without using the valuable data label information.",
      "startOffset" : 109,
      "endOffset" : 170
    }, {
      "referenceID" : 16,
      "context" : "To handle more general HDA tasks, other methods have been proposed to explicitly discover a common subspace (Shi et al., 2010; Wang & Mahadevan, 2011). Shi et al. (2010) proposed to learn feature mapping matrices without using the valuable data label information. While Wang et al. (2011) used the class labels of data, they assumed the data should have a manifold structure.",
      "startOffset" : 109,
      "endOffset" : 289
    }, {
      "referenceID" : 11,
      "context" : "Recently, Kulis et al. (2011) proposed a nonlinear metric learning method to learn an asymmetric feature transformation for the source and target data with high dimensions.",
      "startOffset" : 10,
      "endOffset" : 30
    }, {
      "referenceID" : 14,
      "context" : "Object recognition: We employ a recently released dataset used in (Saenko et al., 2010; Kulis et al., 2011) for this task.",
      "startOffset" : 66,
      "endOffset" : 107
    }, {
      "referenceID" : 11,
      "context" : "Object recognition: We employ a recently released dataset used in (Saenko et al., 2010; Kulis et al., 2011) for this task.",
      "startOffset" : 66,
      "endOffset" : 107
    }, {
      "referenceID" : 11,
      "context" : "We follow the same protocols in the previous work (Kulis et al., 2011).",
      "startOffset" : 50,
      "endOffset" : 70
    }, {
      "referenceID" : 1,
      "context" : "Specifically, SURF features (Bay et al., 2006) are extracted for all the images.",
      "startOffset" : 28,
      "endOffset" : 46
    }, {
      "referenceID" : 14,
      "context" : "We strictly follow the setting in (Saenko et al., 2010; Kulis et al., 2011) and randomly select 20 (resp.",
      "startOffset" : 34,
      "endOffset" : 75
    }, {
      "referenceID" : 11,
      "context" : "We strictly follow the setting in (Saenko et al., 2010; Kulis et al., 2011) and randomly select 20 (resp.",
      "startOffset" : 34,
      "endOffset" : 75
    }, {
      "referenceID" : 0,
      "context" : "Text categorization: We use the Reuters multilingual dataset (Amini et al., 2009), which is collected by sampling parts of the Reuters RCV1 and RCV2 collections.",
      "startOffset" : 61,
      "endOffset" : 81
    }, {
      "referenceID" : 11,
      "context" : "Note it is not reported in (Kulis et al., 2011).",
      "startOffset" : 27,
      "endOffset" : 47
    }, {
      "referenceID" : 11,
      "context" : "Following (Kulis et al., 2011), we also report its results in this work.",
      "startOffset" : 10,
      "endOffset" : 30
    }, {
      "referenceID" : 16,
      "context" : "• HeMap (Shi et al., 2010): It finds the projection matrices for a common feature subspace as well as learns the optimal projected data from both domains.",
      "startOffset" : 8,
      "endOffset" : 26
    }, {
      "referenceID" : 11,
      "context" : "• ARC-t (Kulis et al., 2011): It uses the labeled training data from both domains to learn an asymmetric transformation metric between the different feature spaces.",
      "startOffset" : 8,
      "endOffset" : 28
    }, {
      "referenceID" : 11,
      "context" : "Evaluation metric: Following (Kulis et al., 2011), for each method we measure the classification accuracy over all categories/classes on both datasets.",
      "startOffset" : 29,
      "endOffset" : 49
    }, {
      "referenceID" : 14,
      "context" : "Object recognition: We report the mean and standard deviations of classification accuracies for all methods on the object dataset (Saenko et al., 2010) in Table 3.",
      "startOffset" : 130,
      "endOffset" : 151
    }, {
      "referenceID" : 11,
      "context" : "For KCCA and ARC-t, the numbers in the parentheses are the results reported in (Kulis et al., 2011).",
      "startOffset" : 79,
      "endOffset" : 99
    }, {
      "referenceID" : 11,
      "context" : "Both results of ARC-t implemented by ourselves and reported in (Kulis et al., 2011) are only comparable with those of SVM T, which shows that ARC-t is less effective for HDA on this dataset.",
      "startOffset" : 63,
      "endOffset" : 83
    }, {
      "referenceID" : 0,
      "context" : "Text categorization: Table 4 shows the mean and standard deviations of classification accuracies for all methods on the Reuters multilingual dataset (Amini et al., 2009) by using m = 20 labeled training samples per class from the target domain.",
      "startOffset" : 149,
      "endOffset" : 169
    } ],
    "year" : 2012,
    "abstractText" : "We propose a new learning method for heterogeneous domain adaptation (HDA), in which the data from the source domain and the target domain are represented by heterogeneous features with different dimensions. Using two different projection matrices, we first transform the data from two domains into a common subspace in order to measure the similarity between the data from two domains. We then propose two new feature mapping functions to augment the transformed data with their original features and zeros. The existing learning methods (e.g., SVM and SVR) can be readily incorporated with our newly proposed augmented feature representations to effectively utilize the data from both domains for HDA. Using the hinge loss function in SVM as an example, we introduce the detailed objective function in our method called Heterogeneous Feature Augmentation (HFA) for a linear case and also describe its kernelization in order to efficiently cope with the data with very high dimensions. Moreover, we also develop an alternating optimization algorithm to effectively solve the nontrivial optimization problem in our HFA method. Comprehensive experiments on two benchmark datasets clearly demonstrate that HFA outperforms the existing HDA methods.",
    "creator" : " TeX output 2012.05.20:1505"
  }
}