{
  "name" : "1206.1270.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Factoring nonnegative matrices with linear programs",
    "authors" : [ "Victor Bittorf", "Benjamin Recht", "Christopher Ré", "Joel A. Tropp" ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : null,
      "text" : "Keywords. Nonnegative Matrix Factorization, Linear Programming, Stochastic gradient descent, Machine learning, Parallel computing, Multicore."
    }, {
      "heading" : "1 Introduction",
      "text" : "Nonnegative matrix factorization (NMF) is a popular approach for selecting features in data [15– 17, 22]. Many machine-learning and data-mining software packages (including Matlab [3], R [11], and Oracle Data Mining [1]) now include heuristic computational methods for NMF. Nevertheless, we still have limited theoretical understanding of when these heuristics are correct.\nThe difficulty in developing rigorous methods for NMF stems from the fact that the problem is computationally challenging. Indeed, Vavasis has shown that NMF is NP-Hard [26]; see [4] for further worst-case hardness results. As a consequence, we must instate additional assumptions on the data if we hope to compute nonnegative matrix factorizations in practice.\nIn this spirit, Arora, Ge, Kannan, and Moitra (AGKM) have exhibited a polynomial-time algorithm for NMF that is provably correct—provided that the data is drawn from an appropriate model, based on ideas from [7]. The AGKM result describes one circumstance where we can be sure that NMF algorithms are capable of producing meaningful answers. This work has the potential to make an impact in machine learning because proper feature selection is an important preprocessing step for many other techniques. Even so, the actual impact is damped by the fact that the AGKM algorithm is too computationally expensive for large-scale problems and is not tolerant to departures from the modeling assumptions. Thus, for NMF, there remains a gap between the theoretical exercise and the actual practice of machine learning.\nar X\niv :1\n20 6.\n12 70\nv2 [\nm at\nh. O\nC ]\n2 F\neb 2\n01 3\nThe present work presents a scalable, robust algorithm that can successfully solve the NMF problem under appropriate hypotheses. Our first contribution is a new formulation of the nonnegative feature selection problem that only requires the solution of a single linear program. Second, we provide a theoretical analysis of this algorithm. This argument shows that our method succeeds under the same modeling assumptions as the AGKM algorithm with an additional margin constraint that is common in machine learning. We prove that if there exists a unique, well-defined model, then we can recover this model accurately; our error bound improves substantially on the error bound for the AGKM algorithm in the high SNR regime. One may argue that NMF only “makes sense” (i.e., is well posed) when a unique solution exists, and so we believe our result has independent interest. Furthermore, our algorithm can be adapted for a wide class of noise models.\nIn addition to these theoretical contributions, our work also includes a major algorithmic and experimental component. Our formulation of NMF allows us to exploit methods from operations research and database systems to design solvers that scale to extremely large datasets. We develop an efficient stochastic gradient descent (SGD) algorithm that is (at least) two orders of magnitude faster than the approach of AGKM when both are implemented in Matlab. We describe a parallel implementation of our SGD algorithm that can robustly factor matrices with 105 features and 106 examples in a few minutes on a multicore workstation. Our formulation of NMF uses a data-driven modeling approach to simplify the factorization problem. More precisely, we search for a small collection of rows from the data matrix that can be used to express the other rows. This type of approach appears in a number of other factorization problems, including rank-revealing QR [14], interpolative decomposition [19], subspace clustering [9, 23], dictionary learning [10], and others. Our computational techniques can be adapted to address large-scale instances of these problems as well."
    }, {
      "heading" : "2 Separable Nonnegative Matrix Factorizations and Hott Topics",
      "text" : "Notation. For a matrix M and indices i and j, we write Mi· for the ith row of M and M·j for the jth column of M . We write Mij for the (i, j) entry.\nLet Y be a nonnegative f × n data matrix with columns indexing examples and rows indexing features. Exact NMF seeks a factorization Y = FW where the feature matrix F is f × r, where the weight matrix W is r × n, and both factors are nonnegative. Typically, r min{f, n}.\nUnless stated otherwise, we assume that each row of the data matrix Y is normalized so it sums to one. Under this hypothesis, we may also assume that each row of F and of W also sums to one [4].\nIt is notoriously difficult to solve the NMF problem. Vavasis showed that it is NP-complete to decide whether a matrix admits a rank-r nonnegative factorization [26]. AGKM proved that an exact NMF algorithm can be used to solve 3-SAT in subexponential time [4].\nThe literature contains some mathematical analysis of NMF that can be used to motivate algorithmic development. Thomas [24] developed a necessary and sufficient condition for the existence of a rank-r NMF. More recently, Donoho and Stodden [7] obtained a related sufficient condition for uniqueness. AGKM exhibited an algorithm that can produce a nonnegative matrix factorization under a weaker sufficient condition. To state their results, we need a definition.\nDefinition 2.1 A set of vectors {v1, . . . ,vr} ⊂ Rd is simplicial if no vector vi lies in the convex hull of {vj : j 6= i}. The set of vectors is α-robust simplicial if, for each i, the `1 distance from vi to the convex hull of {vj : j 6= i} is at least α. Figure 1 illustrates these concepts.\nAlgorithm 1: AGKM: Approximably Separable Nonnegative Matrix Factorization [4]\n1: Initialize R = ∅. 2: Compute the f × f matrix D with Dij = ‖Xi· −Xj·‖1. 3: for k = 1, . . . f do 4: Find the set Nk of rows that are at least 5 /α+ 2 away from Xk·. 5: Compute the distance δk of Xk· from conv({Xj· : j ∈ Nk}). 6: if δk > 2 , add k to the set R. 7: end for 8: Cluster the rows in R as follows: j and k\nare in the same cluster if Djk ≤ 10 /α+ 6 . 9: Choose one element from each cluster to\nyield W . 10: F = arg minZ∈Rf×r ∥∥X −ZW∥∥∞,1\nThese ideas support the uniqueness results of Donoho and Stodden and the AGKM algorithm. Indeed, we can find an NMF of Y efficiently if Y contains a set of r rows that is simplicial and whose convex hull contains the remaining rows.\nDefinition 2.2 An NMF Y = FW is called separable if the rows of W are simplicial and there is a permutation matrix Π such that\nΠF = [ Ir M ] . (1)\nTo compute a separable factorization of Y , we must first identify a simplicial set of rows from Y . Afterward, we compute weights that express the remaining rows as convex combinations of this distinguished set. We call the simplicial rows hott and the corresponding features hott topics.\nThis model allows us to express all the features for a particular instance if we know the values of the instance at the simplicial rows. This assumption can be justified in a variety of applications. For example, in text, knowledge of a few keywords may be sufficient to reconstruct counts of the other words in a document. In vision, localized features can be used to predict gestures. In audio data, a few bins of the spectrogram may allow us to reconstruct the remaining bins.\nWhile a nonnegative matrix one encounters in practice might not admit a separable factorization, it may be well-approximated by a nonnnegative matrix with separable factorization. AGKM derived an algorithm for nonnegative matrix factorization of a matrix that is well-approximated by a separable factorization. To state their result, we introduce a norm on f × n matrices:\n∥∥∆∥∥∞,1 := max1≤i≤f n∑ j=1 |∆ij | .\nTheorem 2.3 (AGKM [4]) Let and α be nonnegative constants satisfying ≤ α220+13α . Let X be a nonnegative data matrix. Assume X = Y + ∆ where Y is a nonnegative matrix whose rows\nhave unit `1 norm, where Y = FW is a rank-r separable factorization in which the rows of W are α-robust simplicial, and where ∥∥∆∥∥∞,1 ≤ . Then Algorithm 1 finds a rank-r nonnegative factorization F̂ Ŵ that satisfies the error bound\n∥∥X − F̂ Ŵ∥∥∞,1 ≤ 10 /α+ 7 . In particular, the AGKM algorithm computes the factorization exactly when = 0. Although this method is guaranteed to run in polynomial time, it has many undesirable features. First, the algorithm requires a priori knowledge of the parameters α and . It may be possible to calculate , but we can only estimate α if we know which rows are hott. Second, the algorithm computes all `1 distances between rows at a cost of O(f\n2n). Third, for every row in the matrix, we must determine its distance to the convex hull of the rows that lie at a sufficient distance; this step requires us to solve a linear program for each row of the matrix at a cost of Ω(fn). Finally, this method is intimately linked to the choice of the error norm\n∥∥·∥∥∞,1. It is not obvious how to adapt the algorithm for other noise models. We present a new approach, based on linear programming, that overcomes these drawbacks."
    }, {
      "heading" : "3 Main Theoretical Results: NMF by Linear Programming",
      "text" : "This paper shows that we can factor an approximately separable nonnegative matrix by solving a linear program. A major advantage of this formulation is that it scales to very large data sets.\nHere is the key observation: Suppose that Y is any f × n nonnegative matrix that admits a rank-r separable factorization Y = FW . If we pad F with zeros to form an f × f matrix, we have\nY = ΠT [\nIr 0 M 0\n] ΠY =: CY\nWe call the matrix C factorization localizing. Note that any factorization localizing matrix C is an element of the polyhedral set\nΦ(Y ) := {C ≥ 0 : CY = Y , Tr(C) = r, Cjj ≤ 1 ∀j, Cij ≤ Cjj ∀i, j}.\nThus, to find an exact NMF of Y , it suffices to find a feasible element of C ∈ Φ(Y ) whose diagonal is integral. This task can be accomplished by linear programming. Once we have such a C, we construct W by extracting the rows of X that correspond to the indices i where Cii = 1. We construct the feature matrix F by extracting the nonzero columns of C. This approach is summarized in Algorithm 2. In turn, we can prove the following result.\nTheorem 3.1 Suppose Y is a nonnegative matrix with a rank-r separable factorization Y = FW . Then Algorithm 2 constructs a rank-r nonnegative matrix factorization of Y .\nAs the theorem suggests, we can isolate the rows of Y that yield a simplicial factorization by solving a single linear program. The factor F can be found by extracting columns of C."
    }, {
      "heading" : "3.1 Robustness to Noise",
      "text" : "Suppose we observe a nonnegative matrix X whose rows sum to one. Assume that X = Y + ∆ where Y is a nonnegative matrix whose rows sum to one, which has a rank-r separable factorization\nAlgorithm 2 Separable Nonnegative Matrix Factorization by Linear Programming\nRequire: An f × n nonnegative matrix Y with a rank-r separable NMF. Ensure: An f × r matrix F and r × n matrix W with F ≥ 0, W ≥ 0, and Y = FW . 1: Find the unique C ∈ Φ(Y ) to minimize pT diag(C) where p is any vector with distinct values. 2: Let I = {i : Cii = 1} and set W = YI· and F = C·I .\nAlgorithm 3 Approximably Separable Nonnegative Matrix Factorization by Linear Programming\nRequire: An f × n nonnegative matrix X that satisfies the hypotheses of Theorem 3.2. Ensure: An f × r matrix F and r× n matrix W with F ≥ 0, W ≥ 0, and ∥∥X − FW∥∥∞,1 ≤ 2 . 1: Find C ∈ Φ2 (X) that minimizes pT diagC where p is any vector with distinct values. 2: Let I = {i : Cii = 1} and set W = XI·. 3: Set F = arg minZ∈Rf×r\n∥∥X −ZW∥∥∞,1 Y = FW such that the rows of W are α-robust simplicial, and where\n∥∥∆∥∥∞,1 ≤ . Define the polyhedral set\nΦτ (X) := { C ≥ 0 : ∥∥CX −X∥∥∞,1 ≤ τ,Tr(C) = r, Cjj ≤ 1 ∀j, Cij ≤ Cjj ∀i, j} The set Φ(X) consists of matrices C that approximately locate a factorization of X. We can prove the following result.\nTheorem 3.2 Suppose that X satisfies the assumptions stated in the previous paragraph. Furthermore, assume that for every row Yj,· that is not hott, we have the margin constraint ‖Yj,·−Yi,·‖ ≥ d0 for all hott rows i. Then we can find a nonnegative factorization satisfying ∥∥X − F̂ Ŵ∥∥∞,1 ≤ 2 provided that < min{αd0,α\n2} 9(r+1) . Furthermore, this factorization correctly identifies the hott topics\nappearing in the separable factorization of Y .\nAlgorithm 3 requires the solution of two linear programs. The first minimizes a cost vector over Φ2 (X). This lets us find Ŵ . Afterward, the matrix F̂ can be found by setting\nF̂ = arg min Z≥0 ∥∥X −ZŴ∥∥∞,1 . (2) Our robustness result requires a margin-type constraint assuming that the original configuration consists either of duplicate hott topics, or topics that are reasonably far away from the hott topics. On the other hand, under such a margin constraint, we can construct a considerably better approximation than that guaranteed by the AGKM algorithm. Moreover, unlike AGKM, our algorithm does not need to know the parameter α.\nThe proofs of Theorems 3.1 and 3.2 can be found in the appendix. The main idea is to show that we can only represent a hott topic efficiently using the hott topic itself. Some earlier versions of this paper contained incomplete arguments, which we have remedied. For a signifcantly stronger robustness analysis of Algorithm 3, see the recent paper [12].\nHaving established these theoretical guarantees, it now remains to develop an algorithm to solve the LP. Off-the-shelf LP solvers may suffice for moderate-size problems, but for large-scale matrix factorization problems, their running time is prohibitive, as we show in Section 5. In Section 4, we turn to describe how to solve Algorithm 3 efficiently for large data sets."
    }, {
      "heading" : "3.2 Related Work",
      "text" : "Localizing factorizations via column or row subset selection is a popular alternative to direct factorization methods such as the SVD. Interpolative decomposition such as Rank-Revealing QR [14] and CUR [19] have favorable efficiency properties as compared to factorizations (such as SVD) that are not based on exemplars. Factorization localization has been used in subspace clustering and has been shown to be robust to outliers [9, 23].\nIn recent work on dictionary learning, Esser et al. and Elhamifar et al. have proposed a factorization localization solution to nonnegative matrix factorization using group sparsity techniques [8,10]. Esser et al. prove asymptotic exact recovery in a restricted noise model, but this result requires preprocessing to remove duplicate or near-duplicate rows. Elhamifar shows exact representative recovery in the noiseless setting assuming no hott topics are duplicated. Our work here improves upon this work in several aspects, enabling finite sample error bounds, the elimination of any need to preprocess the data, and algorithmic implementations that scale to very large data sets."
    }, {
      "heading" : "4 Incremental Gradient Algorithms for NMF",
      "text" : "The rudiments of our fast implementation rely on two standard optimization techniques: dual decomposition and incremental gradient descent. Both techniques are described in depth in Chapters 3.4 and 7.8 of Bertsekas and Tstisklis [5].\nWe aim to minimize pT diag(C) subject to C ∈ Φτ (X). To proceed, form the Lagrangian\nL(C, β,w) = pT diag(C) + β(Tr(C)− r) + f∑ i=1 wi (‖Xi· − [CX]i·‖1 − τ)\nwith multipliers β and w ≥ 0. Note that we do not dualize out all of the constraints. The remaining ones appear in the constraint set Φ0 = {C : C ≥ 0, diag(C) ≤ 1, and Cij ≤ Cjj for all i, j}.\nDual subgradient ascent solves this problem by alternating between minimizing the Lagrangian over the constraint set Φ0, and then taking a subgradient step with respect to the dual variables\nwi ← wi + s (‖Xi· − [C?X]i·‖1 − τ) and β ← β + s(Tr(C?)− r)\nwhere C? is the minimizer of the Lagrangian over Φ0. The update of wi makes very little difference in the solution quality, so we typically only update β.\nWe minimize the Lagrangian using projected incremental gradient descent. Note that we can rewrite the Lagrangian as\nL(C, β,w) = −τ1Tw − βr + n∑ k=1  ∑ j∈supp(X·k) wj‖Xjk − [CX]jk‖1 + µj(pj + β)Cjj  . Here, supp(x) is the set indexing the entries where x is nonzero, and µj is the number of nonzeros in row j divided by n. The incremental gradient method chooses one of the n summands at random and follows its subgradient. We then project the iterate onto the constraint set Φ0. The projection onto Φ0 can be performed in the time required to sort the individual columns of C plus a linear-time operation. The full procedure is described in Appendix B. In the case where we expect a unique solution, we can drop the constraint Cij ≤ Cjj , resulting in a simple clipping procedure: set all\nAlgorithm 4 Hottopixx: Approximate Separable NMF by Incremental Gradient Descent\nRequire: An f × n nonnegative matrix X. Primal and dual stepsizes sp and sd. Ensure: An f × r matrix F and r× n matrix W with F ≥ 0, W ≥ 0, and ∥∥X − FW∥∥∞,1 ≤ 2 . 1: Pick a cost p with distinct entries. 2: Initialize C = 0, β = 0 3: for t = 1, . . . , Nepochs do 4: for i = 1, . . . n do 5: Choose k uniformly at random from [n]. 6: C ← C + sp · sign(X·k −CX·k)XT·k − sp diag(µ ◦ (β1− p)). 7: end for 8: Project C onto Φ0. 9: β ← β + sd(Tr(C)− r) 10: end for 11: Let I = {i : Cii = 1} and set W = XI·. 12: Set F = arg minZ∈Rf×r\n∥∥X −ZW∥∥∞,1 negative items to zero and set any diagonal entry exceeding one to one. In practice, we perform a tradeoff. Since the constraint Cij ≤ Cjj is used solely for symmetry breaking, we have found empirically that we only need to project onto Φ0 every n iterations or so.\nThis incremental iteration is repeated n times in a phase called an epoch. After each epoch, we update the dual variables and quit after we believe we have identified the large elements of the diagonal of C. Just as before, once we have identified the hott rows, we can form W by selecting these rows of X. We can find F just as before, by solving (2). Note that this minimization can also be computed by incremental subgradient descent. The full procedure, called Hottopixx, is described in Algorithm 4."
    }, {
      "heading" : "4.1 Sparsity and Computational Enhancements for Large Scale.",
      "text" : "For small-scale problems, Hottopixx can be implemented in a few lines of Matlab code. But for the very large data sets studied in Section 5, we take advantage of natural parallelism and a host of lowlevel optimizations that are also enabled by our formulation. As in any numerical program, memory layout and cache behavior can be critical factors for performance. We use standard techniques: in-memory clustering to increase prefetching opportunities, padded data structures for better cache alignment, and compiler directives to allow the Intel compiler to apply vectorization.\nNote that the incremental gradient step (step 6 in Algorithm 4) only modifies the entries of C where X·k is nonzero. Thus, we can parallelize the algorithm with respect to updating either the rows or the columns of C. We store X in large contiguous blocks of memory to encourage hardware prefetching. In contrast, we choose a dense representation of our localizing matrix C; this choice trades space for runtime performance.\nEach worker thread is assigned a number of rows of C so that all rows fit in the shared L3 cache. Then, each worker thread repeatedly scans X while marking updates to multiple rows of C. We repeat this process until all rows of C are scanned, similar to the classical block-nested loop join in relational databases [21]."
    }, {
      "heading" : "5 Experiments",
      "text" : "Except for the speedup curves, all of the experiments were run on an identical configuration: a dual Xeon X650 (6 cores each) machine with 128GB of RAM. The kernel is Linux 2.6.32-131.\nIn small-scale, synthetic experiments, we compared Hottopixx to the AGKM algorithm and the linear programming formulation of Algorithm 3 implemented in Matlab. Both AGKM and Algorithm 3 were run using CVX [13] coupled to the SDPT3 solver [25]. We ran Hottopixx for 50 epochs with primal stepsize 1e-1 and dual stepsize 1e-2. Once the hott topics were identified, we fit F using two cleaning epochs of incremental gradient descent for all three algorithms.\nTo generate our instances, we sampled r hott topics uniformly from the unit simplex in Rn. These topics were duplicated d times. We generated the remaining f − r(d+ 1) rows to be random convex combinations of the hott topics, with the combinations selected uniformly at random. We then added noise with (∞, 1)-norm error bounded by η· α220+13α . Recall that AGKM algorithm is only guaranteed to work for η < 1. We ran with f ∈ {40, 80, 160}, n ∈ {400, 800, 1600}, r ∈ {3, 5, 10}, d ∈ {0, 1, 2}, and η ∈ {0.25, 0.95, 4, 10, 100}. Each experiment was repeated 5 times.\nBecause we ran over 2000 experiments with 405 different parameter settings, it is convenient to use the performance profiles to compare the performance of the different algorithms [6]. Let P be the set of experiments and A denote the set of different algorithms we are comparing. Let Qa(p) be the value of some performance metric of the experiment p ∈ P for algorithm a ∈ A. Then the performance profile at τ for a particular algorithm is the fraction of the experiments where the value of Qa(p) lies within a factor of τ of the minimal value of minb∈AQb(p). That is,\nPa(τ) = # {p ∈ P : Qa(p) ≤ τ mina′∈AQa′(p)}\n#(P) .\nIn a performance profile, the higher a curve corresponding to an algorithm, the more often it outperforms the other algorithms. This gives a convenient way to contrast algorithms visually.\nOur performance profiles are shown in Figure 2. The first two figures correspond to experiments with f = 40 and n = 400. The third figure is for the synthetic experiments with all other values of f and n. In terms of (∞, 1)-norm error, the linear programming solver typically achieves the lowest error. However, using SDPT3, it is prohibitively slow to factor larger matrices. On the other hand, Hottopixx achieves better noise performance than the AGKM algorithm in much less time. Moreover, the AGKM algorithm must be fed the values of and α in order to run. Hottopixx does not require this information and still achieves about the same error performance.\nWe also display a graph for running only four epochs (hott (fast)). This algorithm is by far the fastest algorithm, but does not achieve as optimal a noise performance. For very high levels of noise, however, it achieves a lower reconstruction error than the AGKM algorithm, whose performance degrades once η approaches or exceeds 1 (Figure 2(f)). We also provide performance profiles for the root-mean-square error of the nonnegative matrix factorizations (Figure 2 (d) and (e)). The performance is qualitatively similar to that for the (∞, 1)-norm.\nWe also coded Hottopixx in C++, using the design principles described in Section 4.1, and ran on three large data sets. We generated a large synthetic example (jumbo) as above with r = 100. We generated a co-occurrence matrix of people and places from the ClueWeb09 Dataset [2], normalized by TFIDF. We also used Hottopixx to select features from the RCV1 data set to recognize the class CCAT [18]. The statistics for these data sets can be found in Table 1.\nIn Figure 3 (left), we plot the speed-up over a serial implementation. In contrast to other parallel methods that exhibit memory contention [20], we see superlinear speed-ups for up to 20 threads\ndue to hardware prefetching and cache effects. All three of our large data sets can be trained in minutes, showing that we can scale Hottopixx on both synthetic and real data. Our algorithm is able to correctly identify the hott topics on the jumbo set. For clueweb, we plot the RMSE Figure 3 (middle). This curve rolls off quickly for the first few hundred topics, demonstrating that our algorithm may be useful for dimensionality reduction in Natural Language Processing applications. For RCV1, we trained an SVM on the set of features extracted by Hottopixx and plot the misclassification error versus the number of topics in Figure 3 (right). With 1500 hott topics, we achieve 7% misclassification error as compared to 5.5% with the entire set of features."
    }, {
      "heading" : "6 Discussion",
      "text" : "This paper provides an algorithmic and theoretical framework for analyzing and deploying any factorization problem that can be posed as a linear (or convex) factorization localizing program.\nFuture work should investigate the applicability of Hottopixx to other factorization localizing algorithms, such as subspace clustering, and should revisit earlier theoretical bounds on such prior art."
    }, {
      "heading" : "Acknowledgments",
      "text" : "The authors would like to thank Sanjeev Arora, Michael Ferris, Rong Ge, Nicolas Gillis, Ankur Moitra, and Stephen Wright for helpful suggestions. BR is generously supported by ONR award N00014-11-1-0723, NSF award CCF-1139953, and a Sloan Research Fellowship. CR is generously supported by NSF CAREER award under IIS-1054009, ONR award N000141210041, and gifts or research awards from American Family Insurance, Google, Greenplum, and Oracle. JAT is generously supported by ONR award N00014-11-1002, AFOSR award FA9550-09-1-0643, and a Sloan Research Fellowship.\nReferences\n[1] docs.oracle.com/cd/B28359_01/datamine.111/b28129/algo_nmf.htm.\n[2] lemurproject.org/clueweb09/.\n[3] www.mathworks.com/help/toolbox/stats/nnmf.html.\n[4] S. Arora, R. Ge, R. Kannan, and A. Moitra. Computing a nonnegative matrix factorization – provably. To appear in STOC 2012. Preprint available at \\arxiv.org/abs/1111.0952, 2011.\n[5] D. P. Bertsekas and J. N. Tsitsiklis. Parallel and Distributed Computation: Numerical Methods. Athena Scientific, Belmont, MA, 1997.\n[6] E. D. Dolan and J. J. Moré. Benchmarking optimization software with performance profiles. Mathematical Programming, Series A, 91:201–213, 2002.\n[7] D. Donoho and V. Stodden. When does non-negative matrix factorization give a correct decomposition into parts? In Advances in Neural Information Processing Systems, 2003.\n[8] E. Elhamifar, G. Sapiro, and R. Vidal. See all by looking at a few: Sparse modeling for finding representative objects. In Proceedings of CVPR, 2012.\n[9] E. Elhamifar and R. Vidal. Sparse subspace clustering. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, 2009.\n[10] E. Esser, M. Möller, S. Osher, G. Sapiro, and J. Xin. A convex model for non-negative matrix factorization and dimensionality reduction on physical space. IEEE Transactions on Image Processing, 2012. To appear. Preprint available at arxiv.org/abs/1102.0844.\n[11] R. Gaujoux and C. Seoighe. NMF: A flexible R package for nonnegative matrix factorization. BMC Bioinformatics, 11:367, 2010. doi:10.1186/1471-2105-11-367.\n[12] N. Gillis. Robustness analysis of hotttopixx, a linear programming model for factoring nonnegative matrices. arxiv.org/1211.6687, 2012.\n[13] M. Grant and S. Boyd. CVX: Matlab software for disciplined convex programming, version 1.21. http://cvxr.com/cvx, May 2010.\n[14] M. Gu and S. C. Eisenstat. Efficient algorithms for computing a strong rank-revealing QR factorization. SIAM Journal on Scientific Computing, 17:848–869, 1996.\n[15] T. Hofmann. Probabilistic latent semantic indexing. In Proceedings of the 22nd Annual International SIGIR Conference on Research and Development in Information Retrieval, 1999.\n[16] D. D. Lee and H. S. Seung. Learning the parts of objects by non-negative matrix factorization. Nature, 401:788–791, 1999.\n[17] D. D. Lee and H. S. Seung. Algorithms for non-negative matrix factorization. In Advances in Neural Information Processing Systems, 2001.\n[18] D. Lewis, Y. Yang, T. Rose, and F. Li. RCV1: A new benchmark collection for text categorization research. Journal of Machine Learning Research, 5:361–397, 2004.\n[19] M. W. Mahoney and P. Drineas. CUR matrix decompositions for improved data analysis. Proceedings of the National Academy of Sciences, 106:697–702, 2009.\n[20] F. Niu, B. Recht, C. Ré, and S. J. Wright. HOGWILD!: A lock-free approach to parallelizing stochastic gradient descent. In Advances in Neural Information Processing Systems, 2011.\n[21] L. D. Shapiro. Join processing in database systems with large main memories. ACM Transactions on Database Systems, 11(3):239–264, 1986.\n[22] P. Smaragdis. Non-negative matrix factorization for polyphonic music transcription. In IEEE Workshop on Applications of Signal Processing to Audio and Acoustics, pages 177–180, 2003.\n[23] M. Soltanolkotabi and E. J. Candès. A geometric analysis of subspace clustering with outliers. Preprint available at arxiv.org/abs/1112.4258, 2011.\n[24] L. B. Thomas. Problem 73-14, rank factorization of nonnegative matrices. SIAM Review, 16(3):393–394, 1974.\n[25] K. C. Toh, M. Todd, and R. H. Tütüncü. SDPT3: A MATLAB software package for semidefinitequadratic-linear programming. Available from http://www.math.nus.edu.sg/~mattohkc/sdpt3.html.\n[26] S. A. Vavasis. On the complexity of nonnegative matrix factorization. SIAM Joural on Optimization, 20(3):1364–1377, 2009."
    }, {
      "heading" : "A Proofs",
      "text" : "Let Y be a nonnegative matrix whose rows sum to one. Assume that Y admits an exact separable factorization of rank r. In other words, we can write Y = FW where the rows of W are α-robust simplicial and\nΠF = [ Ir M ] for some permutation Π. Let I denote the indices of the rows in Y that correspond with the identity matrix in the factorization, which we have called the hott rows. Then we can write each row j that is not hott as a convex combination of the hott rows:\nYj· = ∑ k∈I MjkYk· for each j /∈ I.\nAs we have discussed, we may assume that ∑\nkMjk = 1 for each j /∈ I because each row of Y sums to one.\nThe first lemma offers a stronger bound on the coefficients Mjk in terms of the distance between row j and the hott rows.\nLemma A.1 For an index `, suppose that the row Y`· has distance greater than δ from a hott topic Yi· with i ∈ I. Then M`i ≤ 1− δ/2.\nProof We can express the `th row as a convex combination of hott rows: Y`· = ∑\nk∈IM`kYk·. For each i ∈ I, we can bound M`i as follows.\nδ ≤ ‖Yi· − Y`·‖1 = ∥∥∥∥∥Yi· −∑ k∈I M`kYk· ∥∥∥∥∥ 1\n= ∥∥∥∥∥∥(1−M`i)Yi − ∑\nk∈I\\{i}\nM`kYk· ∥∥∥∥∥∥ 1\n≤ ‖(1−M`i)Yi‖1 + ∑\nk∈I\\{i}\nM`k ‖Yk·‖1\n= 2(1−M`i) .\nThe inequality is the triangle inequality. To reach the last line, we use the fact that each row of Y has `1 norm equal to one. Furthermore, ∑ k∈I\\{i}M`k = 1 −M`i ≥ 0 because each row of M consists of nonnegative numbers that sum to one. Rearrange to complete the argument.\nThe next lemma is the central tool in our proofs. It tells us that any representation of a hott row has to involve rows that are close in `1 norm to a hott row. To state the result, we define for each hott row i\nBδ(i) = {j : ‖Yi· − Yj·‖1 ≤ δ}.\nIn other words, Bδ(i) contains the indices of all rows with `1 distance no greater than δ from the hott topic Yi·.\nLemma A.2 Let c ∈ Rf be a nonnegative vector whose entries sum to one. For some hott row i ∈ I, suppose that ‖cTY − Yi·‖1 ≤ τ . Then∑\nj∈Bδ(i)\ncj ≥ 1− 2τ\nmin{αδ, α2} . (3)\nProof Let us introduce notation for the quantity of interest: wi = wi(c) = ∑\nj∈Bδ(Xi·) cj . We may assume that wi < 1, or else the result holds trivially. Since the entries of c sum to one, we have\n0 < 1− wi = ∑ j cj − ∑\nj∈Bδ(i)\ncj = ∑\nj /∈Bδ(i)\ncj .\nNext, we introduce the extra assumption that δ < α. It is clear that wi increases monotonically with δ, so any lower bound on wi that we establish in this case extends to a bound that holds for larger δ. Since the hott topics are α-robust simplicial, all the other hott topics are at least δ away from Yi· in `1 norm. Therefore, the hott row i is the unique hott row listed in Bδ(i).\nTo establish the result, we may as well assume that wi(c) achieves its minimum possible value subject to the constraints that the value of cTY is fixed and that c is a nonnegative vector that sums to one. We claim that this minimum such wi occurs if and only if cj = 0 for all j ∈ Bδ(i)\\{i}. We complete the proof under this additional surmise.\nThe assertion in the last paragraph follows from an argument by contradiction. Suppose that wi(c) were minimized at a vector c where cj > 0 for some j ∈ Bδ(i) \\ {i}. Then we can construct another set of coefficients c̃ that satisfies the constraints and leads to a smaller value of wi. We have the representation Yj· = ∑ k∈IMjkYk·. Set c̃j = 0; set c̃k = ck + cjMjk for each k ∈ I, and set c̃k = ck for all remaining k /∈ I ∪ {j}. It is easy to verify that c̃TY = cTY and that c̃ is a nonnegative vector whose entries sum to one. But the value of wi is strictly smaller with the coefficients c̃:\nwi(c̃) = ∑\nk∈Bδ(i)\nc̃k < ∑\nk∈Bδ(i)\nck = wi(c)\nIn this relation, all the summands cancel, except for the one with index j. But c̃j = 0 < cj . It follows that the minimum value of wi cannot occur when cj > 0. Compactness of the constraint set assures us that there is some vector c of coefficients that minimizes wi(c), so we must conclude that the minimizer c satisfies cj = 0 for j ∈ Bδ(i) \\ {i}.\nLet us continue. Owing to the assumption that Yi· is no farther than τ from c TY , we have\nτ ≥ ∥∥∥∥∥∥Yi· − ∑ j cjYj· ∥∥∥∥∥∥ 1\n= ∥∥∥∥∥∥(1− wi)Yi· − ∑\nj /∈Bδ(i)\ncjYj· ∥∥∥∥∥∥ 1\n= (1− wi) ∥∥∥∥∥∥Yi· − 11− wi ∑\nj /∈Bδ(i)\n∑ k∈I cjMjkYk· ∥∥∥∥∥∥ 1 . (4)\nThe first line follows when we split the sum over j based on whether or not the components fall in Bδ(i). Then we apply the property that cj = 0 for j ∈ Bδ(i) \\ {i}, and we identify the quantity wi. In the last line, we factored out 1− wi, and we introduced the separable factorization of Y .\nNext, for each k ∈ I, define πk :=\n1\n1− wi ∑ j /∈Bδ(i) cjMjk ,\nand note that πk ≥ 0. Furthermore,∑ k∈I πk = 1 1− wi ∑ j /∈Bδ(i) cj ∑ k∈I Mjk = 1 1− wi ∑ j /∈Bδ(i) cj = 1\nbecause the rows of M sum to one and because of the definition of wi. Lemma A.1 implies that πi satisfies the bound\nπi = 1\n1− wi ∑ j /∈Bδ(i) cjMji ≤ 1− δ/2 1− wi ∑ j /∈Bδ(i) cj = 1− δ/2. (5)\nIndeed, the lemma is valid because Yj· is at least a distance of δ away from Yi· for every j /∈ Bδ(i). With these observations, we can continue our calculation from (4):\nτ ≥ (1− wi) ∥∥∥∥∥Yi· −∑ k∈I πkYk· ∥∥∥∥∥ 1\n= (1− wi)(1− πi) ∥∥∥∥∥∥Yi· − ∑\nk∈I\\{i}\nπk 1− πi Yk· ∥∥∥∥∥∥ 1\n≥ (1− wi)(1− πi)α ≥ (1− wi)(δ/2)α.\nThe first identity follows when we combine the ith term in the sum with Yi·. The inequality depends on the assumption that W is α-robust simplicial; any convex combination of {Yk· : k /∈ I} is at least α away from Yi· in `1 norm. Afterward, we use the bound (5). Rearrange the final expression to complete the argument.\nA.1 Proof of Theorem 3.1\nThis result is almost obvious when there are no duplicated rows. Indeed, since the hott topics form a simplicial set and the matrix Y admits a separable factorization, the only way we can represent all r hott topics exactly is to have Cii = 1 for every hott row i. This exhausts the trace constraint, and we see that every other diagonal entry Ckk = 0 for every not hott row k. The only matrices that are feasible identify the hott rows on the diagonal. They must represent the remaining rows using linear combinations of the hott topics because of the constraints CY = Y and Cij ≤ Cjj . It follows that the only feasible matrices are factorization localizing matrices.\nWhen there are duplicated rows, the analysis is slightly more delicate. By the same argument as above, all the weight on the diagonal must be concentrated on hott rows. But the objective pT diag(C) ensures that, out of any set of duplicates of a given topic, we always pick the duplicate row j where pj is smallest; otherwise, we could reduce the objective further. Therefore, the diagonal of C identifies all r distinct hott topics, and we select each one duplicate of each topic. As before, the other constraints ensure that the remaining rows are represented with this distinguished choice of hott topic exemplars. Therefore, the only minimizers are factorization localizing matrices that identify each hott topic exactly once.\nA.2 Proof of Theorem 3.2\nLet X = Y + ∆. The matrix X is the observed data, with rows scaled to have unit sum, and the perturbation matrix ∆ satisfies ∥∥∆∥∥∞,1 ≤ . We assume that Y is a nonnegative matrix whose rows sum to one, and we posit that it admits a rank-r separable NMF Y = FW where W is α-robust simplicial. We write I for the set of rows corresponding to hott topics in Y .\nSuppose that C0 is a factorization localizing matrix for the underlying matrix Y . That is, C0Y = Y and each row of C0 sums to one. It follows that∥∥C0∆−∆∥∥∞,1 ≤ (∥∥C0∥∥∞,1 + ∥∥I∥∥∞,1)∥∥∆∥∥∞,1 ≤ 2 . Using our decomposition X = Y + ∆, we quickly verify that∥∥C0X −X∥∥∞,1 ≤ ∥∥C0Y − Y ∥∥∞,1 + ∥∥C0∆−∆∥∥∞,1 ≤ 2 . The point here is that a factorization localizing matrix for Y serves as an approximate factorization localizing matrix for X.\nOur approach for constructing an approximate factorization of X requires us to minimize a cost function tT diag(C) over the constraint set\nΦ2 (X) = { C ≥ 0 : ∥∥CX −X∥∥∞,1 ≤ 2 ,Tr(C) = r, Cjj ≤ 1 ∀j, Cij ≤ Cjj ∀i, j} . (6) Note that the factorization localizing matrix C0 for Y is a member of this set, so the optimization problem we solve in Theorem 3.2 is feasible.\nSuppose that C ∈ Φ2 (X) is arbitrary. Let us check that the row sums of C are not much larger than one. To that end, note that\nC1 = CX1 = X1 + (CX −X)1 = 1 + (CX −X)1.\nWe have twice used the fact that every row of X sums to one. For any row c of the matrix C, this formula yields cT1 ≤ 1 + 2 since ∥∥CX −X∥∥∞,1 ≤ 2 . As a consequence,∥∥C∆−∆∥∥∞,1 ≤ (∥∥C∥∥∞,1 + ∥∥I∥∥∞,1)∥∥∆∥∥∞,1 ≤ (1 + 2 + 1) = 2 + 2 2. We may conclude that∥∥CY − Y ∥∥∞,1 ≤ ∥∥CX −X∥∥∞,1 + ∥∥C∆−∆∥∥∞,1 ≤ 4 + 2 2.\nThe margin assumption states that ‖Y`· − Yi·‖ > d0 for every hott topic i ∈ I and every row ` /∈ I. For any i ∈ I, Lemma A.2 ensures that any approximate representation cTY of the ith row Yi· with error at most 4 + 2 2 satisfies\nci = ∑\nj∈Bd0 (i)\ncj ≥ 1− 8 + 4 2\nmin{αd0, α2} .\nIn particular, every matrix C in the set Φ2 (X) has Cii ≥ 1 − (8 + 4 2)/min{αd0, α2} for each hott topic i. To ensure that hott topic i has weight Cii greater than 1 − 1/(r + 1) for each i, we need\n< √ 1 +\nmin{αd0, α2} 4(r + 1) − 1 < min{αd0, α 2} 9(r + 1)\nSince there are r hott rows, they carry total weight greater than r(1− 1/(r + 1)). Given the trace constraint, that leaves less than 1 − 1/(r + 1) for the remaining rows. We see that each of the r hott rows must carry more weight than every row that is not hott, so we can easily identify them.\nOnce we have identified the set I of hott topics, we simply solve the second linear program\nminimize B ∥∥X − [ I B ] XI ∥∥ ∞,1 (7)\nto find a 2 -accurate factorization."
    }, {
      "heading" : "B Projection onto Φ0",
      "text" : "To project onto the set Φ0, note that we can compute the projection one column at a time. Moreover, the projection for each individual column amounts to (after permuting the entries of the column),\n{x ∈ Rf : 0 ≤ xi ≤ x1 ∀i , x1 ≤ 1} .\nAssume, again without loss of generality, that we want to project a vector z with z2 ≥ z3 ≥ . . . ≥ zn. Then we need to solve the quadratic program\nminimize 12‖z − x‖ 2 subject to 0 ≤ xi ≤ x1 ∀i , x1 ≤ 1 (8)\nThe optimal solution can be found as follows. Let kc be the largest k ∈ {2, . . . , f} such that\nzkc+1 ≤ Π[0,1] ( kc∑ k=1 zk ) =: µ\nwhere Π[0,1] denotes the projection onto the interval [0, 1]. Set\nx̂i = { µ i ≤ kc (zi)+ i > kc .\nThen x̂ is the optimal solution. A linear time algorithm for computing x̂ is given by Algorithm 5 To prove that x̂ is optimal, define\nyi = { zi − µ i ≤ kc min(zi, 0) i > kc .\nyi is the gradient of 1 2‖x− z‖ 2 at x̂. Consider the LP\nminimize −yTx subject to 0 ≤ xi ≤ x1 ∀i , x1 ≤ 1 .\nx̂ is an optimal solution for this LP because the cost is negative on the negative entries, 0 on the nonnegative entries that are larger than kc, positive for 2 ≤ k ≤ kc, and nonpositive for k = 1. Hence, by the minimum principle, x̂ is also a solution of (8).\nAlgorithm 5 Column Squishing\nRequire: A vector z ∈ Rf with z2 ≥ z3 ≥ . . . ≥ zn. Ensure: The projection of z onto {x ∈ Rf : 0 ≤ xi ≤ x1 ∀i , x1 ≤ 1}. 1: µ← z1. 2: for k = 2, . . . , f do 3: if zk ≤ Π[0,1](µ), Set kc = k − 1 and break 4: else set µ = k−1k µ+ 1 kzk.\n5: end for 6: x1 ← Π[0,1](µ) 7: for k = 2, . . . , kc set xk = Π[0,1](µ). 8: for k = (kc + 1), . . . , f set xk = (zi)+. 9: return x"
    } ],
    "references" : [ ],
    "referenceMentions" : [ ],
    "year" : 2013,
    "abstractText" : "<lb>This paper describes a new approach, based on linear programming, for computing nonneg-<lb>ative matrix factorizations (NMFs). The key idea is a data-driven model for the factorization<lb>where the most salient features in the data are used to express the remaining features. More<lb>precisely, given a data matrix X, the algorithm identifies a matrix C that satisfies X ≈ CX<lb>and some linear constraints. The constraints are chosen to ensure that the matrix C selects<lb>features; these features can then be used to find a low-rank NMF of X. A theoretical analysis<lb>demonstrates that this approach has guarantees similar to those of the recent NMF algorithm<lb>of Arora et al. (2012). In contrast with this earlier work, the proposed method extends to more<lb>general noise models and leads to efficient, scalable algorithms. Experiments with synthetic and<lb>real datasets provide evidence that the new approach is also superior in practice. An optimized<lb>C++ implementation can factor a multigigabyte matrix in a matter of minutes.",
    "creator" : "TeX"
  }
}