{
  "name" : "1402.1454.pdf",
  "metadata" : {
    "source" : "META",
    "title" : "An Autoencoder Approach to Learning Bilingual Word Representations",
    "authors" : [ "Sarath Chandar", "Stanislas Lauly", "Hugo Larochelle", "Mitesh M. Khapra", "Balaraman Ravindran" ],
    "emails" : [ "APSARATHCHANDAR@GMAIL.COM", "STANISLAS.LAULY@USHERBROOKE.CA", "HUGO.LAROCHELLE@USHERBROOKE.CA", "MIKHAPRA@IN.IBM.COM", "RAVI@CSE.IITM.AC.IN", "VIRAYKAR@IN.IBM.COM", "AMRSAHA4@IN.IBM.COM" ],
    "sections" : [ {
      "heading" : null,
      "text" : "on the problem of cross-language test classification, where a classifier trained on a given language (e.g., English) must learn to generalize to a different language (e.g., German). These experiments demonstrate that our approaches are competitive with the state-of-the-art, achieving up to 10-14 percentage point improvements over the best reported results on this task."
    }, {
      "heading" : "1. Introduction",
      "text" : "Languages such as English, which have plenty of annotated resources at their disposal have better Natural Language Processing (NLP) capabilities than other languages that are not so fortunate in terms of annotated resources. For example, high quality POS taggers (Toutanova et al., 2003), parsers (Socher et al., 2013), sentiment analyzers (Liu, 2012) are already available for English but this is not the case for many other languages such as Hindi, Marathi, Bodo, Farsi, Urdu, etc. This situation was acceptable in the past when only a few languages dominated the digital content available online and elsewhere. However, the ever increasing number of languages on the web today has made it important to accurately process natural language data in such lesser-fortunate languages also. An obvious solution\nar X\niv :1\n40 2.\n14 54\nv1 [\nto this problem is to improve the annotated inventory of these languages but the involved cost, time and effort act as a natural deterrent to this.\nAnother option is to exploit the unlabeled data available in a language. In this context, vectorial text representations have proven useful for multiple NLP tasks (Turian et al., 2010; Collobert et al., 2011). It’s been shown that meaningful representations, capturing syntactic and semantic similarity, can be learned from unlabeled data. Along with a (usually smaller) set of labeled data, these representations allow to exploit unlabeled data and improve the generalization performance on some given task, even allowing to generalize out of the vocabulary observed in the labeled data only (thereby, partly alleviating the problem of data sparsity).\nWhile the majority of previous work on vectorial text representations has concentrated on the monolingual case, recent work has started looking at learning word and document representations that are aligned across languages (Klementiev et al., 2012; Zou et al., 2013; Mikolov et al., 2013). Such aligned representations can potentially allow the use of resources from a resource fortunate language to develop NLP capabilities in a resource deprived language (Yarowsky and Ngai, 2001; Das and Petrov, 2011; Mihalcea et al., 2007; Wan, 2009; Padó and Lapata, 2009). For example, if a common representation model is learned for representing English and German documents, then a classifier trained on annotated English documents can be used to classify German documents (provided we use the learned common representation model for representing documents in both languages).\nSuch reuse of resources across languages has been tried in the past by projecting parameters learned from the annotated data of one language to another language (Yarowsky and Ngai, 2001; Das and Petrov, 2011; Mihalcea et al., 2007; Wan, 2009; Padó and Lapata, 2009) These projections are enabled by a bilingual resource such as a Machine Translation (MT) system. Recent attempts at learning common bilingual representations (Klementiev et al., 2012; Zou et al., 2013; Mikolov et al., 2013) aim to eliminate the need of such a MT system. Such bilingual representations have been applied to a variety of problems, including crosslanguage document classification (Klementiev et al., 2012) and phrase-based machine translation (Zou et al., 2013). A common property of these approaches is that a word-level alignment of translated sentences is leveraged, e.g., to derive a regularization term relating word embeddings across languages (Klementiev et al., 2012; Zou et al., 2013). Such methods not only eliminate the need for an MT system but also outperform MT based projection approaches.\nIn this paper, we experiment with a method to learn bilingual word representations that does without word-to-word\nalignment of bilingual corpora during training. Unlike previous approaches (Klementiev et al., 2012), we only require aligned sentences and do not rely on word-level alignments (e.g., extracted using GIZA++, as is usual), which simplifies the learning procedure. To do so, we propose a bilingual autoencoder model, that learns hidden encoder representations of paired bag-of-words sentences which are not only informative of the original bag-of-words but also predictive of each other. Word representations can then easily be extracted from the encoder and used in the context of a supervised NLP task. Specifically, we demonstrate the quality of these representations for the task of crosslanguage document classification, where a labeled data set can be available in one language, but not in another one. As we’ll see, our approach is able to reach state-of-the-art performance, achieving up to 10-14 percentage point improvements over the best previously reported results."
    }, {
      "heading" : "2. Autoencoder for Bags-of-Words",
      "text" : "Let x be the bag-of-words representation of a sentence. Specifically, each xi is a word index from a fixed vocabulary of V words. As this is a bag-of-words, the order of the words within x does not correspond to the word order in the original sentence. We wish to learn a D-dimensional vectorial representation of our words from a training set of sentence bag-of-words {x(t)}Tt=1.\nWe propose to achieve this by using an autoencoder model that encodes an input bag-of-words x with a sum of the representations (embeddings) of the words present in x, followed by a nonlinearity. Specifically, let matrix W be the D × V matrix whose columns are the vector representations for each word. The encoder’s computation will involve summing over the columns of W for each word in the bag-of-word. We will note this encoder function φ(x). Then, using a decoder, the autoencoder will be trained to optimize a loss function that measures how predictive of the original bag-of-words the encoder representation φ(x) is.\nThere are different variations we can consider, in the design of the encoder/decoder and the choice of loss function. One must be careful however, as certain choices can be inappropriate for training on word observations, which are intrinsically sparse and high-dimensional. In this paper, we explore and compare two different approaches, described in the next two sub-sections."
    }, {
      "heading" : "2.1. Binary bag-of-words reconstruction training with merged mini-batches",
      "text" : "In the first approach, we start from the conventional autoencoder architecture, which minimizes a cross-entropy loss that compares a binary vector observation with a decoder\nreconstruction. We thus convert the bag-of-words x into a fixed-size but sparse binary vector v(x), which is such that v(x)xi is 1 if word xi is present in x or otherwise 0.\nFrom this representation, we obtain an encoder representation by multiplying v(x) with the word representation matrix W\nφ(x) = h(c+Wv(x)) (1)\nwhere h(·) is an element-wise non-linearity such as the sigmoid or hyperbolic tangent, and c is a D-dimensional bias vector. Encoding thus involves summing the word representation of the words present at least once in the bag-ofword.\nTo produce a reconstruction, we parametrize the decoder using the following non-linear form:\nv̂(x) = sigm(Vφ(x) + b) (2)\nwhere V = WT and b is the bias vector of the reconstruction layer and sigm(a) = 1/(1 + exp(−a)) is the sigmoid non-linearity.\nThen, the reconstruction is compared to the original binary bag-of-words as follows: `(v(x)) = − V∑ i=1 v(x)i log(v̂(x)i)+(1−v(x)i) log(1−v̂(x)i) . (3) Training then proceeds by optimizing the sum of reconstruction cross-entropies across the training set, e.g., using stochastic or mini-batch gradient descent.\nNote that, since the binary bag-of-words are very highdimensional (the dimensionality corresponds to the size of the vocabulary, which is typically large), the above training procedure which aims at reconstructing the complete binary bag-of-word, will be slow. Since we will later be training on millions of sentences, training on each individual sentence bag-of-words will be expensive.\nThus, we propose a simple trick, which exploits the bagof-words structure of the input. Assuming we are performing mini-batch training (where a mini-batch contains a list of bag-of-words), we simply propose to merge the bagsof-words of the mini-batch into a single bag-of-word, and revert back to stochastic gradient descent. The resulting effect is that each update is as efficient as in stochastic gradient descent, but the number of updates per training epoch is divided by the mini-batch size. As we’ll see in the experimental section, we’ve found this trick to still produces good word representations, while sufficiently reducing training time.\nWe note that, additionally, we could have used the stochastic approach proposed by Dauphin et al. (2011) for reconstructing binary bag-of-words representations of documents, to further improve the efficiency of training. They\nuse importance sampling to avoid reconstructing the whole V -dimensional input vector."
    }, {
      "heading" : "2.2. Tree-based decoder training",
      "text" : "The previous autoencoder architecture worked with a binary vectorial representation of the input bag-of-word. In the second autoencoder architecture we investigated, we considered an architecture that instead works with the bag (unordered list) representation more directly.\nFirstly, the encoder representation will now involve a sum of the representation of all words, reflecting the relative frequency of each word:\nφ(x) = h c+ |x|∑ i=1 W·,xi  . (4) Notice that this implies that the scaling of the pre-activation (the input to the nonlinearity) can vary between bags-ofwords, depending on how many words it contains. Thus, we’ll optionally consider using the average of the representations, as opposed to the sum (this choice is crossvalidated in our experiments).\nMoreover, decoder training will assume that, from the decoder’s output, we can obtain a probability distribution over any word x̂ observed at the reconstruction output layer p(x̂|φ(x)). Then, we can treat the input bag-of-words as a |x|-trials multinomial sample from that distribution and use as the reconstruction loss its negative log-likelihood:\n`(x) = V∑ i=1 − log p(x̂ = xi|φ(x)) . (5)\nWe now must ensure that the decoder can compute p(x̂ = xi|φ(x)) efficiently from φ(x). Specifically, we’d like to avoid a procedure scaling linearly with the vocabulary size V , since V will be very large in practice. This precludes any procedure that would compute the numerator of p(x̂ = w|φ(x)) for each possible word w separately and normalize so it sums to one.\nWe instead opt for an approach borrowed from the work on neural network language models (Morin and Bengio, 2005; Mnih and Hinton, 2009). Specifically, we use a probabilistic tree decomposition of p(x̂ = xi|φ(x)). Let’s assume each word has been placed at the leaf of a binary tree. We can then treat the sampling of a word as a stochastic path from the root of the tree to one of the leaves.\nWe denote as l(x) the sequence of internal nodes in the path from the root to a given word x, with l(x)1 always corresponding to the root. We will denote as π(x) the vector of associated left/right branching choices on that path, where π(x)k = 0 means the path branches left at internal node\nl(x)k and branches right if π(x)k = 1 otherwise. Then, the probability p(x̂ = x|φ(x)) of reconstructing a certain word x observed in the bag-of-words is computed as\np(x̂|φ(x)) = |π(x̂)|∏ k=1 p(π(x̂)k|φ(x)) (6)\nwhere p(π(x̂)k|φ(x)) is output by the decoder. By using a full binary tree of words, the number of different decoder outputs required to compute p(x̂|φ(x)) will be logarithmic in the vocabulary size V . Since there are |x| words in the bag-of-words, at most O(|x| log V ) outputs are required from the decoder. This is of course a worst case scenario, since words will share internal nodes between their paths, for which the decoder output can be computed just once. As for organizing words into a tree, as in Larochelle and Lauly (2012) we used a random assignment of words to the leaves of the full binary tree, which we have found to work well in practice.\nFinally, we need to choose a parametrized form for the decoder. We choose the following non-linear form:\np(π(x̂)k = 1|φ(x)) = sigm(bl(x̂i)k +Vl(x̂i)k,·φ(x)) (7)\nwhere b is a (V -1)-dimensional bias vector and V is a (V − 1)×D matrix. Each left/right branching probability is thus modeled with a logistic regression model applied on the encoder representation of the input bag-of-words φ(x)."
    }, {
      "heading" : "3. Bilingual autoencoders",
      "text" : "Let’s now assume that for each sentence bag-of-words x in some source language X , we have an associated bagof-words y for the same sentence translated in some target language Y by a human expert.\nAssuming we have a training set of such (x,y) pairs, we’d like to use it to learn representations in both languages that are aligned, such that pairs of translated words have similar representations.\nTo achieve this, we propose to augment the regular autoencoder proposed in Section 2 so that, from the sentence representation in a given language, a reconstruction can be attempted of the original sentence in the other language. Specifically, we now define language specific word representation matrices Wx and Wy , corresponding to the languages of the words in x and y respectively. Let V X and V Y also be the number of words in the vocabulary of both languages, which can be different. The word representations however are of the same sizeD in both languages. For the binary reconstruction autoencoder, the bag-of-words representations extracted by the encoder becomes\nφ(x) = h ( c+WXv(x) ) , φ(y) = h ( c+WYv(y) )\nand are similarly extended for the tree-based autoencoder. Notice that we share the bias c before the nonlinearity across encoders, to encourage the encoders in both languages to produce representations on the same scale.\nFrom the sentence in either languages, we want to be able to perform a reconstruction of the original sentence in any of the languages. In particular, given a representation in any language, we’d like a decoder that can perform a reconstruction in language X and another decoder that can reconstruct in language Y . Again, we use decoders of the form proposed in either Section 2.1 or 2.2 (see Figures 1 and 2), but let the decoders of each language have their own parameters (bX ,VX ) and (bY ,VY).\nThis encoder/decoder decomposition structure allows us to learn a mapping within each language and across the languages. Specifically, for a given pair (x,y), we can train the model to (1) construct y from x (loss `(x,y)), (2) construct x from y (loss `(y,x)), (3) reconstruct x from itself (loss `(x)) and (4) reconstruct y from itself (loss `(y)). We follow this approach in our experiments and optimize the sum of the corresponding 4 losses during training."
    }, {
      "heading" : "3.1. Cross-lingual correlation regularization",
      "text" : "The bilingual encoder proposed above can be further enriched by ensuring that the embeddings learned for a given pair (x,y) are highly correlated. We achieve this by adding a correlation term to the objective function. Specifically, we could optimize\n`(x,y) + `(y,x)− λ · cor(φ(x),φ(y)) (8)\nwhere cor(φ(x),φ(y)) is the correlation between the encoder representations learned for x and y and λ is a scaling factor which ensures that the three terms in the loss function have the same range. Note that this approach could be used for either the binary bag-of-words or the tree-based reconstruction autoencoders."
    }, {
      "heading" : "3.2. Document representations",
      "text" : "Once we learn the language specific word representation matrices Wx and Wy as described above, we can use them to construct document representations, by using their columns as vector representations for words in both languages. Now, given a document d written in language Z ∈ {X ,Y} and containing m words, z1, z2, . . . , zm, we represent it as the tf-idf weighted sum of its words’ representations:\nψ(d) = m∑ i=1 tf-idf(zi) ·WZ.,zi (9)\nWe use the document representations thus obtained to train\nour document classifiers, in the cross-lingual document classification task described in Section 5."
    }, {
      "heading" : "4. Related Work",
      "text" : "Recent work that has considered the problem of learning bilingual representations of words usually has relied on word-level alignments. Klementiev et al. (2012) propose to train simultaneously two neural network languages models, along with a regularization term that encourages pairs of frequently aligned words to have similar word embeddings. Zou et al. (2013) use a similar approach, with a different form for the regularizer and neural network language models as in (Collobert et al., 2011). In our work, we specifically investigate whether a method that does not rely on word-level alignments can learn comparably useful multilingual embeddings in the context of document classification.\nLooking more generally at neural networks that learn multilingual representations of words or phrases, we mention the work of Gao et al. (2013) which showed that a useful linear mapping between separately trained monolingual skip-gram language models could be learned. They too however rely on the specification of pairs of words in the two languages to align. Mikolov et al. (2013) also propose a method for training a neural network to learn useful representations of phrases (i.e. short segments of words), in the context of a phrase-based translation model. In this case, phrase-level alignments (usually extracted from word-level alignments) are required."
    }, {
      "heading" : "5. Experiments",
      "text" : "The techniques proposed in this paper enable us to learn bilingual embeddings which capture cross-language similarity between words. We propose to evaluate the quality of these embeddings by using them for the task of crosslanguage document classification. We follow the same setup as used by Klementiev et al. (2012) and compare with their method. The set up is as follows. A labeled data set of documents in some language X is available to train a classifier, however we are interested in classifying documents in a different language Y at test time. To achieve this, we leverage some bilingual corpora, which importantly is not labeled with any document-level categories. This bilingual corpora is used instead to learn document representations in both languages X and Y that are encouraged to be invariant to translations from one language to another. The hope is thus that we can successfully apply the classifier trained on document representations for language X directly to the document representations for language Y . We use English (EN) and German (DE) as the language pair for all our experiments."
    }, {
      "heading" : "5.1. Data",
      "text" : "For learning the bilingual embeddings, we used the English German section of the Europarl corpus (Koehn, 2005) which contains roughly 2 million parallel sentences. As mentioned earlier, unlike Klementiev et al. (2012), we do not use any word alignments between these parallel sentences. We use the same pre-processing as used by Kle-\nmentiev et al. (2012). Specifically, we tokenize the sentences using NLTK (Bird Steven and Klein, 2009), remove punctuations and lowercase all words. We do not remove stopwords (similar to Klementiev et al. (2012)).\nNote that Klementiev et al. (2012) use the word-aligned Europarl corpus to first learn an interaction matrix between the words in the two languages. This interaction matrix is then used in a multitask learning setup to induce bilingual embeddings from English and German sections of the Reuters RCV1/RCV2 corpora. Note that these documents are not parallel. Each document is assigned one or more categories from a pre-defined hierarchy of topics. Following Klementiev et al. (2012), we consider only those documents which were assigned exactly one of the 4 top level categories in the topic hierarchy. These topics are CCAT (Corporate/Industrial), ECAT (Economics), GCAT (Government/Social) and MCAT (Markets). The number of such documents sampled by Klementiev et al. (2012) for English and German is 34,000 and 42,753 respectively. In contrast to Klementiev et al. (2012), we do not require a two stage approach (of learning an interaction matrix and then inducing bilingual embeddings). We directly learn the embeddings from the Europarl corpus which is parallel. Further, in addition to the Europarl corpus, we also considered feeding the same RCV1/RCV2 documents (34000 EN and 42,753 DE) to the autoencoders. These non-parallel documents are used only to reinforce the monolingual embeddings (by reconstructing x from x or y from y). So, in effect, we use the same amount of data as that used by Klementiev et al. (2012) but our model/training procedure is completely different.\nNext for the cross language classification experiments, we again follow the same setup as used by Klementiev et al. (2012). Specifically, we use 10,000 single-topic documents for training and 5000 single-topic documents for testing in each language. These documents are also pre-processed using a similar procedure as that used for the Europarl corpus."
    }, {
      "heading" : "5.2. Cross language classification",
      "text" : "Our overall procedure for cross language classification can be summarized as follows:\n• Train bilingual word representations Wx and Wy on sentence pairs extracted from Europarl-v7 for languages X and Y . Optionally, we also use the monolingual documents from RCV1/RCV2 to reinforce the monolingual embeddings (this choice is crossvalidated, as described in Section 5.3).\n• Train document classifier on the Reuters training set for language X , where documents are represented using the word representations Wx.\n• Use the classifier trained in the previous step on the Reuters test set for language Y , using the word representations Wy to represent the documents.\nAs in Klementiev et al. (2012) we used an averaged perceptron to train a multi-class classifier for 10 epochs, for all the experiments (Klementiev et al. (2012) report that the results were not sensitive to the number of epochs). The English and German vocabularies contained 43,614 and 50,110 words, respectively. Each document is represented with the tf-idf weighted linear combination of its word’s embeddings, as described in Section 3.2, where only the words belonging to the above vocabulary are considered."
    }, {
      "heading" : "5.3. Different models for learning embeddings",
      "text" : "From the different autoencoder architectures and the optional correlation-based regularization term proposed earlier, we trained 3 different models for learning bilingual embeddings. Each of these models is described below.\n• BAE-tr: uses tree-based decoder training (see Section 2.2).\n• BAE-cr: uses reconstruction error based decoder training (see Section 2.1).\n• BAE-cr/corr: uses reconstruction error based decoder training (see Section 2.1), but unlike BAE-cr it uses the correlation based regularization term (see Section 3.1).\nAs we’ll see, BAE-cr is our worse performing model, thus this experiment will allow us to observe whether the correlation regularization can play an important role in improving the quality of the representations.\nAll of the above models were trained for up to 20 epochs using the same data as described earlier. All results are for word embeddings of size D = 40, as in Klementiev et al. (2012). Further, to speed up the training for BAEcr and BAE-cr/corr we merged mini-batches of 5 adjacent sentence pairs into a single training instance, as described in Section 2.1.\nOther hyperparameters were selected using a training/validation set split of 80% and 20% and using the performance on the validation set of an averaged perceptron trained on the smaller training set portion (notice that this corresponds to a monolingual classification experiment, since the general assumption is that no labeled data is available in the test set language)."
    }, {
      "heading" : "6. Results and Discussions",
      "text" : "Before discussing the results of cross language classification, we would first like to give a qualitative feel for the\nembeddings learned by our method. For this, we perform a small experiment where we select a few English words and list the top 10 English and German words which are most similar to these words (in terms of the Euclidean distance between their embeddings as learned by BAE-cr/corr). Table 1 shows the result of this experiment. For example, Table 1 shows that in all the cases the German word which is closest to a given English word is actually the translation of that English word. Also, notice that the model is able to capture semantic similarity between words by embedding semantically similar words (such as, (january, march), (gesagt, sagte), (market, commercial), etc.) close to each other. The results of this experiment suggest that these bilingual embeddings should be useful for any cross language classification task as indeed shown by the results presented in the next section. The supplementary material also includes a 2D visualization of the word embeddings in both languages, generated using the t-SNE dimensionality reduction algorithm (van der Maaten and Hinton, 2008)."
    }, {
      "heading" : "6.1. Comparison of the performance of different models",
      "text" : "We now present the cross language classification results obtained by using the embeddings produced by each of the 3\nmodels described above. We also compare our models with the following approaches, for which the results are reported in Klementiev et al. (2012):\n• Klementiev et al. : This model uses word embeddings learned by a multitask neural network language model with a regularization term that encourages pairs of frequently aligned words to have similar word embeddings. From these embeddings, document representations are computed as described in Section 3.2.\n• MT: Here, test documents are translated to the language of the training documents using a Machine Translation (MT) system. MOSES1, a standard phrase-based MT system, using default parameters and a 5-gram language model was trained on the Europarl v7 corpus (same as the one used for inducing our bilingual embeddings).\n• Majority Class: Every test document is simply assigned the Majority class prevalent in the training data.\nTable 2 summarizes the results obtained using 1K training data with different models. We report results in both direc-\n1http://www.statmt.org/moses/\ntions, i.e., EN-DE and DE-EN. Between BAE-tr and BAEcr, we observe that BAE-tr provides better performance and is comparable to the embeddings learned by the neural network language model of Klementiev et al. (2012) which, unlike BAE-tr, relies on word-level alignments. We also observe that the use of the correlation regularization is very beneficial. Indeed, it is able to improve the performance of BAE-cr and make it the best performing method, with more than 10% in accuracy over other methods for the EN to DE task."
    }, {
      "heading" : "6.2. Effect of varying training size",
      "text" : "Next, we evaluate the effect of varying the amount of supervised training data for training the classifier, with either BAE-tr, BAE-cr/corr or Klementiev et al. (2012) embeddigns. We experiment with training sizes of 100, 200, 500, 1000, 5000 and 10000. These results for EN-DE and DEEN are summarized in Figure 3 and Figure 4 respectively. We observe that BAE-cr/corr clearly outperforms the other models at almost all data sizes. More importantly, it performs remarkably well at very low data sizes (t=100) which suggests that it indeed learns very meaningful embeddings which can generalize well even at low data sizes."
    }, {
      "heading" : "6.3. Effect of coarser alignments",
      "text" : "The excellent performance of BAE-cr/corr suggests that merging mini-batches into single bags-of-words does not significantly impact the quality of the word embeddings. In other words, not only we do not need to rely on wordlevel alignments, but exact sentence-level alignment is also not essential to reach good performances. It is thus natural to ask the effect of using even coarser level alignments. We check this by varying the size of the merged minibatches from 5, 25 to 50, for both BAE-cr/corr and BAE-tr. The cross language classification results obtained by using these coarser alignments are summarized in Table 3.\nSurprisingly, the performance of BAE-tr does not significantly decrease, by using merged mini-batches of size 5 (in fact, the performance even improves for the EN to DE task). However, with larger mini-batches, the performance\ncan deteriorate, as is observed on the DE to EN task, for the BAE-cr/corr embeddings."
    }, {
      "heading" : "7. Conclusion and Future Work",
      "text" : "We presented evidence that meaningful bilingual word representations could be learned without relying on word-level alignments and can even be successful on fairly coarse sentence-level alignments. In particular, we showed that even though our model does not use word level alignments, it is able to outperform a state of the art word representation learning method that exploits word-level alignments. In addition, it also outperforms a strong Machine Translation based baseline. We observed that using a correlation based regularization term leads to better bilingual embeddings which are highly correlated and hence perform better for cross language classification tasks.\nAs future work we would like to investigate extensions of our bag-of- words bilingual autoencoder to bags-of-ngrams, where the model would also have to learn representations for short phrases. Such a model should be particularly useful in the context of a machine translation system.\nWe would also like to explore the possibility of converting our bilingual model to a multilingual model which can learn common representations for multiple languages given different amounts of parallel data between these languages."
    } ],
    "references" : [ {
      "title" : "Feature-rich part-of-speech tagging with a cyclic dependency network",
      "author" : [ "Kristina Toutanova", "Dan Klein", "Christopher D. Manning", "Yoram Singer" ],
      "venue" : "In Proceedings of the 2003 Conference of the North American Chapter of the Association for Computational Linguistics on Human",
      "citeRegEx" : "Toutanova et al\\.,? \\Q2003\\E",
      "shortCiteRegEx" : "Toutanova et al\\.",
      "year" : 2003
    }, {
      "title" : "Sentiment Analysis and Opinion Mining",
      "author" : [ "Bing Liu" ],
      "venue" : "Synthesis Lectures on Human Language Technologies. Morgan & Claypool Publishers,",
      "citeRegEx" : "Liu.,? \\Q2012\\E",
      "shortCiteRegEx" : "Liu.",
      "year" : 2012
    }, {
      "title" : "Word representations: A simple and general method for semisupervised learning",
      "author" : [ "Joseph Turian", "Lev Ratinov", "Yoshua Bengio" ],
      "venue" : "In Proceedings of the 48th Annual Meeting of the Association for Computational Linguistics",
      "citeRegEx" : "Turian et al\\.,? \\Q2010\\E",
      "shortCiteRegEx" : "Turian et al\\.",
      "year" : 2010
    }, {
      "title" : "Inducing Crosslingual Distributed Representations of Words",
      "author" : [ "Alexandre Klementiev", "Ivan Titov", "Binod Bhattarai" ],
      "venue" : "In Proceedings of the International Conference on Computational Linguistics (COLING),",
      "citeRegEx" : "Klementiev et al\\.,? \\Q2012\\E",
      "shortCiteRegEx" : "Klementiev et al\\.",
      "year" : 2012
    }, {
      "title" : "Bilingual Word Embeddings for Phrase-Based Machine Translation",
      "author" : [ "Will Y. Zou", "Richard Socher", "Daniel Cer", "Christopher D. Manning" ],
      "venue" : "In Conference on Empirical Methods in Natural Language Processing",
      "citeRegEx" : "Zou et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Zou et al\\.",
      "year" : 2013
    }, {
      "title" : "Exploiting Similarities among Languages for Machine Translation",
      "author" : [ "Tomas Mikolov", "Quoc Le", "Ilya Sutskever" ],
      "venue" : "Technical report,",
      "citeRegEx" : "Mikolov et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Mikolov et al\\.",
      "year" : 2013
    }, {
      "title" : "Learning multilingual subjective language via cross-lingual projections",
      "author" : [ "Rada Mihalcea", "Carmen Banea", "Janyce Wiebe" ],
      "venue" : "In Proceedings of the 45th Annual Meeting of the Association of Computational Linguistics,",
      "citeRegEx" : "Mihalcea et al\\.,? \\Q2007\\E",
      "shortCiteRegEx" : "Mihalcea et al\\.",
      "year" : 2007
    }, {
      "title" : "Cross-lingual annotation projection for semantic roles",
      "author" : [ "Sebastian Padó", "Mirella Lapata" ],
      "venue" : "Journal of Artificial Intelligence Research (JAIR),",
      "citeRegEx" : "Padó and Lapata.,? \\Q2009\\E",
      "shortCiteRegEx" : "Padó and Lapata.",
      "year" : 2009
    }, {
      "title" : "LargeScale Learning of Embeddings with Reconstruction Sampling",
      "author" : [ "Yann Dauphin", "Xavier Glorot", "Yoshua Bengio" ],
      "venue" : "In Proceedings of the 28th International Conference on Machine Learning (ICML",
      "citeRegEx" : "Dauphin et al\\.,? \\Q2011\\E",
      "shortCiteRegEx" : "Dauphin et al\\.",
      "year" : 2011
    }, {
      "title" : "Hierarchical Probabilistic Neural Network Language Model",
      "author" : [ "Frederic Morin", "Yoshua Bengio" ],
      "venue" : "In Proceedings of the 10th International Workshop on Artificial Intelligence and Statistics (AISTATS",
      "citeRegEx" : "Morin and Bengio.,? \\Q2005\\E",
      "shortCiteRegEx" : "Morin and Bengio.",
      "year" : 2005
    }, {
      "title" : "A Scalable Hierarchical Distributed Language Model",
      "author" : [ "Andriy Mnih", "Geoffrey E Hinton" ],
      "venue" : "In Advances in Neural Information Processing Systems",
      "citeRegEx" : "Mnih and Hinton.,? \\Q2008\\E",
      "shortCiteRegEx" : "Mnih and Hinton.",
      "year" : 2008
    }, {
      "title" : "A Neural Autoregressive Topic Model",
      "author" : [ "Hugo Larochelle", "Stanislas Lauly" ],
      "venue" : "In Advances in Neural Information Processing Systems",
      "citeRegEx" : "Larochelle and Lauly.,? \\Q2012\\E",
      "shortCiteRegEx" : "Larochelle and Lauly.",
      "year" : 2012
    }, {
      "title" : "Learning Semantic Representations for the Phrase Translation Model",
      "author" : [ "Jianfeng Gao", "Xiaodong He", "Wen-tau Yih", "Li Deng" ],
      "venue" : "Technical report, Microsoft Research,",
      "citeRegEx" : "Gao et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Gao et al\\.",
      "year" : 2013
    }, {
      "title" : "Europarl: A parallel corpus for statistical machine translation",
      "author" : [ "Philipp Koehn" ],
      "venue" : "In MT Summit,",
      "citeRegEx" : "Koehn.,? \\Q2005\\E",
      "shortCiteRegEx" : "Koehn.",
      "year" : 2005
    }, {
      "title" : "Visualizing Data using t-SNE",
      "author" : [ "Laurens van der Maaten", "Geoffrey E Hinton" ],
      "venue" : "Journal of Machine Learning Research,",
      "citeRegEx" : "Maaten and Hinton.,? \\Q2008\\E",
      "shortCiteRegEx" : "Maaten and Hinton.",
      "year" : 2008
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "For example, high quality POS taggers (Toutanova et al., 2003), parsers (Socher et al.",
      "startOffset" : 38,
      "endOffset" : 62
    }, {
      "referenceID" : 1,
      "context" : ", 2013), sentiment analyzers (Liu, 2012) are already available for English but this is not the case for many other languages such as Hindi, Marathi, Bodo, Farsi, Urdu, etc.",
      "startOffset" : 29,
      "endOffset" : 40
    }, {
      "referenceID" : 2,
      "context" : "In this context, vectorial text representations have proven useful for multiple NLP tasks (Turian et al., 2010; Collobert et al., 2011).",
      "startOffset" : 90,
      "endOffset" : 135
    }, {
      "referenceID" : 3,
      "context" : "While the majority of previous work on vectorial text representations has concentrated on the monolingual case, recent work has started looking at learning word and document representations that are aligned across languages (Klementiev et al., 2012; Zou et al., 2013; Mikolov et al., 2013).",
      "startOffset" : 224,
      "endOffset" : 289
    }, {
      "referenceID" : 4,
      "context" : "While the majority of previous work on vectorial text representations has concentrated on the monolingual case, recent work has started looking at learning word and document representations that are aligned across languages (Klementiev et al., 2012; Zou et al., 2013; Mikolov et al., 2013).",
      "startOffset" : 224,
      "endOffset" : 289
    }, {
      "referenceID" : 5,
      "context" : "While the majority of previous work on vectorial text representations has concentrated on the monolingual case, recent work has started looking at learning word and document representations that are aligned across languages (Klementiev et al., 2012; Zou et al., 2013; Mikolov et al., 2013).",
      "startOffset" : 224,
      "endOffset" : 289
    }, {
      "referenceID" : 6,
      "context" : "Such aligned representations can potentially allow the use of resources from a resource fortunate language to develop NLP capabilities in a resource deprived language (Yarowsky and Ngai, 2001; Das and Petrov, 2011; Mihalcea et al., 2007; Wan, 2009; Padó and Lapata, 2009).",
      "startOffset" : 167,
      "endOffset" : 271
    }, {
      "referenceID" : 7,
      "context" : "Such aligned representations can potentially allow the use of resources from a resource fortunate language to develop NLP capabilities in a resource deprived language (Yarowsky and Ngai, 2001; Das and Petrov, 2011; Mihalcea et al., 2007; Wan, 2009; Padó and Lapata, 2009).",
      "startOffset" : 167,
      "endOffset" : 271
    }, {
      "referenceID" : 6,
      "context" : "Such reuse of resources across languages has been tried in the past by projecting parameters learned from the annotated data of one language to another language (Yarowsky and Ngai, 2001; Das and Petrov, 2011; Mihalcea et al., 2007; Wan, 2009; Padó and Lapata, 2009) These projections are enabled by a bilingual resource such as a Machine Translation (MT) system.",
      "startOffset" : 161,
      "endOffset" : 265
    }, {
      "referenceID" : 7,
      "context" : "Such reuse of resources across languages has been tried in the past by projecting parameters learned from the annotated data of one language to another language (Yarowsky and Ngai, 2001; Das and Petrov, 2011; Mihalcea et al., 2007; Wan, 2009; Padó and Lapata, 2009) These projections are enabled by a bilingual resource such as a Machine Translation (MT) system.",
      "startOffset" : 161,
      "endOffset" : 265
    }, {
      "referenceID" : 3,
      "context" : "Recent attempts at learning common bilingual representations (Klementiev et al., 2012; Zou et al., 2013; Mikolov et al., 2013) aim to eliminate the need of such a MT system.",
      "startOffset" : 61,
      "endOffset" : 126
    }, {
      "referenceID" : 4,
      "context" : "Recent attempts at learning common bilingual representations (Klementiev et al., 2012; Zou et al., 2013; Mikolov et al., 2013) aim to eliminate the need of such a MT system.",
      "startOffset" : 61,
      "endOffset" : 126
    }, {
      "referenceID" : 5,
      "context" : "Recent attempts at learning common bilingual representations (Klementiev et al., 2012; Zou et al., 2013; Mikolov et al., 2013) aim to eliminate the need of such a MT system.",
      "startOffset" : 61,
      "endOffset" : 126
    }, {
      "referenceID" : 3,
      "context" : "Such bilingual representations have been applied to a variety of problems, including crosslanguage document classification (Klementiev et al., 2012) and phrase-based machine translation (Zou et al.",
      "startOffset" : 123,
      "endOffset" : 148
    }, {
      "referenceID" : 4,
      "context" : ", 2012) and phrase-based machine translation (Zou et al., 2013).",
      "startOffset" : 45,
      "endOffset" : 63
    }, {
      "referenceID" : 3,
      "context" : ", to derive a regularization term relating word embeddings across languages (Klementiev et al., 2012; Zou et al., 2013).",
      "startOffset" : 76,
      "endOffset" : 119
    }, {
      "referenceID" : 4,
      "context" : ", to derive a regularization term relating word embeddings across languages (Klementiev et al., 2012; Zou et al., 2013).",
      "startOffset" : 76,
      "endOffset" : 119
    }, {
      "referenceID" : 3,
      "context" : "Unlike previous approaches (Klementiev et al., 2012), we only require aligned sentences and do not rely on word-level alignments (e.",
      "startOffset" : 27,
      "endOffset" : 52
    }, {
      "referenceID" : 8,
      "context" : "We note that, additionally, we could have used the stochastic approach proposed by Dauphin et al. (2011) for reconstructing binary bag-of-words representations of documents, to further improve the efficiency of training.",
      "startOffset" : 83,
      "endOffset" : 105
    }, {
      "referenceID" : 9,
      "context" : "We instead opt for an approach borrowed from the work on neural network language models (Morin and Bengio, 2005; Mnih and Hinton, 2009).",
      "startOffset" : 88,
      "endOffset" : 135
    }, {
      "referenceID" : 11,
      "context" : "As for organizing words into a tree, as in Larochelle and Lauly (2012) we used a random assignment of words to the leaves of the full binary tree, which we have found to work well in practice.",
      "startOffset" : 43,
      "endOffset" : 71
    }, {
      "referenceID" : 3,
      "context" : "Klementiev et al. (2012) propose to train simultaneously two neural network languages models, along with a regularization term that encourages pairs of frequently aligned words to have similar word embeddings.",
      "startOffset" : 0,
      "endOffset" : 25
    }, {
      "referenceID" : 3,
      "context" : "Klementiev et al. (2012) propose to train simultaneously two neural network languages models, along with a regularization term that encourages pairs of frequently aligned words to have similar word embeddings. Zou et al. (2013) use a similar approach, with a different form for the regularizer and neural network language models as in (Collobert et al.",
      "startOffset" : 0,
      "endOffset" : 228
    }, {
      "referenceID" : 11,
      "context" : "Looking more generally at neural networks that learn multilingual representations of words or phrases, we mention the work of Gao et al. (2013) which showed that a useful linear mapping between separately trained monolingual skip-gram language models could be learned.",
      "startOffset" : 126,
      "endOffset" : 144
    }, {
      "referenceID" : 5,
      "context" : "Mikolov et al. (2013) also propose a method for training a neural network to learn useful representations of phrases (i.",
      "startOffset" : 0,
      "endOffset" : 22
    }, {
      "referenceID" : 3,
      "context" : "We follow the same setup as used by Klementiev et al. (2012) and compare with their method.",
      "startOffset" : 36,
      "endOffset" : 61
    }, {
      "referenceID" : 13,
      "context" : "For learning the bilingual embeddings, we used the English German section of the Europarl corpus (Koehn, 2005) which contains roughly 2 million parallel sentences.",
      "startOffset" : 97,
      "endOffset" : 110
    }, {
      "referenceID" : 3,
      "context" : "As mentioned earlier, unlike Klementiev et al. (2012), we do not use any word alignments between these parallel sentences.",
      "startOffset" : 29,
      "endOffset" : 54
    }, {
      "referenceID" : 3,
      "context" : "We do not remove stopwords (similar to Klementiev et al. (2012)).",
      "startOffset" : 39,
      "endOffset" : 64
    }, {
      "referenceID" : 3,
      "context" : "Note that Klementiev et al. (2012) use the word-aligned Europarl corpus to first learn an interaction matrix between the words in the two languages.",
      "startOffset" : 10,
      "endOffset" : 35
    }, {
      "referenceID" : 3,
      "context" : "Note that Klementiev et al. (2012) use the word-aligned Europarl corpus to first learn an interaction matrix between the words in the two languages. This interaction matrix is then used in a multitask learning setup to induce bilingual embeddings from English and German sections of the Reuters RCV1/RCV2 corpora. Note that these documents are not parallel. Each document is assigned one or more categories from a pre-defined hierarchy of topics. Following Klementiev et al. (2012), we consider only those documents which were assigned exactly one of the 4 top level categories in the topic hierarchy.",
      "startOffset" : 10,
      "endOffset" : 482
    }, {
      "referenceID" : 3,
      "context" : "Note that Klementiev et al. (2012) use the word-aligned Europarl corpus to first learn an interaction matrix between the words in the two languages. This interaction matrix is then used in a multitask learning setup to induce bilingual embeddings from English and German sections of the Reuters RCV1/RCV2 corpora. Note that these documents are not parallel. Each document is assigned one or more categories from a pre-defined hierarchy of topics. Following Klementiev et al. (2012), we consider only those documents which were assigned exactly one of the 4 top level categories in the topic hierarchy. These topics are CCAT (Corporate/Industrial), ECAT (Economics), GCAT (Government/Social) and MCAT (Markets). The number of such documents sampled by Klementiev et al. (2012) for English and German is 34,000 and 42,753 respectively.",
      "startOffset" : 10,
      "endOffset" : 776
    }, {
      "referenceID" : 3,
      "context" : "Note that Klementiev et al. (2012) use the word-aligned Europarl corpus to first learn an interaction matrix between the words in the two languages. This interaction matrix is then used in a multitask learning setup to induce bilingual embeddings from English and German sections of the Reuters RCV1/RCV2 corpora. Note that these documents are not parallel. Each document is assigned one or more categories from a pre-defined hierarchy of topics. Following Klementiev et al. (2012), we consider only those documents which were assigned exactly one of the 4 top level categories in the topic hierarchy. These topics are CCAT (Corporate/Industrial), ECAT (Economics), GCAT (Government/Social) and MCAT (Markets). The number of such documents sampled by Klementiev et al. (2012) for English and German is 34,000 and 42,753 respectively. In contrast to Klementiev et al. (2012), we do not require a two stage approach (of learning an interaction matrix and then inducing bilingual embeddings).",
      "startOffset" : 10,
      "endOffset" : 874
    }, {
      "referenceID" : 3,
      "context" : "Note that Klementiev et al. (2012) use the word-aligned Europarl corpus to first learn an interaction matrix between the words in the two languages. This interaction matrix is then used in a multitask learning setup to induce bilingual embeddings from English and German sections of the Reuters RCV1/RCV2 corpora. Note that these documents are not parallel. Each document is assigned one or more categories from a pre-defined hierarchy of topics. Following Klementiev et al. (2012), we consider only those documents which were assigned exactly one of the 4 top level categories in the topic hierarchy. These topics are CCAT (Corporate/Industrial), ECAT (Economics), GCAT (Government/Social) and MCAT (Markets). The number of such documents sampled by Klementiev et al. (2012) for English and German is 34,000 and 42,753 respectively. In contrast to Klementiev et al. (2012), we do not require a two stage approach (of learning an interaction matrix and then inducing bilingual embeddings). We directly learn the embeddings from the Europarl corpus which is parallel. Further, in addition to the Europarl corpus, we also considered feeding the same RCV1/RCV2 documents (34000 EN and 42,753 DE) to the autoencoders. These non-parallel documents are used only to reinforce the monolingual embeddings (by reconstructing x from x or y from y). So, in effect, we use the same amount of data as that used by Klementiev et al. (2012) but our model/training procedure is completely different.",
      "startOffset" : 10,
      "endOffset" : 1426
    }, {
      "referenceID" : 3,
      "context" : "Next for the cross language classification experiments, we again follow the same setup as used by Klementiev et al. (2012). Specifically, we use 10,000 single-topic documents for training and 5000 single-topic documents for testing in each language.",
      "startOffset" : 98,
      "endOffset" : 123
    }, {
      "referenceID" : 3,
      "context" : "As in Klementiev et al. (2012) we used an averaged perceptron to train a multi-class classifier for 10 epochs, for all the experiments (Klementiev et al.",
      "startOffset" : 6,
      "endOffset" : 31
    }, {
      "referenceID" : 3,
      "context" : "As in Klementiev et al. (2012) we used an averaged perceptron to train a multi-class classifier for 10 epochs, for all the experiments (Klementiev et al. (2012) report that the results were not sensitive to the number of epochs).",
      "startOffset" : 6,
      "endOffset" : 161
    }, {
      "referenceID" : 3,
      "context" : "All results are for word embeddings of size D = 40, as in Klementiev et al. (2012). Further, to speed up the training for BAEcr and BAE-cr/corr we merged mini-batches of 5 adjacent sentence pairs into a single training instance, as described in Section 2.",
      "startOffset" : 58,
      "endOffset" : 83
    }, {
      "referenceID" : 3,
      "context" : "We also compare our models with the following approaches, for which the results are reported in Klementiev et al. (2012):",
      "startOffset" : 96,
      "endOffset" : 121
    }, {
      "referenceID" : 3,
      "context" : "Between BAE-tr and BAEcr, we observe that BAE-tr provides better performance and is comparable to the embeddings learned by the neural network language model of Klementiev et al. (2012) which, unlike BAE-tr, relies on word-level alignments.",
      "startOffset" : 161,
      "endOffset" : 186
    }, {
      "referenceID" : 3,
      "context" : "Next, we evaluate the effect of varying the amount of supervised training data for training the classifier, with either BAE-tr, BAE-cr/corr or Klementiev et al. (2012) embeddigns.",
      "startOffset" : 143,
      "endOffset" : 168
    } ],
    "year" : 2014,
    "abstractText" : "Cross-language learning allows us to use training data from one language to build models for a different language. Many approaches to bilingual learning require that we have word-level alignment of sentences from parallel corpora. In this work we explore the use of autoencoder-based methods for cross-language learning of vectorial word representations that are aligned between two languages, while not relying on word-level alignments. We show that by simply learning to reconstruct the bag-of-words representations of aligned sentences, within and between languages, we can in fact learn high-quality representations and do without word alignments. Since training autoencoders on word observations presents certain computational issues, we propose and compare different variations adapted to this setting. We also propose an explicit correlation maximizing regularizer that leads to significant improvement in the performance. We empirically investigate the success of our approach on the problem of cross-language test classification, where a classifier trained on a given language (e.g., English) must learn to generalize to a different language (e.g., German). These experiments demonstrate that our approaches are competitive with the state-of-the-art, achieving up to 10-14 percentage point improvements over the best reported results on this task.",
    "creator" : "LaTeX with hyperref package"
  }
}