{
  "name" : "1406.5600.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : null,
    "authors" : [ ],
    "emails" : [ "volodya.vovk@gmail.com", "ivan.petej@gmail.com", "alushaf@gmail.com" ],
    "sections" : [ {
      "heading" : null,
      "text" : "ar X\niv :1\n40 6.\n56 00\nv1 [\ncs .L\nG ]\n2 1\nThis paper proposes a new method of probabilistic prediction, which is based on conformal prediction. The method is applied to the standard USPS data set and gives encouraging results."
    }, {
      "heading" : "1 Introduction",
      "text" : "In essence, conformal predictors output systems of p-values: to each potential label of a test object a conformal predictor assigns the corresponding p-value, and a low p-value is interpreted as the label being unlikely. It has been argued, especially by Bayesian statisticians, that p-values are more difficult to interpret than probabilities; besides, in decision problems probabilities can be easily combined with utilities to obtain decisions that are optimal from the point of view of Bayesian decision theory. In this paper we will apply the idea of transforming p-values into probabilities (used in a completely different context in, e.g., [10], Sect. 9, and [7]) to conformal prediction: the p-values produced by conformal predictors will be transformed into probabilities.\nThe approach of this paper is as follows. It was observed in [12] that some criteria of efficiency for conformal prediction (called “probabilistic criteria”) encourage using the conditional probability Q(y | x) as the conformity score for an observation (x, y), Q being the data-generating distribution. In this paper we extend this observation to label-conditional predictors (Sect. 2).\nNext we imagine that we are given a conformal predictor Γ that is nearly optimal with respect to a probabilistic criterion (such a conformal predictor might be an outcome of a thorough empirical study of various conformal predictors using a probabilistic criterion of efficiency). Essentially, this means that in the limit of a very large training set the p-value that Γ outputs for an observation (x, y) is a monotonic transformation of the conditional probability Q(y | x) (Theorem 1 in Sect. 3).\nFinally, we transform the p-values back into conditional probabilities using the distribution of p-values in the test set (Sect. 5). Following [10] and [7], we will say that at this step we calibrate the p-values into probabilities,\nIn Sect. 6 we give an example of a realistic situation where use of the techniques developed in this paper improves on a standard approach. The performance of the probabilistic predictors considered in that section is measured using standard loss functions, logarithmic and Brier (Sect. 4).\nComparisons with related work\nIt should be noted that in the process of transforming p-values into probabilities suggested in this paper we lose a valuable feature of conformal prediction, its automatic validity. Our hope, however, is that the advantages of conformal prediction will translate into accurate probabilistic predictions.\nThere is another method of probabilistic prediction that is related to conformal prediction, Venn prediction (see, e.g., [13], Chap. 6, or [14]). This method does have a guaranteed property of validity (perhaps the simplest being Theorem 1 in [14]); however, the price to pay is that it outputs multiprobabilistic predictions rather than sharp probabilistic predictions. There are natural ways of transforming multiprobabilistic predictions into sharp probabilistic predictions (see, e.g., [14], Sect. 4), but such transformations, again, lead to the loss of the formal property of validity.\nAs preparation, we study label-conditional conformal prediction. For a general discussion of conditionality in conformal prediction, see [11]. Objectconditional conformal prediction has been studied in [5] (in the case of regression)."
    }, {
      "heading" : "2 Criteria of efficiency for label-conditional con-",
      "text" : "formal predictors and transducers\nLet X be a measurable space (the object space) and Y be a finite set equipped with the discrete σ-algebra (the label space); the observation space is defined to be Z := X × Y. A conformity measure is a measurable function A that assigns to every sequence (z1, . . . , zn) ∈ Z\n∗ of observations a same-length sequence (α1, . . . , αn) of real numbers and that is equivariant with respect to permutations: for any n and any permutation π of {1, . . . , n},\n(α1, . . . , αn) = A(z1, . . . , zn) =⇒ ( απ(1), . . . , απ(n) ) = A ( zπ(1), . . . , zπ(n) ) .\nThe label-conditional conformal predictor determined by A is defined by\nΓǫ(z1, . . . , zl, x) := {y | p y > ǫ} , (1)\nwhere (z1, . . . , zl) ∈ Z ∗ is a training sequence, x is a test object, ǫ ∈ (0, 1) is a given significance level, and for each y ∈ Y the corresponding label-conditional p-value py is defined by\npy :=\n∣ ∣ { i = 1, . . . , l+ 1 | yi = y & α y i < α y l+1 }∣ ∣\n|{i = 1, . . . , l + 1 | yi = y}|\n+ τ\n∣ ∣ { i = 1, . . . , l + 1 | yi = y & α y i = α y l+1 }∣ ∣\n|{i = 1, . . . , l + 1 | yi = y}| , (2)\nwhere τ is a random number distributed uniformly on the interval [0, 1] and the corresponding sequence of conformity scores is defined by\n(αy1 , . . . , α y l , α y l+1) := A(z1, . . . , zl, (x, y)).\nIt is clear that the system of prediction sets (1) output by a conformal predictor is nested, namely decreasing in ǫ.\nThe label-conditional conformal transducer determined by A outputs the system of p-values (py | y ∈ Y) defined by (2) for each training sequence (z1, . . . , zl) of observations and each test object x."
    }, {
      "heading" : "Four criteria of efficiency",
      "text" : "Suppose that, besides the training sequence, we are also given a test sequence, and would like to measure on it the performance of a label-conditional conformal predictor or transducer. As usual, let us define the performance on the test set to be the average performance (or, equivalently, the sum of performances) on the individual test observations. Following [12], we will discuss the following four criteria of efficiency for individual test observations; all the criteria will work in the same direction: the smaller the better.\n• The sum ∑ y∈Y p y of the p-values; referred to as the S criterion. This is\napplicable to conformal transducers (i.e., the criterion is ǫ-independent).\n• The size |Γǫ| of the prediction set at a significance level ǫ; this is the N criterion. It is applicable to conformal predictors (ǫ-dependent).\n• The sum of the p-values apart from that for the true label: the OF (“observed fuzziness”) criterion.\n• The number of false labels included in the prediction set Γǫ at a significance level ǫ; this is the OE (“observed excess”) criterion.\nThe last two criteria are simple modifications of the first two (leading to smoother and more expressive pictures).\nRemark 1. Equivalently, the S criterion can be defined as the arithmetic mean 1 |Y| ∑ y∈Y p y of the p-values; the proof of Theorem 1 below will show that, in fact, we can replace arithmetic mean by any mean ([3], Sect. 3.1), including geometric, harmonic, etc."
    }, {
      "heading" : "3 Optimal idealized conformity measures for a",
      "text" : "known probability distribution\nIn this section we consider the idealized case where the probability distribution Q generating independent observations z1, z2, . . . is known (as in [12]). The\nmain result of this section, Theorem 1, is the label-conditional counterpart of Theorem 1 in [12]; the proof of our Theorem 1 is also modelled on the proof of Theorem 1 in [12]. In this section we assume, for simplicity, that the set Z is finite and that Q({z}) > 0 for all z ∈ Z.\nAn idealized conformity measure is a function A(z,Q) of z ∈ Z andQ ∈ P(Z) (where P(Z) is the set of all probability measures on Z). We will sometimes write the corresponding conformity scores as A(z), as Q will be clear from the context. The idealized smoothed label-conditional conformal predictor corresponding to A outputs the following prediction set Γǫ(x) for each object x ∈ X and each significance level ǫ ∈ (0, 1). For each potential label y ∈ Y for x define the corresponding label-conditional p-value as\npy = p(x, y) := Q({(x′, y) | x′ ∈ X & A((x′, y), Q) < A((x, y), Q)})\nQY({y})\n+ τ Q({(x′, y) | x′ ∈ X & A((x′, y), Q) = A((x, y), Q)})\nQY({y}) (3)\n(this is the idealized analogue of (2)), where QY is the marginal distribution of Q on Y and τ is a random number distributed uniformly on [0, 1]. The prediction set is\nΓǫ(x) := {y ∈ Y | p(x, y) > ǫ} . (4)\nThe idealized smoothed label-conditional conformal transducer corresponding to A outputs for each object x ∈ X the system of p-values (py | y ∈ Y) defined by (3); in the idealized case we will usually use the alternative notation p(x, y) for py."
    }, {
      "heading" : "Four idealized criteria of efficiency",
      "text" : "In this subsection we will apply the four criteria of efficiency that we discussed in the previous section to the idealized case of infinite training and test sequences; since the sequences are infinite, they carry all information about the data-generating distribution Q. We will write ΓǫA(x) for the Γ\nǫ(x) in (4) and pA(x, y) for the p(x, y) in (3) to indicate the dependence on the choice of the conformity measure A. Let U be the uniform probability measure on the interval [0, 1].\nAn idealized conformity measure A is:\n• S-optimal if E(x,τ)∼QX×U ∑ y pA(x, y) ≤ E(x,τ)∼QX×U ∑\ny pB(x, y) for any idealized conformity measure B, where QX is the marginal distribution of Q on X;\n• N-optimal if E(x,τ)∼QX×U |Γ ǫ A(x)| ≤ E(x,τ)∼QX×U |Γ ǫ B(x)| for any idealized\nconformity measure B and any significance level ǫ;\n• OF-optimal if\nE((x,y),τ)∼Q×U\n∑\ny′ 6=y\npA(x, y ′) ≤ E((x,y),τ)∼Q×U\n∑\ny′ 6=y\npA(x, y ′)\nfor any idealized conformity measure B;\n• OE-optimal if\nE((x,y),τ)∼Q×U |Γ ǫ A(x) \\ {y}| ≤ E((x,y),τ)∼Q×U |Γ ǫ B(x) \\ {y}|\nfor any idealized conformity measure B and any significance level ǫ.\nThe conditional probability (CP) idealized conformity measure is\nA((x, y), Q) := Q(y | x).\nAn idealized conformity measure A is a (label-conditional) refinement of an idealized conformity measure B if\nB((x1, y)) < B((x2, y)) =⇒ A((x1, y)) < A((x2, y)) (5)\nfor all x1, x2 ∈ Z and all y ∈ Y. (Notice that this definition, being labelconditional, is different from the one given in [12].) Let R(CP) be the set of all refinements of the CP idealized conformity measure. If C is a criterion of efficiency (one of the four discussed above), we let O(C) stand for the set of all C-optimal idealized conformity measures.\nTheorem 1. O(S) = O(OF) = O(N) = O(OE) = R(CP).\nProof. We start from proving R(CP) = O(N). Fix a significance level ǫ. A smoothed confidence predictor at level ǫ is defined as a random set of observations (x, y) ∈ Z; in other words, to each observation (x, y) is assigned the probability P (x, y) that the observation will be outside the prediction set. Under the restriction that the sum of the probabilities Q(x, y) of observations (x, y) outside the prediction set (defined as ∑\nxQ(x, y)P (x, y) in the smoothed case) is bounded by ǫQY(y) for a fixed y, the N criterion requires us to make the sum of QX(x) for (x, y) outside the prediction set (defined as ∑\nx QXP (x, y) in the smoothed case) as large as possible. It is clear that the set should consist of the observations with the smallest Q(y | x) (by the usual Neyman–Pearson argument: cf. [4], Sect. 3.2).\nNext we show that O(N) ⊆ O(S). Let an idealized conformity measure A be N-optimal. By definition,\nEx,τ |Γ ǫ A(x)| ≤ Ex,τ |Γ ǫ B(x)|\nfor any idealized conformity measure B and any significance level ǫ. Integrating over ǫ ∈ (0, 1) and swapping the order of integrals and expectations,\nEx,τ\n∫ 1\n0\n|ΓǫA(x)| dǫ ≤ Ex,τ\n∫ 1\n0\n|ΓǫB(x)| dǫ. (6)\nSince |Γǫ(x)| = ∑\ny∈Y\n1{p(x,y)>ǫ},\nwe can rewrite (6), after swapping the order of summation and integration, as\nEx,τ\n∑\ny∈Y\n( ∫ 1\n0\n1{pA(x,y)>ǫ} dǫ\n)\n≤ Ex,τ ∑\ny∈Y\n( ∫ 1\n0\n1{pB(x,y)>ǫ} dǫ\n)\n.\nSince ∫ 1\n0\n1{p(x,y)>ǫ} dǫ = p(x, y),\nwe finally obtain\nEx,τ\n∑\ny∈Y\npA(x, y) ≤ Ex,τ ∑\ny∈Y\npB(x, y).\nSince this holds for any idealized conformity measure B, A is S-optimal. The argument in the previous paragraph in fact shows that O(S) = O(N) = R(CP). Indeed, that argument shows that\n∑\ny∈Y\np(x, y) =\n∫ 1\n0\n|Γǫ(x)| dǫ,\nand so to optimize a conformity measure in the sense of the S criterion it suffices to optimize it in the sense of the N criterion for all ǫ simultaneously (which can, and therefore should, be done). More generally, for any continuous increasing function φ we have\n∑\ny∈Y\nφ(p(x, y)) = ∑\ny∈Y\n∫ 1\n0\n1{φ(p(x,y))>ǫ} dǫ =\n∫ 1\n0\n∑\ny∈Y\n1{p(x,y)>φ−1(ǫ)} dǫ\n=\n∫ 1\n0\n∣ ∣ ∣ Γφ −1(ǫ)(x) ∣ ∣ ∣ dǫ =\n∫\n∣ ∣ ∣ Γǫ ′ (x) ∣ ∣ ∣ φ′(ǫ′) dǫ′,\nwhich proves Remark 1. The equality O(S) = O(OF) follows from\nEx,τ\n∑\ny\np(x, y) = E(x,y),τ ∑\ny′ 6=y\np(x, y′) + 1\n2 ,\nwhere we have used the fact that p(x, y) is distributed uniformly on [0, 1] when ((x, y), τ) ∼ Q× U (see [13] and [12]).\nFinally, we notice that O(N) = O(OE). Indeed, for any significance level ǫ,\nEx,τ |Γ ǫ(x)| = E(x,y),τ |Γ ǫ(x) \\ {y}|+ (1− ǫ),\nagain using the fact that p(x, y) is distributed uniformly on [0, 1] and so P(x,y),τ (y ∈ Γ ǫ(x)) = 1− ǫ."
    }, {
      "heading" : "4 Criteria of efficiency for probabilistic predic-",
      "text" : "tors\nGiven a training set (z1, . . . , zl) and a test object x, a probabilistic predictor outputs a probability measure P ∈ P(Y), which is interpreted as its probabilistic prediction for the label y of x; we let P(Y) stand for the set of all probability measures on Y. The two standard way of measuring the performance of P on the actual label y are the logarithmic (or log) loss − lnP ({y}) and the Brier loss\n∑\ny′∈Y\n(\n1{y′=y} − P ({y ′})\n)2\n,\nwhere 1E stands for the indicator of an event E: 1E = 0 if E happens and 1E = 0 otherwise. The efficiency of probabilistic predictors will be measured by these two loss functions.\nSuppose we have a test sequence (zl+1, . . . , zl+k), where zi = (xi, yi) for i = l + 1, . . . , l + k, and we want to evaluate the performance of a probabilistic predictor (trained on a training sequence z1, . . . , zl) on it. In the next section we will use the average log loss\n− 1\nk\nl+k ∑\ni=l+1\nlnPi({yi})\nand the standardized Brier loss √\n√ √ √ 1\nk |Y|\nl+k ∑\ni=l+1\n∑\ny′∈Y\n(\n1{y′=yi} − Pi({y ′})\n)2\n,\nwhere Pi ∈ P(Y) is the probabilistic prediction for xi. Notice that in the binary case, |Y| = 2, the average log loss coincides with the mean log error (used in, e.g., [14], (12)) and the standardized Brier loss coincides with the root mean square error (used in, e.g., [14], (13))."
    }, {
      "heading" : "5 Calibration of p-values into conditional prob-",
      "text" : "abilities\nThe argument of this section will be somewhat heuristic, and we will not try to formalize it in this paper. Fix y ∈ Y. Suppose that q := P (y | x) has an absolutely continuous distribution with density f when x ∼ QX. (In other words, f is the density of the image of QX under the mapping x 7→ P (y | x).) For the CP idealized conformity measure, we can rewrite (3) as\np(q) :=\n∫ q\n0\nq′f(q′)dq′ / D , (7)\nAlgorithm 1 Conformal-type probabilistic predictor\nInput: training sequence (z1, . . . , zl) ∈ Z l Input: calibration sequence (xl+1, . . . , xl+k) ∈ X k Input: test object x0 Output: probabilistic prediction P ∈ P(Y) for the label of x0 for y ∈ Y do for each xi in the calibration sequence find the p-value p y i by (2)\n(with l + i in place of l + 1) let gy be the antitonic density on [0, 1] fitted to p y l+1, . . . , p y l+k find the p-value py0 by (2) (with 0 in place of l + 1) for each y ∈ Y, set P ′({y}) := gy(1)/gy(p y 0)\nend for set P ({y}) := P ′({y})/ ∑\ny′ P ′({y′}) for each y ∈ Y\nwhere D := QY({y}); alternatively, we can set D := ∫ 1 0 q ′f(q′)dq′ to the normalizing constant ensuring that p(1) = 1. To see how (7) is a special case of (3) for the CP idealized conformity measure, notice that the probability that Y = y and P (Y | X) ∈ (q′, q′ + dq′), where (X,Y ) ∼ f , is q′f(q′)dq′. In (7) we write p(q) rather than py since py depends on y only via q.\nWe are more interested in the inverse function q(p), which is defined by the condition\np =\n∫ q(p)\n0\nq′f(q′)dq′\n/\nD .\nWhen q ∼ f , we have\nP(p(q) ≤ a) = P(q ≤ q(a)) =\n∫ q(a)\n0\nf(q′)dq′.\nTherefore, when q ∼ f , we have\nP(a ≤ p(q) ≤ a+ da) =\n∫ q(a+da)\nq(a)\nf(q′)dq′ ≈ 1\nq(a)\n∫ q(a+da)\nq(a)\nq′f(q′)dq′ = Dda\nq(a) ,\nand so\nq(c) ≈ D\n/\nP(c ≤ p(q) ≤ c+ dc)\ndc .\nThis gives rise to the algorithm given as Algorithm 1, which uses real pvalues (2) instead of the ideal p-values (3). The algorithm is transductive in that it uses a training sequence of labelled observations and a calibration sequence of unlabelled objects (in the next section we use the test sequence as the calibration sequence); the latter is used for calibrating p-values into conditional probabilities. Given all the p-values for the calibration sequence with postulated label y, find the corresponding antitonic density g(p) (remember that the function q(p) is known to be monotonic, namely isotonic) using Grenander’s\nestimator (see [2] or, e.g., [1], Chap. 8). Use D/g(p) as the calibration function, where D := g(1) is chosen in such a way that a p-value of 1 is calibrated into a conditional probability of 1. (Alternatively, we could set D to the fraction of observations labelled as y in the training sequence; this approximates setting D := QY({y}).) The probabilities produced by this procedure are not guaranteed to lead to a probability measure: the sum over y can be different from 1 (and this phenomenon has been observed in our experiments). Therefore, in the last line of Algorithm 1 we normalize the calibrated p-values to obtain genuine probabilities."
    }, {
      "heading" : "6 Experiments",
      "text" : "In our experiments we use the standard USPS data set of hand-written digits. The size of the training set is 7291, and the size of the test set is 2007; however, instead of using the original split of the data into the two parts, we randomly split all available data (the union of the original training and test sets) into a training set of size 7291 and test set of size 2007. (Therefore, our results somewhat depend on the seed used by the random number generator, but the dependence is minor and does not affect our conclusions at all; we always report results for seed 0.)\nA powerful algorithm for the USPS data set is the 1-Nearest Neighbour (1- NN) algorithm using tangent distance [8]. However, it is not obvious how this algorithm could be transformed into a probabilistic predictor. On the other hand, there is a very natural and standard way of extracting probabilities from support vector machines, which we will refer to it as Platt’s algorithm in this paper: it is the combination of the method proposed by Platt [6] with pairwise coupling [15] (unlike our algorithm, which is applicable to multi-class problems directly, Platt’s method is directly applicable only to binary problems). In this section we will apply our method to the 1-NN algorithm with tangent distance and compare the results to Platt’s algorithm as implemented in the function svm from the e1071R package (for our multi-class problem this function calculates probabilities using the combination of Platt’s binary method and pairwise coupling).\nThere is a standard way of turning a distance into a conformal predictor ([13], Sect. 3.1): namely, the conformity score αi of the ith observation in a sequence of observations can be defined as\nminj:yj 6=yi d(xi, xj)\nminj 6=i:yj=yi d(xi, xj) , (8)\nwhere d is the distance; the intuition is that an object is considered conforming if it is close to an object labelled in the same way and far from any object labelled in a different way.\nTable 1 compares the performance of the conformal-type probabilistic predictor based on the 1-NN conformity measure (8), where d is tangent distance,\nwith the performance of Platt’s algorithm with the optimal values of its parameters. The conformal predictor is parameter-free but Platt’s algorithm depends on the choice of the kernel. We chose the polynomial kernel of degree 3 (since it is known to produce the best results: see [9], Sect. 12.2) and the cost parameter C := 2.9 in the case of the average log loss and C := 3.4 in the case of the standardized Brier loss (the optimal values in our experiments). (Reporting the performance of Platt’s algorithm with optimal parameter values may look like data snooping, but it is fine in this context since we are helping our competitor.) Table 2 reports the performance of Platt’s algorithm as function of the degree of the polynomial kernel with the cost parameter set at C := 10 (the dependence on C is relatively mild, and C = 10 gives good performance for all degrees that we consider)."
    }, {
      "heading" : "Acknowledgments.",
      "text" : "In our experiments we used the R package e1071 (by David Meyer, Evgenia Dimitriadou, Kurt Hornik, Andreas Weingessel, Friedrich Leisch, ChihChung Chang, and Chih-Chen Lin) and the implementation of tangent distance by Daniel Keysers. This work was partially supported by EPSRC (grant EP/K033344/1, first author) and Royal Holloway, University of London (third author)."
    } ],
    "references" : [ {
      "title" : "A Course in Density Estimation",
      "author" : [ "Luc Devroye" ],
      "venue" : null,
      "citeRegEx" : "1",
      "shortCiteRegEx" : "1",
      "year" : 1987
    }, {
      "title" : "On the theory of mortality",
      "author" : [ "Ulf Grenander" ],
      "venue" : "measurement. Part II. Skandinavisk Aktuarietidskrift,",
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 1956
    }, {
      "title" : "John E",
      "author" : [ "G.H. Hardy" ],
      "venue" : "Littlewood, and George Pólya. Inequalities. Cambridge University Press, Cambridge, England, second edition",
      "citeRegEx" : "3",
      "shortCiteRegEx" : null,
      "year" : 1952
    }, {
      "title" : "Testing Statistical Hypotheses",
      "author" : [ "Erich L. Lehmann" ],
      "venue" : null,
      "citeRegEx" : "4",
      "shortCiteRegEx" : "4",
      "year" : 1986
    }, {
      "title" : "Distribution free prediction bands for nonparametric regression",
      "author" : [ "Jing Lei", "Larry Wasserman" ],
      "venue" : "Journal of the Royal Statistical Society B,",
      "citeRegEx" : "5",
      "shortCiteRegEx" : "5",
      "year" : 2014
    }, {
      "title" : "Probabilities for SV machines",
      "author" : [ "John C. Platt" ],
      "venue" : "Advances in Large Margin Classifiers,",
      "citeRegEx" : "6",
      "shortCiteRegEx" : "6",
      "year" : 2000
    }, {
      "title" : "Calibration of p-values for testing precise null hypotheses",
      "author" : [ "Thomas Sellke", "M.J. Bayarri", "James Berger" ],
      "venue" : "American Statistician,",
      "citeRegEx" : "7",
      "shortCiteRegEx" : "7",
      "year" : 2001
    }, {
      "title" : "Efficient pattern recognition using a new transformation distance",
      "author" : [ "Patrice Simard", "Yann LeCun", "John Denker" ],
      "venue" : "Advances in Neural Information Processing Systems,",
      "citeRegEx" : "8",
      "shortCiteRegEx" : "8",
      "year" : 1993
    }, {
      "title" : "Statistical Learning Theory",
      "author" : [ "Vladimir N. Vapnik" ],
      "venue" : null,
      "citeRegEx" : "9",
      "shortCiteRegEx" : "9",
      "year" : 1998
    }, {
      "title" : "A logic of probability, with application to the foundations of statistics (with discussion)",
      "author" : [ "Vladimir Vovk" ],
      "venue" : "Journal of the Royal Statistical Society B,",
      "citeRegEx" : "10",
      "shortCiteRegEx" : "10",
      "year" : 1993
    }, {
      "title" : "Conditional validity of inductive conformal predictors",
      "author" : [ "Vladimir Vovk" ],
      "venue" : "Technical Report arXiv:1209.2673 [cs.LG], arXiv.org e-Print archive,",
      "citeRegEx" : "11",
      "shortCiteRegEx" : "11",
      "year" : 2012
    }, {
      "title" : "Criteria of efficiency for conformal prediction, On-line Compression Modelling project (New Series), http://alrw.net",
      "author" : [ "Vladimir Vovk", "Valentina Fedorova", "Alex Gammerman", "Ilia Nouretdinov" ],
      "venue" : "Working Paper",
      "citeRegEx" : "12",
      "shortCiteRegEx" : "12",
      "year" : 2014
    }, {
      "title" : "Algorithmic Learning in a Random World",
      "author" : [ "Vladimir Vovk", "Alex Gammerman", "Glenn Shafer" ],
      "venue" : null,
      "citeRegEx" : "13",
      "shortCiteRegEx" : "13",
      "year" : 2005
    }, {
      "title" : "Venn–Abers predictors. Technical Report arXiv:1211.0025v2 [cs.LG], arXiv.org e-Print archive",
      "author" : [ "Vladimir Vovk", "Ivan Petej" ],
      "venue" : "To appear in the UAI 2014 Proceedings",
      "citeRegEx" : "14",
      "shortCiteRegEx" : "14",
      "year" : 2014
    }, {
      "title" : "Probability estimates for multi-class classification by pairwise coupling",
      "author" : [ "Ting-Fan Wu", "Chih-Jen Lin", "Ruby C. Weng" ],
      "venue" : "Journal of Machine Learning Research,",
      "citeRegEx" : "15",
      "shortCiteRegEx" : "15",
      "year" : 2004
    } ],
    "referenceMentions" : [ {
      "referenceID" : 9,
      "context" : ", [10], Sect.",
      "startOffset" : 2,
      "endOffset" : 6
    }, {
      "referenceID" : 6,
      "context" : "9, and [7]) to conformal prediction: the p-values produced by conformal predictors will be transformed into probabilities.",
      "startOffset" : 7,
      "endOffset" : 10
    }, {
      "referenceID" : 11,
      "context" : "It was observed in [12] that some criteria of efficiency for conformal prediction (called “probabilistic criteria”) encourage using the conditional probability Q(y | x) as the conformity score for an observation (x, y), Q being the data-generating distribution.",
      "startOffset" : 19,
      "endOffset" : 23
    }, {
      "referenceID" : 9,
      "context" : "Following [10] and [7], we will say that at this step we calibrate the p-values into probabilities,",
      "startOffset" : 10,
      "endOffset" : 14
    }, {
      "referenceID" : 6,
      "context" : "Following [10] and [7], we will say that at this step we calibrate the p-values into probabilities,",
      "startOffset" : 19,
      "endOffset" : 22
    }, {
      "referenceID" : 12,
      "context" : ", [13], Chap.",
      "startOffset" : 2,
      "endOffset" : 6
    }, {
      "referenceID" : 13,
      "context" : "6, or [14]).",
      "startOffset" : 6,
      "endOffset" : 10
    }, {
      "referenceID" : 13,
      "context" : "This method does have a guaranteed property of validity (perhaps the simplest being Theorem 1 in [14]); however, the price to pay is that it outputs multiprobabilistic predictions rather than sharp probabilistic predictions.",
      "startOffset" : 97,
      "endOffset" : 101
    }, {
      "referenceID" : 13,
      "context" : ", [14], Sect.",
      "startOffset" : 2,
      "endOffset" : 6
    }, {
      "referenceID" : 10,
      "context" : "For a general discussion of conditionality in conformal prediction, see [11].",
      "startOffset" : 72,
      "endOffset" : 76
    }, {
      "referenceID" : 4,
      "context" : "Objectconditional conformal prediction has been studied in [5] (in the case of regression).",
      "startOffset" : 59,
      "endOffset" : 62
    }, {
      "referenceID" : 0,
      "context" : ", l + 1 | yi = y}| , (2) where τ is a random number distributed uniformly on the interval [0, 1] and the corresponding sequence of conformity scores is defined by (αy1 , .",
      "startOffset" : 90,
      "endOffset" : 96
    }, {
      "referenceID" : 11,
      "context" : "Following [12], we will discuss the following four criteria of efficiency for individual test observations; all the criteria will work in the same direction: the smaller the better.",
      "startOffset" : 10,
      "endOffset" : 14
    }, {
      "referenceID" : 2,
      "context" : "Equivalently, the S criterion can be defined as the arithmetic mean 1 |Y| ∑ y∈Y p y of the p-values; the proof of Theorem 1 below will show that, in fact, we can replace arithmetic mean by any mean ([3], Sect.",
      "startOffset" : 199,
      "endOffset" : 202
    }, {
      "referenceID" : 11,
      "context" : "is known (as in [12]).",
      "startOffset" : 16,
      "endOffset" : 20
    }, {
      "referenceID" : 11,
      "context" : "main result of this section, Theorem 1, is the label-conditional counterpart of Theorem 1 in [12]; the proof of our Theorem 1 is also modelled on the proof of Theorem 1 in [12].",
      "startOffset" : 93,
      "endOffset" : 97
    }, {
      "referenceID" : 11,
      "context" : "main result of this section, Theorem 1, is the label-conditional counterpart of Theorem 1 in [12]; the proof of our Theorem 1 is also modelled on the proof of Theorem 1 in [12].",
      "startOffset" : 172,
      "endOffset" : 176
    }, {
      "referenceID" : 0,
      "context" : "For each potential label y ∈ Y for x define the corresponding label-conditional p-value as p = p(x, y) := Q({(x, y) | x ∈ X & A((x, y), Q) < A((x, y), Q)}) QY({y}) + τ Q({(x, y) | x ∈ X & A((x, y), Q) = A((x, y), Q)}) QY({y}) (3) (this is the idealized analogue of (2)), where QY is the marginal distribution of Q on Y and τ is a random number distributed uniformly on [0, 1].",
      "startOffset" : 369,
      "endOffset" : 375
    }, {
      "referenceID" : 0,
      "context" : "Let U be the uniform probability measure on the interval [0, 1].",
      "startOffset" : 57,
      "endOffset" : 63
    }, {
      "referenceID" : 11,
      "context" : "(Notice that this definition, being labelconditional, is different from the one given in [12].",
      "startOffset" : 89,
      "endOffset" : 93
    }, {
      "referenceID" : 3,
      "context" : "[4], Sect.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 0,
      "context" : "where we have used the fact that p(x, y) is distributed uniformly on [0, 1] when ((x, y), τ) ∼ Q× U (see [13] and [12]).",
      "startOffset" : 69,
      "endOffset" : 75
    }, {
      "referenceID" : 12,
      "context" : "where we have used the fact that p(x, y) is distributed uniformly on [0, 1] when ((x, y), τ) ∼ Q× U (see [13] and [12]).",
      "startOffset" : 105,
      "endOffset" : 109
    }, {
      "referenceID" : 11,
      "context" : "where we have used the fact that p(x, y) is distributed uniformly on [0, 1] when ((x, y), τ) ∼ Q× U (see [13] and [12]).",
      "startOffset" : 114,
      "endOffset" : 118
    }, {
      "referenceID" : 0,
      "context" : "Indeed, for any significance level ǫ, Ex,τ |Γ (x)| = E(x,y),τ |Γ (x) \\ {y}|+ (1− ǫ), again using the fact that p(x, y) is distributed uniformly on [0, 1] and so P(x,y),τ (y ∈ Γ (x)) = 1− ǫ.",
      "startOffset" : 147,
      "endOffset" : 153
    }, {
      "referenceID" : 13,
      "context" : ", [14], (12)) and the standardized Brier loss coincides with the root mean square error (used in, e.",
      "startOffset" : 2,
      "endOffset" : 6
    }, {
      "referenceID" : 13,
      "context" : ", [14], (13)).",
      "startOffset" : 2,
      "endOffset" : 6
    }, {
      "referenceID" : 0,
      "context" : ", xl+k) ∈ X k Input: test object x0 Output: probabilistic prediction P ∈ P(Y) for the label of x0 for y ∈ Y do for each xi in the calibration sequence find the p-value p y i by (2) (with l + i in place of l + 1) let gy be the antitonic density on [0, 1] fitted to p y l+1, .",
      "startOffset" : 247,
      "endOffset" : 253
    }, {
      "referenceID" : 1,
      "context" : "estimator (see [2] or, e.",
      "startOffset" : 15,
      "endOffset" : 18
    }, {
      "referenceID" : 0,
      "context" : ", [1], Chap.",
      "startOffset" : 2,
      "endOffset" : 5
    }, {
      "referenceID" : 7,
      "context" : ") A powerful algorithm for the USPS data set is the 1-Nearest Neighbour (1NN) algorithm using tangent distance [8].",
      "startOffset" : 111,
      "endOffset" : 114
    }, {
      "referenceID" : 5,
      "context" : "On the other hand, there is a very natural and standard way of extracting probabilities from support vector machines, which we will refer to it as Platt’s algorithm in this paper: it is the combination of the method proposed by Platt [6] with pairwise coupling [15] (unlike our algorithm, which is applicable to multi-class problems directly, Platt’s method is directly applicable only to binary problems).",
      "startOffset" : 234,
      "endOffset" : 237
    }, {
      "referenceID" : 14,
      "context" : "On the other hand, there is a very natural and standard way of extracting probabilities from support vector machines, which we will refer to it as Platt’s algorithm in this paper: it is the combination of the method proposed by Platt [6] with pairwise coupling [15] (unlike our algorithm, which is applicable to multi-class problems directly, Platt’s method is directly applicable only to binary problems).",
      "startOffset" : 261,
      "endOffset" : 265
    }, {
      "referenceID" : 12,
      "context" : "There is a standard way of turning a distance into a conformal predictor ([13], Sect.",
      "startOffset" : 74,
      "endOffset" : 78
    }, {
      "referenceID" : 8,
      "context" : "We chose the polynomial kernel of degree 3 (since it is known to produce the best results: see [9], Sect.",
      "startOffset" : 95,
      "endOffset" : 98
    } ],
    "year" : 2014,
    "abstractText" : "This paper proposes a new method of probabilistic prediction, which is based on conformal prediction. The method is applied to the standard USPS data set and gives encouraging results.",
    "creator" : "dvips(k) 5.991 Copyright 2011 Radical Eye Software"
  }
}