{
  "name" : "1410.1940.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : null,
    "authors" : [ "Xinran He" ],
    "emails" : [ "qiyu@usc.edu", "xinranhe@usc.edu", "yanliu.cs@usc.edu" ],
    "sections" : [ {
      "heading" : null,
      "text" : "Keywords: anomaly detection; social media analysis; hierarchical Bayes modeling"
    }, {
      "heading" : "1 Introduction",
      "text" : "Social media provide convenient platforms for people to share, communicate, and collaborate. While people enjoy the openness and convenience of social media, many malicious behaviors, such as bullying, terrorist attack planning, and fraud information dissemination, can happen. Therefore, it is extremely important that we can detect these abnormal activities as accurately and early as possible to prevent disasters and attacks.\nBy definition, anomaly detection aims to find “an observation that deviates so much from other observations as to arouse suspicion that it was generated by a different mechanism” [10]. Several algorithms have been developed specifically for social media anomaly detection such as power-law models [2], spectral decomposition [21], scan statistics [18], and random walk [17, 20]. However, these algorithms only detect the individual point anomaly. For example, [2] proposes an “OddBall” algorithm to spot anomalous nodes in a graph. The algorithm extracts features from the egonet of the node and declares anomaly node whose features deviate from the power-law pattern.\nIn reality, anomaly may not only appear as an individual point, but also as a group. For instance, a group of people collude to create false product reviews or threat campaign in social media platforms; in large organizations, malfunctioning teams or insider groups closely coordinate with each other to achieve a malicious goal. Those appear as examples for another type of anomaly: group anomaly, which has not been thoroughly examined in social media analysis. In this work, we focus on group anomaly detection. We\nar X\niv :1\n41 0.\n19 40\nv1 [\ncs .L\nG ]\n7 O\nare interested in finding the groups which exhibit a pattern that does not conform to the majority of other groups. This problem has found its applications in galaxy identification [22], high energy particle physics [16], anomalous image detection and turbulence vorticity modeling [23].\nWe identify three major challenges in group anomaly detection: (i) Two forms of data coexist in social media: one is the point-wise data, which characterize the features of an individual person. The other is pair-wise relational data, which describe the properties of social ties. In social science, a fundamental axiom of social media analysis is the concept that structure matters. For example, teams with the same composition of member skills can perform very differently depending on the patterns of relationships among the members [5]. Therefore, it is important to take into account both point-wise and pair-wise data during anomaly detection. (ii) Group anomaly is usually more subtle than individual anomaly. At the individual level, the activities might appear to be normal [6]. Therefore, existing anomaly detection algorithms usually fail when the anomaly is related to a group rather than individuals. (iii) Empirical studies in social media analysis suggest the dynamic nature of individual network positions [15]. People’s activities and communications change constantly over time and we can hardly know the groups beforehand. Thus developing a method that can be easily generalized to dynamic setting is critical to anomaly detection in evolving social media data.\nIn this paper, we take a graphical model approach to address those challenges. We propose a hierarchical model, i.e, Group Latent Anomaly Detection (GLAD) model, to connect two forms of data. To handle the dynamic characteristics of the social media data, we further develop a dynamic extension of GLAD: the d-GLAD model. We show that GLAD outperforms existing approaches in terms of group anomaly detection accuracy and robustness. When dealing with dynamic social networks, the dynamic extension of GLAD achieves lower false positive rate and better data fitting. The major contributions of this paper can be summarized as follows:\n1. We formulate the problem of group anomaly detection in the context of social media analysis for both static and dynamic settings and articulate the three major challenges associated with the task.\n2. We develop a graphical model called GLAD. GLAD can successfully discover the group structure of social media and detect group anomalies. We also generalize GLAD to its dynamic extension and provide tractable model inference algorithms.\n3. We conduct thorough experiments on both synthetic and real world datasets using anomaly injections. We also construct a meaningful dataset from ACM publication dataset for rigorous evaluation. The dataset is accessible at http://www-bcf.usc.edu/~liu32/data.html."
    }, {
      "heading" : "2 Related Work",
      "text" : "We review the related models on group anomaly detection and illustrate the motivation behind our approach. The Multinomial Genre Model (MGM) proposed in [22] first investigates the problem following the paradigm of Latent Dirichlet Allocation (LDA) [4]. As a text processing tool, LDA assumes that each word is associated with a topic and a document is a mixture of topics. Similarly, MGM models a group as a mixture of Gaussian distributed topics with certain mixture rate and assumes there exists “best” mixture rates, corresponding to the mixture rates of normal groups. Then it conducts group anomaly detection by scoring the mixture rate likelihood of each group. One drawback of MGM is that the set of candidate mixture rates is shared globally by groups. It might leads to poor performance when groups have different sets of mixture rates. [23] further extends MGM to Flexible Genre Model (FGM) with more flexibility in the generation of topics. Specifically, the model considers the set of topic mixture rates as random variables rather than model hyper-parameters, which would adapt to diverse “genres” in groups, each of which is a typical distribution of topic mixture rates.\nAnother line of work takes a discriminative approach. [16] uses the same definition of group anomaly from [22]. It considers kernel embedding of the probabilistic distributions and generalizes one-class support vector machine from point anomaly detection to group anomaly detection. The proposed support measure\nmachine (SMM) algorithm maps the distributions to a probability measure space with kernel methods, which can handle the aggregate behavior of data points.\nHowever, existing approaches separate the group anomaly detection task into two stages: group discovery and anomaly detection. They require the group information to be given before applying the anomaly detection algorithms. For example, in [22], the Sloan Digital Sky Survey (SDSS) dataset needs to be preprocessed before feeding into MGM. The authors first construct a neighborhood graph and then treat the connected components in the graph as groups. For the application on turbulence data, the FGM model [23] considers the vertices in a local cubic region as a group. In SMM [16], the authors treat the high energy particles generated from the same collision event as a group.\nThe two-stage approaches identify the groups from the pair-wise data and infer the anomalies based on the point-wise data. This strategy assumes that the point-wise and pair-wise data are marginally independent. However, such independence assumption might underestimate the mutual influence between the group structure and the feature attributes. The detected group anomalies can hardly reveal the joint effect of these two forms of data. These motivate us to build an alla prima that can account for both forms of data and accomplish the tasks of group discovery and anomaly detection all at once.\nAdditionally, existing work can only deal with static network and fixed size groups. This is not feasible for the time-evolving nature of social media data. For example, in corporate networks, employees may switch teams from one to the other. The organization structure of a team may also change. As the dynamic setting needs to take into account the flexible group size and the changing mixture rates, we further adapt our model to the dynamic setting and formulate the problem as a change point detection task.\nGroup anomaly detection in social media analysis may shed light on a wide range of real world problems such as corporate restructuring, team job-hopping and political inclination shift to which our approach can apply. In section 3, we provide a formal definition of group anomaly in social media analysis. We first develop GLAD0 as well as its learning and inference algorithm in section 4. Then we present a computationally more efficient model design: GLAD in section 5. In section 6, we describe the dynamic GLAD model: d-GLAD, which can handle the dynamic social networks. Section 7 shows the empirical evaluation results of GLAD and d-GLAD on synthetic and real world datasets compared with existing baseline models."
    }, {
      "heading" : "3 Definition of Group Anomaly",
      "text" : "The core of our group anomaly definition lies in the collective behavior of individuals. For example, a document is a mixture of various topics and a team is a mixture of different roles. Therefore, we model the node features of each group as a mixture of components. Each component could be an article topic, a social role or a job title. Specifically, we can describe a component as either a discrete variable such as multinomial distribution or a continues variable like Gaussian distribution, depending on the data type of features. Here we use the term role as a general notion for the component. We assume that there are a fixed number of roles and each of which denotes a particular distribution of node features. All groups share the same set of roles but possibly with different role mixture rates. Normal groups follow the same pattern with respect to their role mixture rates, but the anomalous group has a role mixture rate that deviates from the normal pattern.\nFor the static GLAD model, we are interested in the distribution of the role mixture rates across the groups. According to our assumption, the mixture rates of normal groups are more likely to appear. For groups with very rare role mixture rates, we treat them as group anomalies. One example of this type of group anomaly comes from particle physics. It is widely accepted that the dynamics of known particles are governed by the Standard Model, which corresponds to the normal pattern. Unknown particles would contaminate the distribution of the Standard Model. Detecting those anomalies could potentially lead to the discovery of new physical phenomenon. In practice, we first identify the normal mixture rates. Then for each learned group, we evaluate the likelihood of its observations being generated with the normal mixture rates. The lower the likelihood value is, the more anomalous the group would be.\nFor the dynamic d-GLAD model, we emphasize on the temporal aspect of the data and detect the change of the role mixture rate within the groups. For instance, in scientific area, it is valuable to study the\nevolution of research topics and detect the bursty time periods. In the dynamic setting, since the structure of groups change as well as their role mixture rates, detecting groups with rare mixture rate no long applies. Therefore, we think of the task as a change point detection problem and aim to detect the groups whose mixture rates change drastically from the previous time stamps. Compared with GLAD, we not only need to decide whether a group is anomaly or not, but also need to specify when the group appears anomalous.\nEven though we use slightly different definitions of group anomaly for the GLAD model and the d-GLAD model, the key ideas behind our definitions are the same. Both definitions build upon the notion of role mixture rate, which essentially requires a precise inference of both the group membership and role identity for each individual in the group.\n4 GLAD0\nSuppose that we are given a social network with N people. Each person p has total of Ap activities. The point-wise activities data is X = {X1,X2,. . . ,XN}. The pair-wise communication data is Y = {Y1,1,Y1,2, . . . , YN,N}. Xp ∈ RV×Ap . For a particular activity a, Xpa consists of V entries, denoting a feature vector of V dimensions. Yp,q ∈ {0, 1} is a binary valued variable, indicating the pair-wise relationship of nodes. These two forms of data are our inputs. Our goal is to analyze these data jointly and declare the group that has irregular role mixture rate as anomaly. In the following sections, we first describe the motivation for our hierarchical Bayes model and provide its generative process and the plate notation. Then we derive the inference algorithm using the variational Bayesian approach."
    }, {
      "heading" : "4.1 Model Specification",
      "text" : "We model a social network with N individuals. From the point-wise data aspect, assume that each activity of the person p is associated with a group identity Gpa and a role identity Rpa. Group identity finds the natural cluster of a person influenced by the pair-wise observations. Role identify captures the cluster of activities within the group. The two identities assumption is motivated by the controversial viewpoints of what is the right metric for a community. In community detection literature [9], some argue that a community is the one that has dense communications within clusters while others suggest that people in\nthe same community should share common activity features. We get around the controversy by recognizing the arguments of both sides. Mathematically, since we model activities as a mixture model, “role” is the mixture component that categorizes the feature values of each activity. From the pair-wise data perspective, assume that each communication from person p to q has a group membership zp→q. The group membership of person p, zp→, depends on the recipient of the communication while his group identity Gp is undirected. For simplification, we fix the number of groups as M and the number of roles as K.\nFor each person p, he joins a group according to the membership probability distribution πp. We impose a Dirichlet prior on the membership distribution. It is well known that the Dirichlet distribution is conjugate to the multinomial distribution. As we will show later, when dealing with latent variables, the Dirichlet prior facilitates the learning and inference of the model. We assume the pair-wise link Yp,q between person p and person q depends on the group identities of both p and q with the parameter B. Furthermore, we model the dependency between the group and the role using a multinomial distribution parameterized by a set of role mixture rate {θ1:M}. The role mixture rate characterizes the constitution of the group: the proportion of the population that plays the same role in the group. Finally, we model the activity feature vector of the individual Xpa as the dependent variable of his role with parameter set {β1:K}. Without loss of generality, we assume that the activity data has discrete value and follows the multinomial distribution of single trial,i.e, the categorical distribution. But we can easily adapt Xpa to other form of activities.\nFigure 1 shows the plate representation of the proposed model and summarizes the notations therein. Our model unifies the ideas from both the Mixture Membership Stochastic Block (MMSB) model [1] and the Latent Dirichlet Allocation (LDA) model [4]. The blue dashed rectangular on the left side resembles MMSB which models the formation of groups using link information. The red dashed polygon integrates the generating process of LDA which is often used for topic extraction from documents. We denote the current model design as GLAD0 and specify the generative process of GLAD0 in Algorithm 1. Next, we describe the variational Bayes inference for the GLAD 0 model.\nAlgorithm 1 Generative process of the GLAD0 model\nfor individual p = 1→ N do Draw group membership distribution πp ∼ Dir(α)\nfor individual q = 1→ N do Draw group membership zp→q ∼ Multinomial(πp) Draw group membership zp←q ∼ Multinomial(πq) Sample communication Yp,q ∼ Bernoulli (zTp→qBzp←q) end for for activity a = 1→ Ap do\nDraw group identity Gpa ∼ Multinomial(πp) Draw role identity Rpa ∼ Multinomial(Rpa|θ1:M , Gpa) Sample activity Xpa ∼ Multinomial(Xpa|β1:K , Rpa)\nend for end for"
    }, {
      "heading" : "4.2 Model Inference",
      "text" : "We develop an approximate inference technique based on variational Bayesian methods [12] and an EM algorithm for model inference. Specially, we approximate analytically to the posterior probability of the hiddent variables by minimizing the Kullback - Leibler divergence (KL-divergence) of the variational distribution and the actual posterior. Then we perform the EM procedure to learn the model parameters.\nDenote the set of model parameters as Θ = {α,B, θ1:M , β1:K}, the set of visible variables as v = {X1:N , Y1:N,1:N}, and the set of the hidden variables as h = {π1;N ,Z1:N,1:N ,G1:N ,R1:N}. Our aim is to estimate the posterior distribution p(h,Θ|v). We can first write out the complete joint likelihood of observed\nAlgorithm 2 Variational Inference for the alternative GLAD\nrandomly initialize B, θ, β normalize θ, β repeat\ninitialize φp→q,g := 1/M initialize φp←q,h := 1/M initialize γp,g := 1/M initialize µpa,r := 1/K initialize λpa,g := 1/M repeat\nfor p = 1→ N do update γp,g = αg + ∑N q=1 [φp→q,g + φp←q,g] + ∑Ap a=1 λpa,g\nfor q = 1→ N , g = 1→M , h = 1→M do update φp→q,g ∝ eEq(πp)[log πp,g] · ∏M h=1 [ B Ypq gh (1−Bgh)1−Ypq ]φp←q,h update φp←q,h ∝ eEq(πp)[log πp,h] · ∏M g=1 [ B Ypq gh (1−Bgh)1−Ypq\n]φp→q,g end for for a = 1→ Ap, g = 1→M , r = 1→ K do\nupdate λpa,g ∝ eψ(γp,g) · ∏K r=1 θ µga,r gr\nupdate µpa,r ∝ ∏M g=1 θ λpa,g gr · ∏D d=1 β xpa,d rd\nend for end for\nuntil convergence update Bgh = ∑ p,q Ypqφp→q,gφp←q,h\n(1−ρ)· ∑ p,q φp→q,gφp←q,h update βrd ∝ ∑ p ∑ a xpa,d · µpa,r\nupdate θgr ∝ ∑ p ∑ a λpa,gµpa,r\nuntil convergence\nand latent variables as follows: p(v, h|Θ) = ∏ p,a p(Xpa|Rpa, β)p(Rpa|Gpa, θ)p(Gpa|π)\n× ∏ pq p(Ypq|zp→q, zp←q)p(zp→q|πp)p(zp←q|πp) ∏ p p(πp|α).\nThe marginal likelihood of the data p(v|Θ) = ∫ h p(v, h|Θ)dh requires to integrate over all the latent variables in the equation above, which is intractable [1]. Therefore, we choose a variational distribution q(h) to approximate the actual posterior distribution, so that the Kullback-Leibler divergence (KL-divergence) between the actual posterior p(h|Θ, v) and its approximation q(h) is minimized. Rewriting the marginal log likelihood and plugging in the variational distribution, we have\nlog p(v|Θ) = DKL(p||q) + Eq[log p(v, h|Θ)]− Eq[log q(h)],\nwhere Eq[f ] represents the expectation of the function f with respect to the distribution q. Since the marginal likelihood log p(v|Θ) is invariant to the choice of q, minimizing the KL-divergence DKL(p||q) is equivalent to maximizing the last two terms 〈log p(v, h|Θ)〉q − 〈log q(h)〉q. In practice, we choose q(h) to be factorized over the latent variables with free parameters ∆ = {γ1:N , φ1:N,1:N , µ1:N , λ1:N} as follows:\nq(h|∆) = [∏ p q(πp|γp) ][∏ p,q q(zp→q|φp→q)q(zp←q|φp←q) ][∏ p ∏ a q(Gpa|λpa)q(Rpa|µpa) ] .\nFinding the optimal set of the variational parameters is equivalent to solving the following optimization problem subject to probability constraints:\n∆? = argmax ∆ 〈log p(v, h|Θ)〉q − 〈log q(h|∆)〉q\n= argmax ∆ L(v, h,Θ,∆).\nWe follow an EM procedure to solve the problem above. We iteratively update the free parameters by taking the derivative of the Lagrange function of the objective L over one parameter at a time given the value of others from the last iteration. Since {Yp,q} is symmetric, the objective function will result in a quadratic term with respect to λp. Taking the derivative over the variational parameter would not have a closed form solution. A simple workaround is by assuming constant probability for the generation of {Yp,p}. We omit the tedious derivations and only present the final update formulas of each of the free parameters, as shown in Algorithm 3. For convenience, we denote f(Yp,q, Bm,n) = Yp,q logBm,n + (1− Yp,q) log(1−Bm,n).\nFor the parameter estimation, we apply the empirical Bayes method on the variational likelihood. We maximize the Lagrange function of L(v, h,Θ,∆) over model parameters Θ = {α,B, θ1:M , β1:K}. Due to the fact that the derivative of the objective function with respect to α depends on α, there is no closed form solution for the maximizer w.r.t α. We apply the Newton-Raphson method to reach a numerical solution. Similar to the GLAD model, we score the group anomalousness using − ∑ p∈GEp[log p(Rp|Θ)]. The most anomalous group will have the highest anomaly score. We approximate the true log likelihood with the variational log likelihood to get − ∑ p∈GEq[log p(Rp|Θ)].\nGLAD0 jointly models the point-wise and pair-wise data. It allows mixture of groups and roles by associating each activity with a group identity and a role identity, which implies that each person can have multiple roles and can belong to multiple groups. The GLAD0 model loosely connects the two components of MMSB and LDA via a shared group distribution πp. It distinguishes between the communication group membership z and the activity membership G. However, the number of latent variables in GLAD0 scales linearly with number of activities for each person, thus GLAD0 suffers from high computational cost. The complexity of the model and the difficulty of inference increase significantly when we further consider generalizing to the dynamic setting. Additionally, the loose connection with the shared group membership πp may be restrictive in capturing the inter-dependencies of point-wise and pair-wise data. Therefore, we consider a more computationally efficient model design that addresses the above issues."
    }, {
      "heading" : "5 GLAD",
      "text" : "GLAD models a social network of activities X = {X1,X2,. . . , XN} and communications Y = {Y1,1,Y1,2, . . . , YN,N}, where Xp is the aggregation of the activities for each person. Xp ∈ RV consists of V entries, denoting a feature vector of V dimensions. Each person p joins a group according to the membership probability distribution πp. He is associated with a group identity Gp and a role identity Rp. We draw the pair-wise observations of person p {Yp,:} directly from the group identity Gp as Bernoulli random variables. And we further assume that the activities Xp follows a multinomial distribution with Ap trials. GLAD incorporates MMSB and LDA in a more compact way. It not only allows the shared group membership distribution between the two components, but also the group membership identity to emphasize the interdependencies between point-wise and pair-wise data. Figure 2 depicts the plate representation of the GLAD model and its corresponding generative process."
    }, {
      "heading" : "5.1 Inference and Learning",
      "text" : "Inference requires us to compute the posterior distributions of the latent variables given the data. The normalizing term of the posterior distribution involves the calculation of the marginal likelihood of the data for which we resort to variational EM algorithms [12].\nDenote the set of model parameters as Θ = {α,B, θ1:M , β1:K}, the set of observed variables as v = {X1:N , Y1:N}, and the set of the hidden variables as h = {π1;N ,G1:N ,R1:N}. Our aim is to estimate the\nposterior distribution p(h,Θ|v). We can first write out the complete joint likelihood of observed and latent variables as follows:\np(v, h|Θ) = ∏ p p(πp|α)× ∏ p,q p(Yp,q|Gp, Gq, B)\n× ∏ p p(Xp|Rp, β1:K)p(Rp|Gp, θ1:M )p(Gp|πp).\nComputing the maximizer for the marginal likelihood of the data p(v|Θ) = ∫ h p(v, h|Θ)dh requires the integration over all the latent variables in the equation above, which is intractable [1]. Therefore, we apply the variational Bayesian approach [12] to perform the inference approximately. The essence of the variational Bayesian approach is to choose a variational distribution q(h) to approximate the actual posterior distribution, so that the Kullback-Leibler divergence (KL-divergence) between p(h,Θ|v) and its approximation q(h) is minimized.\nRewriting the marginal log likelihood and plugging in the variational distribution, we have\nlog p(v|Θ) = DKL(p||q) + 〈log p(v, h|Θ)〉q − 〈log q(h)〉q,\nwhere we use 〈f〉p to represent the expectation of the function f with respect to the distribution p. Since the marginal likelihood log p(v|Θ) is invariant to the choice of q, minimizing the KL-divergence DKL(p||q) is equivalent to maximizing the last two terms 〈log p(v, h|Θ)〉q − 〈log q(h)〉q. In practice, we choose q(h) to be factorized over the latent variables with free parameters ∆ = {γ1:N , µ1:N , λ1:N} as follows:\nq(h|∆) = ∏ p q(πp|γp)q(Rp|µp)q(Gp|λp).\nOur goal is to find the optimal set of free parameters that provides a variational distribution closest to the actual posterior. Then our problem is to maximize the objective function formulated as follows subject to probability constraints:\n∆? = argmax ∆ 〈log p(v, h|Θ)〉q − 〈log q(h|∆)〉q\n= argmax ∆ L(v, h,Θ,∆).\nThe objective function L, by plugging in the joint likelihood and the variational distribution and taking\nexpectations, is given by L(v, h,Θ,∆) = ∑ p 〈log p(Xp|Rp, β1:K)〉q + ∑ p 〈log p(Rp|Gp, θ1:M )〉q + ∑ p 〈log p(Gp|πp)〉q\n+ ∑ p,q 〈log p(Yp,q|Gp, Gq, B)〉q + ∑ p 〈log p(πp|α)〉q\n− ∑ p 〈log q(πp|γp)〉q − ∑ p 〈log q(Rp|µp)〉q − ∑ p 〈log q(Gp|λp)〉q.\nWe follow a variational EM procedure in order to maximize L(v, h,Θ,∆) over ∆. Basically we iteratively update the free parameters by taking the derivative of the Lagrange function of the objective L over one parameter at a time given the value of others from the last iteration. Since {Yp,q} is symmetric, the objective function will result in a quadratic term with respect to λp. Taking the derivative over the variational parameter would not have a closed form solution. A simple workaround is by assuming constant probability for the generation of {Yp,p}. We omit the tedious derivations and only present the final update formulas of each of the free parameters, as shown in Algorithm 3. For convenience, we denote f(Yp,q, Bm,n) = Yp,q logBm,n + (1− Yp,q) log(1−Bm,n).\nAlgorithm 3 Variational Inference for GLAD\ninitialize γp,m := 1/M initialize µp,k := 1/K initialize λp,m := 1/M repeat\nfor p = 1→ N , m = 1→M k = 1→ K do γp,m = αm + λp,m λp,m = exp{ ∑ k log θm,kµp,k + ψ(γp,m)− ψ( ∑ n γp,n) + ∑ q 6=p ∑ n λq,n · f(Yp,q, Bm,n)}\nµp,k = exp{ ∑ v log βv,kXp,v + ∑ m log θm,kλp,m}\nend for until convergence\nFor the parameter estimation, we apply the empirical Bayes method on the variational likelihood. We maximize the Lagrange function of L(v, h,Θ,∆) over model parameters Θ = {α,B, θ1:M , β1:K}. We apply the Newton-Raphson method to reach a numerical solution for the maximizer w.r.t α. The resulting parameter updating functions for α and B are the same as those of MMSB [1] and the parameters β and θ can be estimated as follows:\nβv,k = ∑ pXp,vµp,k∑ v,pXp,vµp,k θm,k = ∑ p µp,kλp,m∑ k,p µp,kλp,m .\nWe score the group anomalousness using − ∑ p∈G〈log p(Rp|Θ)〉p according to our definition of group anomaly in section 3. The most anomalous group will have the highest anomaly score. We approximate the true log likelihood with the variational log likelihood to get − ∑ p∈G〈log p(Rp|Θ)〉q.\nA limitation of GLAD is that it only models the static network. This might be restrictive if we want to further consider dynamic networks. Besides the anomaly group whose mixture rate deviates significantly from other groups, we are also interested to study how the mixture rate evolves over time. Fortunately, GLAD can be easily extended to account for this dynamics. This leads to the dynamic extension of the GLAD model, which will be discussed in the next section."
    }, {
      "heading" : "6 dynamic GLAD",
      "text" : "We now generalize the GLAD model to take into account the dynamics in the social media. We refer the dynamic extension of GLAD as the d-GLAD model. To be consistent with our description for GLAD in\n1\nsection 5, we start with the model specification and then provide the model inference algorithm using both the variational Bayesian method and the Monte Carlo sampling technique."
    }, {
      "heading" : "6.1 Model Specification",
      "text" : "Generalization of GLAD to d-GLAD stems from the template models [14], which use the model for a particular time stamp as a template, duplicate it over time and connect temporal components sequentially. Similarly, we can adapt GLAD to the dynamic setting by making a copy of GLAD for each time point. To simplify the model, we assume that the latent factors including role Rp, group Gp and mixture rate {θ1:M} change over time but the membership distribution {πp} and model parameters are fixed.\nWe model the temporal evolution of the role mixture rate for each group with a series of multivariate Gaussian distributions. At a particular time point, the Gaussian has its mean as the value of the mixture rate. And the mixture rate of the next time point is a normalized sample from this Gaussian distribution. Since we require the mixture rate to be the parameters of a multivariate distribution over features, we apply a soft-max function to normalize the sample drawn from the multivariate Gaussian. The soft-max function is defined as S(θm) =\nexp θm∑ m exp θm . When the total time length T equals one, d-GLAD reduces to the GLAD\nmodel. Figure 3 depicts the probabilistic graphical model of d-GLAD and the meanings of notations used. We summarize the generative process of d-GLAD in Algorithm 4.\nIn d-GLAD model, since the mixture rate of next time stamp is drawn from a multivariate Gaussian centering around the mixture rate of its previous time stamp, it imposes smoothness on the mixture rates across time, preventing the mixture rate from having drastic changes. The soft-max function maps the samples from the multivariate Gaussian to the parameters for the multinomial distribution. Similar idea can be seen from the generalization of LDA to the dynamic topic model [3]. While it is true that d-GLAD model shares the constraints of GLAD on fixed group/role number and constant self-loop, it has certain intriguing advantages over static models. (i) d-GLAD captures the dynamics of the latent variables Gp and Rp, thus allows an individual to switch groups and roles over time.(ii) The smoothness of the mixture rate over time models the behavior of normal groups, so detecting groups whose mixture rates θtm undergo substantial change becomes easier."
    }, {
      "heading" : "6.2 Inference and Learning",
      "text" : "The variational inference of d-GLAD is similar to the GLAD model except for the longitudinal factor θ (1:T ) 1:M . We add a variational distribution p(θ1:Tm |θ̂1:T ) to approximate the original posterior where {θ̂1:T } are variational parameters. Then we apply the variational Kalman Filter technique [3] to infer the sequential latent variables and learn the model parameters. The transition for the mixture rate of each group is Gaussian\nAlgorithm 4 Generative Process of DGLAD\nfor t = 1→ T do for m = 1→M do\nDraw θ (t) m ∼ Gaussian(θ(t−1)m , σ)\nend for for individual p = 1→ N do\nDraw membership distribution π (t) p ∼ Dir(α) Draw G (t) p ∼ Multinomial(πp)(t)\nfor individual q = 1→ p− 1 and q = p+ 1→ N do Sample Y\n(t) (p,q) ∼ Binomial ((G (t) p )TBG (t) q )\nend for Draw R (t) p ∼ Multinomial(R(t)p |S(θ(t)\nG (t) p\n))\nDraw X (t) p ∼ Multinomial(X(t)p |βR(t)p )\nend for end for\ndistributed: θ(t)|θ(t−1) ∼ N (θ(t−1), σ2I).\nWe can write the variational distribution for the transition as follows:\nθ̂(t)|θ(t−1) ∼ N (θ(t−1), v̂2I).\nThen we can apply similar variational EM procedure incorporating the transitions to infer the variational parameters. Due to the numerical difficulty of variational Kalman filter method, we also implement a version of the Monte Carlo sampling for d-GLAD model, which is used in our empirical evaluations. The algorithm is elaborated in Algorithm 5. The inference of the transitional part {θ1:T } is based on the Particle Filtering method [8]. The anomaly score of the d-GLAD model is measured by ‖θ(t)m − θ(t−1)m ‖.\nAlgorithm 5 Monte Carlo Sampling of DGLAD\nInitialize α, θ0, β1:K , B R1:T1:N = 1/K, G 1:T 1:N = 1/M , π1:N ∼ Dir(α)\nrepeat for p = 1→ N do\nfor t = 1→ T do Update R (t) p ∼ Mul(S(θ(t−1)\nG (t−1) p\n))Mul(X (t) p )\nUpdate G (t) p ∼ Mul(π(t−1)p )Mul(S(θ(t−1)\nG (t−1) p\n))\nend for Update πp ∼ Dir(α)\nend for for t = 1→ T do\nUpdate θ(t) using Particle Filtering end for\nuntil Convergence"
    }, {
      "heading" : "7 Experiments",
      "text" : "To evaluate the effectiveness of our model, we conduct thorough experiments on synthetic datasets and real world datasets. We study the applications of our approach by analyzing scientific publications and senator voting records."
    }, {
      "heading" : "7.1 Baselines",
      "text" : "To our knowledge, all existing algorithms are two-stages approaches: (i) identify groups, (ii) detect group anomalies. We summarize these algorithms in Table 1. We use following approaches as baseline methods in comparison to GLAD and d-GLAD:\n1. MMSB-LDA:First use the MMSB model to learn a group membership distribution for each individual node, then assign the node to the group with the highest probability. Finally, for each group, train an LDA model and infer the role identity.\n2. MMSB-MGM: Group is learned using the same method as MMSB-LDA. For the role inference, train an multi-modal MGM instead of LDA.\n3. Graph-LDA: Run an off-the-shelf graph clustering algorithm Min-Cut to get group membership and then train a LDA model for each group.\n4. Graph-MGM: Get group membership with the graph clustering algorithm Min-Cut and then train a MGM model for each group."
    }, {
      "heading" : "7.2 Synthetic Dataset",
      "text" : "We experiment on two type of synthetic datasets. One is a synthetic dataset with injected group anomalies. The other is a benchmark dataset generated by a simulator with individual anomaly labels."
    }, {
      "heading" : "7.2.1 Synthetic Data with Anomaly Injection",
      "text" : "We generate a network with 500 nodes using GLAD in Algorithm 1. To evaluate the anomaly detection performance, we set the mixture rates of anomalous groups as [0.9, 0.1] and normal groups as [0.1, 0.9]. We vary the number of groups from 5 to 50 and inject 20% anomalous groups. The rest 80% groups are normal. Since we know the normal and anomalous mixture rates, we calculate the anomaly score of each group by directly computing the differences between the inferred mixture rate and the ground truth normal mixture rate. During the testing procedure, we rank the groups with respect to their anomaly score and retrieve top 20% groups. For all methods, we set the number of groups and number of roles the same as the ground truth.\nWe compare the learned groups of three grouping approaches with the ground truth: GLAD, MMSB and Graph, for the case of 5 groups. The inferred group memberships are shown as adjacent matrices in Figure 4. For better visualization, we intentionally put the nodes that belong to the same group together. Ideally, we should observe dense links within groups and sparse links between groups. Therefore, the dark pixels in the\nplot would aggregate along the principal diagonal of the matrix. We use blue color to highlight the groups learned. The group discovery result of GLAD is the closest to the ground truth. The high connectivity in the graph and the lack of point-wise information could be the reasons for the poor performance of Graph and MMSB.\nFigure 5(a) and Figure 5(b) shows the anomaly detection performance with different number of groups for GLAD and four other baselines. GLAD achieves the highest detection accuracy. It is also more robust over 10 random runs. Note that the differences for the first stage of baselines are more obvious than the second stage. This is because the Bernoulli distribution limits the number of samples in the pair-wise data, making the first stage more difficult to learn.\nWe justify the simplification of GLAD by evaluating the anomaly detection performance of the GLAD0 model. We adopt similar experiment set-up for GLAD0 in order to test whether GLAD0 can successfully detect the injected group anomalies. As shown in Figure 5(c), for most of the cases (expect for group number 8 and 9), GLAD0 achieves the highest detection accuracy, while the other two-stage approaches are relatively unstable. Given the complexity of the model and the limited observations we feed in, the gain from GLAD0 is less than that from the GLAD model. The performance deterioration with respect to the number of groups is due to the sparsity of the data. As we increase the group number of a fix size network, each group has fewer number of people, thus learning the role mixture for the group becomes more difficult.\nWe also report the simulation results on group anomaly detection for d-GLAD. The data is generated according to Algorithm 4 with 5 time stamps. We manipulate the mixture rate of 50% of the groups at time point 4 as injected anomalies. Then we raise alarms if the group’s mixture rate deviates from the previous time by a certain threshold. In Figure 5(d), we display the false positive rate with different threshold values. For comparison, we train MMSB-MGM and GLAD at each time independently as baselines. It can be seen that d-GLAD achieves the lowest false positive rate, which demonstrates the gain of d-GLAD over static models on the dynamic dataset."
    }, {
      "heading" : "7.2.2 Benchmark Data with Anomaly Labels",
      "text" : "The benchmark data set is generated by a simulator from a federal funded program. It contains email communication records and working activities from 258 company employees. Each employee is featured by 6 types of activities. The labeled dataset contains 39 individual anomalies and 5 of them cannot be detected by any existing algorithms. We set the number of groups as 20 as the optimal setting obtained from cross validation and calculate the anomaly score of each group by MCMC sampling. We treat all members in the most anomalous group as individual anomalies and compare them with the anomaly labels. Though the anomaly labels are point anomalies rather than group anomalies, the anomaly detection result reflects the potential of our approach to tackle other type of difficult anomaly detection problems. The precision, recall and F1 score over 20 runs on the benchmark dataset is shown in Figure 6.\nWe can see that the GLAD model achieves comparable precision and recall with low variances. In contrast, the detection performances of the two-stage models fluctuates significantly. In terms of the F1\nscores in Figure 6(c), both GLAD and MMSB-MGM beat the other algorithms while GLAD has a lower variance than MMSB-MGM. One possible explanation is that the point-wise features prevent the size of the group to become either too large or too small, thus leading to more robust performance."
    }, {
      "heading" : "7.3 Real World Datasets",
      "text" : ""
    }, {
      "heading" : "7.3.1 Scientific Publications",
      "text" : "Researchers study the topics of papers seeking for concise representations of scientific publications, which contain both pair-wise data like co-authorship and point-wise data such as bag of words features. Detecting anomalous topic distributions in scientific publications can sharpen our understanding of the structure of research communities and possibly reveal unusual research trends. In order to quantify our method, we resort to anomaly injection and construct a dataset with group anomaly labels. One way to construct group anomalies is the scenario that a conference paper corpus is contaminated by group of papers from conferences in other domains.\nWe create a dataset from a pre-processed Digital Bibliography and Library Project (DBLP) dataset from [7]. The dataset consists of conference papers from 20 conferences of four major area: database (DB), data mining (DM), information retrieval (IR) and artificial intelligence (AI). Each paper has a bag-of words feature vector with a vocabulary size of 11,771 and associated 28,702 authors information. The detailed statistics of\nthe dataset are shown in the top half of Table 3. We set up the group anomaly detection scenario as follows: we randomly sample groups of papers from KDD and treat them as normal groups. Then we sample groups of papers from the other conferences (e.g, CVPR, ICML , SIGMOD) and inject them into KDD papers as group anomalies. If the two papers have at least one common author, we add a link between them.\nAccordingly, all conferences share four topics. But different conferences might have difference point of emphasis, resulting in different mixture rates of topics. Our goal is to pick out the “anomalous” papers from the corpus. We sample 50 groups of papers and inject 20% group anomalies. We apply different models with 50 groups and 4 roles to the data for inference of the membership and role distributions. Then we rank 50 groups with respect to their anomaly scores. We treat the top 20% groups as the detected anomalies. Table 2 shows the anomaly detection accuracy by GLAD and four other baselines. GLAD is superior to all four baselines models for different combination of normal/abnormal settings. We also display the topics learned by the GLAD model. In Table 4, we show the top ten most representative words for the four topics, which well reproduce the topic results reported in [7].\nGLAD model, we process another ACM dataset downloaded from ArnetMiner [19]. The dataset contains the publications from year 2000 to 2009 by 4,474 authors, mainly from the data mining community. In order to study the topic evolution for academic scholars, we extract the abstracts of all publications and group them by authors and publishing years. For each author, we construct a bag of words feature vector out of all the papers he/she has written in one year. And the communication networks we generate are based on the co-authorship of the papers. Whenever two authors have collaborations in a certain year, we create a link between them for the network snapshot in that year.\nDue to the lack of labels, it is difficult to directly evaluate our model on anomaly detection task. As an alternative, we design a prediction task to compare the modeling performance of GLAD and d-GLAD on ACM publications. Specifically, we separate the papers into training and testing sets and measure the predictive model log-likelihood on the testing data. For d-GLAD, we train our model using a series of publications from previous years, and test on the year immediately after. For the GLAD model, as it is a static model, time independence assumption applies. We train the model using previous year and test on the next year. The model fitting results are shown in Table 5. Out of 9 training-testing experiments, d-GLAD model achieves higher log-likelihood than GLAD model for 6 times, indicating d-GLAD as a better fit for the evolving publication modeling."
    }, {
      "heading" : "7.3.2 US Senate Voting",
      "text" : "We collect the voting records from the government website of United States 109th Congress 1 using the New York Time Congress API 2. The records of 109th Congress contain 100 senators’ voting spanning two sessions from Jan 1st 2005 to Dec 31st 2006. We divide the 24 months records into 8 time slots, where each slot denotes a 3-month interval. Then we apply the method of [13] to construct a network from original yay/nay votes. For the nodes features, we collect the statistics of votes in six dimensions, namely House Joint Resolution(hjres), House of Representatives(hr), Presidential Nomination(pn), Simple Resolution(s), sconres(Senate Concurrent Resolution) and Senate Joint Resolution(sjres). We evaluate GLAD on single aggregated network and d-GLAD on the 8 time slots time-varying data.\nWe set the number of groups as 2 and number of roles as 3 as the Senate consists of two major parties and maintains three types of committees. Figure 7 shows the groups inferred by GLAD. The blue nodes\n1http://www.senate.gov/ 2http://developer.nytimes.com/docs/read/congress api\ndenote Democratic party members and the red ones are Republican. Compared with known facts, the model correctly reveals the party affiliation except for two outliers: Ben Nelson (Democratic) and James Jeffords (Independent). The underlying reason is that the votes of these two senators are often at odds with the leadership of his party, leading to false grouping. We conduct an anecdotal investigation and find that the congressional vote rating from the National Journal placed Ben Nelson to the right of five Senate Republicans in 2006. For James Jeffords, he served as a Republican until 2001, when he left the party to become an Independent and began caucusing with the Democrats.\nSince there are merely two groups, it is impetuous to say one party is more anomalous than the other. Instead, we use d-GLAD to detect time points when the role mixture rates change dramatically. In fact, d-GLAD raises an alarm at the 7th time-step for Democratic. A well known political event happened during this time is that Democratic senator Joseph Lieberman lost the Democratic Party primary election and became a independent Democratic in September 2006. Though it may be over-optimistic to draw the conclusion that this event causes the sudden change of role mixture rates, it serves as an evidence that the dynamics of the voting behavior is closely related to the party affiliation of members."
    }, {
      "heading" : "8 Conclusion",
      "text" : "In this paper, we perform a follow-up study of the Group Latent Anomaly Detection (GLAD) model by analyzing an alternative construction of the unified model. We loosely connect the MMSB model and the LDA model assuming the shared group membership distribution for both point-wise and pair-wise data. We also provide the variational Bayesian inference algorithm for model inference. We conduct a simulation experiment to verify the benefit of the joint model in comparison with the two-stage approaches."
    }, {
      "heading" : "9 Acknowledgments",
      "text" : "The research was sponsored by the U.S. Defense Advanced Research Projects Agency (DARPA) under the Anomaly Detection at Multiple Scales (ADAMS) program, Agreement Number W911NF-11-C-0200 and NSF research grants IIS-1134990. The views and conclusions are those of the authors and should not be interpreted as representing the official policies of the funding agency, or the U.S. Government."
    } ],
    "references" : [ {
      "title" : "Mixed membership stochastic blockmodels",
      "author" : [ "E.M. Airoldi", "D.M. Blei", "S.E. Fienberg", "E.P. Xing" ],
      "venue" : "Journal of Machine Learning Research, 9",
      "citeRegEx" : "1",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Anomaly detection in large graphs",
      "author" : [ "L. Akoglu", "M. McGlohon", "C. Faloutsos" ],
      "venue" : "In CMU-CS-09-173 Technical Report. Citeseer",
      "citeRegEx" : "2",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "Dynamic topic models",
      "author" : [ "D.M. Blei", "J.D. Lafferty" ],
      "venue" : "Proceedings of the 23rd international conference on Machine learning, pages 113–120. ACM",
      "citeRegEx" : "3",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Latent dirichlet allocation",
      "author" : [ "D.M. Blei", "A.Y. Ng", "M.I. Jordan" ],
      "venue" : "the Journal of machine Learning research, 3:993–1022",
      "citeRegEx" : "4",
      "shortCiteRegEx" : null,
      "year" : 2003
    }, {
      "title" : "Network analysis in the social sciences",
      "author" : [ "S.P. Borgatti", "A. Mehra", "D.J. Brass", "G. Labianca" ],
      "venue" : "science, 323(5916):892–895",
      "citeRegEx" : "5",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "Anomaly detection: A survey",
      "author" : [ "V. Chandola", "A. Banerjee", "V. Kumar" ],
      "venue" : "ACM Computing Surveys (CSUR), 41(3):15",
      "citeRegEx" : "6",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "Probabilistic topic models with biased propagation on heterogeneous information networks",
      "author" : [ "H. Deng", "J. Han", "B. Zhao", "Y. Yu", "C.X. Lin" ],
      "venue" : "Proceedings of the 17th ACM SIGKDD international conference on Knowledge discovery and data mining, pages 1271–1279. ACM",
      "citeRegEx" : "7",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "A tutorial on particle filtering and smoothing: Fifteen years later",
      "author" : [ "A. Doucet", "A.M. Johansen" ],
      "venue" : "Handbook of Nonlinear Filtering",
      "citeRegEx" : "8",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "Community detection in graphs",
      "author" : [ "S. Fortunato" ],
      "venue" : "Physics Reports 486, 75-174 ",
      "citeRegEx" : "9",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "Identification of outliers",
      "author" : [ "D.M. Hawkins" ],
      "venue" : "Chapman and Hall",
      "citeRegEx" : "10",
      "shortCiteRegEx" : null,
      "year" : 1980
    }, {
      "title" : "Bayesian anomaly detection methods for social networks",
      "author" : [ "N.A. Heard", "D.J. Weston", "K. Platanioti", "D.J. Hand" ],
      "venue" : "The Annals of Applied Statistics",
      "citeRegEx" : "11",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "An introduction to variational methods for graphical models",
      "author" : [ "M.I. Jordan", "Z. Ghahramani", "T.S. Jaakkola", "L.K. Saul" ],
      "venue" : "Machine learning, 37(2):183–233",
      "citeRegEx" : "12",
      "shortCiteRegEx" : null,
      "year" : 1999
    }, {
      "title" : "et al",
      "author" : [ "M. Kolar", "L. Song", "A. Ahmed", "E.P. Xing" ],
      "venue" : "Estimating time-varying networks. The Annals of Applied Statistics, 4(1):94–123",
      "citeRegEx" : "13",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "Probabilistic graphical models: principles and techniques",
      "author" : [ "D. Koller", "N. Friedman" ],
      "venue" : "MIT press",
      "citeRegEx" : "14",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "Empirical analysis of an evolving social",
      "author" : [ "G. Kossinets" ],
      "venue" : "network. Science,",
      "citeRegEx" : "15",
      "shortCiteRegEx" : "15",
      "year" : 2006
    }, {
      "title" : "One-class support measure machines for group anomaly detection",
      "author" : [ "K. Muandet", "B. Schölkopf" ],
      "venue" : "arXiv preprint arXiv:1303.0309",
      "citeRegEx" : "16",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Automatic multimedia cross-modal correlation discovery",
      "author" : [ "J.-Y. Pan", "H.-J. Yang", "C. Faloutsos", "P. Duygulu" ],
      "venue" : "Proceedings of the tenth ACM SIGKDD international conference on Knowledge discovery and data mining, pages 653–658. ACM",
      "citeRegEx" : "17",
      "shortCiteRegEx" : null,
      "year" : 2004
    }, {
      "title" : "Scan statistics on enron graphs",
      "author" : [ "C.E. Priebe", "J.M. Conroy", "D.J. Marchette", "Y. Park" ],
      "venue" : "Computational & Mathematical Organization Theory, 11(3):229–247",
      "citeRegEx" : "18",
      "shortCiteRegEx" : null,
      "year" : 2005
    }, {
      "title" : "Arnetminer: Extraction and mining of academic social networks",
      "author" : [ "J. Tang", "J. Zhang", "L. Yao", "J. Li", "L. Zhang", "Z. Su" ],
      "venue" : "KDD’08, pages 990–998",
      "citeRegEx" : "19",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "Random walk with restart: fast solutions and applications",
      "author" : [ "H. Tong", "C. Faloutsos", "J.-Y. Pan" ],
      "venue" : "Knowledge and Information Systems, 14(3):327–346",
      "citeRegEx" : "20",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "A tutorial on spectral clustering",
      "author" : [ "U. Von Luxburg" ],
      "venue" : "Statistics and computing, 17(4):395–416",
      "citeRegEx" : "21",
      "shortCiteRegEx" : null,
      "year" : 2007
    }, {
      "title" : "Hierarchical probabilistic models for group anomaly detection",
      "author" : [ "L. Xiong", "B. Poczos", "J. Schneider", "A. Connolly", "J. Vanderplas" ],
      "venue" : "AI and Statistics, pages 789–797",
      "citeRegEx" : "22",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Group anomaly detection using flexible genre models",
      "author" : [ "L. Xiong", "B. Póczos", "J.G. Schneider" ],
      "venue" : "NIPS, pages 1071–1079",
      "citeRegEx" : "23",
      "shortCiteRegEx" : null,
      "year" : 2011
    } ],
    "referenceMentions" : [ {
      "referenceID" : 9,
      "context" : "By definition, anomaly detection aims to find “an observation that deviates so much from other observations as to arouse suspicion that it was generated by a different mechanism” [10].",
      "startOffset" : 179,
      "endOffset" : 183
    }, {
      "referenceID" : 1,
      "context" : "Several algorithms have been developed specifically for social media anomaly detection such as power-law models [2], spectral decomposition [21], scan statistics [18], and random walk [17, 20].",
      "startOffset" : 112,
      "endOffset" : 115
    }, {
      "referenceID" : 20,
      "context" : "Several algorithms have been developed specifically for social media anomaly detection such as power-law models [2], spectral decomposition [21], scan statistics [18], and random walk [17, 20].",
      "startOffset" : 140,
      "endOffset" : 144
    }, {
      "referenceID" : 17,
      "context" : "Several algorithms have been developed specifically for social media anomaly detection such as power-law models [2], spectral decomposition [21], scan statistics [18], and random walk [17, 20].",
      "startOffset" : 162,
      "endOffset" : 166
    }, {
      "referenceID" : 16,
      "context" : "Several algorithms have been developed specifically for social media anomaly detection such as power-law models [2], spectral decomposition [21], scan statistics [18], and random walk [17, 20].",
      "startOffset" : 184,
      "endOffset" : 192
    }, {
      "referenceID" : 19,
      "context" : "Several algorithms have been developed specifically for social media anomaly detection such as power-law models [2], spectral decomposition [21], scan statistics [18], and random walk [17, 20].",
      "startOffset" : 184,
      "endOffset" : 192
    }, {
      "referenceID" : 1,
      "context" : "For example, [2] proposes an “OddBall” algorithm to spot anomalous nodes in a graph.",
      "startOffset" : 13,
      "endOffset" : 16
    }, {
      "referenceID" : 21,
      "context" : "This problem has found its applications in galaxy identification [22], high energy particle physics [16], anomalous image detection and turbulence vorticity modeling [23].",
      "startOffset" : 65,
      "endOffset" : 69
    }, {
      "referenceID" : 15,
      "context" : "This problem has found its applications in galaxy identification [22], high energy particle physics [16], anomalous image detection and turbulence vorticity modeling [23].",
      "startOffset" : 100,
      "endOffset" : 104
    }, {
      "referenceID" : 22,
      "context" : "This problem has found its applications in galaxy identification [22], high energy particle physics [16], anomalous image detection and turbulence vorticity modeling [23].",
      "startOffset" : 166,
      "endOffset" : 170
    }, {
      "referenceID" : 4,
      "context" : "For example, teams with the same composition of member skills can perform very differently depending on the patterns of relationships among the members [5].",
      "startOffset" : 152,
      "endOffset" : 155
    }, {
      "referenceID" : 5,
      "context" : "At the individual level, the activities might appear to be normal [6].",
      "startOffset" : 66,
      "endOffset" : 69
    }, {
      "referenceID" : 14,
      "context" : "(iii) Empirical studies in social media analysis suggest the dynamic nature of individual network positions [15].",
      "startOffset" : 108,
      "endOffset" : 112
    }, {
      "referenceID" : 21,
      "context" : "The Multinomial Genre Model (MGM) proposed in [22] first investigates the problem following the paradigm of Latent Dirichlet Allocation (LDA) [4].",
      "startOffset" : 46,
      "endOffset" : 50
    }, {
      "referenceID" : 3,
      "context" : "The Multinomial Genre Model (MGM) proposed in [22] first investigates the problem following the paradigm of Latent Dirichlet Allocation (LDA) [4].",
      "startOffset" : 142,
      "endOffset" : 145
    }, {
      "referenceID" : 22,
      "context" : "[23] further extends MGM to Flexible Genre Model (FGM) with more flexibility in the generation of topics.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 15,
      "context" : "[16] uses the same definition of group anomaly from [22].",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 21,
      "context" : "[16] uses the same definition of group anomaly from [22].",
      "startOffset" : 52,
      "endOffset" : 56
    }, {
      "referenceID" : 21,
      "context" : "For example, in [22], the Sloan Digital Sky Survey (SDSS) dataset needs to be preprocessed before feeding into MGM.",
      "startOffset" : 16,
      "endOffset" : 20
    }, {
      "referenceID" : 22,
      "context" : "For the application on turbulence data, the FGM model [23] considers the vertices in a local cubic region as a group.",
      "startOffset" : 54,
      "endOffset" : 58
    }, {
      "referenceID" : 15,
      "context" : "In SMM [16], the authors treat the high energy particles generated from the same collision event as a group.",
      "startOffset" : 7,
      "endOffset" : 11
    }, {
      "referenceID" : 8,
      "context" : "In community detection literature [9], some argue that a community is the one that has dense communications within clusters while others suggest that people in",
      "startOffset" : 34,
      "endOffset" : 37
    }, {
      "referenceID" : 0,
      "context" : "Our model unifies the ideas from both the Mixture Membership Stochastic Block (MMSB) model [1] and the Latent Dirichlet Allocation (LDA) model [4].",
      "startOffset" : 91,
      "endOffset" : 94
    }, {
      "referenceID" : 3,
      "context" : "Our model unifies the ideas from both the Mixture Membership Stochastic Block (MMSB) model [1] and the Latent Dirichlet Allocation (LDA) model [4].",
      "startOffset" : 143,
      "endOffset" : 146
    }, {
      "referenceID" : 11,
      "context" : "2 Model Inference We develop an approximate inference technique based on variational Bayesian methods [12] and an EM algorithm for model inference.",
      "startOffset" : 102,
      "endOffset" : 106
    }, {
      "referenceID" : 0,
      "context" : "The marginal likelihood of the data p(v|Θ) = ∫ h p(v, h|Θ)dh requires to integrate over all the latent variables in the equation above, which is intractable [1].",
      "startOffset" : 157,
      "endOffset" : 160
    }, {
      "referenceID" : 11,
      "context" : "The normalizing term of the posterior distribution involves the calculation of the marginal likelihood of the data for which we resort to variational EM algorithms [12].",
      "startOffset" : 164,
      "endOffset" : 168
    }, {
      "referenceID" : 0,
      "context" : "Computing the maximizer for the marginal likelihood of the data p(v|Θ) = ∫ h p(v, h|Θ)dh requires the integration over all the latent variables in the equation above, which is intractable [1].",
      "startOffset" : 188,
      "endOffset" : 191
    }, {
      "referenceID" : 11,
      "context" : "Therefore, we apply the variational Bayesian approach [12] to perform the inference approximately.",
      "startOffset" : 54,
      "endOffset" : 58
    }, {
      "referenceID" : 0,
      "context" : "The resulting parameter updating functions for α and B are the same as those of MMSB [1] and the parameters β and θ can be estimated as follows:",
      "startOffset" : 85,
      "endOffset" : 88
    }, {
      "referenceID" : 13,
      "context" : "1 Model Specification Generalization of GLAD to d-GLAD stems from the template models [14], which use the model for a particular time stamp as a template, duplicate it over time and connect temporal components sequentially.",
      "startOffset" : 86,
      "endOffset" : 90
    }, {
      "referenceID" : 2,
      "context" : "Similar idea can be seen from the generalization of LDA to the dynamic topic model [3].",
      "startOffset" : 83,
      "endOffset" : 86
    }, {
      "referenceID" : 2,
      "context" : "Then we apply the variational Kalman Filter technique [3] to infer the sequential latent variables and learn the model parameters.",
      "startOffset" : 54,
      "endOffset" : 57
    }, {
      "referenceID" : 7,
      "context" : "The inference of the transitional part {θ } is based on the Particle Filtering method [8].",
      "startOffset" : 86,
      "endOffset" : 89
    }, {
      "referenceID" : 10,
      "context" : "Table 1: Two stage models in existing work Algorithm Stage-1 Stage-2 Heard 2010 [11] spectrum Poisson process Xiong 2011-a [22] clustering Mixture Genre Model Xiong 2011-b [23] clustering Flexible Genre Model Muandet 2013 [16] simulator One class SMM",
      "startOffset" : 80,
      "endOffset" : 84
    }, {
      "referenceID" : 21,
      "context" : "Table 1: Two stage models in existing work Algorithm Stage-1 Stage-2 Heard 2010 [11] spectrum Poisson process Xiong 2011-a [22] clustering Mixture Genre Model Xiong 2011-b [23] clustering Flexible Genre Model Muandet 2013 [16] simulator One class SMM",
      "startOffset" : 123,
      "endOffset" : 127
    }, {
      "referenceID" : 22,
      "context" : "Table 1: Two stage models in existing work Algorithm Stage-1 Stage-2 Heard 2010 [11] spectrum Poisson process Xiong 2011-a [22] clustering Mixture Genre Model Xiong 2011-b [23] clustering Flexible Genre Model Muandet 2013 [16] simulator One class SMM",
      "startOffset" : 172,
      "endOffset" : 176
    }, {
      "referenceID" : 15,
      "context" : "Table 1: Two stage models in existing work Algorithm Stage-1 Stage-2 Heard 2010 [11] spectrum Poisson process Xiong 2011-a [22] clustering Mixture Genre Model Xiong 2011-b [23] clustering Flexible Genre Model Muandet 2013 [16] simulator One class SMM",
      "startOffset" : 222,
      "endOffset" : 226
    }, {
      "referenceID" : 6,
      "context" : "We create a dataset from a pre-processed Digital Bibliography and Library Project (DBLP) dataset from [7].",
      "startOffset" : 102,
      "endOffset" : 105
    }, {
      "referenceID" : 6,
      "context" : "In Table 4, we show the top ten most representative words for the four topics, which well reproduce the topic results reported in [7].",
      "startOffset" : 130,
      "endOffset" : 133
    }, {
      "referenceID" : 18,
      "context" : "GLAD model, we process another ACM dataset downloaded from ArnetMiner [19].",
      "startOffset" : 70,
      "endOffset" : 74
    }, {
      "referenceID" : 12,
      "context" : "Then we apply the method of [13] to construct a network from original yay/nay votes.",
      "startOffset" : 28,
      "endOffset" : 32
    } ],
    "year" : 2014,
    "abstractText" : "Traditional anomaly detection on social media mostly focuses on individual point anomalies while anomalous phenomena usually occur in groups. Therefore it is valuable to study the collective behavior of individuals and detect group anomalies. Existing group anomaly detection approaches rely on the assumption that the groups are known, which can hardly be true in real world social media applications. In this paper, we take a generative approach by proposing a hierarchical Bayes model: Group Latent Anomaly Detection (GLAD) model. GLAD takes both pair-wise and point-wise data as input, automatically infers the groups and detects group anomalies simultaneously. To account for the dynamic properties of the social media data, we further generalize GLAD to its dynamic extension d-GLAD. We conduct extensive experiments to evaluate our models on both synthetic and real world datasets. The empirical results demonstrate that our approach is effective and robust in discovering latent groups and detecting group anomalies.",
    "creator" : "LaTeX with hyperref package"
  }
}