{
  "name" : "1411.6081.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "PU Learning for Matrix Completion",
    "authors" : [ "Cho-Jui Hsieh", "Nagarajan Natarajan", "Inderjit S. Dhillon" ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : null,
      "text" : "1 (1−ρ)n\n) , where 1−ρ denotes the fraction of ones observed. This implies a sample complexity\nof O(n log n) ones to achieve a small error, when M is dense and n is large. We extend our methods and guarantees to the recently proposed inductive matrix completion problem, where rows and columns of M have associated features. We provide efficient and scalable optimization procedures for both the methods and demonstrate the effectiveness of the proposed methods for link prediction (on real-world networks consisting of over 2 million nodes and 90 million links) and semi-supervised clustering tasks."
    }, {
      "heading" : "1 Introduction",
      "text" : "The problem of recovering a matrix from a given subset of its entries arises in many practical problems of interest. The famous Netflix problem of predicting user-movie ratings is one example that motivates the traditional matrix completion problem, where we would want to recover the underlying (ratings) matrix given partial observations. Strong theoretical guarantees have been developed in the recent past for the low-rank matrix completion problem [Candès and Plan, 2009, Candès and Recht, 2009, Candès and Tao, 2010]. An important variant of the matrix completion problem is to recover an underlying matrix from one-bit quantization of its entries. Modern applications of the matrix completion problem reveal a conspicuous gap between existing matrix completion theory and practice. For example, consider the problem of link prediction in social networks. Here, the goal is to recover the underlying friendship network from a given snapshot of the social graph consisting of observed friendships. We can pose the problem as recovering the adjacency matrix of\nar X\niv :1\n41 1.\n60 81\nv1 [\ncs .L\nG ]\n2 2\nN ov\n2 01\nthe network A such that Aij = 1 if users i and j are related and Aij = 0 otherwise. In practice, we only observe positive relationships between users corresponding to 1’s in A. Thus, there is not only one-bit quantization in the observations, but also a one-sided nature to the sampling process here — no “negative” entries are sampled. In the context of classification, methods for learning in the presence of positive and unlabeled examples only, called positive-unlabeled (PU in short) learning, have been studied in the past [Elkan and Noto, 2008, Liu et al., 2003]. For matrix completion, can one guarantee recovery when only a subset of positive entries is observed? In this paper, we formulate the PU matrix completion problem and answer the question in the affirmative under different settings.\nMinimizing squared loss on the observed entries corresponding to 1’s, subject to the low-rank constraints, yields a degenerate solution — the rank-1 matrix with all its entries equal to 1 achieves zero loss. In practice, a popular heuristic used is to try and complete the matrix by treating some or all of the missing observations as true 0’s, which seems to be a good strategy when the underlying matrix has a small number of positive examples, i.e., small number of 1’s. This motivates viewing the problem of learning from only positive samples as a certain noisy matrix completion problem. Existing theory for noise-tolerant matrix completion [Candès and Plan, 2009, Davenport et al., 2012] does not sufficiently address recoverability under PU learning (see Section 2).\nIn our work, we assume that the true matrix M ∈ Rm×n has a bounded nuclear norm ‖M‖∗. The PU learning model for matrix completion is specified by a certain one-bit quantization process that generates a binary matrix Y from M and a one-sided sampling process that reveals a subset of positive entries of Y . In particular, we consider two recovery settings for PU matrix completion: The first setting is non-deterministic — M parameterizes a probability distribution which is used to generate the entries of Y . We show that it is possible to recover M using only a subset of positive entries of Y . The idea is to minimize an unbiased estimator of the squared loss between the estimated and the observed “noisy” entries, motivated by the approach in Natarajan et al. [2013]. We recast the objective as a “shifted matrix completion” problem that facilitates in obtaining a scalable optimization algorithm. The second setting is deterministic — Y is obtained by thresholding the entries of M (modeling how the users vote), and then a subset of positive entries of Y is revealed. While recovery of M is not possible (see Section 2), we show that we can recover Y with low error. To this end, we propose a scalable biased matrix completion method where the observed and the unobserved entries of Y are penalized differently. Recently, an inductive approach to matrix completion was proposed [Jain and Dhillon, 2013] where the matrix entries are modeled as a bilinear function of real-valued features associated with the rows and the columns. We extend our methods under the two aforementioned settings to the inductive matrix completion problem and establish similar recovery guarantees. Our contributions are summarized below:\n1. To the best of our knowledge, this is the first paper to formulate and study PU learning for matrix completion, necessitated by the applications of matrix completion. Furthermore, we extend our results to the recently proposed inductive matrix completion problem. 2. We provide strong guarantees for recovery; for example, in the non-deterministic setting, the error in recovering an n × n matrix is O( 1(1−ρ)n) for our method compared to O( 1 (1−ρ) √ n )\nimplied by the method in Davenport et al. [2012], where (1 − ρ) is the fraction of observed 1’s. 3. Our results provide a theoretical insight for the heuristic approach used in practice, namely, biased matrix completion. 4. We give efficient, scalable optimization algorithms for our methods; experiments on simulated\nand real-world data (social networks consisting of over 2 million users and 90 million links) demonstrate the superiority of the proposed methods for the link prediction problem.\nOutline of the paper. We begin by establishing some hardness results and describing our PU learning settings in Section 2. In Section 3, we propose methods and give recovery guarantees for the matrix completion problem under the different settings. We extend the results to PU learning for inductive matrix completion problem in Section 4. We describe efficient optimization procedures for the proposed methods in Section 5. Experimental results on synthetic and real-world data are presented in Section 6.\nRelated Work. In the last few years, there has been a tremendous amount of work on the theory of matrix completion since the remarkable result concerning recovery of low-rank matrices by Candès and Recht [2009]. Strong results on recovery from noisy observations have also been established [Candès and Plan, 2009, Keshavan et al., 2010]. Recently, Davenport et al. [2012] studied the problem of recovering matrices from 1-bit observations, motivated by the nature of observations in domains such as recommender systems where matrix completion is heavily applied. Our work draws motivation from recommender systems as well, but differs from Davenport et al. [2012] in that we seek to understand the case when only 1’s in the matrix are observed. One of the algorithms we propose for PU matrix completion is based on using different costs in the objective for observed and unobserved entries. The approach has been used before, albeit heuristically, in the context of matrix completion in recommender system applications [Sindhwani et al., 2010]. Compressed sensing is a field that is closely related to matrix completion. Here the goal is to recover an ssparse vector in Rd using a limited number of linear measurements. Recently, compressed sensing theory has been extended to the case of single-bit quantization [Boufounos and Baraniuk, 2008]. Here, the goal is to recover an s-sparse signal when the observations consist of only the signs of the measurements, and remarkable recovery guarantees have been proved for the single-bit quantization case [Boufounos and Baraniuk, 2008]."
    }, {
      "heading" : "2 Problem Settings",
      "text" : "We assume that the underlying matrix M ∈ Rm×n has a bounded nuclear norm, i.e., ‖M‖∗ ≤ t, where t is a constant independent of m and n. If Mij ∈ {0, 1} for all (i, j), stating the PU matrix completion problem is straight-forward: we only observe a subset Ω1 randomly sampled from {(i, j) | Mij = 1} and the goal is to recover M based on this “one-sided” sampling. We call this the “basic setting”. However, in real world applications it is unlikely that the underlying matrix is binary. In the following, we consider two general settings, which include the basic setting as a special case."
    }, {
      "heading" : "2.1 Non-deterministic setting",
      "text" : "In the non-deterministic setting, we assume Mij has bounded values and without loss of generality we can assume Mij ∈ [0, 1] for all (i, j) by normalizing it. We then consider each entry as a probability distribution which generates a clean 0-1 observation Y ∈ Rm×n:\nP (Yij = 1) = Mij , P (Yij = 0) = 1−Mij ,\nIn the classical matrix completion setting, we will observe partial entries sampled randomly from Y ; In our PU learning model, we assume only a subset of positive entries of Y is observed. More precisely, we observe a subset Ω1 from Y where Ω1 is sampled uniformly from {(i, j) | Yij = 1}. We assume |Ω1| = s̄ and denote the number of 1’s in Y by s. With only Ω1 given, the goal of PU matrix completion is to recover the underlying matrix M . Equivalently, letting A ∈ {0, 1}m×n to denote the observations, where AΩ1 = 1 and Aij = 0 for all (i, j) /∈ Ω1, the non-deterministic setting can be specified as observing A by the process:\nP (Aij = 1) = Mij(1− ρ), P (Aij = 0) = 1−Mij(1− ρ), (1)\nwhere ρ = 1− s̄/s is the noise rate of flipping a 1 to 0 (or equivalently, 1− ρ is the sampling ratio to obtain Ω1 from Y ).\nHardness of recovering M : The 1-bit matrix completion approach of Davenport et al. [2012] can be applied to this setting — Given a matrix M , a subset Ω is sampled uniformly at random from M , and the observed values are “quantized” by a known probability distribution. We can transform our problem to the 1-bit matrix completion problem by assuming all the unobserved entries are zeros. For convenience we assume M ∈ Rn×n. We will show that the one-bit matrix completion approach in [Davenport et al., 2012] is not satisfactory for PU matrix completion in the non-deterministic setting. In [Davenport et al., 2012], the underlying matrix M is assumed to satisfy ‖M‖∗ ≤ t and ‖M‖∞ ≤ α; we are given a subset (chosen uniformly random) Ω with |Ω| = m and we observe the following quantity on Ω:\nYi,j =\n{ 1 with probability f(Mij),\n−1 with probability 1− f(Mij). (2)\nBy setting f(Mij) = (1− ρ)Mij and 1 ≥Mij ≥ 0, and assuming Ω contains all the n2 entries, it is equivalent to our problem.\nThe estimator is obtained by solving the following optimization problem:\nM̂ = argmax X:‖X‖∗≤t ∑ i,j∈Ω  ∑ i,j:Yij=1 log(f(Xij)) + ∑ i,j:Yij=0 log(1− f(Xij))  . (3) The following result shows that M̂ is close to M :\nTheorem 1 (Davenport et al. [2012]). Assume ‖M‖∗ ≤ t, and Y is generated by (2), then\n1\nn2 ‖M̂ −M‖2F ≤\n√ 2Cα\n√ 2nr\nm , (4)\nwhere m = |Ω|, Cα := C2αLαβα where C2 is a constant and\nLα = sup |x|≤α |f ′(x)| f(x)(1− f(x)) and βα = sup |x|≤α f(x)(1− f(x)) (f ′(x))2 .\nBy substituting f(x) = (1 − ρ)x into the above formulas we can find Lα ≥ 1α(1−(1−ρ)α) and βα ≥ α(1−(1−ρ)α)1−ρ , so Lαβα ≥ 1 1−ρ . Therefore the above theorem suggests that\n1\nn2 ‖M̂ −M‖2F ≤ O\n( √ nr\n(1− ρ) √ m\n) .\nIn our setting, m = n2, so we have\n1\nn2 ‖M̂ −M‖2F ≤ O\n( √ r\n(1− ρ) √ n\n) . (5)\nThus the recovery error is O (\n1 (1−ρ) √ n\n) , which implies that the sample complexity for recovery\nusing this approach is quite high: For example, observing O(n log n) 1’s, when M is dense, is not sufficient.\nThe main drawback of using this approach for PU matrix completion is computation — time complexity of solving (3) is O(n2) which makes the approach prohibitive for large matrices. Moreover, the average error on each element is O(1/ √ n) (in contrast, our algorithm has O(1/n) average\nerror). To see how this affects sample complexity for recovery, assume ∑\ni,jMi,j = O(n 2) (number\nof 1’s are of the same order as the number of 0’s in the original matrix) and O(n log n) 1’s are observed. Then (1− ρ) = O( lognn ) and the average error according to (5) is 1 n2 ‖M̂ −M‖2F = O( √ rn\nlogn), which diverges as n→∞. In contrast, we will show that the average error of our estimator vanishes as n→∞."
    }, {
      "heading" : "2.2 Deterministic setting",
      "text" : "In the deterministic setting, a clean 0-1 matrix Y is observed from M by the thresholding process: Yij = I(Mij > q), where I(·) is the indicator function and q ∈ R is the threshold. Again, in our PU learning model, we assume only a subset of positive entries of Y are observed, i.e. we observe Ω1 from Y where Ω1 is sampled uniformly from {(i, j) | Yij = 1}. Equivalently, we will use A to denote the observations, where Aij = 1 if (i, j) ∈ Ω1, and Aij = 0 otherwise.\nIt is impossible to recover M even if we observe all the entries of Y . A trivial example is that all the matrices ηeeT will give Y = eeT if η > q, and we cannot recover η from Y . Therefore, in the deterministic setting we can only hope to recover the underlying 0-1 matrix Y from the given observations. To the best of our knowledge, there is no existing work that gives a reasonable guarantee of recovering Y . For example, if we apply the noisy matrix completion algorithm proposed in [Candès and Plan, 2009], the estimator Ŷ has an error bound ‖Ŷ −Y ‖ ≤ ‖A−Y ‖, which indicates the error in Ŷ is not guaranteed to be better than the trivial estimator A.\nHardness of applying noisy matrix completion to our deterministic setting: An easy way to model PU matrix completion problem in the deterministic setting is to think of it as a traditional matrix completion problem with n2 “noisy” observed entries. In [Candès and Plan, 2009], it is assumed that A = M + Z where Z is noise and δ = ‖Z‖F . The idea is to solve:\nmin ‖X‖∗ such that ‖PΩ(X −A)‖F ≤ δ, (6)\nwhere δ is total amount of noise. Candès and Plan [2009] established the following recovery guarantee:\nTheorem 2 (Candès and Plan [2009]). Let M ∈ Rn×n be a fixed matrix of rank r, and assume M is µ-incoherent, i.e.,\n‖ui‖∞ ≤ √ µ/n and ‖vi‖∞ ≤ √ µ/n, (7)\nwhere ui,vi are eigenvectors of M . Suppose we observe m entries of M with locations sampled uniformly at random, and\nm ≥ Cµ2nr log6 n, (8)\nwhere C is a numerical constant, then\n‖M̂ −M‖ ≤ 4\n√ (2 + p)n\np δ + 2δ, (9)\nwhere p = m/n2.\nIf we apply Theorem 2 to our case, δ = ‖Z‖F = ρ1−ρ s̄, the error of the recovered matrix M̂ using (6) can be bounded as:\n‖M̂ −M‖F ≤ ‖A−M‖F , (10)\nand clearly this bound is not very useful."
    }, {
      "heading" : "3 Proposed Algorithms for PU Matrix Completion",
      "text" : "In this section, we introduce two algorithms: shifted matrix completion for non-deterministic PU matrix completion, and biased matrix completion for deterministic PU matrix completion. All proofs are deferred to Appendix A."
    }, {
      "heading" : "3.1 Shifted Matrix Completion for Non-deterministic Setting (ShiftMC)",
      "text" : "We want to find a matrix X such that the loss ‖M −X‖2F is bounded, using the noisy observation matrix A generated from M by (1). Observe that conditioned on Y , the noise in Aij is asymmetric, i.e. P (Aij = 0|Yij = 1) = ρ and P (Aij = 1|Yij = 0) = 0. Asymmetric label noise has been studied in the context of binary classification, and recently Natarajan et al. [2013] proposed a method of unbiased estimator to bound the true loss using only noisy observations. In our case, we aim to find a matrix minimizing the unbiased estimator defined on each element, which leads to the following optimization problem:\nmin X ∑ i,j ˜̀(Xij , Aij) such that ‖X‖∗ ≤ t, 0 ≤ Xij ≤ 1 ∀(i, j). (11)\nwhere ˜̀(Xij , Aij) =\n{ (Xij−1)2−ρX2ij\n1−ρ if Aij = 1,\nX2ij if Aij = 0. (12)\nThe bound constraint on X in the above estimator ensures the loss has bounded Lipschitz constant. This optimization problem is equivalent to the traditional trace-norm regularization problem\nmin X ∑ i,j ˜̀(Xij , Aij) + λ‖X‖∗, such that 0 ≤ Xij ≤ 1 ∀(i, j), (13)\nwhere λ has a one-to-one mapping to t. We use ˜̀ instead of the original loss ` because it is the unbiased estimator of the underlying squared loss `(Xij ,Mij) = (Xij −Mij)2, as formalized below. Thus, we use ˜̀ on the observed Aij , we minimize the loss w.r.t. Yij in expectation.\nLemma 1. For any X ∈ Rm×n, 1mnE [∑ i,j(Xij − Yij)2 ] = 1mnE [∑ i,j ˜̀(Xij , Aij) ] .\nInterestingly, we can rewrite ˜̀ as ˜̀(Xij , 1) = ( Xij − 11−ρ )2 − ρ (1−ρ)2 . Therefore, (13) can be\nrewritten as the following “shifted matrix completion” problem:\nX̂ = argmin X ∑ i,j:Aij=1 ( Xij − 1 1− ρ )2 + ∑ i,j:Aij=0 X2ij + λ‖X‖∗ s.t. 0 ≤ Xij ≤ 1 ∀(i, j). (14)\nWe want to show that the average error of the ShiftMC estimator X̂ decays as O(1/n). In order to do so, we first need to bound the difference between the expected error and the empirical error. We define the hypothesis space to be X := {X | X ∈ Rm×n and ‖W‖∗ ≤ t}. The expected error can be written as EA[R˜̀(W )] = EA[ 1 mn ∑ i,j\n˜̀(Wij , Aij)], and the empirical error is R̂˜̀(W ) = 1 mn ∑ i,j\n˜̀(Wij , Aij). We first show that the difference between expected error and empirical error can be upper bounded:\nTheorem 3. Let X := {X ∈ Rm×n | ‖X‖∗ ≤ t, 0 ≤ X ≤ 1}, then\nmax X∈X ∣∣∣EA[R˜̀(X)]− R̂˜̀(X)∣∣∣ ≤ tC√n+√m+ 4√s (1− ρ)mn + 3 √ log(2/δ)√ mn(1− ρ)\n(15)\nwith probability at least 1 − δ, where C is a constant, E[R˜̀(X)] := E[ 1mn ∑ i,j ˜̀(Xij , Aij)] is the expected error, and R̂˜̀(X) = 1 mn ∑ i,j ˜̀(Xij , Aij) is the empirical error.\nCombining Lemma 1 and Theorem 3, we have our first main result:\nTheorem 4 (Main Result 1). With probability at least 1− δ,\n1\nmn ∑ i,j (Mij − X̂ij)2 ≤ 6 √ log(2/δ)√ mn(1− ρ) + 2Ct √ n+ √ m+ 4 √ s (1− ρ)mn .\nThe average error is of the order of O( 1n(1−ρ)) when M ∈ R n×n, where 1 − ρ denotes the ratio of observed 1’s. This shows that even when we only observe a very small ratio of 1’s in the matrix, we can still estimate M accurately when n is large enough."
    }, {
      "heading" : "3.2 Biased Matrix Completion for Deterministic Setting (BiasMC)",
      "text" : "In the deterministic setting, we propose to solve the matrix completion problem with label-dependent loss [Scott, 2012]. Let `(x, a) = (x − a)2 denote the squared loss, for a ∈ {0, 1}. The α-weighted loss is defined by\n`α(x, a) = α1a=1`(x, 1) + (1− α)1a=0`(x, 0), (16)\nwhere 1a=1, 1a=0 are indicator functions. We then recover the groundtruth by solving the following biased matrix completion (biasMC) problem:\nX̂ = argmin X:‖X‖∗≤t ∑ i,j `α(Xij , Aij) = argmin X:‖X‖∗≤t α ∑\ni,j:Aij=1\n(Xij − 1)2 + (1− α) ∑\ni,j:Aij=0\nX2ij (17)\nThe underlying binary matrix Y is then recovered by the thresholding operator X̄ij = I(X̂ij > q). A similar formulation has been used in [Sindhwani et al., 2010] to recommend items to users in the “who-bought-what” network. Here, we show that this biased matrix factorization technique can be used to provably recover Y . For convenience, we define the thresholding operator thr(x) = 1 if x > q, and thr(x) = 0 if x ≤ q. We first define the recovery error as R(X) = 1mn ∑ i,j 1thr(Xij) 6=Yij , where Y is the underlying 0-1 matrix. Define the label-dependent error:\nUα(x, a) = (1− α)1thr(x)=11a=−1 + α1thr(x)=−11a=1. (18)\nand α-weighted expected error and expected α-weighted loss: Rα,ρ(X) = E [∑ i,j Uα(Xij , Aij) ] , Rlα,ρ(X) = E [∑ i,j lα(Xij , Aij) ] . (19)\nThe following lemma is a special case of Theorem 9 in [Natarajan et al., 2013], showing that R(X) and Rα,ρ(X) can be related by a linear transformation:\nLemma 2. For the choice α∗ = 1+ρ2 and a = 1+ρ\n2 , there exists a constant b that is independent of"
    }, {
      "heading" : "X such that, for any matrix X,",
      "text" : "Rα∗,ρ(X) = aR(X) + b.\nTherefore, minimizing the α-weighed expected error in the partially observed situation is equivalent to minimizing the true recovery error R. By further relating Rα∗,ρ(X) and R`α∗ ,ρ(X) we can show:\nTheorem 5 (Main Result 2). Let X̂ be the minimizer of (17), and X̄ be the thresholded 0-1 matrix of X̂, then with probability at least 1− δ, we have\nR(X̄) ≤ 2η 1 + ρ\n( Ct √ n+ √ m+ 4 √ s\nmn + 3 √ log(2/δ)√ mn(1− ρ) ) ,\nwhere η = max(1/q2, 1/(1− q)2) and C is a constant.\nThe average error is of the order of O( 1n(1−ρ)) when M ∈ R n×n, where 1 − ρ denotes the ratio\nof observed 1’s, similar to the ShiftMC estimator."
    }, {
      "heading" : "4 PU Inductive Matrix Completion",
      "text" : "In this section, we extend our approaches to inductive matrix completion problem, where in addition to the samples, row and column features Fu ∈ Rm×d, Fv ∈ Rn×d are also given. In the standard inductive matrix completion problem [Jain and Dhillon, 2013], the observations AΩ are sampled\nfrom the groundtruth M ∈ Rm×n, and we want to recover M by solving the following optimization problem:\nmin D∈Rd×d ∑ i,j∈Ω (Aij − (FuDF Tv )ij)2 + λ‖D‖∗. (20)\nMatrix completion is a special case of inductive matrix completion when Fu = I, Fv = I. In the multi-label learning problem, M represents the label matrix and Fu corresponds to examples (typically Fv = I) [Yu et al., 2014, Xu et al., 2013]. This technique has also been applied to genedisease prediction [Natarajan and Dhillon, 2014], semi-supervised clustering [Yi et al., 2013], and theoretically studied in [Jain and Dhillon, 2013].\nThe problem is fairly recent and we wish to extend PU learning analysis to this problem, which is also well motivated in many real world applications. For example, in multi-label learning with partially observed labels, negative labels are usually not available. In the experiments, we will consider another interesting application — semi-supervised clustering problem with only positive and unlabeled relationships."
    }, {
      "heading" : "4.1 Shifted Inductive Matrix Completion for Non-deterministic Setting",
      "text" : "In the non-deterministic setting, we consider the inductive version of ShiftMC:\nmin D∈Rd×d ∑ i,j ˜̀((FuDF T v )ij , Aij) such that ‖D‖∗ ≤ t, 1 ≥ FuDF Tv ≥ 0, (21)\nwhere the unbiased estimator of loss ˜̀(·) is defined in (12). Note that we can assume that Fu, Fv are orthogonal (otherwise we can conduct a preprocessing step to normalize it). Let ui be the i-th row of Fu (the feature for row i) and vj be the j-th row of Fv. Define constants Xu = maxi ‖ui‖,Xv = maxj ‖vj‖.\nγ = min ( mini ‖ui‖ Xu , mini ‖vi‖ Xv ) .\nIn practice if one does an instance-wise scaling of features, µ will be 1. Assume Fu = UΣV , then we define F̄u = Ud̄Σd̄Vd̄ where σd̄ is the smallest singular value with σd ≥ µσ1. By the same way we can define F̄v. We assume the column space of the ground truth M lies in span(F̄u) and the row space of M lies in span(F̄v). We expect µ to be not too small, which indicates that the ground truth matrix lies in a more informative subspace of Fu and Fv. Since the output of inductive matrix completion is FuDFv, it can only recover the original matrix when the underlying matrix M can be written in such form. Following Xu et al. [2013], Yi et al. [2013], we assume the features are good enough such that M = Fu(Fu) TMFv(Fv) T . Recall ‖M‖∗ ≤ t. We now extend Theorem 4 to PU inductive matrix completion.\nTheorem 6. Assume D̂ is the optimal solution of (21) and the groundtruth M is in the subspace formed by Fu and Fv: M = Fu(Fu) TMFv(Fv) T , then\n1\nmn ∑ i,j (Mij − (F Tu D̂Fv)ij)2 ≤ 6 √ log(2/δ)√ mn(1− ρ) + 4t √ log 2d√ mn √ 1− ρ XuXv. (22)\nwith probability at least 1− δ.\nTherefore if t and d are bounded, the mean square error of shiftMC is O(1/n)."
    }, {
      "heading" : "4.2 Biased Inductive Matrix Completion for Deterministic Setting",
      "text" : "In the deterministic setting, we propose to solve the inductive version of BiasMC:\nD̂ = arg min D:‖D‖∗≤t\nα ∑\ni,j:Aij=1\n((FuDF T v )ij − 1)2 + (1− α) ∑ i,j:Aij=0 (FuDF T v ) 2 ij . (23)\nThe clean 0-1 matrix Y can then be recovered by Ŷij = I((FuD̂F T v )ij > q).\nŶij =\n{ 1 if (FuD̂F T v )ij ≥ q\n0 if (FuD̂F T v )ij < q.\n(24)\nSimilar to the case of matrix completion, Lemma 2 shows that the expected 0-1 error R(X) and the α-weighted expected error in noisy observation Rα,ρ(X) can be related by a linear transformation when α∗ = 1+ρ2 . With this choice of α\n∗, Lemma 2 continues to hold in this case, which allows us to extend Theorem 5 to PU inductive matrix completion:\nTheorem 7. Let D̂ be the minimizer of (23) with α∗ = (1 + ρ)/2, and let Ŷ be generated from D̂ by thresholding, then with probability at least 1− δ, we have\nR(Ŷ ) = 1\nmn ‖Y − Ŷ ‖2F ≤\n2η\n1 + ρ\n( 4t √\nlog 2d√ mn √ 1− ρ XuXv + 6 √ log(2/δ)√ mn(1− ρ) ) ,\nwhere η = max(1/q2, 1/(1− q)2).\nAgain, we have that if t and d are bounded, the mean square error of BiasMC is O(1/n)."
    }, {
      "heading" : "5 Optimization Techniques for PU Matrix Completion",
      "text" : "In this section, we show that BiasMC can be solved very efficiently for large-scale (millions of rows and columns) datasets, and that ShiftMC can be solved efficiently after a relaxation.\nFirst, consider the optimization problem for BiasMC:\nargmin X\nα ∑\ni,j:Aij=1\n(Xij − 1)2 + (1− α) ∑\ni,j:Aij=0\nX2ij + λ‖X‖∗ := fb(X) + λ‖X‖∗, (25)\nwhich is equivalent to the constrained problem (17) with suitable λ. The typical proximal gradient descent update isX ← S(X−η∇fb(X), λ), where η is the learning rate and S is the soft thresholding operator on singular values [Ji and Ye, 2009]. The (approximate) SVD of G := (X− η∇fb(X)) can be computed efficiently using power method or Lanczos algorithm if we have a fast procedure to compute GP for a tall-and-thin matrix P ∈ Rn×k. In order to do so, we first rewrite fb(X) as\nfb(X) = (1− α)‖X −A‖2F + (2α− 1) ∑\ni,j:Aij=1\n(Xij −Aij)2. (26)\nAssume the current solution is stored in a low-rank form X = WHT and R = (X − A)Ω1 is the residual on Ω1, then\nGP = XP − 2η ((1− α)(X −A) + (2α− 1)(X −A)Ω1)P = (1− 2η(1− α))WHTP + 2η(1− α)AP − 2η(2α− 1)RP,\nwhere the first term can be computed in O(mk2 + nk2) flops, and the remaining terms can be computed in O(|Ω1|k) flops. With this approach, we can efficiently compute the proximal operator. This can also be applied to other faster nuclear norm solvers (for example, [Hsieh and Olsen, 2014]).\nNext we show that the non-convex form of BiasMC can also be efficiently solved, and thus can scale to millions of nodes and billions of observations. It is well known that the nuclear norm regularized problem minX fb(X) + λ‖X‖∗ is equivalent to\nmin W∈Rm×k,H∈Rn×k\nfb(WH T ) +\nλ 2 (‖W‖2F + ‖H‖2F ) (27)\nwhen k is sufficiently large. We can use a trick similar to (26) to compute the gradient and Hessian efficiently:\n∇W fb(WHT ) = 2(1− α)(WHTH −AH) + 2(2α− 1)RΩH and ∇2Wi,·fb(WH T ) = 2(1− α)HTH + 2(2α− 1)HTΩiHΩi ,\nwhereHΩi is the sub-matrix with columns {hj : j ∈ Ωi}, and Ωi is the column indices of observations in the i-th row. Thus, we can efficiently apply Alternating Least Squares (ALS) or Coordinate Descent (CD) for solving (27). For example, when applying CCD++ in [Yu et al., 2013], each coordinate descent update only needs O(|Ωi| + k) flops. We apply this technique to solve largescale link prediction problems (see Section 6).\nThe optimization problem for ShiftMC is harder to solve because of the bounded constraint. We can apply the bounded matrix factorization technique [Kannan et al., 2014] to solve the non-convex form of (13), where the time complexity is O(mn) because of the constraint 0 ≤ (WHT )ij ≤ 1 for all (i, j). To scale it to large datasets, we relax the bounded constraint and solve:\nmin W∈Rm×k,H∈Rn×k\n‖A−WHT ‖2F + λ\n2 (‖W‖2F + ‖H‖2F ) s.t. 0 ≤W,H ≤\n√ 1/k (28)\nThis approach (ShiftMC-relax) is easy to solve by ALS or CD with O(|Ω|k) complexity per sweep (similar to the BiasMC). In our experiments, we show ShiftMC-relax performs even better than shiftMC in practice."
    }, {
      "heading" : "6 Experiments",
      "text" : "We first use synthetic data to show that our bounds are meaningful and then demonstrate the effectiveness of our algorithms in real world applications."
    }, {
      "heading" : "6.1 Synthetic Data",
      "text" : "We assume the underlying matrix M ∈ Rn×n is generated by UUT , where U ∈ Rn×k is the orthogonal basis of a random Gaussian n by k matrix with mean 0 and variance 1. For the nondeterministic setting, we linearly scale M to have values in [0, 1], and then generate training samples as described Section 2. For deterministic setting, we choose q so that Y has equal number of zeros and ones. We fix ρ = 0.9 (so that only 10% 1’s are observed). From Lemma 2, α = 0.95 is optimal. We fix k = 10, and test our algorithms with different sizes n. The results are shown in Figure 1(a)-(b). Interestingly, the results reflect our theory: error of our estimators decreases with n; in\nparticular, error linearly decays with n in log-log scaled plots, which suggests a rate of O(1/n), as shown in Theorems 4 and 5. Directly minimizing ‖A−X‖2F gives very poor results. For BiasMF, we also plot the performance of estimators with various α values in Figure 1(b). As our theory suggests, α = 1+ρ2 performs the best. We also observe that the error is well-behaved in a certain range of α. A principled way of selecting α is an interesting problem for further research."
    }, {
      "heading" : "6.2 Parameter Selection",
      "text" : "Before showing the experimental results on real-world problems, we discuss the selection of the parameter ρ in our PU matrix completion model (see eq (1)). Note that ρ indicates the noise rate of flipping a 1 to 0. If there are equal number of positive and negative elements in the underlying matrix Y , we will have ρ = 1 − 2s where s = (# positive entries)/(# total entries). In practice (e.g., link prediction problems) number of 1’s are usually less than number of 0 in the underlying matrix, but we do not know the ratio. Therefore, in all the experiments we chose ρ from the set {1 − 2s, 10(1 − 2s), 100(1 − 2s), 1000(1 − 2s)} based on a random validation set, and use the corresponding α in the optimization problems."
    }, {
      "heading" : "6.3 Matrix completion for link prediction",
      "text" : "One of the important applications that motivated our analysis in this paper is the link prediction problem. Here, we are given n nodes (users) and a set of edges Ωtrain (relationships) and the goal is to predict missing edges, i.e. Ωtest. We use 4 real-world datasets: 2 co-author networks ca-GrQc (4,158 nodes and 26,850 edges) and ca-HepPh (11,204 nodes and 235,368 edges), where we randomly split edges into training and test such that |Ωtrain| = |Ωtest|; 2 social networks LiveJournal (1,770,961 nodes, |Ωtrain| = 83,663,478 and |Ωtest| = 2,055,288) and MySpace (2,137,264 nodes, |Ωtrain| = 90,333,122 and |Ωtest| = 1,315,594), where train/test split is done using timestamps. For our proposed methods BiasMC, ShiftMC and ShiftMC-relax, we solve the non-convex form with k = 50 for ca-GrQc, ca-HepPh and k = 100 for LiveJournal and MySpace. The α and λ values are chosen by a validation set.\nWe compare with competing link prediction methods [Kiben-Nowell and Kleinberg, 2003] Common Neighbors, Katz, and SVD-Katz (compute Katz using the rank-k approximation, A ≈ UkΣkVk). Note that the classical matrix factorization approach in this case is equivalent to SVD on the given 0-1 training matrix, and SVD-Katz slightly improves over SVD by further computing the Katz values based on the low rank approximation (see Kiben-Nowell and Kleinberg [2003]), so we omit the SVD results in the figures.\nBased on the training matrix, each link prediction method will output a list of k candidate entries. The quality of the top-k entries can be evaluated by computing the False Positive Rate (FPR) and False Negative Rate (FNR) defined by\nFPR = # of incorrectly predicted links # of non-friend links , FNR = 1− # of correctly predicted links # of actual links ,\nwhere the groundtruth is given in the test snapshot. The results are shown in Figure 1. ca-GrQc is a small dataset, so we can solve the original ShiftMC problem accurately, although ShiftMCrelax achieves a similar performance here. For larger datasets, we show only the performance of ShiftMC-relax. In general BiasMC performs the best, and ShiftMC tends to perform better in the beginning. Overall, our methods achieve lower FPR and FNR comparing to other methods,\nwhich indicate that we obtain a better link prediction model by solving the PU matrix completion problem. Also, BiasMC is highly efficient — it takes 516 seconds for 10 coordinate descent sweeps on the largest dataset (MySpace), whereas computing top 100 eigenvectors using eigs in Matlab requires 2408 seconds."
    }, {
      "heading" : "6.4 Inductive matrix completion",
      "text" : "We use the semi-supervised clustering problem to evaluate our PU inductive matrix completion methods. PU inductive matrix completion can be applied to many real-world problems, including recommender systems with features and 0-1 observations, and the semi-supervised clustering problem when we can only observed positive relationships. Here we use the latter as an example to demonstrate the usefulness of our algorithm.\nIn semi-supervised clustering problems, we are given n samples with features {xi}ni=1 and pairwise relationships A ∈ Rn×n, where Aij = 1 if two samples are in the same cluster, Aij = −1 if they are in different clusters, and Aij = 0 if the relationship is unobserved. Note that the groundtruth matrix M ∈ {+1,−1}n×n exhibits a simple structure and is a low rank as well as low trace norm matrix; it is shown in [Yi et al., 2013] that we can recover M using IMC when there are both positive and negative observations.\nNow we consider the setting where only positive relationships are observed, so A is a 0-1 matrix. We show that biased IMC can recover M using very few positive relationships. We test the algorithms on two datasets: the Mushroom dataset with 8142 samples, 112 features, and 2 classes; the Segment dataset with 2310 samples, 19 features, and 7 classes. The results are presented in Figure 2.\nWe compare BiasMC-inductive with (a) MC-inductive, which considers all the unlabeled pairs as zeros and minimizes ‖FuDF Tv − A‖2F , and (b) spectral clustering, which does not use feature information. Since the data is from classification datasets, the ground truth M is known and can\nbe used to evaluate the results. In Figure 2, the vertical axis is the clustering error rate defined by\n(number of entries in M predicted with correct sign)/n2.\nFigure 2 shows that BiasMC-inductive is much better than other approaches for this task."
    }, {
      "heading" : "7 Conclusions",
      "text" : "Motivated by modern applications of matrix completion, our work attempts to bridge the gap between the theory of matrix completion and practice. We have shown that even when there is noise in the form of one-bit quantization as well as one-sided sampling process revealing the measurements, the underlying matrix can be accurately recovered. We have considered two recovery settings, both of which are natural for PU learning, and have provided similar recovery guarantees for the two. Our error bounds are strong and useful in practice. Our work serves to provide the first theoretical insight into the biased matrix completion approach that has been employed as a heuristic for similar problems in the past. Experimental results on synthetic data conform to our theory; effectiveness of our methods are evident for the link prediction task in real-world networks. A principled way of selecting or estimating the bias α in BiasMC seems worthy of exploration given our encouraging results."
    }, {
      "heading" : "A Proofs",
      "text" : "A.1 Proof of Lemma 1\nProof.\n1\nmn E [∑ i,j l̃(Xij , Aij) ] = 1 mn ∑ i,j E [ l̃(Xij , Aij) ]\n= 1\nmn ∑ i,j\n( P (Yij = 0)X 2 ij + P (Yij = 1) ( ρX2ij + (1− ρ)( (Xij − 1)2 − ρX2ij 1− ρ ) ))\n= 1\nmn ∑ i,j ( P (Yij = 0)X 2 ij + P (Yij = 1)(Xij − 1)2 ) = 1\nmn E [∑ i,j (Xij − Yij)2 ] = 1 mn E [ l(Xij , Yij) ] .\nA.2 Proof of Theorem 3\nProof. We want to bound supX∈X ∣∣∣R̂l̃(X)− EA[Rl̃(X)]∣∣∣. First, EA[Rl̃(X)] ≤ R̂l̃(X) + sup\nX∈X\n( EA[ 1\nmn ∑ i,j l̃(Xij , Aij)]− 1 mn ∑ i,j l̃(Xij , Aij) ) .\nApply McDiarmid’s Theorem in [Shawe-Taylor and Cristianini, 2004]; since each l̃(Xij , Aij) can be either X2ij or (Xij−1)2−ρX2ij 1−ρ , when changing one random variable Aij , in the worst case the quantity\nsupX∈X ( EA[Rl̃(X)]− 1 mn ∑ i,j l̃(Xij , Aij) ) can be changed by ∣∣∣X2ij − (Xij − 1)2 − ρX2ij1− ρ ∣∣∣ ≤ ∣∣∣2Xij + 11− ρ ∣∣∣ ≤ 31− ρ. So by McDiarmid’s Theorem, with probability 1− δ/2,\nsup X∈X\n( EA(Rl̃(X))− 1\nmn ∑ i,j l̃(Xij , Aij) ) ≤ EA  sup X∈X ( EA(Rl̃(X))− 1 mn ∑ i,j l̃(Xij , Aij) )+3 √log(2/δ)√ mn(1− ρ) .\n(29)\nAlso,\nEA  sup X∈X ( EA[Rl̃(X)]− 1 mn ∑ i,j l̃(Xij , Aij) ) (30)\n≤ EA,Ã  sup X∈X ( 1 mn ∑ i,j l̃(Xij , Ãij)− 1 mn ∑ i,j l̃(Xij , Aij) ) (31)\n= EA,Ã  sup X∈X 1 mn ∑ i,j (l̃(Xij , Ãij)− l̃(Xij , Aij))  (32) = 1\nmn EA,A′,σ  sup X∈X ∑ i,j:Mij=1 σij(l̃(Xij , Ãij)− l̃(Xij , Aij))  (33) ≤ 1 mn EA,σ  sup X∈X ∑ i,j:Mij=1 σij l̃(Xij , Aij)\n (34) where σij are random variables with half chance to be +1 and half chance to be -1. Where from (32) to (33) we use the fact that Aij = 0 with probability 1 if Mij = 0. Next we want to bound the\nRademacher complexity EA,σ [ supX∈X ∑ i,j:Mij=1 σij l̃(Xij , Aij) ] . When Mij = 1,\nl̃(Xij , Aij) = { X2ij with probability ρ (Xij−1)2−ρX2ij\n1−ρ with probability 1− ρ\nSince 0 ≤ Xij ≤ 1, the Lipschitz constant for l̃(Xij , Aij) is at most 1/(1− ρ), so\n(34) ≤ 1 mn Eσ( sup X∈X ∑ i,j:Mij=1 σijXij)\n≤ 1 (1− ρ)mn Eσ [ sup X∈X ‖PMij=1(σ)‖2‖X‖∗ ] .\nAs pointed out in Shamir and Shalev-Shwartz [2011], we can then apply the main Theorem in Latala [2005], when Z is an independent zero mean random matrix,\nE[‖Z‖2] ≤ C max i √∑ j E[Z2ij ] + maxj √∑ i E[Z2ij ] + 4 √∑ ij E[Z4ij ]  with a universal constant C.\nSo in our case E[‖σ‖2] ≤ C ( √ n+ √ m+ 4 √ s), so (34) ≤ tC √ n+ √ m+ 4 √ s\n(1−ρ)mn .\nA.3 Proof of Theorem 4\nLet X̂ be the minimizer of (11), and\nP := tC\n√ n+ √ m+ 4 √ s\n(1− ρ)mn + 3 √ log(2/δ)√ mn(1− ρ) ,\nwe have\nE [ 1 mn ∑ i,j (X̂ij − Yij)2 ] = E [ 1 mn ∑ i,j l̃(X̂ij , Aij) ] (Lemma 1)\n≤ R̂l̃(X̂) + P (Theorem 3) ≤ R̂l̃(M) + P (by the definition of X̂)\n≤ E [ 1 mn l̃(Mij , Aij) ] + 2P (Theorem 3)\n= E [ 1 mn ∑ i,j (Mij − Yij)2 ] (Lemma 1)\nTherefore 1\nmn ∑ i,j E [ (Xij − Yij)2 − (Mij − Yij)2 ] ≤ 2P.\nSince P (Yij = 1) = Mij , we have E [ (Xij − Yij)2 − (Mij − Yij)2] = Mi,j ( (Xij − 1)2 − (Mij − 1)2 ) + (1−Mij)(X2ij −M2ij)\n= (Xij −Mij)2,\ntherefore 1\nmn ∑ i,j (Xij −Mij)2 ≤ 2P.\nA.4 Proof of Theorem 5\nProof. We want to show\nRα,ρ(X)−min X Rα,ρ(X) ≤ η(Rlα,ρ(X)−min X Rlα,ρ(X)), (35)\nwhere η = max(1/q2, 1/(1− q)2). Consider the following two cases. If Yij = 0, then\nRα,ρ(Xij) = α1Xij>q, min Xij Rα,ρ(Xij) = 0 Rlα,ρ(Xij) = αX 2 ij , min\nXij Rlα,ρ(Xij) = 0,\nso the left hand side of (35) is α1Xij>q and the right hand side is αX 2 ij . Therefore we can simply verify that (35) holds with η = 1/q2. For the second case if Yij = 1,\nRα,ρ(Xij) = ρ(1− α∗)1Xij>q + (1− ρ)α∗1Xij<q = (1− ρ)(1 + ρ)\n2 1Xij<q + ρ(1− ρ) 2 1Xij>q,\nRlα,ρ(Xij) = (1− ρ)(1 + ρ)\n2 (Xij − 1)2 + ρ(1− ρ) 2 X2ij .\nWe can see (1−ρ)(1+ρ)1Xij<q ≤ 1(1−q)2 (1−ρ)(1+ρ)(Xij−1) 2 and ρ(1−ρ)1Xij<q < 1q2 ρ(1−ρ)X 2 ij , so both will satisfied by our chosen η.\nNext we compute minXij Rα,ρ(Xij) and minXij Rlα,ρ(Xij). By definition\nRα∗,ρ(Xij) = { ρ(1− α∗) = ρ(1−ρ)2 if Xij > q (1− ρ)α∗ = (1+ρ)(1−ρ)2 if Xij < q.\nTherefore\nmin Xij\nRα,ρ(Xij) = ρ(1− ρ)\n2 . (36)\nOn the other hand,\nRlα,ρ(x) = ρ(1− α∗)x2 + (1− ρ)α∗(x− 1)2 = ρ(1− ρ)\n2 x2 + (1− ρ)(1 + ρ) 2 (x− 1)2.\nTaking gradient equals to zero we get x∗ = ρ+12ρ+1 , and therefore\nmin x Rlα,ρ(x) = (1 + ρ)ρ(1− ρ) 2 ≤ ρ(1− ρ). (37)\nCombining (36) and (37), we have\nmin x Rα,ρ ≥ min x Rlα,ρ/2,\ntherefore we need η ≥ 2. But this is satisfied by η = max(1/q2, 1/(1− q)2). Combining the above arguments, we proved that (35) holds.\nNext we show an upper bound of (35). Using the proof similar to Theorem 3 we have\nRlα,ρ(X)−min X\nRlα,ρ(X) ≤ Ct √ n+ √ m+ 4 √ s\nmn + 3 √ log(2/δ)√ mn(1− ρ)\n(38)\nNow for the left hand side Rα,ρ(X)−minX Rα,ρ(X). By Theorem 2, we know that\nRα∗,ρ(X)−min X Rα∗,ρ(X) =\n( 1 + ρ\n2\n) R(X). (39)\nHere we use the fact that minX R(X) = 0 because R(Y ) = 0, and the term B vanished because it is a constant for both sides. Combining (39), (38) and (35), we have(\n1 + ρ\n2\n) R(X) ≤ η ( Ct √ n+ √ m+ 4 √ s\nmn + 3 √ log(2/δ)√ mn(1− ρ) ) ,\ntherefore\nR(X) ≤ 2η 1 + ρ\n( Ct √ n+ √ m+ 4 √ 3s\nmn + 3 √ log(2/δ)√ mn(1− ρ) ) .\nA.5 Proof of Theorem 6\nProof. For convenience, we let X = FuDF T v . We first apply the same argument in to the proof in Appendix A.2 to get (34). Now we want to bound the Rademacher compelxity EA,σ[supw∈W ∑ i,j σij l̃(Xij , Aij)] (upper bound of (34)). Since l̃(Xij , Aij) is Lipchitz continuous with constant 1\n1−ρ (use the fact that\nXij is bounded between 0 and 1), we have l̃(Xij , Aij) ≤ 11−ρ(Xij −Aij). Therefore,\nEA,σ[ sup w∈W ∑ i,j:Aij=1 σij l̃((FuDF T v )ij , Aij)]\n≤ EA,σ[ sup w∈W ∑ i,j:Aij=1 σij 1− ρ (FuDF T v )ij ] + EA,σ[ σij 1− ρ ] = 1\n1− ρ EA,σ[ sup\nw∈W ∑ i,j:Aij=1 σijtr(uiv T j D)]\nWe then use the following Lemma, which is a special case of Theorem 1 in Kakade et al. [2008] when taking ‖ · ‖ to be the matrix 2 norm and ‖ · ‖∗ (the dual norm) is the trace norm: Lemma 3. Let D := {D | D ∈ Rd×d and ‖D‖∗ ≤ D1} (where ‖W‖∗ is the trace norm of W ), and W = maxi ‖Wi‖2, then\nEσ[ sup D∈D\n1\np m∑ i=1 σitr(DWi)] ≤ 2WD1\n√ log 2d\np .\nNow the set D is {D : ‖D‖∗ ≤ t} and number of terms that Aij = 1 is p = n2(1− ρ), so using the above lemma we have\nEA,σ[ sup D∈D ∑ i,j:Aij=1 σij l̃((FuDF T v )ij , Aij)] ≤ 2 1− ρ t ( max i,j ‖uivTj ‖2 )√ log 2d √ p\n≤ 2 1− ρ\ntXuXv √ log 2d √ mn √ 1− ρ\n= 2 √ mnt √\nlog 2d√ 1− ρ XuXv.\nTherefore, 1\nmn EA,σ[ sup\nD∈D ∑ i,j:Aij=1 σij l̃((FuDF T v )ij , Aij)] ≤ 2t √ log 2d√ mn √ 1− ρ XuXv.\nCombined with other part of the proof of Theorem 3 we have\n1\nmn ∑ i,j (Mij − FuD̂F Tv )2 ≤ 6 √ log(2/δ)√ mn(1− ρ) + 4t √ log 2d√ mn √ 1− ρ XuXv.\nA.6 Proof of Theorem 7\nProof. We follow the proof for Theorem 5. Again let X = FuDF T v . First, we show that (35) is still true for the inductive case. The only difference here is to show that minX:‖X‖∗≤tRα,ρ ≥ ηminX:‖X‖∗≤tRlα,ρ(X) because now all the (i, j) elements are dependent. However, as discussed in the previous proof, if we treat each (i, j) independently, the optimal value for each (i, j) elements will be\nZij =\n{ > q if Aij = 1,\n≤ q if Aij = 0.\nBy assumption we know there exists an D with ‖FuDF Tv ‖∗ = ‖D‖∗ ≤ t and X = FuDF Tv satisfies the above condition. Therefore the value of minX:‖X‖∗≤tRα,ρ still takes the same value with Theorem 5. On the other hand, since now we enforce a more strict constraint that X = FuDF T v , Theorem 5 gives an upper bound of minD:‖D‖∗≤tRlα,ρ(FuDF T v ). Therefore, equation (35) still holds. We then also have\nRlα,ρ(FuDF T v )−min\nD Rlα,ρ(FuDF\nT v ) ≤ 6 √ log(2/δ)√ mn(1− ρ) + 4t √ log 2d√ mn √ 1− ρ XuXv (40)\nusing the similar proof to Theorem 6. Combining (40), (35) and Theorem 2, the proof is complete."
    } ],
    "references" : [ {
      "title" : "Learning classifiers from only positive and unlabeled data",
      "author" : [ "C. Elkan", "K. Noto" ],
      "venue" : null,
      "citeRegEx" : "Elkan and Noto.,? \\Q2012\\E",
      "shortCiteRegEx" : "Elkan and Noto.",
      "year" : 2012
    }, {
      "title" : "Provable inductive matrix completion",
      "author" : [ "P. Jain", "I.S. Dhillon" ],
      "venue" : "CoRR, abs/1306.0626,",
      "citeRegEx" : "2014",
      "shortCiteRegEx" : "2014",
      "year" : 2013
    }, {
      "title" : "Some estimates of norms of random matrices",
      "author" : [ "R. Latala" ],
      "venue" : "Proceedings of the AMS,",
      "citeRegEx" : "2003",
      "shortCiteRegEx" : "2003",
      "year" : 2005
    }, {
      "title" : "Calibrated asymmetric surrogate losses",
      "author" : [ "C. Scott" ],
      "venue" : "Electronic J. of Stat.,",
      "citeRegEx" : "2013",
      "shortCiteRegEx" : "2013",
      "year" : 2012
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "In the context of classification, methods for learning in the presence of positive and unlabeled examples only, called positive-unlabeled (PU in short) learning, have been studied in the past [Elkan and Noto, 2008, Liu et al., 2003]. For matrix completion, can one guarantee recovery when only a subset of positive entries is observed? In this paper, we formulate the PU matrix completion problem and answer the question in the affirmative under different settings. Minimizing squared loss on the observed entries corresponding to 1’s, subject to the low-rank constraints, yields a degenerate solution — the rank-1 matrix with all its entries equal to 1 achieves zero loss. In practice, a popular heuristic used is to try and complete the matrix by treating some or all of the missing observations as true 0’s, which seems to be a good strategy when the underlying matrix has a small number of positive examples, i.e., small number of 1’s. This motivates viewing the problem of learning from only positive samples as a certain noisy matrix completion problem. Existing theory for noise-tolerant matrix completion [Candès and Plan, 2009, Davenport et al., 2012] does not sufficiently address recoverability under PU learning (see Section 2). In our work, we assume that the true matrix M ∈ Rm×n has a bounded nuclear norm ‖M‖∗. The PU learning model for matrix completion is specified by a certain one-bit quantization process that generates a binary matrix Y from M and a one-sided sampling process that reveals a subset of positive entries of Y . In particular, we consider two recovery settings for PU matrix completion: The first setting is non-deterministic — M parameterizes a probability distribution which is used to generate the entries of Y . We show that it is possible to recover M using only a subset of positive entries of Y . The idea is to minimize an unbiased estimator of the squared loss between the estimated and the observed “noisy” entries, motivated by the approach in Natarajan et al. [2013]. We recast the objective as a “shifted matrix completion” problem that facilitates in obtaining a scalable optimization algorithm.",
      "startOffset" : 193,
      "endOffset" : 2015
    }, {
      "referenceID" : 0,
      "context" : "In the context of classification, methods for learning in the presence of positive and unlabeled examples only, called positive-unlabeled (PU in short) learning, have been studied in the past [Elkan and Noto, 2008, Liu et al., 2003]. For matrix completion, can one guarantee recovery when only a subset of positive entries is observed? In this paper, we formulate the PU matrix completion problem and answer the question in the affirmative under different settings. Minimizing squared loss on the observed entries corresponding to 1’s, subject to the low-rank constraints, yields a degenerate solution — the rank-1 matrix with all its entries equal to 1 achieves zero loss. In practice, a popular heuristic used is to try and complete the matrix by treating some or all of the missing observations as true 0’s, which seems to be a good strategy when the underlying matrix has a small number of positive examples, i.e., small number of 1’s. This motivates viewing the problem of learning from only positive samples as a certain noisy matrix completion problem. Existing theory for noise-tolerant matrix completion [Candès and Plan, 2009, Davenport et al., 2012] does not sufficiently address recoverability under PU learning (see Section 2). In our work, we assume that the true matrix M ∈ Rm×n has a bounded nuclear norm ‖M‖∗. The PU learning model for matrix completion is specified by a certain one-bit quantization process that generates a binary matrix Y from M and a one-sided sampling process that reveals a subset of positive entries of Y . In particular, we consider two recovery settings for PU matrix completion: The first setting is non-deterministic — M parameterizes a probability distribution which is used to generate the entries of Y . We show that it is possible to recover M using only a subset of positive entries of Y . The idea is to minimize an unbiased estimator of the squared loss between the estimated and the observed “noisy” entries, motivated by the approach in Natarajan et al. [2013]. We recast the objective as a “shifted matrix completion” problem that facilitates in obtaining a scalable optimization algorithm. The second setting is deterministic — Y is obtained by thresholding the entries of M (modeling how the users vote), and then a subset of positive entries of Y is revealed. While recovery of M is not possible (see Section 2), we show that we can recover Y with low error. To this end, we propose a scalable biased matrix completion method where the observed and the unobserved entries of Y are penalized differently. Recently, an inductive approach to matrix completion was proposed [Jain and Dhillon, 2013] where the matrix entries are modeled as a bilinear function of real-valued features associated with the rows and the columns. We extend our methods under the two aforementioned settings to the inductive matrix completion problem and establish similar recovery guarantees. Our contributions are summarized below: 1. To the best of our knowledge, this is the first paper to formulate and study PU learning for matrix completion, necessitated by the applications of matrix completion. Furthermore, we extend our results to the recently proposed inductive matrix completion problem. 2. We provide strong guarantees for recovery; for example, in the non-deterministic setting, the error in recovering an n × n matrix is O( 1 (1−ρ)n) for our method compared to O( 1 (1−ρ) √ n ) implied by the method in Davenport et al. [2012], where (1 − ρ) is the fraction of observed 1’s.",
      "startOffset" : 193,
      "endOffset" : 3474
    }, {
      "referenceID" : 3,
      "context" : "[2013], Yi et al. [2013], we assume the features are good enough such that M = Fu(Fu) MFv(Fv) T .",
      "startOffset" : 1,
      "endOffset" : 25
    }, {
      "referenceID" : 2,
      "context" : "We compare with competing link prediction methods [Kiben-Nowell and Kleinberg, 2003] Common Neighbors, Katz, and SVD-Katz (compute Katz using the rank-k approximation, A ≈ UkΣkVk). Note that the classical matrix factorization approach in this case is equivalent to SVD on the given 0-1 training matrix, and SVD-Katz slightly improves over SVD by further computing the Katz values based on the low rank approximation (see Kiben-Nowell and Kleinberg [2003]), so we omit the SVD results in the figures.",
      "startOffset" : 79,
      "endOffset" : 455
    } ],
    "year" : 2014,
    "abstractText" : "In this paper, we consider the matrix completion problem when the observations are one-bit measurements of some underlying matrix M , and in particular the observed samples consist only of ones and no zeros. This problem is motivated by modern applications such as recommender systems and social networks where only “likes” or “friendships” are observed. The problem of learning from only positive and unlabeled examples, called PU (positive-unlabeled) learning, has been studied in the context of binary classification. We consider the PU matrix completion problem, where an underlying real-valued matrix M is first quantized to generate one-bit observations and then a subset of positive entries is revealed. Under the assumption that M has bounded nuclear norm, we provide recovery guarantees for two different observation models: 1) M parameterizes a distribution that generates a binary matrix, 2) M is thresholded to obtain a binary matrix. For the first case, we propose a “shifted matrix completion” method that recovers M using only a subset of indices corresponding to ones, while for the second case, we propose a “biased matrix completion” method that recovers the (thresholded) binary matrix. Both methods yield strong error bounds — if M ∈ Rn×n, the Frobenius error is bounded as O ( 1 (1−ρ)n ) , where 1−ρ denotes the fraction of ones observed. This implies a sample complexity of O(n log n) ones to achieve a small error, when M is dense and n is large. We extend our methods and guarantees to the recently proposed inductive matrix completion problem, where rows and columns of M have associated features. We provide efficient and scalable optimization procedures for both the methods and demonstrate the effectiveness of the proposed methods for link prediction (on real-world networks consisting of over 2 million nodes and 90 million links) and semi-supervised clustering tasks.",
    "creator" : "LaTeX with hyperref package"
  }
}