{
  "name" : "1411.6305.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Revenue Optimization in Posted-Price Auctions with Strategic Buyers",
    "authors" : [ "Mehryar Mohri", "Andres Muñoz" ],
    "emails" : [ "mohri@cims.nyu.edu", "munoz@cims.nyu.edu" ],
    "sections" : [ {
      "heading" : null,
      "text" : "√ T ). We then introduce a new algorithm that achieves a strategic regret\ndiffering from the lower bound only by a factor in O(log T ), an exponential improvement upon the previous best algorithm. Our new algorithm admits a natural analysis and simpler proofs, and the ideas behind its design are general. We also report the results of empirical evaluations comparing our algorithm with the previous state of the art and show a consistent exponential improvement in several different scenarios."
    }, {
      "heading" : "1 Introduction",
      "text" : "Auctions have long been an active area of research in Economics and Game Theory [Vickrey, 2012, Milgrom and Weber, 1982, Ostrovsky and Schwarz, 2011]. In the past decade, however, the advent of online advertisement has prompted a more algorithmic study of auctions, including the design of learning algorithms for revenue maximization for generalized second-price auctions or second-price auctions with reserve [Cesa-Bianchi et al., 2013, Mohri and Muñoz Medina, 2014, He et al., 2013].\nThese studies have been largely motivated by the widespread use of AdExchanges and the vast amount of historical data thereby collected – AdExchanges are advertisement selling platforms using second-price auctions with reserve price to allocate advertisement space. Thus far, the learning algorithms proposed for revenue maximization in these auctions critically rely on the assumption that the bids, that is, the outcomes of auctions, are drawn i.i.d. according to some unknown distribution. However, this assumption may not hold in practice. In particular, with the knowledge that a revenue optimization algorithm is being used, an advertiser could seek to mislead the publisher by under-bidding. In fact, consistent empirical evidence of strategic behavior by advertisers has been found by Edelman and Ostrovsky [2007]. This motivates the analysis presented in this paper of the interactions between sellers and strategic buyers, that is, buyers that may act non-truthfully with the goal of maximizing their surplus.\nThe scenario we consider is that of posted-price auctions, which, albeit simpler than other mechanisms, in fact matches a common situation in AdExchanges where many auctions admit a single bidder. In this setting, second-price auctions with reserve are equivalent to posted-price auctions: a seller sets a reserve price for a good and the buyer decides whether or not to accept it (that is to bid higher than the reserve price). In order to capture the buyer’s strategic behavior, we will analyze an online scenario: at each time t, a price pt is offered by the seller and the buyer must decide to either accept it or leave it. This scenario can be modeled as a two-player repeated non-zero sum game with\nar X\niv :1\n41 1.\n63 05\nv1 [\ncs .L\nG ]\n2 3\nN ov\nincomplete information, where the seller’s objective is to maximize his revenue, while the advertiser seeks to maximize her surplus as described in more detail in Section 2.\nThe literature on non-zero sum games is very rich [Nachbar, 1997, 2001, Morris, 1994], but much of the work in that area has focused on characterizing different types of equilibria, which is not directly relevant to the algorithmic questions arising here. Furthermore, the problem we consider admits a particular structure that can be exploited to design efficient revenue optimization algorithms.\nFrom the seller’s perspective, this game can also be viewed as a bandit problem [Kuleshov and Precup, 2010, Robbins, 1985] since only the revenue (or reward) for the prices offered is accessible to the seller. Kleinberg and Leighton [2003] precisely studied this continuous bandit setting under the assumption of an oblivious buyer, that is, one that does not exploit the seller’s behavior (more precisely, the authors assume that at each round the seller interacts with a different buyer). The authors presented a tight regret bound of Θ(log log T ) for the scenario of a buyer holding a fixed valuation and a regret bound of O(T 2 3 ) when facing an adversarial buyer by using an elegant reduction to a discrete bandit problem. However, as argued by Amin et al. [2013], when dealing with a strategic buyer, the usual definition of regret is no longer meaningful. Indeed, consider the following example: let the valuation of the buyer be given by v ∈ [0, 1] and assume that an algorithm with sublinear regret such as Exp3 [Auer et al., 2002b] or UCB [Auer et al., 2002a] is used for T rounds by the seller. A possible strategy for the buyer, knowing the seller’s algorithm, would be to accept prices only if they are smaller than some small value , certain that the seller would eventually learn to offer only prices less than . If v, the buyer would considerably boost her surplus while, in theory, the seller would have not incurred a large regret since in hindsight, the best fixed strategy would have been to offer price for all rounds. This, however is clearly not optimal for the seller. The stronger notion of policy regret introduced by Arora et al. [2012] has been shown to be the appropriate one for the analysis of bandit problems with adaptive adversaries. However, for the example just described, a sublinear policy regret can be similarly achieved. Thus, this notion of regret is also not the pertinent one for the study of our scenario.\nWe will adopt instead the definition of strategic-regret, which was introduced by Amin et al. [2013] precisely for the study of this problem. This notion of regret also matches the concept of learning loss introduced by [Agrawal, 1995] when facing an oblivious adversary. Using this definition, Amin et al. [2013] presented both upper and lower bounds for the regret of a seller facing a strategic buyer and showed that the buyer’s surplus must be discounted over time in order to be able to achieve sublinear regret (see Section 2). However, the gap between the upper and lower bounds they presented is in O( √ T ). In the following, we analyze a very broad family of monotone regret minimization algorithms for this problem (Section 3), which includes the algorithm of Amin et al. [2013], and show that no algorithm in that family admits a strategic regret more favorable than Ω( √ T ). Next, we introduce a nearly-optimal algorithm that achieves a strategic regret differing from the lower bound at most by a factor in O(log T ) (Section 4). This represents an exponential improvement upon the existing best algorithm for this setting. Our new algorithm admits a natural analysis and simpler proofs. A key idea behind its design is a method deterring the buyer from lying, that is rejecting prices below her valuation."
    }, {
      "heading" : "2 Setup",
      "text" : "We consider the following game played by a buyer and a seller. A good, such as an advertisement space, is repeatedly offered for sale by the seller to the buyer over T rounds. The buyer holds a private valuation v ∈ [0, 1] for that good. At each round t = 1, . . . , T , a price pt is offered by the seller and a decision at ∈ {0, 1} is made by the buyer. at takes value 1 when the buyer accepts to buy at that price, 0 otherwise. We will say that a buyer lies whenever at = 0 while pt < v. At the beginning of the game, the algorithm A used by the seller to set prices is announced to the buyer. Thus, the buyer plays strategically against this algorithm. The knowledge of A is a standard assumption in mechanism design and also matches the practice in AdExchanges.\nFor any γ ∈ (0, 1), define the discounted surplus of the buyer as follows:\nSur(A, v) = T∑ t=1 γt−1at(v − pt). (1)\nThe value of the discount factor γ indicates the strength of the preference of the buyer for current surpluses versus future ones. The performance of a seller’s algorithm is measured by the notion of strategic-regret [Amin et al., 2013] defined as follows:\nReg(A, v) = Tv − T∑ t=1 atpt. (2)\nThe buyer’s objective is to maximize his discounted surplus, while the seller seeks to minimize his regret. Note that, in view of the discounting factor γ, the buyer is not fully adversarial. The problem consists of designing algorithms achieving sublinear strategic regret (that is a regret in o(T )).\nThe motivation behind the definition of strategic-regret is straightforward: a seller, with access to the buyer’s valuation, can set a fixed price for the good close to this value. The buyer, having no control on the prices offered, has no option but to accept this price in order to optimize his utility. The revenue per round of the seller is therefore v− . Since there is no scenario where higher revenue can be achieved, this is a natural setting to compare the performance of our algorithm.\nTo gain more intuition about the problem, let us examine some of the complications arising when dealing with a strategic buyer. Suppose the seller attempts to learn the buyer’s valuation v by performing a binary search. This would be a natural algorithm when facing a truthful buyer. However, in view of the buyer’s knowledge of the algorithm, for γ 0, it is in her best interest to lie on the initial rounds, thereby quickly, in fact exponentially, decreasing the price offered by the seller. The seller would then incur an Ω(T ) regret. A binary search approach is therefore “too aggressive”. Indeed, an untruthful buyer can manipulate the seller into offering prices less than v/2 by lying about her value even just once! This discussion suggests following a more conservative approach. In the next section, we discuss a natural family of conservative algorithms for this problem."
    }, {
      "heading" : "3 Monotone algorithms",
      "text" : "The following conservative pricing strategy was introduced by Amin et al. [2013]. Let p1 = 1 and β < 1. If price pt is rejected at round t, the lower price pt+1 = βpt is offered at the next round. If at any time price pt is accepted, then this price is offered for all the remaining rounds. We will denote this algorithm by monotone. The motivation behind its design is clear: for a suitable choice of β, the seller can slowly decrease the prices offered, thereby pressing the buyer to reject many prices (which is not convenient for her) before obtaining a favorable price. The authors present an O(Tγ √ T ) regret bound for this algorithm, with Tγ = 1/(1− γ). A more careful analysis shows\nthat this bound can be further tightened to O( √ TγT + √ T ) when the discount factor γ is known to the seller.\nDespite its sublinear regret, the monotone algorithm remains sub-optimal for certain choices of γ. Indeed, consider a scenario with γ 1. For this setting, the buyer would no longer have an incentive to lie, thus, an algorithm such as binary search would achieve logarithmic regret, while the regret achieved by the monotone algorithm is only guaranteed to be in O( √ T ).\nOne may argue that the monotone algorithm is too specific since it admits a single parameter β and that perhaps a more complex algorithm with the same monotonic idea could achieve a more favorable regret. Let us therefore analyze a generic monotone algorithmAm defined by Algorithm 1. Definition 1. For any buyer’s valuation v ∈ [0, 1], define the acceptance time κ∗ = κ∗(v) as the first time a price offered by the seller using algorithm Am is accepted. Proposition 1. For any decreasing sequence of prices (pt)Tt=1, there exists a truthful buyer with valuation v0 such that algorithm Am suffers regret of at least\nReg(Am, v0) ≥ 1\n4\n√ T − √ T .\nProof. By definition of the regret, we have Reg(Am, v) = vκ∗ + (T − κ∗)(v − pκ∗). We can consider two cases: κ∗(v0) > √ T for some v0 ∈ [1/2, 1] and κ∗(v) ≤ √ T for every v ∈ [1/2, 1].\nIn the former case, we have Reg(Am, v0) ≥ v0 √ T ≥ 12 √ T , which implies the statement of the proposition. Thus, we can assume the latter condition.\nAlgorithm 1 Family of monotone algorithms. Let p1 = 1 and pt ≤ pt−1 for t = 2, . . . T . t← 1 p← pt Offer price p while (Buyer rejects p) and (t < T ) do\nt← t+ 1 p← pt Offer price p\nend while while (t < T ) do\nt← t+ 1 Offer price p\nend while\nAlgorithm 2 Definition of Ar . n = the root of T (T ) while Offered prices less than T do\nOffer price pn if Accepted then\nn = r(n) else\nOffer price pn for r rounds n = l(n)\nend if end while\nLet v be uniformly distributed over [ 12 , 1]. In view of Lemma 4 (see Appendix 8.1), we have\nE[vκ∗] + E[(T − κ∗)(v − pκ∗)] ≥ 1\n2 E[κ∗] + (T −\n√ T )E[(v − pκ∗)] ≥ 1\n2 E[κ∗] +\nT − √ T 32E[κ∗] .\nThe right-hand side is minimized for E[κ∗] = √ T− √ T\n4 . Plugging in this value yields\nE[Reg(Am, v)] ≥ √ T− √ T 4 , which implies the existence of v0 with Reg(Am, v0) ≥ √ T− √ T 4 .\nWe have thus shown that any monotone algorithmAm suffers a regret of at least Ω( √ T ), even when facing a truthful buyer. A tighter lower bound can be given under a mild condition on the prices offered.\nDefinition 2. A sequence (pt)Tt=1 is said to be convex if it verifies pt − pt+1 ≥ pt+1 − pt+2 for t = 1, . . . , T − 2.\nAn instance of a convex sequence is given by the prices offered by the monotone algorithm. A seller offering prices forming a decreasing convex sequence seeks to control the number of lies of the buyer by slowly reducing prices. The following proposition gives a lower bound on the regret of any algorithm in this family.\nProposition 2. Let (pt)Tt=1 be a decreasing convex sequence of prices. There exists a valuation v0 for the buyer such that the regret of the monotone algorithm defined by these prices is Ω( √ TCγ +√\nT ), where Cγ = γ2(1−γ) .\nThe full proof of this proposition is given in Appendix 8.1. The proposition shows that when the discount factor γ is known, the monotone algorithm is in fact asymptotically optimal in its class.\nThe results just presented suggest that the dependency on T cannot be improved by any monotone algorithm. In some sense, this family of algorithms is “too conservative”. Thus, to achieve a more favorable regret guarantee, an entirely different algorithmic idea must be introduced. In the next section, we describe a new algorithm that achieves a substantially more advantageous strategic regret by combining the fast convergence properties of a binary search-type algorithm (in a truthful setting) with a method penalizing untruthful behaviors of the buyer."
    }, {
      "heading" : "4 A nearly optimal algorithm",
      "text" : "Let A be an algorithm for revenue optimization used against a truthful buyer. Denote by T (T ) the tree associated to A after T rounds. That is, T (T ) is a full tree of height T with nodes n ∈ T (T ) labeled with the prices pn offered by A. The right and left children of n are denoted by r(n) and l(n) respectively. The price offered when pn is accepted by the buyer is the label of r(n) while the price offered by A if pn is rejected is the label of l(n). Finally, we will denote the left and right subtrees rooted at node n by L (n) and R(n) respectively. Figure 1 depicts the tree generated by an algorithm proposed by Kleinberg and Leighton [2003], which we will describe later.\nSince the buyer holds a fixed valuation, we will consider algorithms that increase prices only after a price is accepted and decrease it only after a rejection. This is formalized in the following definition. Definition 3. An algorithm A is said to be consistent if maxn′∈L (n) pn′ ≤ pn ≤ minn′∈R(n) pn′ for any node n ∈ T (T ).\nFor any consistent algorithm A, we define a modified algorithm Ar, parametrized by an integer r ≥ 1, designed to face strategic buyers. Algorithm Ar offers the same prices as A, but it is defined with the following modification: when a price is rejected by the buyer, the seller offers the same price for r rounds. The pseudocode of Ar is given in Algorithm 2. The motivation behind the modified algorithm is given by the following simple observation: a strategic buyer will lie only if she is certain that rejecting a price will boost her surplus in the future. By forcing the buyer to reject a price for several rounds, the seller ensures that the future discounted surplus will be negligible, thereby coercing the buyer to be truthful.\nWe proceed to formally analyze algorithm Ar. In particular, we will quantify the effect of the parameter r on the choice of the buyer’s strategy. To do so, a measure of the spread of the prices offered by Ar is needed. Definition 4. For any node n ∈ T (T ) define the right increment of n as δrn := pr(n)−pn. Similarly, define its left increment to be δln := maxn′∈L (n) pn − pn′ .\nThe prices offered by Ar define a path in T (T ). For each node in this path, we can define time t(n) to be the number of rounds needed for this node to be reached by Ar. Note that, since r may be greater than 1, the path chosen by Ar might not necessarily reach the leaves of T (T ). Finally, let S : n 7→ S(n) be the function representing the surplus obtained by the buyer when playing an optimal strategy against Ar after node n is reached. Lemma 1. The function S satisfies the following recursive relation:\nS(n) = max(γt(n)−1(v − pn) + S(r(n)),S(l(n))). (3)\nProof. Define a weighted tree T ′(T ) ⊂ T (T ) of nodes reachable by algorithm Ar. We assign weights to the edges in the following way: if an edge on T ′(T ) is of the form (n, r(n)), its weight is set to be γt(n)−1(v − pn), otherwise, it is set to 0. It is easy to see that the function S evaluates the weight of the longest path from node n to the leafs of T ′(T ). It thus follows from elementary graph algorithms that equation (3) holds.\nThe previous lemma immediately gives us necessary conditions for a buyer to reject a price. Proposition 3. For any reachable node n, if price pn is rejected by the buyer, then the following inequality holds:\nv − pn < γr\n(1− γ)(1− γr) (δln + γδ r n).\nProof. A direct implication of Lemma 1 is that price pn will be rejected by the buyer if and only if\nγt(n)−1(v − pn) + S(r(n)) < S(l(n)). (4)\nHowever, by definition, the buyer’s surplus obtained by following any path in R(n) is bounded above by S(r(n)). In particular, this is true for the path which rejects pr(n) and accepts every price afterwards. The surplus of this path is given by ∑T t=t(n)+r+1 γ\nt−1(v − p̂t) where (p̂t)Tt=t(n)+r+1 are the prices the seller would offer if price pr(n) were rejected. Furthermore, since algorithm Ar is consistent, we must have p̂t ≤ pr(n) = pn + δrn. Therefore, S(r(n)) can be bounded as follows:\nS(r(n)) ≥ T∑\nt=t(n)+r+1\nγt−1(v − pn − δrn) = γt(n)+r − γT\n1− γ (v − pn − δrn). (5)\nWe proceed to upper bound S(l(n)). Since pn − p′n ≤ δln for all n′ ∈ L (n), v − pn′ ≤ v − pn + δln and\nS(l(n)) ≤ T∑\nt=tn+r\nγt−1(v − pn + δln) = γt(n)+r−1 − γT\n1− γ (v − pn + δln). (6)\nCombining inequalities (4), (5) and (6) we conclude that\nγt(n)−1(v − pn) + γt(n)+r − γT\n1− γ (v − pn − δrn) ≤\nγt(n)+r−1 − γT\n1− γ (v − pn + δln)\n⇒ (v − pn) ( 1 + γr+1 − γr\n1− γ\n) ≤ γ rδln + γ r+1δrn − γT−t(n)+1(δrn + δln)\n1− γ\n⇒ (v − pn)(1− γr) ≤ γr(δln + γδ r n)\n1− γ .\nRearranging the terms in the above inequality yields the desired result.\nLet us consider the following instantiation of algorithm A introduced in [Kleinberg and Leighton, 2003]. The algorithm keeps track of a feasible interval [a, b] initialized to [0, 1] and an increment parameter initialized to 1/2. The algorithm works in phases. Within each phase, it offers prices a + , a + 2 , . . . until a price is rejected. If price a + k is rejected, then a new phase starts with the feasible interval set to [a+ (k− 1) , a+ k ] and the increment parameter set to 2. This process continues until b − a < 1/T at which point the last phase starts and price a is offered for the remaining rounds. It is not hard to see that the number of phases needed by the algorithm is less than dlog2 log2 T e+1. A more surprising fact is that this algorithm has been shown to achieve regret O(log log T ) when the seller faces a truthful buyer. We will show that the modification Ar of this algorithm admits a particularly favorable regret bound. We will call this algorithm PFSr (penalized fast search algorithm). Proposition 4. For any value of v ∈ [0, 1] and any γ ∈ (0, 1), the regret of algorithm PFSr admits the following upper bound:\nReg(PFSr, v) ≤ (vr + 1)(dlog2 log2 T e+ 1) + (1 + γ)γrT\n2(1− γ)(1− γr) . (7)\nNote that for r = 1 and γ → 0 the upper bound coincides with that of [Kleinberg and Leighton, 2003].\nProof. Algorithm PFSr can accumulate regret in two ways: the price offered pn is rejected, in which case the regret is v, or the price is accepted and its regret is v − pn. Let K = dlog2 log2 T e + 1 be the number of phases run by algorithm PFSr. Since at most K different prices are rejected by the buyer (one rejection per phase) and each price must be rejected for r rounds, the cumulative regret of all rejections is upper bounded by vKr.\nThe second type of regret can also be bounded straightforwardly. For any phase i, let i and [ai, bi] denote the corresponding search parameter and feasible interval respectively. If v ∈ [ai, bi], the regret accrued in the case where the buyer accepts a price in this interval is bounded by bi−ai = √ i. If, on the other hand v ≥ bi, then it readily follows that v − pn < v − bi + √ i for all prices pn offered in phase i. Therefore, the regret obtained in acceptance rounds is bounded by K∑ i=1 Ni ( (v − bi)1v>bi + √ i ) ≤ K∑ i=1 (v − bi)1v>biNi +K,\nwhere Ni ≤ 1√ i denotes the number of prices offered during the i-th round.\nFinally, notice that, in view of the algorithm’s definition, every bi corresponds to a rejected price. Thus, by Proposition 3, there exist nodes ni (not necessarily distinct) such that pni = bi and\nv − bi = v − pni ≤ γr\n(1− γ)(1− γr) (δlni + γδ r ni).\nIt is immediate that δrn ≤ 1/2 and δln ≤ 1/2 for any node n, thus, we can write K∑ i=1 (v − bi)1v>biNi ≤ γr(1 + γ) 2(1− γ)(1− γr) K∑ i=1 Ni ≤ γr(1 + γ) 2(1− γ)(1− γr) T.\nThe last inequality holds since at most T prices are offered by our algorithm. Combining the bounds for both regret types yields the result.\nWhen an upper bound on the discount factor γ is known to the seller, he can leverage this information and optimize upper bound (7) with respect to the parameter r.\nTheorem 1. Let 1/2 < γ < γ0 < 1 and r∗ = ⌈ argminr≥1 r + γr0T\n(1−γ0)(1−γr0 )\n⌉ . For any v ∈ [0, 1],\nif T > 4, the regret of PFSr∗ satisfies\nReg(PFSr∗ , v) ≤ (2vγ0Tγ0 log cT + 1 + v)(log2 log2 T + 1) + 4Tγ0 ,\nwhere c = 4 log 2.\nThe proof of this theorem is fairly technical and is deferred to the Appendix. The theorem helps us define conditions under which logarithmic regret can be achieved. Indeed, if γ0 = e−1/ log T = O(1− 1log T ), using the inequality e −x ≤ 1− x+ x2/2 valid for all x > 0 we obtain\n1 1− γ0 ≤ log\n2 T\n2 log T − 1 ≤ log T.\nIt then follows from Theorem 1 that\nReg(PFSr∗ , v) ≤ (2v log T log cT + 1 + v)(log2 log2 T + 1) + 4 log T.\nLet us compare the regret bound given by Theorem 1 with the one given by Amin et al. [2013]. The above discussion shows that for certain values of γ, an exponentially better regret can be achieved by our algorithm. It can be argued that the knowledge of an upper bound on γ is required, whereas this is not needed for the monotone algorithm. However, if γ > 1 − 1/ √ T , the regret bound on monotone is super-linear, and therefore uninformative. Thus, in order to properly compare both algorithms, we may assume that γ < 1 − 1/ √ T in which case, by Theorem 1, the regret of our algorithm is O( √ T log T ) whereas only linear regret can be guaranteed by the monotone\nalgorithm. Even under the more favorable bound of O( √ TγT + √ T ), for any α < 1 and γ < 1 − 1/Tα, the monotone algorithm will achieve regret O(T α+12 ) while a strictly better regret O(Tα log T log log T ) is attained by ours."
    }, {
      "heading" : "5 Lower bound",
      "text" : "The following lower bounds have been derived in previous work. Theorem 2 ([Amin et al., 2013]). Let γ > 0 be fixed. For any algorithm A, there exists a valuation v for the buyer such that Reg(A, v) ≥ 112Tγ .\nThis theorem is in fact given for the stochastic setting where the buyer’s valuation is a random variable taken from some fixed distribution D. However, the proof of the theorem selects D to be a point mass, therefore reducing the scenario to a fixed priced setting. Theorem 3 ( [Kleinberg and Leighton, 2003]). Given any algorithm A to be played against a truthful buyer, there exists a value v ∈ [0, 1] such that Reg(A, v) ≥ C log log T for some universal constant C.\nCombining these results leads immediately to the following. Corollary 1. Given any algorithm A, there exists a buyer’s valuation v ∈ [0, 1] such that Reg(A, v) ≥ max ( 1 12Tγ , C log log T ) , for a universal constant C.\nWe now compare the upper bounds given in the previous section with the bound of Corollary 1. For γ > 1/2, we have Reg(PFSr, v) = O(Tγ log T log log T ). On the other hand, for γ ≤ 1/2, we may choose r = 1, in which case, by Proposition 4, Reg(PFSr, v) = O(log log T ). Thus, the upper and lower bounds match up to an O(log T ) factor."
    }, {
      "heading" : "6 Empirical results",
      "text" : "In this section, we present the result of simulations comparing the monotone algorithm and our algorithm PFSr. The experiments were carried out as follows: given a buyer’s valuation v, a discrete set of false valuations v̂ were selected out of the set {.03, .06, . . . , v}. Both algorithms were run against a buyer making the seller believe her valuation is v̂ instead of v. The value of v̂ achieving the best utility for the buyer was chosen and the regret for both algorithms is reported in Figure 2.\nWe considered two sets of experiments. First, the value of parameter γ was left unknown to both algorithms and the value of r was set to log(T ). This choice is motivated by the discussion following Theorem 1 since, for large values of T , we can expect to achieve logarithmic regret. The first two plots (from left to right) in Figure 2 depict these results. The apparent stationarity in the regret of PFSr is just a consequence of the scale of the plots as the regret is in fact growing as log(T ). For the second set of experiments, we allowed access to the parameter γ to both algorithms. The value of r was chosen optimally based on the results of Theorem 1 and the parameter β of monotone was set to 1 − 1/ √ TTγ to ensure regret in O( √ TTγ + √ T ). It is worth noting that even though our algorithm was designed under the assumption of some knowledge about the value of γ, the experimental results show that an exponentially better performance over the monotone algorithm is still attainable and in fact the performances of the optimized and unoptimized versions of our algorithm are comparable. A more comprehensive series of experiments is presented in Appendix 9."
    }, {
      "heading" : "7 Conclusion",
      "text" : "We presented a detailed analysis of revenue optimization algorithms against strategic buyers. In doing so, we reduced the gap between upper and lower bounds on strategic regret to a logarithmic factor. Furthermore, the algorithm we presented is simple to analyze and reduces to the truthful scenario in the limit of γ → 0, an important property that previous algorithms did not admit. We believe that our analysis helps gain a deeper understanding of this problem and that it can serve as a tool for studying more complex scenarios such as that of strategic behavior in repeated second-price auctions, VCG auctions and general market strategies."
    }, {
      "heading" : "Acknowledgments",
      "text" : "We thank Kareem Amin, Afshin Rostamizadeh and Umar Syed for several discussions about the topic of this paper. This work was partly funded by the NSF award IIS-1117591."
    }, {
      "heading" : "8 Appendix",
      "text" : "Lemma 2. The function g : γ 7→ log 1 γ\n1−γ is decreasing over the interval (0, 1).\nProof. This can be straightforwardly established:\ng′(γ) = − 1−γγ + log 1 γ\n(1− γ)2 = γ log\n( 1− [ 1− 1γ ]) − (1− γ)\nγ(1− γ)2 < (1− γ)− (1− γ) γ(1− γ)2 = 0,\nusing the inequality log(1− x) < −x valid for all x < 0.\nLemma 3. Let a ≥ 0 and let g : D ⊂ R → [a,∞) be a decreasing and differentiable function. Then, the function F : R→ R defined by\nF (γ) = g(γ)− √ g(γ)2 − b\nis increasing for all values of b ∈ [0, a].\nProof. We will show that F ′(γ) ≥ 0 for all γ ∈ D. Since F ′ = g′[1 − g(g2 − b)−1/2] and g′ ≤ 0 by hypothesis, the previous statement is equivalent to showing that √ g2 − b ≤ g which is trivially verified since b ≥ 0.\nTheorem 1. Let 1/2 < γ < γ0 < 1 and r∗ = ⌈ argminr≥1 r + γr0T\n(1−γ0)(1−γr0 )\n⌉ . For any v ∈ [0, 1],\nif T > 4, the regret of PFSr∗ satisfies\nReg(PFSr∗ , v) ≤ (2vγ0Tγ0 log cT + 1 + v)(log2 log2 T + 1) + 4Tγ0 ,\nwhere c = 4 log 2.\nProof. It is not hard to verify that the function r 7→ r + γ r 0T\n(1−γ0)(1−γr0 ) is convex and approaches\ninfinity as r → ∞. Thus, it admits a minimizer r̄∗ whose explicit expression can be found by solving the following equation\n0 = d\ndr\n( r +\nγr0T\n(1− γ0)(1− γr0)\n) = 1 +\nγr0T log γ0 (1− γ0)(1− γr0)2 .\nSolving the corresponding second-degree equation yields\nγr̄ ∗ 0 = 2 + T log(1/γ0)1−γ0 −\n√( 2 + T log(1/γ0)1−γ0 )2 − 4\n2 =: F (γ0).\nBy Lemmas 2 and 3, the function F thereby defined is increasing. Therefore, γr̄ ∗\n0 ≤ limγ0→1 F (γ0) and\nγr̄ ∗ 0 ≤ 2 + T − √ (2 + T )2 − 4 2 = 4 2(2 + T + √ (2 + T )2 − 4) ≤ 2 T . (8)\nBy the same argument, we must have γr̄ ∗\n0 ≥ F (1/2), that is\nγr̄ ∗ 0 ≥ F (1/2) = 2 + 2T log 2− √ (2 + 2T log 2)2 − 4 2\n= 4 2(2 + 2T log 2 + √ (2 + 2T log 2)2 − 4)\n≥ 2 4 + 4T log 2 ≥ 1 4T log 2 .\nThus,\nr∗ = dr̄∗e ≤ log(1/F (1/2)) log(1/γ0) + 1 ≤ log(4T log 2) log 1/γ0 + 1. (9)\nCombining inequalities (8) and (9) with (7) gives Reg(PFSr∗ , v) ≤ ( v log(4T log 2)\nlog 1/γ0 + 1 + v\n) (dlog2 log2 T e+ 1) +\n(1 + γ0)T\n(1− γ0)(T − 2) ≤ (2vγ0Tγ0 log(cT ) + 1 + v)(dlog2 log2 T e+ 1) + 4Tγ0 ,\nusing the inequality log( 1γ ) ≥ 1−γ 2γ valid for all γ ∈ (1/2, 1)."
    }, {
      "heading" : "8.1 Lower bound for monotone algorithms",
      "text" : "Lemma 4. Let (pt)Tt=1 be a decreasing sequence of prices. Assume that the seller faces a truthful buyer. Then, if v is sampled uniformly at random in the interval [ 12 , 1], the following inequality holds:\nE[κ∗] ≥ 1 32E[v − pκ∗ ] .\nProof. Since the buyer is truthful, κ∗(v) = κ if and only if v ∈ [pκ, pκ−1]. Thus, we can write\nE[v − pκ∗ ] = κmax∑ κ=2 E [ 1v∈[pκ,pκ−1](v − pκ) ] = κmax∑ κ=2 ∫ pκ−1 pκ (v − pκ) dv = κmax∑ κ=2 (pκ−1 − pκ)2 2 ,\nwhere κmax = κ∗( 12 ). Thus, by the Cauchy-Schwarz inequality, we can write\nE [ κ∗∑ κ=2 pκ−1 − pκ ] ≤ E  √√√√κ∗ κ∗∑ κ=2 (pκ−1 − pκ)2  ≤ E\n√√√√κ∗ κmax∑ κ=2 (pκ−1 − pκ)2  = E [√ 2κ∗E[v − pκ∗ ]\n] ≤ √ E[κ∗] √\n2E[v − p∗κ],\nwhere the last step holds by Jensen’s inequality. In view of that, since v > pκ∗ , it follows that:\n3 4 = E[v] ≥ E[pκ∗ ] = E [ κ∗∑ κ=2 pκ − pκ−1 ] + p1 ≥ − √ E[κ∗] √ 2E[v − pκ∗ ] + 1.\nSolving for E[κ∗] concludes the proof.\nThe following lemma characterizes the value of κ∗ when facing a strategic buyer.\nLemma 5. For any v ∈ [0, 1], κ∗ satisfies v − pκ∗ ≥ Cκ ∗ γ (pκ∗ − pκ∗+1) with Cκ ∗ γ = γ−γT−κ\n∗+1\n1−γ . Furthermore, when κ∗ ≤ 1+ √ TγT and T ≥ Tγ + 2 log(2/γ)log(1/γ) , C κ∗\nγ can be replaced by the universal constant Cγ = γ2(1−γ) .\nProof. Since an optimal strategy is played by the buyer, the surplus obtained by accepting a price at time κ∗ must be greater than the corresponding surplus obtained when accepting the first price at time κ∗ + 1. It thus follows that:\nT∑ t=κ∗ γt−1(v − pκ∗) ≥ T∑ t=κ∗+1 γt−1(v − pκ∗+1)\n⇒ γκ ∗−1(v − pκ∗) ≥ T∑ t=κ∗+1 γt−1(pκ∗ − pκ∗+1) = γκ ∗ − γT 1− γ (pκ∗ − pκ∗+1).\nDividing both sides of the inequality by γκ ∗−1 yields the first statement of the lemma. Let us verify the second statement. A straightforward calculation shows that the conditions on T imply T − √ TTγ ≥ log(2/γ)log(1/γ) , therefore\nCκ ∗ γ ≥ γ − γT−\n√ TγT\n1− γ ≥ γ − γ\nlog(2/γ) log(1/γ)\n1− γ = γ − γ2 1− γ = γ 2(1− γ) .\nProposition 5. For any convex decreasing sequence (pt)Tt=1, if T ≥ Tγ + 2 log(2/γ) log(1/γ) , then there exists a valuation v0 ∈ [ 12 , 1] for the buyer such that\nReg(Am, v0) ≥ max 1 8 √ T − √ T , √√√√Cγ(T −√TγT)(1 2 − √ Cγ T ) = Ω(√T +√CγT ). Proof. In view of Proposition 1, we only need to verify that there exists v0 ∈ [ 12 , 1] such that\nReg(Am, v0) ≥ √√√√Cγ(T −√TγT)(1 2 − √ Cγ T ) .\nLet κmin = κ∗(1), and κmax = κ∗( 12 ). If κmin > 1 + √ TγT , then Reg(Am, 1) ≥ 1 + √ TγT , from which the statement of the proposition can be derived straightforwardly. Thus, in the following we will only consider the case κmin ≤ 1+ √ TγT . Since, by definition, the inequality 12 ≥ pκmax holds, we can write 1\n2 ≥ pκmax = κmax∑ κ=κmin+1 (pκ − pκ−1) + pκmin ≥ κmax(pκmin+1 − pκmin) + pκmin ,\nwhere the last inequality holds by the convexity of the sequence and the fact that pκmin − pκmin−1 ≤ 0. The inequality is equivalent to pκmin − pκmin+1 ≥ pκmin− 1 2 κmax . Furthermore, by Lemma 5, we have\nmax v∈[ 12 ,1] Reg(Am, v) ≥ max (κmax, (T − κmin)(pκmin − pκmin+1))\n≥ max ( κmax, Cγ\n(T − κmin)(pκmin − 12 ) κmax\n) .\nThe right-hand side is minimized for κmax = √ Cγ(T − κmin)(pκmin − 12 ). Thus, there exists a valuation v0 for which the following inequality holds:\nReg(Am, v0) ≥ √ Cγ(T − κmin) ( pκmin − 1\n2\n) ≥ √ Cγ ( T − √ TγT )( pκmin − 1\n2\n) .\nFurthermore, we can assume that pκmin ≥ 1 − √ Cγ T otherwise Reg(Am, 1) ≥ (T − 1) √ Cγ/T , which is easily seen to imply the desired lower bound. Thus, there exists a valuation v0 such that\nReg(Am, v0) ≥ √√√√Cγ(T −√TγT)(1 2 − √ Cγ T ) ,\nwhich concludes the proof."
    }, {
      "heading" : "9 Simulations",
      "text" : "Here, we present the results of more extensive simulations for PFSr and the monotone algorithm. Again, we consider two different scenarios. Figure 3 shows the experimental results for an agnostic scenario where the value of the parameter γ remains unknown to both algorithms and where the parameter r of PFSr is set to log(T ). The results reported in Figure 4 correspond to the second scenario where the discounting factor γ is known to the algorithms and where the parameter β for the monotone algorithm is set to 1−1/ √ TTγ . The scale on the plots is logarithmic in the number of rounds and in the regret."
    } ],
    "references" : [ {
      "title" : "The continuum-armed bandit problem",
      "author" : [ "R. Agrawal" ],
      "venue" : "SIAM journal on control and optimization,",
      "citeRegEx" : "Agrawal.,? \\Q1926\\E",
      "shortCiteRegEx" : "Agrawal.",
      "year" : 1926
    }, {
      "title" : "Learning prices for repeated auctions with strategic buyers",
      "author" : [ "K. Amin", "A. Rostamizadeh", "U. Syed" ],
      "venue" : "In Proceedings of NIPS,",
      "citeRegEx" : "Amin et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Amin et al\\.",
      "year" : 2013
    }, {
      "title" : "Online bandit learning against an adaptive adversary: from regret to policy regret",
      "author" : [ "R. Arora", "O. Dekel", "A. Tewari" ],
      "venue" : "In Proceedings of ICML,",
      "citeRegEx" : "Arora et al\\.,? \\Q2012\\E",
      "shortCiteRegEx" : "Arora et al\\.",
      "year" : 2012
    }, {
      "title" : "Finite-time analysis of the multiarmed bandit problem",
      "author" : [ "P. Auer", "N. Cesa-Bianchi", "P. Fischer" ],
      "venue" : "Machine Learning,",
      "citeRegEx" : "Auer et al\\.,? \\Q2002\\E",
      "shortCiteRegEx" : "Auer et al\\.",
      "year" : 2002
    }, {
      "title" : "The nonstochastic multiarmed bandit problem",
      "author" : [ "P. Auer", "N. Cesa-Bianchi", "Y. Freund", "R.E. Schapire" ],
      "venue" : "SIAM J. Comput.,",
      "citeRegEx" : "Auer et al\\.,? \\Q2002\\E",
      "shortCiteRegEx" : "Auer et al\\.",
      "year" : 2002
    }, {
      "title" : "Regret minimization for reserve prices in second-price auctions",
      "author" : [ "N. Cesa-Bianchi", "C. Gentile", "Y. Mansour" ],
      "venue" : "In Proceedings of SODA,",
      "citeRegEx" : "Cesa.Bianchi et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Cesa.Bianchi et al\\.",
      "year" : 2013
    }, {
      "title" : "Strategic bidder behavior in sponsored search auctions",
      "author" : [ "B. Edelman", "M. Ostrovsky" ],
      "venue" : "Decision Support Systems,",
      "citeRegEx" : "Edelman and Ostrovsky.,? \\Q2007\\E",
      "shortCiteRegEx" : "Edelman and Ostrovsky.",
      "year" : 2007
    }, {
      "title" : "A game-theoretic machine learning approach for revenue maximization in sponsored search",
      "author" : [ "D. He", "W. Chen", "L. Wang", "T. Liu" ],
      "venue" : "In Proceedings of IJCAI,",
      "citeRegEx" : "He et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "He et al\\.",
      "year" : 2013
    }, {
      "title" : "The value of knowing a demand curve: Bounds on regret for online posted-price auctions",
      "author" : [ "R.D. Kleinberg", "F.T. Leighton" ],
      "venue" : "In Proceedings of FOCS,",
      "citeRegEx" : "Kleinberg and Leighton.,? \\Q2003\\E",
      "shortCiteRegEx" : "Kleinberg and Leighton.",
      "year" : 2003
    }, {
      "title" : "Algorithms for the multi-armed bandit problem",
      "author" : [ "V. Kuleshov", "D. Precup" ],
      "venue" : "Journal of Machine Learning,",
      "citeRegEx" : "Kuleshov and Precup.,? \\Q2010\\E",
      "shortCiteRegEx" : "Kuleshov and Precup.",
      "year" : 2010
    }, {
      "title" : "A theory of auctions and competitive bidding",
      "author" : [ "P. Milgrom", "R. Weber" ],
      "venue" : "Econometrica: Journal of the Econometric Society,",
      "citeRegEx" : "Milgrom and Weber.,? \\Q1982\\E",
      "shortCiteRegEx" : "Milgrom and Weber.",
      "year" : 1982
    }, {
      "title" : "Learning theory and algorithms for revenue optimization in second-price auctions with reserve",
      "author" : [ "M. Mohri", "A. Muñoz Medina" ],
      "venue" : "In Proceedings of ICML,",
      "citeRegEx" : "Mohri and Medina.,? \\Q2014\\E",
      "shortCiteRegEx" : "Mohri and Medina.",
      "year" : 2014
    }, {
      "title" : "Non-zero-sum games. In Introduction to Game Theory, pages 115–147",
      "author" : [ "P. Morris" ],
      "venue" : null,
      "citeRegEx" : "Morris.,? \\Q1994\\E",
      "shortCiteRegEx" : "Morris.",
      "year" : 1994
    }, {
      "title" : "Bayesian learning in repeated games of incomplete information",
      "author" : [ "J. Nachbar" ],
      "venue" : "Social Choice and Welfare,",
      "citeRegEx" : "Nachbar.,? \\Q2001\\E",
      "shortCiteRegEx" : "Nachbar.",
      "year" : 2001
    }, {
      "title" : "Prediction, optimization, and learning in repeated games",
      "author" : [ "J.H. Nachbar" ],
      "venue" : "Econometrica: Journal of the Econometric Society,",
      "citeRegEx" : "Nachbar.,? \\Q1997\\E",
      "shortCiteRegEx" : "Nachbar.",
      "year" : 1997
    }, {
      "title" : "Reserve prices in internet advertising auctions: A field experiment",
      "author" : [ "M. Ostrovsky", "M. Schwarz" ],
      "venue" : "In Proceedings of EC,",
      "citeRegEx" : "Ostrovsky and Schwarz.,? \\Q2011\\E",
      "shortCiteRegEx" : "Ostrovsky and Schwarz.",
      "year" : 2011
    }, {
      "title" : "Some aspects of the sequential design of experiments",
      "author" : [ "H. Robbins" ],
      "venue" : "In Herbert Robbins Selected Papers,",
      "citeRegEx" : "Robbins.,? \\Q1985\\E",
      "shortCiteRegEx" : "Robbins.",
      "year" : 1985
    }, {
      "title" : "Counterspeculation, auctions, and competitive sealed tenders",
      "author" : [ "W. Vickrey" ],
      "venue" : "The Journal of finance,",
      "citeRegEx" : "Vickrey.,? \\Q2012\\E",
      "shortCiteRegEx" : "Vickrey.",
      "year" : 2012
    } ],
    "referenceMentions" : [ {
      "referenceID" : 5,
      "context" : "In the past decade, however, the advent of online advertisement has prompted a more algorithmic study of auctions, including the design of learning algorithms for revenue maximization for generalized second-price auctions or second-price auctions with reserve [Cesa-Bianchi et al., 2013, Mohri and Muñoz Medina, 2014, He et al., 2013]. These studies have been largely motivated by the widespread use of AdExchanges and the vast amount of historical data thereby collected – AdExchanges are advertisement selling platforms using second-price auctions with reserve price to allocate advertisement space. Thus far, the learning algorithms proposed for revenue maximization in these auctions critically rely on the assumption that the bids, that is, the outcomes of auctions, are drawn i.i.d. according to some unknown distribution. However, this assumption may not hold in practice. In particular, with the knowledge that a revenue optimization algorithm is being used, an advertiser could seek to mislead the publisher by under-bidding. In fact, consistent empirical evidence of strategic behavior by advertisers has been found by Edelman and Ostrovsky [2007]. This motivates the analysis presented in this paper of the interactions between sellers and strategic buyers, that is, buyers that may act non-truthfully with the goal of maximizing their surplus.",
      "startOffset" : 261,
      "endOffset" : 1158
    }, {
      "referenceID" : 3,
      "context" : "Kleinberg and Leighton [2003] precisely studied this continuous bandit setting under the assumption of an oblivious buyer, that is, one that does not exploit the seller’s behavior (more precisely, the authors assume that at each round the seller interacts with a different buyer).",
      "startOffset" : 0,
      "endOffset" : 30
    }, {
      "referenceID" : 0,
      "context" : "However, as argued by Amin et al. [2013], when dealing with a strategic buyer, the usual definition of regret is no longer meaningful.",
      "startOffset" : 22,
      "endOffset" : 41
    }, {
      "referenceID" : 0,
      "context" : "However, as argued by Amin et al. [2013], when dealing with a strategic buyer, the usual definition of regret is no longer meaningful. Indeed, consider the following example: let the valuation of the buyer be given by v ∈ [0, 1] and assume that an algorithm with sublinear regret such as Exp3 [Auer et al., 2002b] or UCB [Auer et al., 2002a] is used for T rounds by the seller. A possible strategy for the buyer, knowing the seller’s algorithm, would be to accept prices only if they are smaller than some small value , certain that the seller would eventually learn to offer only prices less than . If v, the buyer would considerably boost her surplus while, in theory, the seller would have not incurred a large regret since in hindsight, the best fixed strategy would have been to offer price for all rounds. This, however is clearly not optimal for the seller. The stronger notion of policy regret introduced by Arora et al. [2012] has been shown to be the appropriate one for the analysis of bandit problems with adaptive adversaries.",
      "startOffset" : 22,
      "endOffset" : 936
    }, {
      "referenceID" : 0,
      "context" : "However, as argued by Amin et al. [2013], when dealing with a strategic buyer, the usual definition of regret is no longer meaningful. Indeed, consider the following example: let the valuation of the buyer be given by v ∈ [0, 1] and assume that an algorithm with sublinear regret such as Exp3 [Auer et al., 2002b] or UCB [Auer et al., 2002a] is used for T rounds by the seller. A possible strategy for the buyer, knowing the seller’s algorithm, would be to accept prices only if they are smaller than some small value , certain that the seller would eventually learn to offer only prices less than . If v, the buyer would considerably boost her surplus while, in theory, the seller would have not incurred a large regret since in hindsight, the best fixed strategy would have been to offer price for all rounds. This, however is clearly not optimal for the seller. The stronger notion of policy regret introduced by Arora et al. [2012] has been shown to be the appropriate one for the analysis of bandit problems with adaptive adversaries. However, for the example just described, a sublinear policy regret can be similarly achieved. Thus, this notion of regret is also not the pertinent one for the study of our scenario. We will adopt instead the definition of strategic-regret, which was introduced by Amin et al. [2013] precisely for the study of this problem.",
      "startOffset" : 22,
      "endOffset" : 1324
    }, {
      "referenceID" : 0,
      "context" : "This notion of regret also matches the concept of learning loss introduced by [Agrawal, 1995] when facing an oblivious adversary. Using this definition, Amin et al. [2013] presented both upper and lower bounds for the regret of a seller facing a strategic buyer and showed that the buyer’s surplus must be discounted over time in order to be able to achieve sublinear regret (see Section 2).",
      "startOffset" : 79,
      "endOffset" : 172
    }, {
      "referenceID" : 0,
      "context" : "This notion of regret also matches the concept of learning loss introduced by [Agrawal, 1995] when facing an oblivious adversary. Using this definition, Amin et al. [2013] presented both upper and lower bounds for the regret of a seller facing a strategic buyer and showed that the buyer’s surplus must be discounted over time in order to be able to achieve sublinear regret (see Section 2). However, the gap between the upper and lower bounds they presented is in O( √ T ). In the following, we analyze a very broad family of monotone regret minimization algorithms for this problem (Section 3), which includes the algorithm of Amin et al. [2013], and show that no algorithm in that family admits a strategic regret more favorable than Ω( √ T ).",
      "startOffset" : 79,
      "endOffset" : 648
    }, {
      "referenceID" : 1,
      "context" : "The performance of a seller’s algorithm is measured by the notion of strategic-regret [Amin et al., 2013] defined as follows:",
      "startOffset" : 86,
      "endOffset" : 105
    }, {
      "referenceID" : 1,
      "context" : "3 Monotone algorithms The following conservative pricing strategy was introduced by Amin et al. [2013]. Let p1 = 1 and β < 1.",
      "startOffset" : 84,
      "endOffset" : 103
    }, {
      "referenceID" : 8,
      "context" : "Figure 1 depicts the tree generated by an algorithm proposed by Kleinberg and Leighton [2003], which we will describe later.",
      "startOffset" : 64,
      "endOffset" : 94
    }, {
      "referenceID" : 8,
      "context" : "(a) (b) Figure 1: (a) Tree T (3) associated to the algorithm proposed in [Kleinberg and Leighton, 2003].",
      "startOffset" : 73,
      "endOffset" : 103
    }, {
      "referenceID" : 8,
      "context" : "Let us consider the following instantiation of algorithm A introduced in [Kleinberg and Leighton, 2003].",
      "startOffset" : 73,
      "endOffset" : 103
    }, {
      "referenceID" : 8,
      "context" : "Note that for r = 1 and γ → 0 the upper bound coincides with that of [Kleinberg and Leighton, 2003].",
      "startOffset" : 69,
      "endOffset" : 99
    }, {
      "referenceID" : 1,
      "context" : "Let us compare the regret bound given by Theorem 1 with the one given by Amin et al. [2013]. The above discussion shows that for certain values of γ, an exponentially better regret can be achieved by our algorithm.",
      "startOffset" : 73,
      "endOffset" : 92
    }, {
      "referenceID" : 1,
      "context" : "Theorem 2 ([Amin et al., 2013]).",
      "startOffset" : 11,
      "endOffset" : 30
    }, {
      "referenceID" : 8,
      "context" : "Theorem 3 ( [Kleinberg and Leighton, 2003]).",
      "startOffset" : 12,
      "endOffset" : 42
    } ],
    "year" : 2014,
    "abstractText" : "We study revenue optimization learning algorithms for posted-price auctions with strategic buyers. We analyze a very broad family of monotone regret minimization algorithms for this problem, which includes the previously best known algorithm, and show that no algorithm in that family admits a strategic regret more favorable than Ω( √ T ). We then introduce a new algorithm that achieves a strategic regret differing from the lower bound only by a factor in O(log T ), an exponential improvement upon the previous best algorithm. Our new algorithm admits a natural analysis and simpler proofs, and the ideas behind its design are general. We also report the results of empirical evaluations comparing our algorithm with the previous state of the art and show a consistent exponential improvement in several different scenarios.",
    "creator" : "LaTeX with hyperref package"
  }
}