{
  "name" : "1412.0233.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "The Loss Surface of Multilayer Networks",
    "authors" : [ "Anna Choromanska", "Mikael Henaff", "Michael Mathieu" ],
    "emails" : [ "achoroma@cims.nyu.edu", "mbh305@nyu.edu", "mathieu@cs.nyu.edu", "benarous@cims.nyu.edu", "yann@cs.nyu.edu" ],
    "sections" : [ {
      "heading" : null,
      "text" : "We study the connection between the highly non-convex loss function of a simple model of the fully-connected feed-forward neural network and the Hamiltonian of the spherical spin-glass model under the assumptions of: i) variable independence, ii) redundancy in network parametrization, and iii) uniformity. These assumptions enable us to explain the complexity of the fully decoupled neural network through the prism of the results from the random matrix theory. We show that for large-size decoupled networks the lowest critical values of the random loss function are located in a well-defined narrow band lowerbounded by the global minimum. Furthermore, they form a layered structure. We show that the number of local minima outside the narrow band diminishes exponentially with the size of the network. We empirically demonstrate that the mathematical model exhibits similar behavior as the computer simulations, despite the presence of high dependencies in real networks. We conjecture that both simulated annealing and SGD converge to the band containing the largest number of critical points, and that all critical points found there are local minima and correspond to the same high learning quality measured by the test error. This emphasizes a major difference between largeand small-size networks where for the latter poor quality local minima have non-zero probability of being recovered. Simultaneously we prove that recovering the global minimum becomes harder as the network size increases and that it is in practice irrelevant as global minimum often leads to overfitting."
    }, {
      "heading" : "1 Introduction",
      "text" : "Deep learning methods have enjoyed a resurgence of interest in the last few years for such applications as image recognition, speech recognition, and natural language processing [Ciresan et al., 2012]. Some of the most popular methods use multi-stage architectures composed of alternated layers of linear transformations and max function. In a particularly popular version, the max functions are known as ReLUs (Rectified Linear Units) and compute the mapping y = max(x, 0) in a pointwise fashion [Nair and Hinton, 2010]. In other architectures, such as convolutional networks [LeCun et al., 1998a] and maxout networks [Goodfellow et al., 2013], the max operation is performed over a small set of variable within a layer.\nThe vast majority of practical applications of deep learning use supervised learning with very deep networks. The supervised loss function, generally a crossentropy or hinge loss, is minimized using some form of stochastic gradient descent (SGD) [Bottou, 1998], in which the gradient is evaluated using the backpropagation procedure [LeCun et al., 1998b].\nThe general shape of the loss function is very poorly understood. In the early days of neural nets (late 1980s and early 1990s), many reearchers and engineers were experimenting with relatively small networks, whose convergence tends to be unreliable, particularly when using batch optimization. Multilayer neural nets earned a reputation of being finicky and unreliable, which in part caused the community to focus on simpler method with convex loss functions, such as kernel machines and boosting.\nHowever, several researchers experimenting with larger networks and SGD had noticed that, while multilayer nets do have many local minima, the result of multiple experiments consistently give very similar performance. This suggests that, while local nimia are numerous, they are relatively easy to find, and they\nar X\niv :1\n41 2.\n02 33\nv1 [\ncs .L\nG ]\n3 0\nN ov\n2 01\nare all more or less equivalent in terms of performance on the test set. The present paper attempts to explain this peculiar property through the use of random matrix theory applied to the analysis of critical points in high degree polynomials on the sphere.\nWe first establish that the loss function of a typical multilayer net with ReLUs can be expressed as a polynomial as the a function of the weights in the network, whose degree is the number of layers, and whose number of monomials is the number of paths from inputs to output. As the weights (or the inputs) vary, some of the monomials are switched off and others become activated, leading to a piecwise, continuous polynomial whose monomials are switched in and out at the boundaries between pieces.\nAn important question concerns the distribution of critical points (maxima, minima, and saddle points) of such functions. the Hamiltonian of spherical spin glasses have\nResults from random matrix theory applied to spherical spin glasses have shown that these functions have a combinatorially large number of saddle points. Loss surfaces for large neural nets have many local minima that are essentially equivalent from the point of view of the test error, and these minima tend to be highly degenerate, with many eigenvalues of the Hessian near zero.\nWe empirically verify several hypotheses regarding learning with large-size networks:\n• For large-size networks, most local minima are equivalent and yield similar performance on a test set.\n• The probability of finding a “bad” (high value) local minimum is non-zero for small-size networks and decreases quickly with network size.\n• Struggling to find the global minimum on the training set (as opposed to one of the many good local ones) is not useful in practice as it may lead to overfitting.\nThe above hypotheses can be directly justified by our theoretical findings. We finally conclude the paper with brief discussion of our results and future research directions in Section 6.\nWe confirm the intuition and empirical evidence expressed in previous works that the problem of training deep learning systems resides with avoiding saddle points and quickly “breaking the symmetry” by picking sides of saddle points and chosing a suitable attractor [LeCun et al., 1998b, Saxe et al., 2014, Dauphin et al., 2014].\nWhat is new in this paper? To the best of our knowledge, this paper is the first work providing a theoretical description of the optimization paradigm with neural networks in the presence of large number of parameters. It has to be emphasized however that this connection relies on a number of possibly unrealistic assumptions. It is also an attempt to shed light on the puzzling behavior of modern deep learning systems when it comes to optimization and generalization."
    }, {
      "heading" : "2 Prior work",
      "text" : "In the 1990s, a number of researchers have studied the convergence of gradient-based learning for multilayer networks using the methods of statistical physics, notably Saad and Solla [Saad and Solla, 1995], and the edited works [Saad, 2009]. More recently, Saxe [Saxe et al., 2014] and Dauphin [Dauphin et al., 2014] have explored the statistical properties of the error surface in multi-layer architectures, pointing out the importance of saddle points.\nEarlier theoretical analyses [Bray and Dean, 2007, Fyodorov and Williams, 2007, Baldi and Hornik, 1989, Wigner, 1958] suggest the existence of a certain structure of critical points of random Gaussian error functions on high dimensional continuous spaces. They imply that critical points which error is much higher than the global minimum are exponentially likely to be saddle points with many negative and approximate plateau directions whereas all local minima are likely to have an error very close to that of the global minimum (these results are conveniently reviewed in [Dauphin et al., 2014]). The work of [Dauphin et al., 2014] establishes a strong empirical connection between neural networks and the theory of random Gaussian fields by providing an experimental evidence that the cost function of neural networks exhibits the same properties as the Gaussian error functions on high dimensional continuous spaces. Nevertheless they provide no theoretical justification for the existence of this connection which instead we provide in this paper.\nThis work is inspired by the recent advances in random matrix theory and the work of [Auffinger et al., 2010] and [Auffinger and Ben Arous, 2013]. The authors of these works provided an asymptotic evaluation of the complexity of the spherical spin-glass model (the spin-glass model originates from the condensed matter physics where it is used to represent a magnet with irregularly aligned spins). They discovered and mathematically proved the existence of a layered structure of the low critical values for the model’s Hamiltonian which in fact is a Gaussian process. Their re-\nsults are not discussed in details here as it will be done in Section 4 in the context of neural networks. We build the bridge between their findings and neural networks and show that the objective function used by neural network is analogous to the Hamiltonian of the spin-glass model under the assumptions of: i) variable independence, ii) redundancy in network parametrization, and iii) uniformity, and thus their landscapes share the same properties. We emphasize that the connection between spin-glass models and neural networks was already explored back in the past (a summary can be found in [Dotsenko, 1995]). In example in [Amit et al., 1985] the authors showed that the long-term behavior of certain neural network models are governed by the statistical mechanism of infinite-range Ising spin-glass Hamiltonians. Another work [Nakanishi and Takayama, 1997] examined the nature of the spin-glass transition in the Hopfield neural network model. None of these works however make the attempt to explain the paradigm of optimizing the highly non-convex neural network objective function through the prism of spin-glass theory and thus in this respect our approach is very novel."
    }, {
      "heading" : "3 Deep network and spin-glass model",
      "text" : ""
    }, {
      "heading" : "3.1 Preliminaries",
      "text" : "For the theoretical analysis, we consider a simple model of the fully-connected feed-forward deep network with a single output and rectified linear units. We call the network N . We focus on a binary classification task. Let X be the random input vector of dimensionality d. Let (H − 1) denote the number of hidden layers in the network and we will refer to the input layer as the 0th layer and to the output layer as the Hth layer. Let ni denote the number of units in the ith layer (note that n0 = d and nH = 1). Let Wi be the matrix of weights between (i− 1)th and ith layers of the network. Also, let σ denotes the activation function that converts a unit’s weighted input to its output activation. We consider linear rectifiers thus σ(x) = max(0, x). We can therefore write that for any given random input vector X, the network gives the following (random) output Y :\nY = qσ(W>Hσ(W > H−1 . . . σ(W > 1 X))) . . . ), where q = √\n(n0n1...nH)(H−1)/2H is simply a normalization factor. The same expression for the output of the network can be re-expressed in the following way:\nY = q n0∑ i=1 γ∑ j=1 Xi,jAi,j H∏ k=1 w (k) i,j , (1)\nwhere the first summation is over the network inputs and the second one is over all paths from a given net-\nwork input to its output, where γ is the total number of such paths (note that γ = n1n2 . . . nH). Also, for all i = {1, 2, . . . , n0}: Xi,1 = Xi,2 = · · · = Xi,γ . Furthermore, w\n(k) i,j is the weight of the k th segment of path\nindexed with (i, j) which connects layer (k− 1)st with layer kth of the network. Note that each path corresponds to a certain set of H weights, which we refer to as a configuration of weights, which are multiplied by each other. Finally, Ai,j denotes whether a path (i, j) is active (Ai,j = 1) or not (Ai,j = 0).\nDefinition 3.1. The mass of the network Ψ is the total number of all paths between all network inputs and outputs: Ψ = ∏H i=0 ni. Also let Λ as Λ = H √ Ψ. Definition 3.2. The size of the network N is the total number of network parameters: N = ∑H−1 i=0 nini+1.\nThe mass and the size of the network depend on each other as captured in Theorem 3.1.\nTheorem 3.1. Let Ψ be the mass of the network, d be the number of network inputs and H be the depth of the network. The size of the network is bounded as\nΨ2H = Λ2HH ≥ N ≥ H √ Ψ2 H H √ d ≥ H √ Ψ = Λ.\nIn the rest of the paper we assume that the depth of the network H is bounded. Therefore N → ∞ iff Ψ→∞, and N →∞ iff Λ→∞.\nIn the rest of this section we will be establishing a connection between the loss function of the neural network and the Hamiltonian of the spin-glass model. All proofs are deferred to the Supplementary material."
    }, {
      "heading" : "3.2 Approximation",
      "text" : "In this section we introduce randomness to the model by assuming Xs and As are random. We make certain assumptions regarding the neural network model. They consider random variables Xs and As (their distributions and mutual dependencies) as well as they introduce spherical constraint on the model weights. We also introduce two other assumptions regarding redundancy of network parameters and their uniformity (details in the text below), both of them are justified by empirical evidence in the literature.\nInput We assume each input Xi,j is a normal random variable such that Xi,j ∼ N(0, 1). Clearly the model contains several dependencies as one input is associated with many paths in the network. That poses a major theoretical problem in analyzing these models as it is unclear how to account for these dependencies. In this paper we instead study fully decoupled model [De la Peña and Giné, 1999], where Xi,j ’s are\nassumed to be independent. We allow this simplification as to the best of our knowledge there exists no theoretical description of the optimization paradigm with neural networks in the literature either under independence assumption or when the dependencies are allowed. Also note that statistical learning theory heavily relies on this assumption [Hastie et al., 2001] even when the model under consideration is much simpler than a neural network. Under the independence assumption we will explore the similarity of this model to the spin-glass model. We emphasize that despite the presence of high dependencies in real neural networks, both models exhibit high similarities as will be empirically demonstrated.\nPaths We assume each path in Equation 1 is equally likely to be active thus Ai,j ’s will be modeled as Bernoulli random variables with the same probability of success ρ. By assuming the independence of X’s and A’s we get the following\nEA[Y ] = q n0∑ i=1 γ∑ j=1 Xi,jρ H∏ k=1 w (k) i,j . (2)\nRedundancy in network parametrization Let W = {w1, w2, . . . , wN} be the set of all weights of the network. Let A denote the set of all H-length configuration of weights chosen from W (order of weights in a configuration does matter). Note that the size of A is therefore NH . Also let B be a set such that each element correspond to the single configuration of weights from Equation 2, thus B = {(w11,1, w21,1, . . . , wH1,1), (w11,2, w21,2, . . . , wH1,2), . . . , (w1n0,γ , w 2 n0,γ , . . . , w H n0,γ)}, where every single weight comes from set W (note that B ⊂ A). Thus Equation 2 can be equivalently written as\nYN :=EA[Y ]=q N∑\ni1,i2,...,iH=1\nri1,i2,...,iH∑ j=1 X (j) i1,i2,...,iH ρ H∏ k=1 wik . (3)\nWe will now explain the notation. It is overcomplicated for purpose, as this notation will be useful later on. ri1,i2,...,iH denotes whether the configuration (wi1 , wi2 , . . . , wiH ) appeared in Equation 2 or not, thus ri1,i2,...,iH ∈ {0∪1}, and {X (j) i1,i2,...,iH\n}ri1,i2,...,iHj=1 denote a set of random variables corresponding to the same weight configuration (since ri1,i2,...,iH ∈ {0∪1} this set has at most one element). Also ri1,i2,...,iH = 0 implies that summand X (j) i1,i2,...,iH ρ ∏H k=1 wik is zeroed out). Furthermore, the following condition has to be satisfied: ∑N i1,i2,...,iH=1\nri1,i2,...,iH = Ψ. In the notation YN , index N refers to the number of unique weights of a network (this notation will also be helpful later).\nConsider a family of networks which have the same graph of connections as network N but different edge\nweighting such that they only have s unique weights and s ≤ N (through notation analogy expected output of this network will be called Ys). It was recently shown [Denil et al., 2013, Denton et al., 2014] that for large-size networks large number of network parameters (according to [Denil et al., 2013] even up to 95%) are redundant and can either be learned from a very small set of unique parameters or even not learned at all with almost no loss in prediction accuracy.\nDefinition 3.3. A network M which has the same graph of connections as N and the number of unique weights s satisfying s ≤ N is called a (s, )-reduction image of N for some ∈ [0, 1] if the prediction accuracy of N and M differ by no more than (thus they classify at most fraction of data points differently).\nTheorem 3.2. Let N be a neural network giving the output whose expectation YN is given in Equation 3. Let M be its (s, )-reduction image for some s ≤ N and ∈ [0, 0.5]. Through analogy, let Ys be the expected output of network M. Then the following holds\ncorr(sign(Ys), sign(YN )) ≥ 1− 2 1 + 2 ,\nwhere corr denotes the correlation defined as corr(A,B) = E[(A−E[A]])(B−E[B]])std(A)std(B) , std is the standard deviation and sign(·) denotes the sign of prediction (sign(Ys) and sign(YN ) are both random).\nThe redundancy assumption implies that one can preserve to be close to 0 even with s << N .\nUniformity Consider network M to be a (s, )- reduction image of N for some s ≤ N and ∈ [0, 1]. The output Ys of the image network can in general be expressed as\nYs = q s∑ i1,...,iH=1 ti1,...,iH∑ j=1 X (j) i1,...,iH ρ H∏ k=1 wik ,\nwhere ti1,...,iH ∈ {Z+ ∪ 0} is the number of times each configuration (wi1 , wi2 , . . . , wiH ) repeats in Equation 3 and ∑s i1,...,iH=1\nti1,...,iH = Ψ. We assume that unique weights are close to being evenly distributed on the graph of connections of network M. We call this assumption a uniformity assumption. Thus this assumption implies that for all (i1, i2, . . . , iH) : i1, i2, . . . , iH ∈ {1, 2, . . . , s} there exists a positive constant c ≥ 1 such that the following holds\n1 c · Ψ sH ≤ ti1,i2,...,iH ≤ c · Ψ sH . (4)\nThe factor Ψ sH\ncomes from the fact that for the network where every weight is uniformly distributed on the graph of connections (thus with high probability\nevery node is adjacent to an edge with any of the unique weights) it holds that ti1,i2,...,iH = Ψ sH\n. Note that this condition can be satisfied with small c (close to 1) if s is sufficiently small.\nFor simplicity assume Ψ sH ∈ Z+ and H\n√ Ψ ∈ Z+. Con-\nsider therefore an expression as follows\nŶs = q s∑ i1,...,iH=1 Ψ sH∑ j=1 X (j) i1,...,iH ρ H∏ k=1 wik , (5)\nwhich corresponds to a network for which the lowerbound and upper-bound in Equation 4 match. Note that one can combine both summations in Equation 5 and re-index its terms to obtain\nŶs = q Λ∑ i1,...,iH=1 Xi1,...,iHρ H∏ k=1 wik . (6)\nThe following theorem (Theorem 3.3) captures the connection between Ŷs and Ys.\nTheorem 3.3. Under the uniformity assumption of Equation 4, random variable Ŷs in Equation 5 and random variable Ys in Equation 3 sattisfy the following: corr(Ŷs, Ys) ≥ 1c2 .\nWe will refer to Ŷs as an (s, , c)-approximator of YN , where the quality of this approximation is captured in Theorems 3.2 and 3.3. Intuitively, for large networks (our analysis in Section 4 considers Λ→∞) one would expect s to be small enough to simultaneously guarantee c sufficiently close to 1 and preserve good accuracy ( close to 0).\nSpherical constraint We finally make a benign assumption that for some positive constant C weights satisfy the spherical condition\n1\nΛ Λ∑ i=1 w2i = C. (7)\nNext we will consider two frequently used loss functions, absolute loss and hinge loss, where we approximate YN (recall Yn := EA[Y ]) with Ŷs.\n3.3 Loss function as a H-spin spherical spin-glass model\nLet LaΛ,H(w) and LhΛ,H(w) be the (random) absolute loss and (random) hinge loss that we define as follows\nLaΛ,H(w) = EA[ |Yt − Y | ]\nand LhΛ,H(w) = EA[max(0, 1− YtY )],\nwhere Yt is a random variable corresponding to the true data labeling that takes values −S or S in case of the absolute loss, where S = supw Ŷs, and −1 or 1 in case of the hinge loss. Also note that in case of the hinge loss max operator can be modeled as Bernoulli random variable. One can show that after approximating EA[Y ] with its (s, , c)-approximator Ŷs both losses can be generalized to the following expression\nLΛ,H(w) = C1 + C2q Λ∑\ni1,i2,...,iH=1\nXi1,i2,...,iH H∏ k=1 w̃ik ,\nwhere\n1\nΛ Λ∑ i=1 w̃2i = 1, (8)\nand C1, C2 are some constants and weights w̃ are simply scaled weights w. We skip the details showing this equivalence, and defer them to the Supplementary material, as they are strictly technical.\nTo simplify the notation in Equation 11 we drop the letter accents and simply denote ŵ as w. We also skip constants C1 and C2 as they do not matter when minimizing the loss function. After substituting q =\n1 Ψ(H−1)/2H = 1 Λ(H−1)/2 we obtain\nLΛ,H(w)= 1\nΛ(H−1)/2 Λ∑ i1,i2,...,iH=1 Xi1,i2,...,iHwi1wi2. . .wiH . (9)\nEquation 9 is the centered Gaussian process on the sphere S = SΛ−1( √ Λ) and is equivalent to the Hamiltonian of the H-spin spherical spin-glass model. The spherical constraint is captured in Equation 8. An asymptotic evaluation of the complexity of spherical H-spin spherical spin-glass models via random matrix theory was studied in the literature [Auffinger et al., 2010] where a precise description of the energy landscape for the Hamiltonians of these models is provided. In this paper we use the results of the theoretical analysis of the complexity of spinglass models [Auffinger et al., 2010] to gain an understanding of the optimization of strongly non-convex loss functions of neural networks."
    }, {
      "heading" : "4 Theoretical results",
      "text" : "The theoretical findings of this section are direct consequence of the theoretical analysis of the complexity of spherical spin-glass models of [Auffinger et al., 2010]. We will first introduce the notation and definitions.\nDefinition 4.1. Let u ∈ R and k be an integer such that 0 ≤ k < Λ. We will denote as CΛ,k(u) a random number of critical values of LΛ,H(w) in the set ΛB =\n{ΛX : x ∈ (−∞, u)} with index1 equal to k. Similarly we will denote as CΛ(B) a random total number of critical values of LΛ,H(w).\nLater in the paper by critical values of the loss function that have non-diverging (fixed) index we mean the ones with index non-diverging with Λ. We will also call them low-index saddle points. Next we summarize the results of the theoretical analysis in [Auffinger et al., 2010] in the context of neural networks.\nThe existence of the band of low-index critical points One can directly use Theorem 2.12 in [Auffinger et al., 2010] to show that for large-size networks (more precisely when Λ→∞ but recall that Λ → ∞ iff N → ∞) it is improbable to find a critical value below certain level −ΛE0(H) (which we call the ground state), where E0(H) is some real number.\nLet us also introduce the number that we will refer to as E∞. We will refer to this important threshold as an energy barrier and define it as\nE∞ = E∞(H) = 2 √ H − 1 H .\nTheorem 2.14 in [Auffinger et al., 2010] implies that for large-size networks all critical values of the loss function that are of non-diverging index must lie below the threshold −ΛE∞(H). Any critical point that lies above the energy barrier is a high-index saddle point with overwhelming probability. Thus for largesize networks all critical values of the loss function that are of non-diverging index must lie in the band (−ΛE0(H),−ΛE∞(H)).\nLayered structure of low-index critical points From Theorem 2.15 in [Auffinger et al., 2010] it follows that for large-size networks finding a critical value with index larger or equal to k (for any fixed integer k) below energy level −ΛEk(H) is improbable, where −Ek(H) ∈ [−E0(H),−E∞(H)]. Furthermore, the sequence {Ek(H)}k∈N is strictly decreasing and converges to E∞ as k →∞ [Auffinger et al., 2010].\nThese results unravel a layered structure for the lowest critical values of the loss function of a large-size network, where with overwhelming probability the critical values above the global minimizer (ground state) of the loss function are local minima exclusively. Above the band ((−ΛE0(H),−ΛE1(H))) containing only local minima (critical points of index 0), there is another one, ((−ΛE1(H),−ΛE2(H))), where one\n1The number of negative eigenvalues of the Hessian ∇2LΛ,H at w is also called index of ∇2LΛ,H at w.\ncan only find local minima and saddle points of index 1, and above this band there exists another one, ((−ΛE2(H),−ΛE3(H))), where one can only find local minima and saddle points of index 1 and 2, etc.\nThe band (−E0(H),−E∞) is in practice very narrow, i.e. it is order of magnitudes narrower than band (−E∞, 0) (an example is shown in Figure 1 and 2), which indicates that low-index critical points lie ’close’ to the global minimum.\nLogarithmic asymptotics of the mean number of critical points We will now define two nondecreasing, continuous functions on R, ΘH and Θk,H as follows\nΘH(u) =  1 2 log(H−1)− H−2 4(H−1)−I(u) if u≤−E∞ 1 2 log(H−1)− H−2 4(H−1) if −E∞≤u ≤ 0\n1 2 log(H − 1) if 0≤u\n,\nand for any integer k ≥ 0:\nΘk,H(u)=\n{ 1 2 log(H−1)− H−2 4(H−1)−(k+1)I(u) if u≤−E∞\n1 2 log(H−1)− H−2 4(H−1) if u≥−E∞\nwhere\nI(u) = − u E2∞\n√ u2−E2∞−log(−u+ √ u2−E2∞)+logE∞.\nFigure 2 captures exemplary plots of the functions ΘH(u) and Θk,H(u). Also note that the following corollary holds.\nCorollary 4.1. For all k > 0 and u < −E∞, Θk,H(u) < Θ0,H(u).\nNext we will show the logarithmic asymptotics of the mean number of critical points (the asymptotics of the mean number of critical points can be found in the Supplementary material).\nTheorem 4.1 ([Auffinger et al., 2010], Theorem 2.5 and 2.8). For all H ≥ 2\nlim Λ→∞\n1 Λ logE[CΛ(u)] = ΘH(u).\nand for all H ≥ 2 and k ≥ 0 fixed\nlim Λ→∞\n1 Λ logE[CΛ,k(u)] = Θk,H(u).\nFrom Theorem 4.1 and Corollary 4.1 the number of critical points in the band (−ΛE0(H),−ΛE∞(H)) increases exponentially as Λ grows and that local minima dominate over saddle points and this domination also grows exponentially as Λ grows. Thus for large-size networks the probability of recovering a saddle point in the band (−ΛE0(H),−ΛE∞(H)), rather than a local minima, goes to 0.\nHardness of recovering the global minimum Note that based on what was already shown recovering the global minimizer when starting from any (local) minima from one of the energy bands above, e.g. (−ΛEi(H),−ΛEi+1(H)), diverges with Λ since it is bounded below by Λ(E0(H) − Ei(H)). Furthemore, let us consider what happens if we cross the barrier. Suppose we are at a local minima with a scaled energy of −E∞ − δ. In order to find a further low lying minima it has to pass through a saddle point. The moving particle has to go up at least to the level where there is equal amount of saddle points to have a decent chance of finding a path that might possibly take it to another local minima. This process takes exponentially long time so in practice finding the global minimum is not feasible.\nFigure 1 captures exemplary plots of the distributions of the mean number of critical points, local minima and low-index saddle points. Clearly local minima and low-index saddle points are located in the band (−ΛE0(H),−ΛE∞(H)) whereas high-index saddle points can only be found above the energy barrier −ΛE∞(H). Figure 1 also reveals the layered structure for the lowest critical values of the loss function.\nNote that the variance of the loss in Equation 9 is Λ which suggests that the extensive quantities should scale with Λ. In fact this is the reason behind the\nscaling factor in front of the summation in the loss. The relation to the logarithmic asymptotics is as follows: the number of critical values of the loss below the level Λu is roughly eΛΘH(u). The gradient descent gets trapped roughly at the barrier denoted by −ΛE∞, as will be shown in the experimental section."
    }, {
      "heading" : "5 Experiments",
      "text" : ""
    }, {
      "heading" : "5.1 Experimental Setup",
      "text" : "Spin-Glass To illustrate the theorems in Section 4, we conducted spin-glass simulations for different dimensions Λ from 25 to 500. For each value of Λ, we obtained an estimate of the distribution of minima by sampling 1000 initial points on the unit sphere and performing stochastic gradient descent (SGD) to find a minimum energy point. Note that throughout this section we will refer to the energy of the Hamiltonian of the spin-glass model as its loss.\nNeural Network We performed an analogous experiment on a scaled-down version of MNIST, where each image was downsampled to size 10× 10. Specifically, we trained 1000 networks with one hidden layer and n1 ∈ {25, 50, 100, 250, 500} hidden units, each one starting from a random set of parameters sampled uniformly within the unit cube. All networks were trained for 200 epochs using SGD with learning rate decay.\nTo verify the validity of our theoretical assumption of parameter redundancy, we trained a neural network on a subset of MNIST using simulated annealing (SA) where 95% of parameters were assumed to be redundant. Specifically, we allowed the weights to take one of 3 values uniformly spaced in the interval [−1, 1]. We obtained less than 2.5% drop in accuracy, which demonstrates the heavy over-parametrization of neural networks as discussed in Section 3.\nSaddle Points It is necessary to verify that our solutions obtained through SGD are low-index critical points rather than high-index saddle points. It was\nobserved by [Dauphin et al., 2014] that certain optimization schemes have the potential to get trapped in high-index saddle points of poor quality. We ran two tests to ensure that this was not the case in our experimental setup. First, for n1 = {10, 25, 50, 100} we computed the eigenvalues of the Hessian of the loss function at each solution and computed the index. All eigenvalues less than 0.001 in magnitude were set to 0. Figure 5 captures an exemplary distribution of normalized indices, which is the proportion of negative eigenvalues, for n1 = 25 (the results for n1 = {10, 50, 100} can be found in the Supplementary material). It can be seen that all solutions are either minima or saddle points of very low normalized index (of the order 0.01).nhidden=25\nNext, we compared simulated annealing to SGD on a subset of MNIST. Simulated annealing does not\ncompute gradients and thus does not tend to become trapped in high-index saddle points. We found that SGD performed at least as well as simulated annealing, which indicates that becoming trapped in poor saddle points is not a problem in our experiments. The result of this comparison are in the Supplementary material. We emphasize that all figures in this paper should be read in color.\nScaling loss values To observe qualitative differences in behavior for different values of Λ or n1, it is necessary to rescale the loss values to make their expected values approximately equal. For spin-glasses, the expected value of the loss at critical points scales linearly with Λ, therefore we rescaled the losses by dividing them by Λ (note that this normalization is in the statement of Theorem 4.1) which gives us the histogram of points at the correct scale. For MNIST experiments, we empirically found that the loss with respect to number of hidden units approximately follows an exponential power law: E[L] ∝ eαn β 1 . We fitted the coefficients α, β and scaled the loss values to L/eαn β 1 ."
    }, {
      "heading" : "5.2 Results",
      "text" : "Figure 3 shows the distributions of the scaled losses for both sets of experiments. For the spin-glasses (left plot), we see that for small values of Λ, we obtain poor local minima on many experiments, while for larger\nvalues of Λ the distribution becomes increasingly concentrated around the energy barrier where local minima have high quality. We observe that the left tails for all Λ touches the barrier that is hard to penetrate and as Λ increases the values concentrate around −E∞. In fact this concentration result has long been predicted but not proved until [Auffinger et al., 2010].\nWe see that qualitatively the distribution of losses for the neural network experiments (right plot) exhibits similar behavior. Even after scaling, the variance decreases with higher network sizes. This is clearly captured in Figure 4. This indicates that getting stuck in poor local minima is a major problem for smaller networks but becomes gradually of less importance as the network size increases. This is because critical points of large networks exhibit the layered structure where high-quality low-index critical points lie close to the global minimum."
    }, {
      "heading" : "5.3 Relationship between train and test loss",
      "text" : "The theory and experiments thus far indicate that minima lie in a band which gets smaller as the network size increases. This indicates that computable solutions become increasingly equivalent with respect to training error, but how does this relate to error on the test set? To determine this, we computed the correlation ρ between training and test loss for all solutions for each network size, with the following results:\nWe see that training and test error become increasingly decorrelated as the network size increases. This provides further indication that attempting to find the absolute possible minimum is of limited use with regards to generalization performance."
    }, {
      "heading" : "6 Conclusion",
      "text" : "This paper establishes a connection between the neural network and the spin-glass model. We show that under certain assumptions, the loss function of the fully decoupled large-size neural network of depth H has similar landscape to the Hamiltonian of the H-spin spherical spin-glass model. We empirically demonstrate that both models studied here are highly similar also in real settings, despite the presence of variable dependencies in real networks. To the best of our knowledge our work is one of the first efforts in the literature to shed light on the theory of neural network optimization."
    }, {
      "heading" : "7 Proof of Theorem 3.1",
      "text" : "Proof. First we will prove the lower-bound on N . By the inequality between arithmetic and geometric mean the mass and the size of the network are connected as follows\nN ≥ H √ Ψ2 H\nH √ n0nH\n= H √\nΨ2 H H √ d ,\nand since H √\nΨ HH√ d\n= H √∏H\ni=1 niH ≥ 1 then\nN ≥ H √ Ψ2 H H √ d ≥ H √ Ψ.\nNext we show the upper-bound on N . Let nmax = maxi∈{1,2,...,H} ni. Then\nN ≤ Hn2max ≤ HΨ2."
    }, {
      "heading" : "8 Proof of Theorem 3.2",
      "text" : "Proof. We will first proof the following more general lemma.\nLemma 8.1. Let Y1 and Y2 be the outputs of two arbitrary binary classifiers. Assume that the first classifiers predicts 1 with probability p where, without loss of generality, we assume p ≤ 0.5 and −1 otherwise. Furthemore, let the prediction accuracy of the second classifier differ from the prediction accuracy of the first classifier by no more than ∈ [0, p]. Then the following holds\ncorr(sign(Y1), sign(Y2))\n≥ 1− 2 − (1− 2p) 2 − 2(1− 2p) 4 √ p(1− p)(p+ )(1− p+ ) .\nProof. Consider two random variables Z1 = sign(Y1) and Z2 = sign(Y2). Let X+ denote the set of data points for which the first classifier predicts +1 and let X− denote the set of data points for which the first classifier predicts −1 (X+ ∪ X− = X , where X is the entire dataset). Also let p = |X\n+| |X | . Furthermore, let\nX− denote the dataset for which Z1 = +1 and Z2 = −1 and X+ denote the dataset for which Z1 = −1 and Z2 = +1, where |X+ |+|X − | X = . Also let + = |X+ | X and − = |X− | X . Therefore\nZ1 = { 1 if x ∈ X+ −1 if x ∈ X−\nand\nZ2 = { 1 if x ∈ X+ ∪ X+ \\ X− −1 if x ∈ X− ∪ X− \\ X+ .\nOne can compute that E[Z1] = 2p − 1, E[Z2] = 2(p + + − −) − 1, E[Z1Z2] = 1 − 2 , std(Zs) = 2 √ p(1− p), and finally std(ZΛ) =\n2 √ (p+ + − −)(1− p− + + −). Thus we obtain\ncorr(sign(Y1), sign(Y2)) = corr(Z1, Z2) = E[Z1Z2]− E[Z1]E[Z2]\nstd(Z1)std(Z2)\n= 1− 2 − (1− 2p)2 + 2(1− 2p)( + − −) 4 √ p(1− p)(p+ + − −)(1− p− + + −)\n≥ 1− 2 − (1− 2p) 2 − 2(1− 2p) 4 √ p(1− p)(p+ )(1− p+ )\n(10)\nNote that when the first classifier is network N considered in this paper and M is its (s, )-reduction image E[Y1] = 0 and E[Y2] = 0 (that follows from the fact that X’s in Equation 3 have zero-mean). That implies p = 0.5 which, when substituted to Equation 10 gives the theorem statement."
    }, {
      "heading" : "9 Proof of Theorem 3.3",
      "text" : "Proof. Note that E[Ŷs] = 0 and E[Ys] = 0. Furthermore E[ŶsYΛ] = q2ρ2 Λ∑\ni1,i2,...,iH=1\nmin\n( Ψ\nΛH , ti1,i2,...,iH ) H∏ k=1 w2ik\nand\nstd(Ŷs) = qρ √√√√ Λ∑ i1,i2,...,iH=1 Ψ ΛH H∏ k=1 w2ik\nstd(Ys) = qρ √√√√ Λ∑ i1,i2,...,iH=1 ti1,i2,...,iH H∏ k=1 w2ik .\nTherefore\ncorr(Ŷs, Ys)\n=\nΛ∑ i1,...,iH=1 min ( Ψ ΛH , ti1,...,iH ) H∏ k=1\nw2ik√√√√√  Λ∑ i1,...,iH=1 Ψ ΛH H∏ k=1 w2ik  Λ∑ i1,...,iH=1 ti1,...,iH H∏ k=1 w2ik  ≥ 1\nc2 ,\nwhere the last inequality is the direct consequence of the uniformity assumption of Equation 4."
    }, {
      "heading" : "10 Loss function as a H - spin spherical spin-glass model",
      "text" : "We consider two loss functions, (random) absolute loss LaΛ,H(w) and (random) hinge loss LhΛ,H(w) defined in the main body of the paper. Recall that in case of the hinge loss max operator can be modeled as Bernoulli random variable, that we will refer to as M , with success (M = 1) probability ρ ′ = C ′\nρ √ CH for some non-\nnegative constant C′ . We assume M is independent of Ŷs. Therefore we obtain that\nLaΛ,H(w) = { S − Ŷs if Yt = S S + Ŷs if Yt = −S\nand\nLhΛ,H(w) = EM,A[M(1− YtŶs)]\n= { EM [M(1− Ŷs)] if Yt = 1 EM [M(1 + Ŷs)] if Yt = −1\nNote that both cases can be generalized as LΛ,H(w) = {\nEM [M(S − Ŷs)] if Yt > 0 EM [M(S + Ŷs)] if Yt < 0 ,\nwhere in case of the absolute loss ρ ′\n= 1 and in case of the hinge loss S = 1. Furthermore, using the fact that X’s are Gaussian random variables one we can further generalize both cases as\nLΛ,H(w) = Sρ ′ +q Λ∑ i1,i2,...,iH=1 Xi1,i2,...,iHρρ ′ H∏ k=1 wik .\nLet w̃i = H\n√ ρρ′\nC′ wi for all i = {1, 2, . . . , k}. Note that w̃i =\n1√ C wi. Thus\nLΛ,H(w) = Sρ ′ + qC\n′ Λ∑\ni1,...,iH=1\nXi1,...,iH H∏ k=1 w̃ik . (11)\nNote that the spherical assumption in Equation 7 directly implies that\n1\nΛ Λ∑ i=1 w̃2i = 1\nTo simplify the notation in Equation 11 we drop the letter accents and simply denote w̃ as w. We skip constant Sρ ′ and C′ as it does not matter when minimizing the loss function. After substituting q = 1 Ψ(H−1)/2H\nwe obtain\nLΛ,H(w)= 1\nΛ(H−1)/2 Λ∑ i1,i2,...,iH=1 Xi1,i2,...,iHwi1wi2. . .wiH ."
    }, {
      "heading" : "11 Asymptotics of the mean number of critical points and local minima",
      "text" : "Below, we provide the asymptotics of the mean number of critical points (Theorem 11.1) and the mean number of local minima (Theorem 11.2), which extend Theorem 4.1. Those results are the consequences of Theorem 2.17. and Corollary 2.18. [Auffinger et al., 2010].\nTheorem 11.1. For H ≥ 3, the following holds as Λ→∞:\n• For u < −E∞\nE[CΛ(u)] = h(v)√ 2Hπ\nexp(I1(v)− v2 I ′ 1(v))\n−Φ′(v) + I ′1(v) Λ− 1 2\n· exp (ΛΘH(u)) (1 + o(1)),\nwhere v = −u √\nH 2(H−1) , Φ(v) = − H−2 2H v 2, h(v) = ∣∣∣ v−√2 v+ √ 2 ∣∣∣ 14 + ∣∣∣ v+√2 v− √ 2 ∣∣∣ 14 and I1(v) = ∫ v√ 2 √ |x2 − 2|dx.\n• For u = −E∞\nE[CΛ(u)] = 2A(0)\n√ 2H\n3(H − 2) Λ− 1 3\n· exp (ΛΘH(u)) (1 + o(1)),\nwhere A is the Airy function of first kind.\n• For u ∈ (−E∞, 0)\nE[CΛ(u)] = 2 √\n2H(E2∞ − u2) (2−H)πu\n· exp (ΛΘH(u)) (1 + o(1)),\n• For u > 0\nE[CΛ(u)] = 4 √ 2√ π(H − 2) Λ 1 2\n· exp (ΛΘH(0)) (1 + o(1)),\nTheorem 11.2. For H ≥ 3 and u < −E∞, the following holds as Λ→∞:\nE[CΛ,0(u)] = h(v)√ 2Hπ\nexp(I1(v)− v2 I ′ 1(v))\n−Φ′(v) + I ′1(v) Λ− 1 2\n· exp (ΛΘH(u)) (1 + o(1)),\nwhere v, Φ, h and I1 were defined in Theorem 11.1."
    }, {
      "heading" : "12 Additional Experiments",
      "text" : "Figure 8 shows the distribution of normalized indices, which is the proportion of negative eigenvalues, for neural networks with n1 = {10, 25, 50, 100}. We see that all solutions are minima or saddle points of very low index.\nFigure 6 compares SGD with SA.\nFigure 7 captures the zoomed (n1 = {10, 25, 50, 100}) boxplot generated based on the distributions of the scaled losses for the neural network experiment.\na) n1 = 10 nhidden=10\nnormalized index\nF re\nqu en\ncy\n0.0000 0.0005 0.0010 0.0015 0.0020 0.0025\n0 20\n0 40\n0 60\n0 80\n0\nb) n1 = 25 nhidden=25\nnormalized index\nF re\nqu en\ncy\n0.000 0.005 0.010 0.015\n0 20\n0 40\n0 60\n0 80\n0\nc) n1 = 50 nhidden=50"
    } ],
    "references" : [ ],
    "referenceMentions" : [ ],
    "year" : 2017,
    "abstractText" : "We study the connection between the highly<lb>non-convex loss function of a simple model of<lb>the fully-connected feed-forward neural net-<lb>work and the Hamiltonian of the spherical<lb>spin-glass model under the assumptions of:<lb>i) variable independence, ii) redundancy in<lb>network parametrization, and iii) uniformity.<lb>These assumptions enable us to explain the<lb>complexity of the fully decoupled neural net-<lb>work through the prism of the results from<lb>the random matrix theory. We show that for<lb>large-size decoupled networks the lowest crit-<lb>ical values of the random loss function are<lb>located in a well-defined narrow band lower-<lb>bounded by the global minimum. Further-<lb>more, they form a layered structure. We<lb>show that the number of local minima out-<lb>side the narrow band diminishes exponen-<lb>tially with the size of the network. We em-<lb>pirically demonstrate that the mathemati-<lb>cal model exhibits similar behavior as the<lb>computer simulations, despite the presence<lb>of high dependencies in real networks. We<lb>conjecture that both simulated annealing and<lb>SGD converge to the band containing the<lb>largest number of critical points, and that<lb>all critical points found there are local min-<lb>ima and correspond to the same high learn-<lb>ing quality measured by the test error. This<lb>emphasizes a major difference between large-<lb>and small-size networks where for the lat-<lb>ter poor quality local minima have non-zero<lb>probability of being recovered. Simultane-<lb>ously we prove that recovering the global<lb>minimum becomes harder as the network size<lb>increases and that it is in practice irrelevant<lb>as global minimum often leads to overfitting.<lb>",
    "creator" : "LaTeX with hyperref package"
  }
}