{
  "name" : "1412.6651.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Deep learning with Elastic Averaging SGD",
    "authors" : [ "Sixin Zhang", "Anna Choromanska" ],
    "emails" : [ "zsx@cims.nyu.edu", "achoroma@cims.nyu.edu", "yann@cims.nyu.edu" ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "One of the most challenging problems in large-scale machine learning is how to parallelize the training of large models that use a form of stochastic gradient descent (SGD) [1]. There have been attempts to parallelize SGD-based training for large-scale deep learning models on large number of CPUs, including the Google’s Distbelief system [2]. But practical image recognition systems consist of large-scale convolutional neural networks trained on few GPU cards sitting in a single computer [3, 4]. The main challenge is to devise parallel SGD algorithms to train large-scale deep learning models that yield a significant speedup when run on multiple GPU cards.\nIn this paper we introduce the Elastic Averaging SGD method (EASGD) and its variants. EASGD is motivated by quadratic penalty method [5], but is re-interpreted as a parallelized extension of the averaging SGD algorithm [6]. The basic idea is to let each worker maintain its own local parameter, and the communication and coordination of work among the local workers is based on an elastic force which links the parameters they compute with a center variable stored by the master. The center variable is updated as a moving average where the average is taken in time and also in space over the parameters computed by local workers. The main contribution of this paper is a new algorithm that provides fast convergent minimization while outperforming DOWNPOUR method [2] and other\nar X\niv :1\n41 2.\n66 51\nv8 [\ncs .L\nG ]\n2 5\nO ct\nbaseline approaches in practice. Simultaneously it reduces the communication overhead between the master and the local workers while at the same time it maintains high-quality performance measured by the test error. The new algorithm applies to deep learning settings such as parallelized training of convolutional neural networks.\nThe article is organized as follows. Section 2 explains the problem setting, Section 3 presents the synchronous EASGD algorithm and its asynchronous and momentum-based variants, Section 4 provides stability analysis of EASGD and ADMM in the round-robin scheme, Section 5 shows experimental results and Section 6 concludes. The Supplement contains additional material including additional theoretical analysis."
    }, {
      "heading" : "2 Problem setting",
      "text" : "Consider minimizing a function F (x) in a parallel computing environment [7] with p ∈ N workers and a master. In this paper we focus on the stochastic optimization problem of the following form\nmin x F (x) := E[f(x, ξ)], (1)\nwhere x is the model parameter to be estimated and ξ is a random variable that follows the probability distribution P over Ω such that F (x) = ∫ Ω f(x, ξ)P(dξ). The optimization problem in Equation 1 can be reformulated as follows\nmin x1,...,xp,x̃ p∑ i=1 E[f(xi, ξi)] + ρ 2 ‖xi − x̃‖2, (2)\nwhere each ξi follows the same distribution P (thus we assume each worker can sample the entire dataset). In the paper we refer to xi’s as local variables and we refer to x̃ as a center variable. The problem of the equivalence of these two objectives is studied in the literature and is known as the augmentability or the global variable consensus problem [8, 9]. The quadratic penalty term ρ in Equation 2 is expected to ensure that local workers will not fall into different attractors that are far away from the center variable. This paper focuses on the problem of reducing the parameter communication overhead between the master and local workers [10, 2, 11, 12, 13]. The problem of data communication when the data is distributed among the workers [7, 14] is a more general problem and is not addressed in this work. We however emphasize that our problem setting is still highly non-trivial under the communication constraints due to the existence of many local optima [15]."
    }, {
      "heading" : "3 EASGD update rule",
      "text" : "The EASGD updates captured in resp. Equation 3 and 4 are obtained by taking the gradient descent step on the objective in Equation 2 with respect to resp. variable xi and x̃,\nxit+1 = x i t − η(git(xit) + ρ(xit − x̃t)) (3)\nx̃t+1 = x̃t + η p∑ i=1 ρ(xit − x̃t), (4)\nwhere git(x i t) denotes the stochastic gradient of F with respect to x i evaluated at iteration t, xit and x̃t denote respectively the value of variables xi and x̃ at iteration t, and η is the learning rate.\nThe update rule for the center variable x̃ takes the form of moving average where the average is taken over both space and time. Denote α = ηρ and β = pα, then Equation 3 and 4 become\nxit+1 = x i t − ηgit(xit)− α(xit − x̃t) (5)\nx̃t+1 = (1− β)x̃t + β\n( 1\np p∑ i=1 xit\n) . (6)\nNote that choosing β = pα leads to an elastic symmetry in the update rule, i.e. there exists an symmetric force equal to α(xit − x̃t) between the update of each xi and x̃. It has a crucial influence on the algorithm’s stability as will be explained in Section 4. Also in order to minimize the staleness [16] of the difference xit − x̃t between the center and the local variable, the update for the master in Equation 4 involves xit instead of x i t+1.\nNote also that α = ηρ, where the magnitude of ρ represents the amount of exploration we allow in the model. In particular, small ρ allows for more exploration as it allows xi’s to fluctuate further from the center x̃. The distinctive idea of EASGD is to allow the local workers to perform more exploration (small ρ) and the master to perform exploitation. This approach differs from other settings explored in the literature [2, 17, 18, 19, 20, 21, 22, 23], and focus on how fast the center variable converges. In this paper we show the merits of our approach in the deep learning setting."
    }, {
      "heading" : "3.1 Asynchronous EASGD",
      "text" : "We discussed the synchronous update of EASGD algorithm in the previous section. In this section we propose its asynchronous variant. The local workers are still responsible for updating the local variables xi’s, whereas the master is updating the center variable x̃. Each worker maintains its own clock ti, which starts from 0 and is incremented by 1 after each stochastic gradient update of xi as shown in Algorithm 1. The master performs an update whenever the local workers finished τ steps of their gradient updates, where we refer to τ as the communication period. As can be seen in Algorithm 1, whenever τ divides the local clock of the ith worker, the ith worker communicates with the master and requests the current value of the center variable x̃. The worker then waits until the master sends back the requested parameter value, and computes the elastic difference α(x− x̃) (this entire procedure is captured in step a) in Algorithm 1). The elastic difference is then sent back to the master (step b) in Algorithm 1) who then updates x̃.\nThe communication period τ controls the frequency of the communication between every local worker and the master, and thus the trade-off between exploration and exploitation.\nAlgorithm 1: Asynchronous EASGD: Processing by worker i and the master\nInput: learning rate η, moving rate α, communication period τ ∈ N Initialize: x̃ is initialized randomly, xi = x̃, ti = 0 Repeat x← xi if (τ divides ti) then\na) xi ← xi − α(x− x̃) b) x̃ ← x̃ + α(x− x̃)\nend xi ← xi − ηgiti(x) ti ← ti + 1\nUntil forever\nAlgorithm 2: Asynchronous EAMSGD: Processing by worker i and the master\nInput: learning rate η, moving rate α, communication period τ ∈ N, momentum term δ Initialize: x̃ is initialized randomly, xi = x̃, vi = 0, ti = 0 Repeat x← xi if (τ divides ti) then\na) xi ← xi − α(x− x̃) b) x̃ ← x̃ + α(x− x̃)\nend vi ← δvi − ηgiti(x+ δv\ni) xi ← xi + vi ti ← ti + 1\nUntil forever"
    }, {
      "heading" : "3.2 Momentum EASGD",
      "text" : "The momentum EASGD (EAMSGD) is a variant of our Algorithm 1 and is captured in Algorithm 2. It is based on the Nesterov’s momentum scheme [24, 25, 26], where the update of the local worker of the form captured in Equation 3 is replaced by the following update\nvit+1 = δv i t − ηgit(xit + δvit) (7)\nxit+1 = x i t + v i t+1 − ηρ(xit − x̃t),\nwhere δ is the momentum term. Note that when δ = 0 we recover the original EASGD algorithm.\nAs we are interested in reducing the communication overhead in the parallel computing environment where the parameter vector is very large, we will be exploring in the experimental section the asynchronous EASGD algorithm and its momentum-based variant in the relatively large τ regime (less frequent communication)."
    }, {
      "heading" : "4 Stability analysis of EASGD and ADMM in the round-robin scheme",
      "text" : "In this section we study the stability of the asynchronous EASGD and ADMM methods in the roundrobin scheme [20]. We first state the updates of both algorithms in this setting, and then we study\ntheir stability. We will show that in the one-dimensional quadratic case, ADMM algorithm can exhibit chaotic behavior, leading to exponential divergence. The analytic condition for the ADMM algorithm to be stable is still unknown, while for the EASGD algorithm it is very simple1.\nThe analysis of the synchronous EASGD algorithm, including its convergence rate, and its averaging property, in the quadratic and strongly convex case, is deferred to the Supplement.\nIn our setting, the ADMM method [9, 27, 28] involves solving the following minimax problem2,\nmax λ1,...,λp min x1,...,xp,x̃ p∑ i=1 F (xi)− λi(xi − x̃) + ρ 2 ‖xi − x̃‖2, (8)\nwhere λi’s are the Lagrangian multipliers. The resulting updates of the ADMM algorithm in the round-robin scheme are given next. Let t ≥ 0 be a global clock. At each t, we linearize the function F (xi) with F (xit) + 〈 ∇F (xit), xi − xit 〉 + 12η ∥∥xi − xit∥∥2 as in [28]. The updates become λit+1 = { λit − (xit − x̃t) if mod (t, p) = i− 1; λit if mod (t, p) 6= i− 1. (9)\nxit+1 =\n{ xit−η∇F (x i t)+ηρ(λ i t+1+x̃t)\n1+ηρ if mod (t, p) = i− 1; xit if mod (t, p) 6= i− 1.\n(10)\nx̃t+1 = 1\np p∑ i=1 (xit+1 − λit+1). (11)\nEach local variable xi is periodically updated (with period p). First, the Lagrangian multiplier λi is updated with the dual ascent update as in Equation 9. It is followed by the gradient descent update of the local variable as given in Equation 10. Then the center variable x̃ is updated with the most recent values of all the local variables and Lagrangian multipliers as in Equation 11. Note that since the step size for the dual ascent update is chosen to be ρ by convention [9, 27, 28], we have re-parametrized the Lagrangian multiplier to be λit ← λit/ρ in the above updates. The EASGD algorithm in the round-robin scheme is defined similarly and is given below\nxit+1 = { xit − η∇F (xit)− α(xit − x̃t) if mod (t, p) = i− 1; xit if mod (t, p) 6= i− 1.\n(12)\nx̃t+1 = x̃t + ∑\ni: mod (t,p)=i−1\nα(xit − x̃t). (13)\nAt time t, only the i-th local worker (whose index i−1 equals tmodulo p) is activated, and performs the update in Equations 12 which is followed by the master update given in Equation 13.\nWe will now focus on the one-dimensional quadratic case without noise, i.e. F (x) = x 2\n2 , x ∈ R.\nFor the ADMM algorithm, let the state of the (dynamical) system at time t be st = (λ1t , x 1 t , . . . , λ p t , x p t , x̃t) ∈ R2p+1. The local worker i’s updates in Equations 9, 10, and 11 are composed of three linear maps which can be written as st+1 = (F i3 ◦ F i2 ◦ F i1)(st). For simplicity, we will only write them out below for the case when i = 1 and p = 2:\nF 11=  1 −1 0 0 1 0 1 0 0 0 0 0 1 0 0 0 0 0 1 0 0 0 0 0 1 , F 12=  1 0 0 0 0 ηρ 1+ηρ 1−η 1+ηρ 0 0 ηρ 1+ηρ 0 0 1 0 0 0 0 0 1 0 0 0 0 0 1 , F 13=  1 0 0 0 0 0 1 0 0 0 0 0 1 0 0 0 0 0 1 0 − 1 p 1 p − 1 p 1 p 0 .\nFor each of the p linear maps, it’s possible to find a simple condition such that each map, where the ith map has the form F i3 ◦ F i2 ◦ F i1, is stable (the absolute value of the eigenvalues of the map are\n1This condition resembles the stability condition for the synchronous EASGD algorithm (Condition 17 for p = 1) in the analysis in the Supplement.\n2The convergence analysis in [27] is based on the assumption that “At any master iteration, updates from the workers have the same probability of arriving at the master.”, which is not satisfied in the round-robin scheme.\nsmaller or equal to one). However, when these non-symmetric maps are composed one after another as follows F = F p3 ◦F p 2 ◦F p 1 ◦ . . .◦F 13 ◦F 12 ◦F 11 , the resulting map F can become unstable! (more precisely, some eigenvalues of the map can sit outside the unit circle in the complex plane).\nWe now present the numerical conditions for which the ADMM algorithm becomes unstable in the round-robin scheme for p = 3 and p = 8, by computing the largest absolute eigenvalue of the map F . Figure 1 summarizes the obtained result.\nOn the other hand, the EASGD algorithm involves composing only symmetric linear maps due to the elasticity. Let the state of the (dynamical) system at time t be st = (x1t , . . . , x p t , x̃t) ∈ Rp+1. The activated local worker i’s update in Equation 12 and the master update in Equation 13 can be written as st+1 = F i(st). In case of p = 2, the map F 1 and F 2 are defined as follows\nF 1=\n( 1− η − α 0 α\n0 1 0 α 0 1− α\n) , F 2= ( 1 0 0 0 1− η − α α 0 α 1− α ) For the composite map F p ◦ . . . ◦ F 1 to be stable, the condition that needs to be satisfied is actually the same for each i, and is furthermore independent of p (since each linear map F i is symmetric).\nIt essentially involves the stability of the 2 × 2 matrix (\n1− η − α α α 1− α\n) , whose two (real)\neigenvalues λ satisfy (1− η − α− λ)(1− α− λ) = α2. The resulting stability condition (|λ| ≤ 1) is simple and given as 0 ≤ η ≤ 2, 0 ≤ α ≤ 4−2η4−η ."
    }, {
      "heading" : "5 Experiments",
      "text" : "In this section we compare the performance of EASGD and EAMSGD with the parallel method DOWNPOUR and the sequential method SGD, as well as their averaging and momentum variants.\nAll the parallel comparator methods are listed below3:\n• DOWNPOUR [2], the pseudo-code of the implementation of DOWNPOUR used in this paper is enclosed in the Supplement. • Momentum DOWNPOUR (MDOWNPOUR), where the Nesterov’s momentum scheme is applied to the master’s update (note it is unclear how to apply it to the local workers or for the case when τ > 1). The pseudo-code is in the Supplement. • A method that we call ADOWNPOUR, where we compute the average over time of the center variable x̃ as follows: zt+1 = (1− αt+1)zt + αt+1x̃t, and αt+1 = 1t+1 is a moving rate, and z0 = x̃0. t denotes the master clock, which is initialized to 0 and incremented every time the center variable x̃ is updated. • A method that we call MVADOWNPOUR, where we compute the moving average of the\ncenter variable x̃ as follows: zt+1 = (1 − α)zt + αx̃t, and the moving rate α was chosen to be constant, and z0 = x̃0. t denotes the master clock and is defined in the same way as for the ADOWNPOUR method.\n3We have compared asynchronous ADMM [27] with EASGD in our setting as well, the performance is nearly the same. However, ADMM’s momentum variant is not as stable for large communication periods.\nAll the sequential comparator methods (p = 1) are listed below:\n• SGD [1] with constant learning rate η. • Momentum SGD (MSGD) [26] with constant momentum δ. • ASGD [6] with moving rate αt+1 = 1t+1 . • MVASGD [6] with moving rate α set to a constant.\nWe perform experiments in a deep learning setting on two benchmark datasets: CIFAR-10 (we refer to it as CIFAR) 4 and ImageNet ILSVRC 2013 (we refer to it as ImageNet) 5. We focus on the image classification task with deep convolutional neural networks. We next explain the experimental setup. The details of the data preprocessing and prefetching are deferred to the Supplement."
    }, {
      "heading" : "5.1 Experimental setup",
      "text" : "For all our experiments we use a GPU-cluster interconnected with InfiniBand. Each node has 4 Titan GPU processors where each local worker corresponds to one GPU processor. The center variable of the master is stored and updated on the centralized parameter server [2]6.\nTo describe the architecture of the convolutional neural network, we will first introduce a notation. Let (c, y) denotes the size of the input image to each layer, where c is the number of color channels and y is both the horizontal and the vertical dimension of the input. Let C denotes the fully-connected convolutional operator and let P denotes the max pooling operator, D denotes the linear operator with dropout rate equal to 0.5 and S denotes the linear operator with softmax output non-linearity. We use the cross-entropy loss and all inner layers use rectified linear units. For the ImageNet experiment we use the similar approach to [4] with the following 11-layer convolutional neural network (3,221)C(96,108)P(96,36)C(256,32)P(256,16)C(384,14) C(384,13)C(256,12)P(256,6)D(4096,1)D(4096,1)S(1000,1). For the CIFAR experiment we use the similar approach to [29] with the following 7-layer convolutional neural network (3,28)C(64,24)P(64,12)C(128,8)P(128,4)C(64,2)D(256,1)S(10,1).\nIn our experiments all the methods we run use the same initial parameter chosen randomly, except that we set all the biases to zero for CIFAR case and to 0.1 for ImageNet case. This parameter is used to initialize the master and all the local workers7. We add l2-regularization λ2 ‖x‖\n2 to the loss function F (x). For ImageNet we use λ = 10−5 and for CIFAR we use λ = 10−4. We also compute the stochastic gradient using mini-batches of sample size 128."
    }, {
      "heading" : "5.2 Experimental results",
      "text" : "For all experiments in this section we use EASGD with β = 0.98 , for all momentum-based methods we set the momentum term δ = 0.99 and finally for MVADOWNPOUR we set the moving rate to α = 0.001. We start with the experiment on CIFAR dataset with p = 4 local workers running on a single computing node. For all the methods, we examined the communication periods from the following set τ = {1, 4, 16, 64}. For comparison we also report the performance of MSGD which outperformed SGD, ASGD and MVASGD as shown in Figure 6 in the Supplement. For each method we examined a wide range of learning rates (the learning rates explored in all experiments are summarized in Table 1, 2, 3 in the Supplement). The CIFAR experiment was run 3 times independently from the same initialization and for each method we report its best performance measured by the smallest achievable test error. From the results in Figure 2, we conclude that all DOWNPOURbased methods achieve their best performance (test error) for small τ (τ ∈ {1, 4}), and become highly unstable for τ ∈ {16, 64}. While EAMSGD significantly outperforms comparator methods for all values of τ by having faster convergence. It also finds better-quality solution measured by the test error and this advantage becomes more significant for τ ∈ {16, 64}. Note that the tendency to achieve better test performance with larger τ is also characteristic for the EASGD algorithm.\n4Downloaded from http://www.cs.toronto.edu/˜kriz/cifar.html. 5Downloaded from http://image-net.org/challenges/LSVRC/2013. 6Our implementation is available at https://github.com/sixin-zh/mpiT. 7On the contrary, initializing the local workers and the master with different random seeds ’traps’ the algo-\nrithm in the symmetry breaking phase. 8Intuitively the ’effective β’ is β/τ = pα = pηρ (thus ρ = β\nτpη ) in the asynchronous setting.\nWe next explore different number of local workers p from the set p = {4, 8, 16} for the CIFAR experiment, and p = {4, 8} for the ImageNet experiment9. For the ImageNet experiment we report the results of one run with the best setting we have found. EASGD and EAMSGD were run with τ = 10 whereas DOWNPOUR and MDOWNPOUR were run with τ = 1. The results are in Figure 3 and 4. For the CIFAR experiment, it’s noticeable that the lowest achievable test error by either EASGD or EAMSGD decreases with larger p. This can potentially be explained by the fact that larger p allows for more exploration of the parameter space. In the Supplement, we discuss further the trade-off between exploration and exploitation as a function of the learning rate (section 9.5) and the communication period (section 9.6). Finally, the results obtained for the ImageNet experiment also shows the advantage of EAMSGD over the competitor methods."
    }, {
      "heading" : "6 Conclusion",
      "text" : "In this paper we describe a new algorithm called EASGD and its variants for training deep neural networks in the stochastic setting when the computations are parallelized over multiple GPUs. Experiments demonstrate that this new algorithm quickly achieves improvement in test error compared to more common baseline approaches such as DOWNPOUR and its variants. We show that our approach is very stable and plausible under communication constraints. We provide the stability analysis of the asynchronous EASGD in the round-robin scheme, and show the theoretical advantage of the method over ADMM. The different behavior of the EASGD algorithm from its momentumbased variant EAMSGD is intriguing and will be studied in future works.\n9For the ImageNet experiment, the training loss is measured on a subset of the training data of size 50,000."
    }, {
      "heading" : "Acknowledgments",
      "text" : "The authors thank R. Power, J. Li for implementation guidance, J. Bruna, O. Henaff, C. Farabet, A. Szlam, Y. Bakhtin for helpful discussion, P. L. Combettes, S. Bengio and the referees for valuable feedback."
    }, {
      "heading" : "7 Additional theoretical results and proofs",
      "text" : ""
    }, {
      "heading" : "7.1 Quadratic case",
      "text" : "We provide here the convergence analysis of the synchronous EASGD algorithm with constant learning rate. The analysis is focused on the convergence of the center variable to the local optimum. We discuss one-dimensional quadratic case first, then the generalization to multi-dimensional setting (Lemma 7.3) and finally to the strongly convex case (Theorem 7.1).\nOur analysis in the quadratic case extends the analysis of ASGD in [6]. Assume each of the p local workers xit ∈ Rn observes a noisy gradient at time t ≥ 0 of the linear form given in Equation 14.\ngit(x i t) = Ax i t − b− ξit, i ∈ {1, . . . , p}, (14)\nwhere the matrix A is positive-definite (each eigenvalue is strictly positive) and {ξit}’s are i.i.d. random variables, with zero mean and positive-definite covariance Σ. Let x∗ denote the optimum solution, where x∗ = A−1b ∈ Rn. In this section we analyze the behavior of the mean squared error (MSE) of the center variable x̃t, where this error is denoted as E[‖x̃t − x∗‖2], as a function of t, p, η, α and β, where β = pα. Note that the MSE error can be decomposed as (squared) bias and variance10: E[‖x̃t − x∗‖2] = ‖E[x̃t − x∗]‖2 + V[x̃t − x∗]. For one-dimensional case (n = 1), we assume A = h > 0 and Σ = σ2 > 0. Lemma 7.1. Let x̃0 and {xi0}i=1,...,p be arbitrary constants, then\nE[x̃t − x∗] = γt(x̃0 − x∗) + γt − φt\nγ − φ αu0, (15)\nV[x̃t − x∗] = p2α2η2\n(γ − φ)2\n( γ2 − γ2t\n1− γ2 + φ2 − φ2t 1− φ2 − 2γφ− (γφ) t 1− γφ\n) σ2\np , (16)\nwhere u0 = ∑p i=1(x i 0−x∗− α1−pα−φ (x̃0−x ∗)), a = ηh+(p+1)α, c2 = ηhpα, γ = 1− a− √ a2−4c2 2 , and φ = 1− a+ √ a2−4c2 2 .\nIt follows from Lemma 7.1 that for the center variable to be stable the following has to hold −1 < φ < γ < 1. (17)\nIt can be verified that φ and γ are the two zero-roots of the polynomial in λ: λ2 − (2− a)λ+ (1− a+ c2). Recall that φ and λ are the functions of η and α. Thus (see proof in Section 7.1.2)\n• γ < 1 iff c2 > 0 (i.e. η > 0 and α > 0). • φ > −1 iff (2− ηh)(2− pα) > 2α and (2− ηh) + (2− pα) > α. • φ = γ iff a2 = 4c2 (i.e. ηh = α = 0).\nThe proof the above Lemma is based on the diagonalization of the linear gradient map (this map is symmetric due to the relation β = pα). The stability analysis of the asynchronous EASGD algorithm in the round-robin scheme is similar due to this elastic symmetry.\nProof. Substituting the gradient from Equation 14 into the update rule used by each local worker in the synchronous EASGD algorithm (Equation 5 and 6) we obtain\nxit+1 = x i t − η(Axit − b− ξit)− α(xit − x̃t), (18)\nx̃t+1 = x̃t + p∑ i=1 α(xit − x̃t), (19)\n10In our notation, V denotes the variance.\nwhere η is the learning rate, and α is the moving rate. Recall that α = ηρ and A = h.\nFor the ease of notation we redefine x̃t and xit as follows:\nx̃t , x̃t − x∗ and xit , xit − x∗. We prove the lemma by explicitly solving the linear equations 18 and 19. Let xt = (x1t , . . . , x p t , x̃t) T . We rewrite the recursive relation captured in Equation 18 and 19 as simply\nxt+1 = Mxt + bt,\nwhere the drift matrix M is defined as\nM =  1− α− ηh 0 ... 0 α\n0 1− α− ηh 0 ... α ... 0 ... 0 ... 0 ... 0 1− α− ηh α α α ... α 1− pα  , and the (diffusion) vector bt = (ηξ1t , . . . , ηξ p t , 0) T .\nNote that one of the eigenvalues of matrixM , that we call φ, satisfies (1−α−ηh−φ)(1−pα−φ) = pα2. The corresponding eigenvector is (1, 1, . . . , 1,− pα1−pα−φ )\nT . Let ut be the projection of xt onto this eigenvector. Thus ut = ∑p i=1(x i t − α1−pα−φ x̃t). Let furthermore ξt = ∑p i=1 ξ i t . Therefore we have\nut+1 = φut + ηξt. (20)\nBy combining Equation 19 and 20 as follows\nx̃t+1 = x̃t + p∑ i=1 α(xit − x̃t) = (1− pα)x̃t + α(ut + pα 1− pα− φ x̃t)\n= (1− pα+ pα 2\n1− pα− φ )x̃t + αut = γx̃t + αut,\nwhere the last step results from the following relations: pα 2\n1−pα−φ = 1 − α − ηh − φ and φ + γ = 1− α− ηh+ 1− pα. Thus we obtained\nx̃t+1 = γx̃t + αut. (21)\nBased on Equation 20 and 21, we can then expand ut and x̃t recursively,\nut+1 = φ t+1u0 + φ t(ηξ0) + . . .+ φ 0(ηξt), (22)\nx̃t+1 = γ t+1x̃0 + γ t(αu0) + . . .+ γ 0(αut). (23)\nSubstituting u0, u1, . . . , ut, each given through Equation 22, into Equation 23 we obtain\nx̃t = γ tx̃0 +\nγt − φt\nγ − φ αu0 + αη t−1∑ l=1 γt−l − φt−l γ − φ ξl−1. (24)\nTo be more specific, the Equation 24 is obtained by integrating by parts,\nx̃t+1 = γ t+1x̃0 + t∑ i=0 γt−i(αui)\n= γt+1x̃0 + t∑ i=0 γt−i(α(φiu0 + i−1∑ l=0 φi−1−lηξl))\n= γt+1x̃0 + t∑ i=0 γt−iφi(αu0) + t−1∑ l=0 t∑ i=l+1 γt−iφi−1−l(αηξl)\n= γt+1x̃0 + γt+1 − φt+1\nγ − φ (αu0) + t−1∑ l=0 γt−l − φt−l γ − φ (αηξl).\nSince the random variables ξl are i.i.d, we may sum the variance term by term as follows\nt−1∑ l=0 ( γt−l − φt−l γ − φ )2 = t−1∑ l=0 γ2(t−l) − 2γt−lφt−l + φ2(t−l) (γ − φ)2\n= 1\n(γ − φ)2\n( γ2 − γ2(t+1)\n1− γ2 − 2γφ− (γφ) t+1 1− γφ + φ2 − φ2(t+1) 1− φ2\n) . (25)\nNote that E[ξt] = ∑p i=1 E[ξit] = 0 and V[ξt] = ∑p i=1 V[ξit] = pσ2. These two facts, the equality in Equation 24 and Equation 25 can then be used to compute E[x̃t] and V[x̃t] as given in Equation 15 and 16 in Lemma 7.1.\n7.1.1 Visualizing Lemma 7.1\nIn Figure 5, we illustrate the dependence of MSE on β, η and the number of processors p over time t. We consider the large-noise setting where x̃0 = xi0 = 1, h = 1 and σ = 10. The MSE error is color-coded such that the deep blue color corresponds to the MSE equal to 10−3, the green color corresponds to the MSE equal to 1, the red color corresponds to MSE equal to 103 and the dark red color corresponds to the divergence of algorithm EASGD (condition in Equation 17 is then violated). The plot shows that we can achieve significant variance reduction by increasing the number of local workers p. This effect is less sensitive to the choice of β and η for large p."
    }, {
      "heading" : "7.1.2 Condition in Equation 17",
      "text" : "We are going to show that\n• γ < 1 iff c2 > 0 (i.e. η > 0 and β > 0). • φ > −1 iff (2− ηh)(2− β) > 2β/p and (2− ηh) + (2− β) > β/p. • φ = γ iff a2 = 4c2 (i.e. ηh = β = 0).\nRecall that a = ηh+ (p+ 1)α, c2 = ηhpα, γ = 1− a− √ a2−4c2 2 , φ = 1− a+ √ a2−4c2 2 , and β = pα. We have\n• γ < 1⇔ a− √ a2−4c2 2 > 0⇔ a > √ a2 − 4c2 ⇔ a2 > a2 − 4c2 ⇔ c2 > 0. • φ > −1⇔ 2 > a+ √ a2−4c2 2 ⇔ 4− a > √ a2 − 4c2 ⇔ 4− a > 0, (4− a)2 > a2 − 4c2 ⇔\n4− a > 0, 4− 2a+ c2 > 0⇔ 4 > ηh+ β + α, 4− 2(ηh+ β + α) + ηhβ > 0. • φ = γ ⇔ √ a2 − 4c2 = 0⇔ a2 = 4c2.\nThe next corollary is a consequence of Lemma 7.1. As the number of workers p grows, the averaging property of the EASGD can be characterized as follows Corollary 7.1. Let the Elastic Averaging relation β = pα and the condition 17 hold, then\nlim p→∞ lim t→∞\npE[(x̃t − x∗)2] = βηh (2− β)(2− ηh) · 2− β − ηh+ βηh β + ηh− βηh · σ 2 h2 .\nProof. Note that when β is fixed, limp→∞ a = ηh+ β and c2 = ηhβ. Then limp→∞ φ = min(1− β, 1− ηh) and limp→∞ γ = max(1− β, 1− ηh). Also note that using Lemma 7.1 we obtain\nlim t→∞\nE[(x̃t − x∗)2] = β2η2\n(γ − φ)2\n( γ2\n1− γ2 +\nφ2\n1− φ2 − 2γφ 1− γφ\n) σ2\np\n= β2η2\n(γ − φ)2\n( γ2(1− φ2)(1− φγ) + φ2(1− γ2)(1− φγ)− 2γφ(1− γ2)(1− φ2)\n(1− γ2)(1− φ2)(1− γφ)\n) σ2\np\n= β2η2\n(γ − φ)2\n( (γ − φ)2(1 + γφ)\n(1− γ2)(1− φ2)(1− γφ)\n) σ2\np\n= β2η2 (1− γ2)(1− φ2) · 1 + γφ 1− γφ · σ 2 p .\nCorollary 7.1 is obtained by plugining in the limiting values of φ and γ.\nThe crucial point of Corollary 7.1 is that the MSE in the limit t → ∞ is in the order of 1/p which implies that as the number of processors p grows, the MSE will decrease for the EASGD algorithm. Also note that the smaller the β is (recall that β = pα = pηρ), the more exploration is allowed (small ρ) and simultaneously the smaller the MSE is."
    }, {
      "heading" : "7.2 Generalization to multidimensional case",
      "text" : "The next lemma (Lemma 7.2) shows that EASGD algorithm achieves the highest possible rate of convergence when we consider the double averaging sequence (similarly to [6]) {z1, z2, . . . } defined as below\nzt+1 = 1\nt+ 1 t∑ k=0 x̃k. (26)\nLemma 7.2 (Weak convergence). If the condition in Equation 17 holds, then the normalized double averaging sequence defined in Equation 26 converges weakly to the normal distribution with zero mean and variance σ2/ph2,\n√ t(zt − x∗) ⇀ N (0, σ2\nph2 ), t→∞. (27)\nProof. As in the proof of Lemma 7.1, for the ease of notation we redefine x̃t and xit as follows:\nx̃t , x̃t − x∗ and xit , xit − x∗.\nAlso recall that {ξit}’s are i.i.d. random variables (noise) with zero mean and the same covariance Σ 0. We are interested in the asymptotic behavior of the double averaging sequence {z1, z2, . . . } defined as\nzt+1 = 1\nt+ 1 t∑ k=0 x̃k. (28)\nRecall the Equation 24 from the proof of Lemma 7.1 (for the convenience it is provided below):\nx̃k = γ kx̃0 + αu0\nγk − φk\nγ − φ + αη k−1∑ l=1 γk−l − φk−l γ − φ ξl−1,\nwhere ξt = ∑p i=1 ξ i t . Therefore\nt∑ k=0 x̃k = 1− γt+1 1− γ x̃0 + αu0 1 γ − µ ( 1− γt+1 1− γ − 1− φ t+1 1− φ ) + αη t−1∑ l=1 t∑ k=l+1 γk−l − φk−l γ − φ ξl−1\n= O(1) + αη t−1∑ l=1 1 γ − φ ( γ 1− γt−l 1− γ − φ1− φ t−l 1− φ ) ξl−1\nNote that the only non-vanishing term (in weak convergence) of 1/ √ t ∑t k=0 x̃k as t→∞ is\n1√ t αη t−1∑ l=1 1 γ − φ ( γ 1− γ − φ 1− φ ) ξl−1. (29)\nAlso recall that V[ξl−1] = pσ2 and 1\nγ − φ\n( γ\n1− γ − φ 1− φ\n) =\n1\n(1− γ)(1− φ) =\n1\nηhpα .\nTherefore the expression in Equation 29 is asymptotically normal with zero mean and variance σ2/ph2.\nThe asymptotic variance in the Lemma 7.2 is optimal with any fixed η and β for which Equation 17 holds. The next lemma (Lemma 7.3) extends the result in Lemma 7.2 to the multi-dimensional setting. Lemma 7.3 (Weak convergence). Let h denotes the largest eigenvalue of A. If (2− ηh)(2− β) > 2β/p, (2 − ηh) + (2 − β) > β/p, η > 0 and β > 0, then the normalized double averaging sequence converges weakly to the normal distribution with zero mean and the covariance matrix V = A−1Σ(A−1)T ,\n√ tp(zt − x∗) ⇀ N (0, V ), t→∞. (30)\nProof. Since A is symmetric, one can use the proof technique of Lemma 7.2 to prove Lemma 7.3 by diagonalizing the matrix A. This diagonalization essentially generalizes Lemma 7.1 to the multidimensional case. We will not go into the details of this proof as we will provide a simpler way to look at the system. As in the proof of Lemma 7.1 and Lemma 7.2, for the ease of notation we redefine x̃t and xit as follows:\nx̃t , x̃t − x∗ and xit , xit − x∗. Let the spatial average of the local parameters at time t be denoted as yt where yt = 1p ∑p i=1 x i t,\nand let the average noise be denoted as ξt, where ξt = 1p ∑p i=1 ξ i t . Equations 18 and 19 can then be reduced to the following\nyt+1 = yt − η(Ayt − ξt) + α(x̃t − yt), (31) x̃t+1 = x̃t + β(yt − x̃t). (32)\nWe focus on the case where the learning rate η and the moving rate α are kept constant over time11. Recall β = pα and α = ηρ.\nLet’s introduce the block notation Ut = (yt, x̃t), Ξt = (ηξt, 0), M = I − ηL and\nL =\n( A+ αη I − α η I\n−βη I β η I\n) .\nFrom Equations 31 and 32 it follows that Ut+1 = MUt + Ξt. Note that this linear system has a degenerate noise Ξt which prevents us from directly applying results of [6]. Expanding this recursive relation and summing by parts, we have\nt∑ k=0 Uk = M 0U0 +\nM1U0 +M 0Ξ0 + M2U0 +M 1Ξ0 +M 0Ξ1 +\n... M tU0 +M t−1Ξ0 + · · ·+M0Ξt−1.\nBy Lemma 7.4, ‖M‖2 < 1 and thus\nM0 +M1 + · · ·+M t + · · · = (I −M)−1 = η−1L−1.\nSince A is invertible, we get\nL−1 =\n( A−1 αβA −1\nA−1 ηβ + α βA −1\n) ,\nthus\n1√ t t∑ k=0 Uk = 1√ t U0 + 1√ t ηL−1 t∑ k=1 Ξk−1 − 1√ t t∑ k=1 Mk+1Ξk−1.\nNote that the only non-vanishing term (in weak convergence) of 1√ t ∑t k=0 Uk is 1√ t (ηL)−1 ∑t k=1 Ξk−1 thus we have\n1√ t (ηL)−1 t∑ k=1 Ξk−1 ⇀ N (( 0 0 ) , ( V V V V )) , (33)\nwhere V = A−1Σ(A−1)T .\nLemma 7.4. If the following conditions hold:\n(2− ηh)(2− pα) > 2α (2− ηh) + (2− pα) > α\nη > 0\nα > 0\nthen ‖M‖2 < 1.\nProof. The eigenvalue λ of M and the (non-zero) eigenvector (y, z) of M satisfy\nM ( y z ) = λ ( y z ) . (34)\n11As a side note, notice that the center parameter x̃t is tracking the spatial average yt of the local parameters with a non-symmetric spring in Equation 31 and 32. To be more precise note that the update on yt+1 contains (x̃t−yt) scaled by α, whereas the update on x̃t+1 contains −(x̃t−yt) scaled by β. Since α = β/p the impact of the center x̃t+1 on the spatial local average yt+1 becomes more negligible as p grows.\nRecall that\nM = I − ηL = ( I − ηA− αI αI\nβI I − βI\n) . (35)\nFrom the Equations 34 and 35 we obtain{ y − ηAy − αy + αz = λy βy + (1− β)z = λz . (36)\nSince (y, z) is assumed to be non-zero, we can write z = βy/(λ + β − 1). Then the Equation 36 can be reduced to\nηAy = (1− α− λ)y + αβ λ+ β − 1 y. (37)\nThus y is the eigenvector of A. Let λA be the eigenvalue of matrix A such that Ay = λAy. Thus based on Equation 37 it follows that\nηλA = (1− α− λ) + αβ\nλ+ β − 1 . (38)\nEquation 38 is equivalent to\nλ2 − (2− a)λ+ (1− a+ c2) = 0, (39) where a = ηλA + (p + 1)α, c2 = ηλApα. It follows from the condition in Equation 17 that −1 < λ < 1 iff η > 0, β > 0, (2 − ηλA)(2 − β) > 2β/p and (2 − ηλA) + (2 − β) > β/p. Let h denote the maximum eigenvalue of A and note that 2− ηλA ≥ 2− ηh. This implies that the condition of our lemma is sufficient.\nAs in Lemma 7.2, the asymptotic covariance in the Lemma 7.3 is optimal, i.e. meets the Fisher information lower-bound. The fact that this asymptotic covariance matrix V does not contain any term involving ρ is quite remarkable, since the penalty term ρ does have an impact on the condition number of the Hessian in Equation 2."
    }, {
      "heading" : "7.3 Strongly convex case",
      "text" : "We now extend the above proof ideas to analyze the strongly convex case, in which the noisy gradient git(x) = ∇F (x)− ξit has the regularity that there exists some 0 < µ ≤ L, for which µ ‖x− y‖\n2 ≤ 〈∇F (x)−∇F (y), x− y〉 ≤ L ‖x− y‖2 holds uniformly for any x ∈ Rd, y ∈ Rd. The noise {ξit}’s is assumed to be i.i.d. with zero mean and bounded variance E[\n∥∥ξit∥∥2] ≤ σ2. Theorem 7.1. Let at = E\n∥∥∥ 1p∑pi=1 xit − x∗∥∥∥2, bt = 1p∑pi=1 E∥∥xit − x∗∥∥2, ct = E ‖x̃t − x∗‖2, γ1 = 2η µL µ+L and γ2 = 2ηL(1− 2 √ µL µ+L ). If 0 ≤ η ≤ 2\nµ+L (1− α), 0 ≤ α < 1 and 0 ≤ β ≤ 1 then( at+1 bt+1 ct+1 ) ≤ ( 1− γ1 − γ2 − α γ2 α 0 1− γ1 − α α β 0 1− β )( at bt ct ) + η2 σ2pη2σ2 0  . Proof. The idea of the proof is based on the point of view in Lemma 7.3, i.e. how close the center variable x̃t is to the spatial average of the local variables yt = 1p ∑p i=1 x i t. To further simplify the notation, let the noisy gradient be ∇f it,ξ = git(xit) = ∇F (xit) − ξit , and ∇f it = ∇F (xit) be its deterministic part. Then EASGD updates can be rewritten as follows,\nxit+1 = x i t − η∇f it,ξ − α(xit − x̃t), (40)\nx̃t+1 = x̃t + β(yt − x̃t). (41) We have thus the update for the spatial average,\nyt+1 = yt − η 1\np p∑ i=1 ∇f it,ξ − α(yt − x̃t). (42)\nThe idea of the proof is to bound the distance ‖x̃t − x∗‖2 through ‖yt − x∗‖2 and 1 p ∑p i ∥∥xit − x∗∥∥2. W start from the following estimate for the strongly convex function [31], 〈∇F (x)−∇F (y), x− y〉 ≥ µL\nµ+ L ‖x− y‖2 + 1 µ+ L ‖∇F (x)−∇F (y)‖2 .\nSince∇f(x∗) = 0, we have〈 ∇f it , xit − x∗ 〉 ≥ µL µ+ L ∥∥xit − x∗∥∥2 + 1µ+ L ∥∥∇f it∥∥2 . (43) From Equation 40 the following relation holds,∥∥xit+1 − x∗∥∥2 = ∥∥xit − x∗∥∥2 + η2 ∥∥∇f it,ξ∥∥2 + α2 ∥∥xit − x̃t∥∥2\n− 2η 〈 ∇f it,ξ, xit − x∗ 〉 − 2α 〈 xit − x̃t, xit − x∗ 〉 + 2ηα 〈 ∇f it,ξ, xit − x̃t 〉 . (44)\nBy the cosine rule (2 〈a− b, c− d〉 = ‖a− d‖2 − ‖a− c‖2 + ‖c− b‖2 − ‖d− b‖2), we have 2 〈 xit − x̃t, xit − x∗ 〉 = ∥∥xit − x∗∥∥2 + ∥∥xit − x̃t∥∥2 − ‖x̃t − x∗‖2 . (45) By the Cauchy-Schwarz inequality, we have〈 ∇f it , xit − x̃t 〉 ≤ ∥∥∇f it∥∥ ∥∥xit − x̃t∥∥ . (46) Combining the above estimates in Equations 43, 44, 45, 46, we obtain∥∥xit+1 − x∗∥∥2 ≤ ∥∥xit − x∗∥∥2 + η2 ∥∥∇f it − ξit∥∥2 + α2 ∥∥xit − x̃t∥∥2 − 2η ( µL\nµ+ L ∥∥xit − x∗∥∥2 + 1µ+ L ∥∥∇f it∥∥2 ) + 2η 〈 ξit, x i t − x∗ 〉 − α\n( ∥∥xit − x∗∥∥2 + ∥∥xit − x̃t∥∥2 − ‖x̃t − x∗‖2 ) + 2ηα\n∥∥∇f it∥∥ ∥∥xit − x̃t∥∥ − 2ηα 〈ξit, xit − x̃t〉 . (47) Choosing 0 ≤ α < 1, we can have this upper-bound for the terms α2\n∥∥xit − x̃t∥∥2−α ∥∥xit − x̃t∥∥2 + 2ηα\n∥∥∇f it∥∥ ∥∥xit − x̃t∥∥ = −α(1 − α)∥∥xit − x̃t∥∥2 + 2ηα ∥∥∇f it∥∥ ∥∥xit − x̃t∥∥ ≤ η2α1−α ∥∥∇f it∥∥2 by applying −ax2 + bx ≤ b 2\n4a with x = ∥∥xit − x̃t∥∥. Thus we can further bound Equation 47 with∥∥xit+1 − x∗∥∥2 ≤ (1− 2η µLµ+ L − α)∥∥xit − x∗∥∥2 + (η2 + η2α1− α − 2ηµ+ L )∥∥∇f it∥∥2\n− 2η2 〈 ∇f it , ξit 〉 + 2η 〈 ξit, x i t − x∗ 〉 − 2ηα 〈 ξit, x i t − x̃t 〉 (48)\n+ η2 ∥∥ξit∥∥2 + α ‖x̃t − x∗‖2 (49)\nAs in Equation 48 and 49, the noise ξit is zero mean (Eξit = 0) and the variance of the noise ξit is bounded (E ∥∥ξit∥∥2 ≤ σ2), if η is chosen small enough such that η2 + η2α1−α − 2ηµ+L ≤ 0, then E ∥∥xit+1 − x∗∥∥2 ≤ (1− 2η µLµ+ L − α)E∥∥xit − x∗∥∥2 + η2σ2 + αE ‖x̃t − x∗‖2 . (50)\nNow we apply similar idea to estimate ‖yt − x∗‖2. From Equation 42 the following relation holds, ‖yt+1 − x∗‖2 = ‖yt − x∗‖2 + η2 ∥∥∥∥∥1p p∑ i=1 ∇f it,ξ ∥∥∥∥∥ 2 + α2 ‖yt − x̃t‖2\n− 2η\n〈 1\np p∑ i=1 ∇f it,ξ, yt − x∗ 〉 − 2α 〈yt − x̃t, yt − x∗〉\n+ 2ηα\n〈 1\np p∑ i=1 ∇f it,ξ, yt − x̃t\n〉 . (51)\nBy 〈\n1 p ∑p i=1 ai, 1 p ∑p j=1 bj 〉 = 1p ∑p i=1 〈ai, bi〉 − 1 p2 ∑ i>j 〈ai − aj , bi − bj〉, we have〈\n1\np p∑ i=1 ∇f it , yt − x∗ 〉 = 1 p p∑ i=1 〈 ∇f it , xit − x∗ 〉 − 1 p2 ∑ i>j 〈 ∇f it −∇f j t , x i t − x j t 〉 . (52)\nBy the cosine rule, we have\n2 〈yt − x̃t, yt − x∗〉 = ‖yt − x∗‖2 + ‖yt − x̃t‖2 − ‖x̃t − x∗‖2 . (53)\nDenote ξt = 1p ∑p i=1 ξ i t , we can rewrite Equation 51 as\n‖yt+1 − x∗‖2 = ‖yt − x∗‖2 + η2 ∥∥∥∥∥1p p∑ i=1 ∇f it − ξt ∥∥∥∥∥ 2 + α2 ‖yt − x̃t‖2\n− 2η\n〈 1\np p∑ i=1 ∇f it − ξt, yt − x∗ 〉 − 2α 〈yt − x̃t, yt − x∗〉\n+ 2ηα\n〈 1\np p∑ i=1 ∇f it − ξt, yt − x̃t\n〉 . (54)\nBy combining the above Equations 52, 53 with 54, we obtain ‖yt+1 − x∗‖2 = ‖yt − x∗‖2 + η2 ∥∥∥∥∥1p p∑ i=1 ∇f it − ξt ∥∥∥∥∥ 2 + α2 ‖yt − x̃t‖2\n− 2η ( 1\np p∑ i=1 〈 ∇f it , xit − x∗ 〉 − 1 p2 ∑ i>j 〈 ∇f it −∇f j t , x i t − x j t 〉 ) (55)\n+ 2η 〈ξt, yt − x∗〉 − α(‖yt − x∗‖2 + ‖yt − x̃t‖2 − ‖x̃t − x∗‖2)\n+ 2ηα\n〈 1\np p∑ i=1 ∇f it − ξt, yt − x̃t\n〉 . (56)\nThus it follows from Equation 43 and 56 that ‖yt+1 − x∗‖2 ≤ ‖yt − x∗‖2 + η2 ∥∥∥∥∥1p p∑ i=1 ∇f it − ξt ∥∥∥∥∥ 2 + α2 ‖yt − x̃t‖2\n− 2η 1 p p∑ i=1 ( µL µ+ L ∥∥xit − x∗∥∥2 + 1µ+ L ∥∥∇f it∥∥2 )\n+ 2η 1\np2 ∑ i>j 〈 ∇f it −∇f j t , x i t − x j t 〉 + 2η 〈ξt, yt − x∗〉 − α(‖yt − x∗‖2 + ‖yt − x̃t‖2 − ‖x̃t − x∗‖2)\n+ 2ηα\n〈 1\np p∑ i=1 ∇f it − ξt, yt − x̃t\n〉 . (57)\nRecall yt = 1p ∑p i=1 x i t, we have the following bias-variance relation,\n1\np p∑ i=1 ∥∥xit − x∗∥∥2 = 1p p∑ i=1 ∥∥xit − yt∥∥2 + ‖yt − x∗‖2 = 1p2 ∑ i>j ∥∥∥xit − xjt∥∥∥2 + ‖yt − x∗‖2 , 1\np p∑ i=1 ∥∥∇f it∥∥2 = 1p2 ∑ i>j ∥∥∥∇f it −∇f jt ∥∥∥2 + ∥∥∥∥∥1p p∑ i=1 ∇f it ∥∥∥∥∥ 2 . (58)\nBy the Cauchy-Schwarz inequality, we have\nµL\nµ+ L ∥∥∥xit − xjt∥∥∥2 + 1µ+ L ∥∥∥∇f it −∇f jt ∥∥∥2 ≥ 2 √ µL µ+ L 〈 ∇f it −∇f j t , x i t − x j t 〉 . (59)\nCombining the above estimates in Equations 57, 58, 59, we obtain ‖yt+1 − x∗‖2 ≤ ‖yt − x∗‖2 + η2 ∥∥∥∥∥1p p∑ i=1 ∇f it − ξt ∥∥∥∥∥ 2 + α2 ‖yt − x̃t‖2\n− 2η ( µL\nµ+ L ‖yt − x∗‖2 +\n1\nµ+ L ∥∥∥∥∥1p p∑ i=1 ∇f it ∥∥∥∥∥ 2)\n+ 2η ( 1− 2 √ µL\nµ+ L\n) 1\np2 ∑ i>j 〈 ∇f it −∇f j t , x i t − x j t 〉 + 2η 〈ξt, yt − x∗〉 − α(‖yt − x∗‖2 + ‖yt − x̃t‖2 − ‖x̃t − x∗‖2)\n+ 2ηα\n〈 1\np p∑ i=1 ∇f it − ξt, yt − x̃t\n〉 . (60)\nSimilarly if 0 ≤ α < 1, we can have this upper-bound for the terms α2 ‖yt − x̃t‖2−α ‖yt − x̃t‖2 + 2ηα ∥∥∥ 1p∑pi=1∇f it∥∥∥ ‖yt − x̃t‖ ≤ η2α1−α ∥∥∥ 1p∑pi=1∇f it∥∥∥2 by applying −ax2 + bx ≤ b24a with x =\n‖yt − x̃t‖. Thus we have the following bound for the Equation 60\n‖yt+1 − x∗‖2 ≤ (1− 2η µL\nµ+ L − α) ‖yt − x∗‖2 + (η2 +\nη2α\n1− α − 2η µ+ L ) ∥∥∥∥∥1p p∑ i=1 ∇f it ∥∥∥∥∥ 2\n− 2η2 〈 1\np p∑ i=1 ∇f it , ξt\n〉 + 2η 〈ξt, yt − x∗〉 − 2ηα 〈ξt, yt − x̃t〉\n+ 2η ( 1− 2 √ µL\nµ+ L\n) 1\np2 ∑ i>j 〈 ∇f it −∇f j t , x i t − x j t 〉 + η2 ‖ξt‖2 + α ‖x̃t − x∗‖2 . (61)\nSince 2 √ µL µ+L ≤ 1, we need also bound the non-linear term 〈 ∇f it −∇f j t , x i t − x j t 〉 ≤ L ∥∥∥xit − xjt∥∥∥2. Recall the bias-variance relation 1p ∑p i=1\n∥∥xit − x∗∥∥2 = 1p2 ∑i>j ∥∥∥xit − xjt∥∥∥2 + ‖yt − x∗‖2. The key observation is that if 1p ∑p i=1\n∥∥xit − x∗∥∥2 remains bounded, then larger variance∑ i>j\n∥∥∥xit − xjt∥∥∥2 implies smaller bias ‖yt − x∗‖2. Thus this non-linear term can be compensated. Again choose η small enough such that η2 + η\n2α 1−α − 2η µ+L ≤ 0 and take expectation in Equation 61,\nE ‖yt+1 − x∗‖2 ≤ (1− 2η µL\nµ+ L − α)E ‖yt − x∗‖2\n+ 2ηL ( 1− 2 √ µL\nµ+ L\n)( 1\np p∑ i=1 E ∥∥xit − x∗∥∥2 − E ‖yt − x∗‖2)\n+ η2 σ2\np + αE ‖x̃t − x∗‖2 . (62)\nAs for the center variable in Equation 41, we apply simply the convexity of the norm ‖·‖2 to obtain\n‖x̃t+1 − x∗‖2 ≤ (1− β) ‖x̃t − x∗‖2 + β ‖yt − x∗‖2 . (63)\nCombing the estimates from Equations 50, 62, 63, and denote at = E ‖yt − x∗‖2, bt = 1 p ∑p i=1 E ∥∥xit − x∗∥∥2, ct = E ‖x̃t − x∗‖2, γ1 = 2η µLµ+L , γ2 = 2ηL(1− 2√µLµ+L ), then( at+1 bt+1 ct+1 ) ≤ ( 1− γ1 − γ2 − α γ2 α 0 1− γ1 − α α β 0 1− β )( at bt ct ) + η2 σ2pη2σ2 0\n , as long as 0 ≤ β ≤ 1, 0 ≤ α < 1 and η2 + η\n2α 1−α − 2η µ+L ≤ 0, i.e. 0 ≤ η ≤ 2 µ+L (1− α)."
    }, {
      "heading" : "8 Additional pseudo-codes of the algorithms",
      "text" : ""
    }, {
      "heading" : "8.1 DOWNPOUR pseudo-code",
      "text" : "Algorithm 3 captures the pseudo-code of the implementation of the DOWNPOUR used in this paper.\nAlgorithm 3: DOWNPOUR: Processing by worker i and the master Input: learning rate η, communication period τ ∈ N Initialize: x̃ is initialized randomly, xi = x̃, vi = 0, ti = 0 Repeat\nif (τ divides ti) then x̃ ← x̃ + vi xi ← x̃ vi ← 0 end xi ← xi − ηgiti(x\ni) vi ← vi − ηgiti(x\ni) ti ← ti + 1\nUntil forever"
    }, {
      "heading" : "8.2 MDOWNPOUR pseudo-code",
      "text" : "Algorithms 4 and 5 capture the pseudo-codes of the implementation of momentum DOWNPOUR (MDOWNPOUR) used in this paper. Algorithm 4 shows the behavior of each local worker and Algorithm 5 shows the behavior of the master.\nAlgorithm 4: MDOWNPOUR: Processing by worker i Initialize: xi = x̃ Repeat\nReceive x̃ from the master: xi ← x̃ Compute gradient gi = gi(xi) Send gi to the master\nUntil forever\nAlgorithm 5: MDOWNPOUR: Processing by the master Input: learning rate η, momentum term δ Initialize: x̃ is initialized randomly, vi = 0, Repeat\nReceive gi v ← δv − ηgi x̃← x̃+ δv\nUntil forever"
    }, {
      "heading" : "9 Experiments - additional material",
      "text" : ""
    }, {
      "heading" : "9.1 Data preprocessing",
      "text" : "For the ImageNet experiment, we re-size each RGB image so that the smallest dimension is 256 pixels. We also re-scale each pixel value to the interval [0, 1]. We then extract random crops (and their horizontal flips) of size 3× 221× 221 pixels and present these to the network in mini-batches of size 128.\nFor the CIFAR experiment, we use the original RGB image of size 3 × 32 × 32. As before, we re-scale each pixel value to the interval [0, 1]. We then extract random crops (and their horizontal flips) of size 3× 28× 28 pixels and present these to the network in mini-batches of size 128. The training and test loss and the test error are only computed from the center patch (3 × 28 × 28) for the CIFAR experiment and the center patch (3× 221× 221) for the ImageNet experiment."
    }, {
      "heading" : "9.2 Data prefetching (Sampling the dataset by the local workers)",
      "text" : "We will now explain precisely how the dataset is sampled by each local worker as uniformly and efficiently as possible. The general parallel data loading scheme on a single machine is as follows: we use k CPUs, where k = 8, to load the data in parallel. Each data loader reads from the memory-mapped (mmap) file a chunk of c raw images (preprocessing was described in the previous subsection) and their labels (for CIFAR c = 512 and for ImageNet c = 64). For the CIFAR, the mmap file of each data loader contains the entire dataset whereas for ImageNet, each mmap file of each data loader contains different 1/k fractions of the entire dataset. A chunk of data is always sent by one of the data loaders to the first worker who requests the data. The next worker requesting the data from the same data loader will get the next chunk. Each worker requests in total k data chunks from k different data loaders and then process them before asking for new data chunks. Notice that each data loader cycles through the data in the mmap file, sending consecutive chunks to the workers in order in which it receives requests from them. When the data loader reaches the end of the mmap file, it selects the address in memory uniformly at random from the interval [0, s], where s = (number of images in the mmap file modulo mini-batch size), and uses this address to start cycling again through the data in the mmap file. After the local worker receives the k data chunks from the data loaders, it shuffles them and divides it into mini-batches of size 128."
    }, {
      "heading" : "9.3 Learning rates",
      "text" : "In Table 1 we summarize the learning rates η (we used constant learning rates) explored for each method shown in Figure 2. For all values of τ the same set of learning rates was explored for each method.\nIn Table 2 we summarize the learning rates η (we used constant learning rates) explored for each method shown in Figure 3. For all values of p the same set of learning rates was explored for each method.\nIn Table 3 we summarize the initial learning rates η we use for each method shown in Figure 4. For all values of p the same set of learning rates was explored for each method. We also used the rule of the thumb to decrease the initial learning rate twice, first time we divided it by 5 and the second time by 2, when we observed that the decrease of the online predictive (training) loss saturates.\n9.4 Comparison of SGD, ASGD, MVASGD and MSGD\nFigure 6 shows the convergence of the training and test loss (negative log-likelihood) and the test error computed for the center variable as a function of wallclock time for SGD, ASGD, MVASGD and MSGD (p = 1) on the CIFAR experiment. For all CIFAR experiments we always start the averaging for the ADOWNPOUR and ASGD methods from the very beginning of each experiment. For all ImageNet experiments we start the averaging for the ASGD at the same time when we first reduce the initial learning rate.\nFigure 7 shows the convergence of the training and test loss (negative log-likelihood) and the test error computed for the center variable as a function of wallclock time for SGD, ASGD, MVASGD and MSGD (p = 1) on the ImageNet experiment."
    }, {
      "heading" : "9.5 Dependence of the learning rate",
      "text" : "This section discusses the dependence of the trade-off between exploration and exploitation on the learning rate. We compare the performance of respectively EAMSGD and EASGD for different learning rates η when p = 16 and τ = 10 on the CIFAR experiment. We observe in Figure 8 that higher learning rates η lead to better test performance for the EAMSGD algorithm which potentially can be justified by the fact that they sustain higher fluctuations of the local workers. We conjecture that higher fluctuations lead to more exploration and simultaneously they also impose higher regularization. This picture however seems to be opposite for the EASGD algorithm for which larger learning rates hurt the performance of the method and lead to overfitting. Interestingly in this experiment for both EASGD and EAMSGD algorithm, the learning rate for which the best training performance was achieved simultaneously led to the worst test performance."
    }, {
      "heading" : "9.6 Dependence of the communication period",
      "text" : "This section discusses the dependence of the trade-off between exploration and exploitation on the communication period. We have observed from the CIFAR experiment that EASGD algorithm exhibits very similar convergence behavior when τ = 1 up to even τ = 1000, whereas EAMSGD can get trapped at worse energy (loss) level for τ = 100. This behavior of EAMSGD is most likely due to the non-convexity of the objective function. Luckily, it can be avoided by gradually decreasing the learning rate, i.e. increasing the penalty term ρ (recall α = ηρ), as shown in Figure 9. In contrast, the EASGD algorithm does not seem to get trapped at all along its trajectory. The performance of EASGD is less sensitive to increasing the communication period compared to EAMSGD, whereas for the EAMSGD the careful choice of the learning rate for large communication periods seems crucial.\nCompared to all earlier results, the experiment in this section is re-run three times with a new random12 seed and with faster cuDNN13 package14. All our methods are implemented in Torch15. The Message Passing Interface implementation MVAPICH216 is used for the GPU-CPU communication.\n12To clarify, the random initialization we use is by default in Torch’s implementation. 13https://developer.nvidia.com/cuDNN 14https://github.com/soumith/cudnn.torch 15http://torch.ch 16http://mvapich.cse.ohio-state.edu"
    }, {
      "heading" : "9.7 Breakdown of the wallclock time",
      "text" : "In addition, we report in Table 4 the breakdown of the total running time for EASGD when τ = 10 (the time breakdown for EAMSGD is almost identical) and DOWNPOUR when τ = 1 into computation time, data loading time and parameter communication time. For the CIFAR experiment the reported time corresponds to processing 400 × 128 data samples whereas for the ImageNet experiment it corresponds to processing 1024 × 128 data samples. For τ = 1 and p ∈ {8, 16} we observe that the communication time accounts for significant portion of the total running time whereas for τ = 10 the communication time becomes negligible compared to the total running time (recall that based on previous results EASGD and EAMSGD achieve best performance with larger τ which is ideal in the setting when communication is time-consuming)."
    }, {
      "heading" : "9.8 Time speed-up",
      "text" : "In Figure 10 and 11, we summarize the wall clock time needed to achieve the same level of the test error for all the methods in the CIFAR and ImageNet experiment as a function of the number of local workers p. For the CIFAR (Figure 10) we examined the following levels: {21%, 20%, 19%, 18%} and for the ImageNet (Figure 11) we examined: {49%, 47%, 45%, 43%}. If some method does not appear on the figure for a given test error level, it indicates that this method never achieved this level. For the CIFAR experiment we observe that from among EASGD, DOWNPOUR and MDOWNPOUR methods, the EASGD method needs less time to achieve a particular level of test error. We observe that with higher p each of these methods does not necessarily need less time to achieve the same level of test error. This seems counter intuitive though recall that the learning rate for the methods is selected based on the smallest achievable test error. For larger p smaller learning rates were selected than for smaller p which explains our results. Meanwhile, the EAMSGD method achieves significant speed-up over other methods for all the test error levels. For the ImageNet experiment we observe that all methods outperform MSGD and furthermore with p = 4 or p = 8 each of these methods requires less time to achieve the same level of test error. The EAMSGD consistently needs less time than any other method, in particular DOWNPOUR, to achieve any of the test error levels.\n."
    } ],
    "references" : [ ],
    "referenceMentions" : [ ],
    "year" : 2015,
    "abstractText" : "<lb>We study the problem of stochastic optimization for deep learning in the paral-<lb>lel computing environment under communication constraints. A new algorithm<lb>is proposed in this setting where the communication and coordination of work<lb>among concurrent processes (local workers), is based on an elastic force which<lb>links the parameters they compute with a center variable stored by the parameter<lb>server (master). The algorithm enables the local workers to perform more explo-<lb>ration, i.e. the algorithm allows the local variables to fluctuate further from the<lb>center variable by reducing the amount of communication between local workers<lb>and the master. We empirically demonstrate that in the deep learning setting, due<lb>to the existence of many local optima, allowing more exploration can lead to the<lb>improved performance. We propose synchronous and asynchronous variants of<lb>the new algorithm. We provide the stability analysis of the asynchronous vari-<lb>ant in the round-robin scheme and compare it with the more common parallelized<lb>method ADMM. We show that the stability of EASGD is guaranteed when a simple<lb>stability condition is satisfied, which is not the case for ADMM. We additionally<lb>propose the momentum-based version of our algorithm that can be applied in both<lb>synchronous and asynchronous settings. Asynchronous variant of the algorithm<lb>is applied to train convolutional neural networks for image classification on the<lb>CIFAR and ImageNet datasets. Experiments demonstrate that the new algorithm<lb>accelerates the training of deep architectures compared to DOWNPOUR and other<lb>common baseline approaches and furthermore is very communication efficient.",
    "creator" : "LaTeX with hyperref package"
  }
}