{
  "name" : "1502.05534.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "NeuroSVM: A Graphical User Interface for Identification of Liver Patients",
    "authors" : [ "Kalyan Nagaraj", "Amulyashree Sridhar" ],
    "emails" : [ "kalyan1991n@gmail.com", "0908amulyashree@gmail.com" ],
    "sections" : [ {
      "heading" : null,
      "text" : "like sensors are used for detection of infections. Accurate classification techniques are required for automatic identification of disease samples. In this context, this study utilizes data mining approaches for classification of liver patients from healthy individuals. Four algorithms (Naïve Bayes, Bagging, Random forest and SVM) were implemented for classification using R platform. Further to improve the accuracy of classification a hybrid NeuroSVM model was developed using SVM and feed-forward artificial neural network (ANN). The hybrid model was tested for its performance using statistical parameters like root mean square error (RMSE) and mean absolute percentage error (MAPE). The model resulted in a prediction accuracy of 98.83%. The results suggested that development of hybrid model improved the accuracy of prediction. To serve the medicinal community for prediction of liver disease among patients, a graphical user interface (GUI) has been developed using R. The GUI is deployed as a package in local repository of R platform for users to perform prediction.\nKeywords - Liver disease, SVM, Neural network, R, GUI\n1. Introduction\nLiver failures are at high rate of risk among Indians. The diagnosis of liver disorder at any early stage helps in designing effective prevention measures. In India, one in five persons is affected by liver disease. It is expected that by 2025 India may become the ‘World Capital for Liver Diseases’. The widespread occurrence of liver infection in India is contributed due to deskbound lifestyle, increased alcohol consumption and smoking [1]. There are about 100 types of liver infections. Most prevalent liver infections are cirrhosis, non-alcoholic fatty liver disease and alcoholic liver disease. In the recent years sensors and mobile devices have been used extensively used for rapid detection of an infected liver [2]. The performance of these devices can be accelerated by spontaneous classification systems. Classification is a data mining technique comprising of a dual process flow. In the first step the classifier is trained using the training dataset, while the classifier is being tested for its prediction capacity in the second phase using different samples of the test set [3]. Feature selection is the preliminary step to be performed prior to application of classification algorithms for any dataset. There are three categories of feature selection techniques: filter based, wrapper based and embedded methods. Studies have depicted that the wrapper methods performs better compared to filter and embedded methods [4, 5]. Classification algorithms can be either supervised or unsupervised based on the learning mechanism. Supervised learning is implemented by set of labels defined prior in the training set. The function is mapped for new unseen data to predict the labels. Few examples are Discriminative learning, Artificial Neural Network, Bagging, Boosting, Naïve Bayes, Kernel-based classifiers, Nearest Neighbour algorithm, Decision Trees, Random Forest, and other ensemble of classifiers. Whereas unsupervised learning identifies the missing or hidden patterns in unlabelled data without any labels. They are commonly used for dimensionality reduction of feature space. The unsupervised ensembles include clustering approaches, self-organization maps (SOM), hidden Markov models (HMM) and adaptive resonance theory (ART) [7].\nIn this study, a hybrid NeuroSVM model is developed for classification of liver patients using Support Vector Machine (SVM) and Artificial Neural Network (ANN). Further, the hybrid model is implemented as a user friendly Graphical User Interface (GUI) in R. The GUI can be readily utilized by doctors and medical practitioners as a screening tool for liver disease.\n2. Literature Review Health care and medicine handles huge data on daily basis. This data comprises of information about\nthe patients, diagnosis reports and medical images. It is important to utilize this information to decipher a decision support system. To achieve this it is important to discover and extract the knowledge domain from the raw data. It is accomplished by knowledge discovery and data mining (KDD) [8]. The implementation of data mining techniques is widespread in biological domain. Different studies have been conducted for classification of liver disorders, they are discussed briefly. In a study conducted by Rajeshwari et. al. different data mining algorithm like Naïve Bayes, FT Tree and KStar were implemented for analysis of liver disorder. It was found that Naïve Bayes algorithm resulted with an accuracy of 96.52% for the data [9]. In another study conducted by Ramana different classification algorithms were implemented for diagnosis of liver disorder. They include Naïve Bayes, C4.5, Neural Network, K-means and SVM. The performance of the algorithms was tested in different data sets. It was found that neural network classifier resulted in an accuracy of 71.59% for all the features in the liver dataset [10]. In another study conducted by Karthik et.al ANN was applied for classification followed by induction of rule set using Learn by Example (LEM) algorithm. It was followed by execution of fuzzy rules to identify different liver disease types which achieved an accuracy of 96% [11]. In another study the UCI liver dataset was used for selection of sub features based on random forest classifier with multi-layer perceptron induced [12]. Different artificial intelligence techniques were applied for the liver patient’s dataset resulting in accurate predictions of liver malfunction [13, 14, 15, and 16]. Based on the review of literature, it was depicted that the past research studies have implemented different data mining techniques for classification of liver dataset. A hybrid model can be adapted to further increase the prediction accuracy of liver disease. It is followed by development of a graphical user interface would further aid the scientific community in early diagnosis of liver infection. It will provide a framework for end user application for generating promising treatment protocols.\n3. Methodology"
    }, {
      "heading" : "3.1. Data Collection",
      "text" : "The Indian Liver Patient Dataset (ILPD) was selected from UCI Machine learning repository for this study. It is a sample of the entire Indian population collected from Andhra Pradesh region. The dataset comprised of 583 instances based on ten different biological parameters. The class value was reported based on these parameters as either yes (416 cases) or no (167 cases) to represent the liver infection."
    }, {
      "heading" : "3.2. Pre-processing and Feature selection",
      "text" : "Pre-processing techniques was applied to normalize the missing values. The missing values along with their instances were replaced by null value. It was followed by feature selection to identify relevant attribute for classification. Feature selection was performed using both filter and wrapper methods. Initially the attributes having more than 70% correlation was removed from the dataset by correlation analysis. It was followed by feature selection using the library ‘Boruta’ in R. The algorithm was implemented on the basis of random forest for estimating the importance of different features in a dataset [17]."
    }, {
      "heading" : "3.3. Randomization and splitting of dataset",
      "text" : "The features selected in the preceding step were approved to develop classification models. Initially the dataset was randomized to obtain an arbitrary permutated sample. It was followed by\nsplitting of the dataset into training (70% of the dataset) and test (30%) sets. Training set comprised of 389 instances and test set included the remaining 194 instances."
    }, {
      "heading" : "3.4. Classification algorithms",
      "text" : "Different data mining algorithms like Naïve Bayes, Bagging, Random forest and Support vector machine (SVM) were implemented in R platform for classification. R is a popular statistical computing framework for performing data mining experiments. A 10-fold cross validation was performed for each of this algorithm. The algorithms are briefly discussed below: 3.4.1. Naïve Bayes Classifier: It is based on the Bayes theorem of conditional probability. The\nalgorithm assumes that each attribute contributes to the total outcome independent of other attributes [18].\n3.4.2. Bagging: They are applied for decision trees to reduce the rate of overfitting. Sampling\nand replacement is employed to generate a new training set from the given input training set. The bootstrap sample obtained is fitted with models using voting scheme for classification. The algorithm is considered as an averaging scheme for random decision trees. The algorithm was developed by Breiman [19].\n3.4.3. Random Forest: They are classifiers that construct decision trees for training input. A\nrandom value is assigned as range to feature space for splitting the tree. Based on the training ensemble class value is predicted as the modal value of distinct tree. The algorithm was implemented by Breiman [20]. The algorithm is used for ranking the features by estimating out-of-bag error. It is followed by computing of important score for each feature.\n3.4.4. Support Vector Machine: They are kernel based supervised classifier developed by\nVapnik [21]. A hyperplane is constructed in high dimensional space defined by vector having a constant dot product. The feature space is mapped to the hyperplane of nonlinear space using kernel function. The training optimized to the maximum margin hyperplane constitutes the support vectors. These vectors define an ideal linear hyperplane for classifying the instances."
    }, {
      "heading" : "3.5. Development of hybrid model",
      "text" : "The hybrid model was developed with an aid to further increase the accuracy of liver disease prediction. Classification by SVM was figured out to be better compared to other algorithms. SVM was implemented in the hybrid model along with artificial neural network. A feed forward neural network was fed with the SVM classifier. The hybrid NeuroSVM predictor was implemented in R using the ‘neuralnet’ package [22]. Statistical significance of the hybrid model was evaluated using root mean square error (RMSE) and mean absolute percentage error (MAPE)."
    }, {
      "heading" : "3.6. Deployment of hybrid model as GUI in R",
      "text" : "The hybrid model was implemented as a user friendly GUI in R to facilitate the prediction of liver disease in a patient. The GUI was developed using ‘gWidgets’ ‘RGtk2’ and ‘tcltk2’ libraries in R [23, 24 and 25]. The GUI can be used as a screening tool for prediction of liver disease.\n4. Results and Discussion"
    }, {
      "heading" : "4.1. Dataset",
      "text" : "The Indian Liver Patient Dataset comprised of 10 different attributes of 583 patients. The patients were described as either ‘1’ or ‘2’ on the basis of liver disease. The detailed description of the dataset is shown in Table-1.\nSl. No Attribute name Attribute Type Attribute Description\n1. Age Numeric Age of the patient 2. Sex Nominal Gender of the patient 3. Total Bilirubin Numeric Quantity of total bilirubin in patient\nThe methodology is represented as a flowchart in Fig 1."
    }, {
      "heading" : "4.2. Feature Selection",
      "text" : "Ten attributes available in ILPD dataset cannot be used to develop an accurate classification model. Only the relevant features must be selected. The features in dataset were subjected to correlation analysis for removal of redundant attributes. The correlated features were further subjected for feature selection using ‘Boruta’ package in R. It is a wrapper based feature selector algorithm that computes importance of each attribute by permutation. The attributes reported to be important after repeated iteration is chosen by the algorithm based on the ranks. The attributes selected by the algorithm is represented in Table-2. The plot derived from Boruta after feature selection is shown in Fig 2.\nSl. No. Attribute Name Attribute Importance\n1. Age 0.9090 2. Total Bilirubin 1.000 3. Direct Bilirubin 1.000"
    }, {
      "heading" : "4.3. Application of classification algorithms",
      "text" : "Four algorithms namely Naïve Bayes, Bagging, Random forest and SVM were implemented for classification of the Indian Liver Patient Dataset. The models were generated for the training set and evaluated on the test set. Based on the accuracy of prediction it was observed that SVM achieved an accuracy of 76.22%. The prediction outcome from SVM was used to develop a hybrid model."
    }, {
      "heading" : "4.4. Development of hybrid model",
      "text" : "The hybrid model for assessment of liver diseases was build using neural network. The prediction\nresults from SVM was fed into a feed forward artificial neural network comprising of 2 input layers, 5 hidden layers and one output layer. Neural networks were inspired from the neurons in the brain. The network is represented as a weighted graph with nodes and edges. The input function is represented by xj such that j=1, 2….n. The output function is computed using the formula:\n  \n\n  \n  \n\nn\nj uwjxjy 1   Equation (1)\nHere, y= output function wj= weights applied for input j xj = input u= threshold function θ= unit step function The algorithm computes output class and network for input value based on the weights assigned. The algorithm was implemented using ‘neuralnet’ package in R. The hybrid model achieved a better performance compared to the individual algorithms. The performance of the prediction was estimated using the Receiver Operating Characteristics (ROC) curve. It is a plot of the false positive rate (FPR) versus the true positive rate (TPR). Root mean square error and mean absolute error was computed using the formula:\n 2 1 1   n i xxi\nn RMSE  Equation (2)\nxixxi n\nMAPE n\ni / 1 1    Equation (3)\nHere, xi= Actual class x= Predicted class n= Total number of instances\nThe value of RMSE was found to 1.164, predicting an overall error of 1.164%. It can be indicated as a reliable model for screening of liver patients. The accuracy of all the classification algorithms is shown in Table-3. The neural network plot for hybrid model is shown in Fig 3."
    }, {
      "heading" : "4.5. Deployment of GUI in R",
      "text" : "The hybrid NeuroSVM model is deployed as a GUI in R using packages ‘gWidgets’, ‘RGtk2’ and ‘tcltk’. The biological attributes of patients is taken as input for prediction of liver disease. The attributes are subjected to prediction by SVM model. It is followed by implementation of feed forward hybrid NeuroSVM model for prediction of liver patients. The home page of the GUI is shown in Fig-4. Prediction of liver disease in the GUI using hybrid NeuroSVM is shown in Fig. 5 and Fig. 6. The GUI is further implemented as a package in R. The package ‘NeuroSVM’ is installed locally in the machine for implementation of liver disease prediction. The users can utilize the GUI by installing the package in R in their local machines. This application can be utilized by doctors and medicinal practisers to access the probability of liver infection in a patient for initial screening.\n5. Conclusion Identification of liver infection at preliminary stage is important to combat the frequency and severity\ndeaths of patients in India. The patients must be screened based on initial symptoms for development of personalized therapy. In this study, an attempt is made for prediction of liver disease in patients using data mining techniques. A hybrid NeuroSVM model was developed for classification of liver patients based on their biological parameters using artificial neural network. The hybrid model is deployed as a graphical user interface (GUI) in R. The GUI can be used as a screening tool by doctors for prediction of liver disease in patients in future."
    } ],
    "references" : [ {
      "title" : "An Electrochemical Biosensor Array for Rapid Detection of Alanine Aminotransferase and Aspartate Aminotransferase",
      "author" : [ "Min-Jung Song", "Dong-Hwa Tun", "Suk-In Hong" ],
      "venue" : "Biosci. Biotechnol. Biochem",
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 2009
    }, {
      "title" : "Performance of feature selection methods",
      "author" : [ "Edward R Dougherty", "Jianping Hua", "Chao Sima" ],
      "venue" : "Current Genomics",
      "citeRegEx" : "5",
      "shortCiteRegEx" : "5",
      "year" : 2009
    }, {
      "title" : "Identifying and Eliminating Mislabeled Training Instances",
      "author" : [ "M.A.C.E. Brodely" ],
      "venue" : "Friedl",
      "citeRegEx" : "6",
      "shortCiteRegEx" : "6",
      "year" : 1999
    }, {
      "title" : "Comparison of supervised and unsupervised learning algorithms for pattern classification",
      "author" : [ "R. Sathya", "Annamma Abrahim" ],
      "venue" : "International Journal of Advanced Research in Artificial Intelligence",
      "citeRegEx" : "7",
      "shortCiteRegEx" : "7",
      "year" : 2013
    }, {
      "title" : "The Elements of Statistical Learning: Data mining, Inference and Prediction",
      "author" : [ "T Hastie", "Robert T", "F Jerome" ],
      "venue" : null,
      "citeRegEx" : "8",
      "shortCiteRegEx" : "8",
      "year" : 2009
    }, {
      "title" : "A Critical Study of Selected Classification Algorithms for Liver Disease Diagnosis",
      "author" : [ "BendiVenkataRamana", "Prof. M.Surendra Prasad Babu", "Prof. N.B. Venkateswarlu" ],
      "venue" : "International Journal of Database Management Systems",
      "citeRegEx" : "10",
      "shortCiteRegEx" : "10",
      "year" : 2011
    }, {
      "title" : "Classification and Rule Extraction using Rough Set for Diagnosis of Liver Disease and its Types",
      "author" : [ "S. Karthik A", "Priyadarishini", "J. Anuradha", "B.K. Tripathy" ],
      "venue" : "Advances in Applied Science Research",
      "citeRegEx" : "11",
      "shortCiteRegEx" : "11",
      "year" : 2011
    }, {
      "title" : "Liver patient classification using intelligent techniques",
      "author" : [ "Anju Gulia", "Dr. Rajan Vohra", "Praveen Rani" ],
      "venue" : "International Journal of Computer Science and Information Technologies",
      "citeRegEx" : "13",
      "shortCiteRegEx" : "13",
      "year" : 2014
    }, {
      "title" : "An implementation of hierarchical clustering on Indian Liver Patient Dataset",
      "author" : [ "Prasad Babu et. al" ],
      "venue" : "International Journal of Emerging Technologies in Computational and Applied Sciences",
      "citeRegEx" : "14",
      "shortCiteRegEx" : "14",
      "year" : 2014
    }, {
      "title" : "Decision factors on effective liver patient data prediction",
      "author" : [ "Hoon Jin", "Seoungcheon Kim", "Jinhong Kim" ],
      "venue" : "International Journal of Bio-Science and Bio-technology",
      "citeRegEx" : "15",
      "shortCiteRegEx" : "15",
      "year" : 2014
    }, {
      "title" : "A Study of Support Vector Machine Algorithm for Liver Disease Diagnosis",
      "author" : [ "Esraa M Hashem", "Mai S Mabrouk" ],
      "venue" : "American Journal of Intelligent Systems",
      "citeRegEx" : "16",
      "shortCiteRegEx" : "16",
      "year" : 2014
    }, {
      "title" : "Feature selection with Boruta package",
      "author" : [ "Miron Kursa", "Witold Rudnicki" ],
      "venue" : "Journal of Statistical Software",
      "citeRegEx" : "17",
      "shortCiteRegEx" : "17",
      "year" : 2010
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "In the recent years sensors and mobile devices have been used extensively used for rapid detection of an infected liver [2].",
      "startOffset" : 120,
      "endOffset" : 123
    }, {
      "referenceID" : 1,
      "context" : "Studies have depicted that the wrapper methods performs better compared to filter and embedded methods [4, 5].",
      "startOffset" : 103,
      "endOffset" : 109
    }, {
      "referenceID" : 3,
      "context" : "The unsupervised ensembles include clustering approaches, self-organization maps (SOM), hidden Markov models (HMM) and adaptive resonance theory (ART) [7].",
      "startOffset" : 151,
      "endOffset" : 154
    }, {
      "referenceID" : 4,
      "context" : "It is accomplished by knowledge discovery and data mining (KDD) [8].",
      "startOffset" : 64,
      "endOffset" : 67
    }, {
      "referenceID" : 5,
      "context" : "59% for all the features in the liver dataset [10].",
      "startOffset" : 46,
      "endOffset" : 50
    }, {
      "referenceID" : 6,
      "context" : "It was followed by execution of fuzzy rules to identify different liver disease types which achieved an accuracy of 96% [11].",
      "startOffset" : 120,
      "endOffset" : 124
    }, {
      "referenceID" : 11,
      "context" : "The algorithm was implemented on the basis of random forest for estimating the importance of different features in a dataset [17].",
      "startOffset" : 125,
      "endOffset" : 129
    } ],
    "year" : 2015,
    "abstractText" : "Diagnosis of liver infection at preliminary stage is important for better treatment. In today’s scenario devices like sensors are used for detection of infections. Accurate classification techniques are required for automatic identification of disease samples. In this context, this study utilizes data mining approaches for classification of liver patients from healthy individuals. Four algorithms (Naïve Bayes, Bagging, Random forest and SVM) were implemented for classification using R platform. Further to improve the accuracy of classification a hybrid NeuroSVM model was developed using SVM and feed-forward artificial neural network (ANN). The hybrid model was tested for its performance using statistical parameters like root mean square error (RMSE) and mean absolute percentage error (MAPE). The model resulted in a prediction accuracy of 98.83%. The results suggested that development of hybrid model improved the accuracy of prediction. To serve the medicinal community for prediction of liver disease among patients, a graphical user interface (GUI) has been developed using R. The GUI is deployed as a package in local repository of R platform for users to perform prediction.",
    "creator" : "Microsoft® Word 2010"
  }
}