{
  "name" : "1502.03919.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Policy Gradient for Coherent Risk Measures",
    "authors" : [ "Aviv Tamar", "Yinlam Chow" ],
    "emails" : [ "avivt@tx.technion.ac.il", "ychow@stanford.edu", "ghavamza@adobe.com", "shie@ee.technion.ac.il" ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "Risk-sensitive optimization considers problems in which the objective involves a risk measure of the random cost, in contrast to the typical expected cost objective. Such problems are important when the decision-maker wishes to manage the variability of the cost, in addition to its expected outcome, and are standard in various applications of finance and operations research. In reinforcement learning (RL) [33], risk-sensitive objectives have gained popularity as a means to regularize the variability of the total (discounted) cost/reward in a Markov decision process (MDP).\nMany risk objectives have been investigated in the literature and applied to RL, such as the celebrated Markowitz mean-variance model [19], Value-at-Risk (VaR) and Conditional Value at Risk (CVaR) [22, 35, 26, 12, 10, 36]. The view taken in this paper is that the preference of one risk measure over another is problem-dependent and depends on factors such as the cost distribution, sensitivity to rare events, ease of estimation from data, and computational tractability of the optimization problem. However, the highly influential paper of Artzner et al. [2] identified a set of natural properties that are desirable for a risk measure to satisfy. Risk measures that satisfy these properties are termed coherent and have obtained widespread acceptance in financial applications, among others. We focus on such coherent measures of risk in this work.\nFor sequential decision problems, such as MDPs, another desirable property of a risk measure is time consistency. A time-consistent risk measure satisfies a “dynamic programming” style property: if a strategy is risk-optimal for an n-stage problem, then the component of the policy from the t-th\nar X\niv :1\n50 2.\n03 91\n9v 2\n[ cs\n.A I]\ntime until the end (where t < n) is also risk-optimal (see principle of optimality in [5]). The recently proposed class of dynamic Markov coherent risk measures [30] satisfies both the coherence and time consistency properties.\nIn this work, we present policy gradient algorithms for RL with a coherent risk objective. Our approach applies to the whole class of coherent risk measures, thereby generalizing and unifying previous approaches that have focused on individual risk measures. We consider both static coherent risk of the total discounted return from an MDP and time-consistent dynamic Markov coherent risk. Our main contribution is formulating the risk-sensitive policy-gradient under the coherent-risk framework. More specifically, we provide:\n• A new formula for the gradient of static coherent risk that is convenient for approximation using sampling.\n• An algorithm for the gradient of general static coherent risk that involves sampling with convex programming and a corresponding consistency result.\n• A new policy gradient theorem for Markov coherent risk, relating the gradient to a suitable value function and a corresponding actor-critic algorithm.\nSeveral previous results are special cases of the results presented here; our approach allows to rederive them in greater generality and simplicity.\nRelated Work Risk-sensitive optimization in RL for specific risk functions has been studied recently by several authors. [8] studied exponential utility functions, [22], [35], [26] studied meanvariance models, [10], [36] studied CVaR in the static setting, and [25], [11] studied dynamic coherent risk for systems with linear dynamics. Our paper presents a general method for the whole class of coherent risk measures (both static and dynamic) and is not limited to a specific choice within that class, nor to particular system dynamics.\nReference [24] showed that an MDP with a dynamic coherent risk objective is essentially a robust MDP. The planning for large scale MDPs was considered in [37], using an approximation of the value function. For many problems, approximation in the policy space is more suitable (see, e.g., [18]). Our sampling-based RL-style approach is suitable for approximations both in the policy and value function, and scales-up to large or continuous MDPs. We do, however, make use of a technique of [37] in a part of our method.\nOptimization of coherent risk measures was thoroughly investigated by Ruszczynski and Shapiro [31] (see also [32]) for the stochastic programming case in which the policy parameters do not affect the distribution of the stochastic system (i.e., the MDP trajectory), but only the reward function, and thus, this approach is not suitable for most RL problems. For the case of MDPs and dynamic risk, [30] proposed a dynamic programming approach. This approach does not scale-up to large MDPs, due to the “curse of dimensionality”. For further motivation of risk-sensitive policy gradient methods, we refer the reader to [22, 35, 26, 10, 36]."
    }, {
      "heading" : "2 Preliminaries",
      "text" : "Consider a probability space (Ω,F , Pθ), where Ω is the set of outcomes (sample space), F is a σ-algebra over Ω representing the set of events we are interested in, and Pθ ∈ B, where B :={ ξ : ∫ ω∈Ω ξ(ω) = 1, ξ ≥ 0 } is the set of probability distributions, is a probability measure over F parameterized by some tunable parameter θ ∈ RK . In the following, we suppress the notation of θ in θ-dependent quantities.\nTo ease the technical exposition, in this paper we restrict our attention to finite probability spaces, i.e., Ω has a finite number of elements. Our results can be extended to the Lp-normed spaces without loss of generality, but the details are omitted for brevity.\nDenote by Z the space of random variables Z : Ω 7→ (−∞,∞) defined over the probability space (Ω,F , Pθ). In this paper, a random variable Z ∈ Z is interpreted as a cost, i.e., the smaller the realization of Z, the better. For Z,W ∈ Z , we denote by Z ≤ W the point-wise partial order, i.e., Z(ω) ≤ W (ω) for all ω ∈ Ω. We denote by Eξ[Z] . = ∑ ω∈Ω Pθ(ω)ξ(ω)Z(ω) a ξ-weighted expectation of Z.\nAn MDP is a tuple M = (X ,A, C, P, γ, x0), where X and A are the state and action spaces; C(x) ∈ [−Cmax, Cmax] is a bounded, deterministic, and state-dependent cost; P (·|x, a) is the transition probability distribution; γ is a discount factor; and x0 is the initial state.1 Actions are chosen according to a θ-parameterized stationary Markov2 policy µθ(·|x). We denote by x0, a0, . . . , xT , aT a trajectory of length T drawn by following the policy µθ in the MDP."
    }, {
      "heading" : "2.1 Coherent Risk Measures",
      "text" : "A risk measure is a function ρ : Z → R that maps an uncertain outcome Z to the extended real line R ∪ {+∞,−∞}, e.g., the expectation E [Z] or the conditional value-at-risk (CVaR) minν∈R { ν +\n1 αE [ (Z − ν)+ ]} . A risk measure is called coherent, if it satisfies the following conditions for all Z,W ∈ Z [2]:\nA1 Convexity: ∀λ ∈ [0, 1], ρ ( λZ + (1− λ)W ) ≤ λρ(Z) + (1− λ)ρ(W );\nA2 Monotonicity: if Z ≤W , then ρ(Z) ≤ ρ(W ); A3 Translation invariance: ∀a∈R, ρ(Z + a) = ρ(Z) + a; A4 Positive homogeneity: if λ ≥ 0, then ρ(λZ) = λρ(Z).\nIntuitively, these condition ensure the “rationality” of single-period risk assessments: A1 ensures that diversifying an investment will reduce its risk; A2 guarantees that an asset with a higher cost for every possible scenario is indeed riskier; A3, also known as ‘cash invariance’, means that the deterministic part of an investment portfolio does not contribute to its risk; the intuition behind A4 is that doubling a position in an asset doubles its risk. We further refer the reader to [2] for a more detailed motivation of coherent risk.\nThe following representation theorem [32] shows an important property of coherent risk measures that is fundamental to our gradient-based approach.\nTheorem 2.1. A risk measure ρ : Z → R is coherent if and only if there exists a convex bounded and closed set U ⊂ B such that3\nρ(Z) = max ξ : ξPθ∈U(Pθ)\nEξ[Z]. (1)\nThe result essentially states that any coherent risk measure is an expectation w.r.t. a worst-case density function ξPθ, chosen adversarially from a suitable set of test density functions U(Pθ), referred to as risk envelope. Moreover, it means that any coherent risk measure is uniquely represented by its risk envelope. Thus, in the sequel, we shall interchangeably refer to coherent risk-measures either by their explicit functional representation, or by their corresponding risk-envelope.\nIn this paper, we assume that the risk envelop U(Pθ) is given in a canonical convex programming formulation, and satisfies the following conditions.\nAssumption 2.2 (The General Form of Risk Envelope). For each given policy parameter θ ∈ RK , the risk envelope U of a coherent risk measure can be written as\nU(Pθ) = { ξPθ : ge(ξ, Pθ) = 0, ∀e ∈ E , fi(ξ, Pθ) ≤ 0, ∀i ∈ I, ∑ ω∈Ω ξ(ω)Pθ(ω) = 1, ξ(ω) ≥ 0 } , (2) where each constraint ge(ξ, Pθ) is an affine function in ξ, each constraint fi(ξ, Pθ) is a convex function in ξ, and there exists a strictly feasible point ξ. E and I here denote the sets of equality and inequality constraints, respectively. Furthermore, for any given ξ ∈ B, fi(ξ, p) and ge(ξ, p) are twice differentiable in p, and there exists a M > 0 such that\nmax { max i∈I ∣∣∣∣dfi(ξ, p)dp(ω) ∣∣∣∣ ,maxe∈E ∣∣∣∣dge(ξ, p)dp(ω) ∣∣∣∣} ≤M, ∀ω ∈ Ω.\n1Our results may easily be extended to random costs, state-action dependent costs, and random initial states. 2For the dynamic Markov risk we study, an optimal policy is stationary Markov, while this is not necessarily the case for the static risk. Our results can be extended to history-dependent policies or stationary Markov policies on a state space augmented with the accumulated cost. The latter has shown to be sufficient for optimizing the CVaR risk [4].\n3When we study risk in MDPs, the risk envelop U(Pθ) in Eq. 1 also depends on the state x.\nAssumption 2.2 implies that the risk envelope U(Pθ) is known in an explicit form. From Theorem 6.6 of [32], in the case of a finite probability space, ρ is a coherent risk if and only if U(Pθ) is a convex and compact set. This justifies the affine assumption of ge and the convex assumption of fi. Moreover, the additional assumption on the smoothness of the constraints holds for many popular coherent risk measures, such as the CVaR, the mean-semi-deviation, and spectral risk measures [1]."
    }, {
      "heading" : "2.2 Dynamic Risk Measures",
      "text" : "The risk measures defined above do not take into account any temporal structure that the random variable might have, such as when it is associated with the return of a trajectory in the case of MDPs. In this sense, such risk measures are called static. Dynamic risk measures, on the other hand, explicitly take into account the temporal nature of the stochastic outcome. A primary motivation for considering such measures is the issue of time consistency, usually defined as follows [30]: if a certain outcome is considered less risky in all states of the world at stage t + 1, then it should also be considered less risky at stage t. Example 2.1 in [16] shows the importance of time consistency in the evaluation of risk in a dynamic setting. It illustrates that for multi-period decision-making, optimizing a static measure can lead to “time-inconsistent” behavior. Similar paradoxical results could be obtained with other risk metrics; we refer the readers to [30] and [16] for further insights.\nMarkov Coherent Risk Measures. Markov risk measures were introduced in [30] and are a useful class of dynamic time-consistent risk measures that are particularly important for our study of risk in MDPs. For a T -length horizon and MDPM, the Markov coherent risk measure ρT (M) is\nρT (M) = C(x0) + γρ ( C(x1) + . . .+ γρ ( C(xT−1) + γρ ( C(xT ) ))) , (3)\nwhere ρ is a static coherent risk measure that satisfies Assumption 2.2 and x0, . . . , xT is a trajectory drawn from the MDPM under policy µθ. It is important to note that in (3), each static coherent risk ρ at state x ∈ X is induced by the transition probability Pθ(·|x) = ∑ a∈A P (x\n′|x, a)µθ(a|x). We also define ρ∞(M) . = limT→∞ ρT (M), which is well-defined since γ < 1 and the cost is bounded. We further assume that ρ in (3) is a Markov risk measure, i.e., the evaluation of each static coherent risk measure ρ is not allowed to depend on the whole past."
    }, {
      "heading" : "3 Problem Formulation",
      "text" : "In this paper, we are interested in solving two risk-sensitive optimization problems. Given a random variable Z and a static coherent risk measure ρ as defined in Section 2, the static risk problem (SRP) is given by\nmin θ ρ(Z). (4)\nFor example, in an RL setting, Z may correspond to the cumulative discounted cost Z = C(x0) + γC(x1) + · · ·+ γTC(xT ) of a trajectory induced by an MDP with a policy parameterized by θ. For an MDPM and a dynamic Markov coherent risk measure ρT as defined by Eq. 3, the dynamic risk problem (DRP) is given by\nmin θ\nρ∞(M). (5)\nExcept for very limited cases, there is no reason to hope that neither the SRP in (4) nor the DRP in (5) should be tractable problems, since the dependence of the risk measure on θ may be complex and non-convex. In this work, we aim towards a more modest goal and search for a locally optimal θ. Thus, the main problem that we are trying to solve in this paper is how to calculate the gradients of the SRP’s and DRP’s objective functions\n∇θρ(Z) and ∇θρ∞(M).\nWe are interested in non-trivial cases in which the gradients cannot be calculated analytically. In the static case, this would correspond to a non-trivial dependence of Z on θ. For dynamic risk, we also consider cases where the state space is too large for a tractable computation. Our approach for dealing with such difficult cases is through sampling. We assume that in the static case, we may obtain i.i.d. samples of the random variable Z. For the dynamic case, we assume that for each state and action (x, a) of the MDP, we may obtain i.i.d. samples of the next state x′ ∼ P (·|x, a). We show that sampling may indeed be used in both cases to devise suitable estimators for the gradients.\nTo finally solve the SRP and DRP problems, a gradient estimate may be plugged into a standard stochastic gradient descent (SGD) algorithm for learning a locally optimal solution to (4) and (5). From the structure of the dynamic risk in Eq. 3, one may think that a gradient estimator for ρ(Z) may help us to estimate the gradient ∇θρ∞(M). Indeed, we follow this idea and begin with estimating the gradient in the static risk case."
    }, {
      "heading" : "4 Gradient Formula for Static Risk",
      "text" : "In this section, we consider a static coherent risk measure ρ(Z) and propose sampling-based estimators for ∇θρ(Z). We make the following assumption on the policy parametrization, which is standard in the policy gradient literature [18]. Assumption 4.1. The likelihood ratio∇θ logP (ω) is well-defined and bounded for all ω∈Ω.\nMoreover, our approach implicitly assumes that given some ω ∈ Ω, ∇θ logP (ω) may be easily calculated. This is also a standard requirement for policy gradient algorithms [18] and is satisfied in various applications such as queueing systems, inventory management, and financial engineering (see, e.g., the survey by Fu [14]).\nUsing Theorem 2.1 and Assumption 2.2, for each θ, we have that ρ(Z) is the solution to the convex optimization problem (1) (for that value of θ). The Lagrangian function of (1), denoted by Lθ(ξ, λ P , λE , λI), may be written as\nLθ(ξ, λ P, λE, λI)= ∑ ω∈Ω ξ(ω)Pθ(ω)Z(ω)−λP (∑ ω∈Ω ξ(ω)Pθ(ω)−1 ) − ∑ e∈E λE(e)ge(ξ,Pθ)− ∑ i∈I λI(i)fi(ξ,Pθ). (6) The convexity of (1) and its strict feasibility due to Assumption 2.2 implies that Lθ(ξ, λP , λE , λI) has a non-empty set of saddle points S. The next theorem presents a formula for the gradient ∇θρ(Z). As we shall subsequently show, this formula is particularly convenient for devising sampling based estimators for∇θρ(Z). Theorem 4.2. Let Assumptions 2.2 and 4.1 hold. For any saddle point (ξ∗θ , λ ∗,P θ , λ ∗,E θ , λ ∗,I θ ) ∈ S of (6), we have\n∇θρ(Z) = Eξ∗θ [ ∇θ logP (ω)(Z − λ∗,Pθ ) ] − ∑ e∈E λ∗,Eθ (e)∇θge(ξ ∗ θ ;Pθ)− ∑ i∈I λ∗,Iθ (i)∇θfi(ξ ∗ θ ;Pθ).\nThe proof of this theorem, given in the supplementary material, involves an application of the Envelope theorem [21] and a standard ‘likelihood-ratio’ trick. We now demonstrate the utility of Theorem 4.2 with several examples in which we show that it generalizes previously known results, and also enables deriving new useful gradient formulas."
    }, {
      "heading" : "4.1 Example 1: CVaR",
      "text" : "The CVaR at level α ∈ [0, 1] of a random variable Z, denoted by ρCVaR(Z;α), is a very popular coherent risk measure [28], defined as\nρCVaR(Z;α) . = inf t∈R\n{ t+ α−1E [(Z − t)+] } .\nWhen Z is continuous, ρCVaR(Z;α) is well-known to be the mean of the α-tail distribution of Z, E [Z|Z > qα], where qα is a (1− α)-quantile of Z. Thus, selecting a small α makes CVaR particularly sensitive to rare, but very high costs.\nThe risk envelope for CVaR is known to be [32] U = { ξPθ : ξ(ω) ∈\n[0, α−1], ∑ ω∈Ω ξ(ω)Pθ(ω) = 1 } . Furthermore, [32] show that the saddle points of (6) satisfy ξ∗θ (ω) = α −1 when Z(ω) > λ∗,Pθ , and ξ ∗ θ (ω) = 0 when Z(ω) < λ ∗,P θ , where λ ∗,P θ is any (1− α)quantile of Z. Plugging this result into Theorem 4.2, we can easily show that\n∇θρCVaR(Z;α) = E [∇θ logP (ω)(Z − qα)|Z(ω) > qα] . This formula was recently proved in [36] for the case of continuous distributions by an explicit calculation of the conditional expectation, and under several additional smoothness assumptions. Here we show that it holds regardless of these assumptions and in the discrete case as well. Our proof is also considerably simpler."
    }, {
      "heading" : "4.2 Example 2: Mean-Semideviation",
      "text" : "The semi-deviation of a random variable Z is defined as SD[Z] .= ( E [ (Z − E [Z])2+ ])1/2 . The semi-deviation captures the variation of the cost only above its mean, and is an appealing alternative to the standard deviation, which does not distinguish between the variability of upside and downside deviations. For some α ∈ [0, 1], the mean-semideviation risk measure is defined as ρMSD(Z;α) . = E [Z] + αSD[Z], and is a coherent risk measure [32]. We have the following result: Proposition 4.3. Under Assumption 4.1, with ∇θE [Z] = E [∇θ logP (ω)Z], we have\n∇θρMSD(Z;α) = ∇θE [Z] + αE [(Z−E [Z])+(∇θ logP (ω)(Z−E [Z])−∇θE [Z])]\nSD(Z) .\nThis proposition can be used to devise a sampling based estimator for ∇θρMSD(Z;α) by replacing all the expectations with sample averages. The algorithm along with the proof of the proposition are in the supplementary material. In Section 6 we provide a numerical illustration of optimization with a mean-semideviation objective."
    }, {
      "heading" : "4.3 General Gradient Estimation Algorithm",
      "text" : "In the two previous examples, we obtained a gradient formula by analytically calculating the Lagrangian saddle point (6) and plugging it into the formula of Theorem 4.2. We now consider a general coherent risk ρ(Z) for which, in contrast to the CVaR and mean-semideviation cases, the Lagrangian saddle-point is not known analytically. We only assume that we know the structure of the risk-envelope as given by (2). We show that in this case, ∇θρ(Z) may be estimated using a sample average approximation (SAA; [32]) of the formula in Theorem 4.2.\nAssume that we are given N i.i.d. samples ωi ∼ Pθ, i = 1, . . . , N , and let Pθ;N (ω) . = 1 N ∑N i=1 I {ωi = ω} denote the corresponding empirical distribution. Also, let the sample risk envelope U(Pθ;N ) be defined according to Eq. 2 with Pθ replaced by Pθ;N . Consider the following SAA version of the optimization in Eq. 1:\nρN (Z) = max ξ:ξPθ;N∈U(Pθ;N ) ∑ i∈1,...,N Pθ;N (ωi)ξ(ωi)Z(ωi). (7)\nNote that (7) defines a convex optimization problem with O(N) variables and constraints. In the following, we assume that a solution to (7) may be computed efficiently using standard convex programming tools such as interior point methods [9]. Let ξ∗θ;N denote a solution to (7) and λ∗,Pθ;N , λ ∗,E θ;N , λ ∗,I θ;N denote the corresponding KKT multipliers, which can be obtained from the convex programming algorithm [9]. We propose the following estimator for the gradient-based on Theorem 4.2:\n∇θ;Nρ(Z) = N∑ i=1 Pθ;N (ωi)ξ ∗ θ;N (ωi)∇θ logP (ωi)(Z(ωi)− λ ∗,P θ;N ) (8)\n− ∑ e∈E λ∗,Eθ;N (e)∇θge(ξ ∗ θ;N ;Pθ;N )− ∑ i∈I λ∗,Iθ;N (i)∇θfi(ξ ∗ θ;N ;Pθ;N ).\nThus, our gradient estimation algorithm is a two-step procedure involving both sampling and convex programming. In the following, we show that under some conditions on the set U(Pθ), ∇θ;Nρ(Z) is a consistent estimator of∇θρ(Z). The proof has been reported in the supplementary material. Proposition 4.4. Let Assumptions 2.2 and 4.1 hold. Suppose there exists a compact setC = Cξ×Cλ such that: (I) The set of Lagrangian saddle points S ⊂ C is non-empty and bounded. (II) The functions fe(ξ, Pθ) for all e ∈ E and fi(ξ, Pθ) for all i ∈ I are finite-valued and continuous (in ξ) on Cξ. (III) For N large enough, the set SN is non-empty and SN ⊂ C w.p. 1. Further assume that: (IV) If ξNPθ;N ∈ U(Pθ;N ) and ξN converges w.p. 1 to a point ξ, then ξPθ ∈ U(Pθ). We then have that limN→∞ ρN (Z) = ρ(Z) and limN→∞∇θ;Nρ(Z) = ∇θρ(Z) w.p. 1.\nThe set of assumptions for Proposition 4.4 is large, but rather mild. Note that (I) is implied by the Slater condition of Assumption 2.2. For satisfying (III), we need that the risk be well-defined for every empirical distribution, which is a natural requirement. Since Pθ;N always converges to Pθ uniformly on Ω, (IV) essentially requires smoothness of the constraints. We remark that in particular,\nconstraints (I) to (IV) are satisfied for the popular CVaR, mean-semideviation, and spectral risk measures.\nTo summarize this section, we have seen that by exploiting the special structure of coherent risk measures in Theorem 2.1 and by the envelope-theorem style result of Theorem 4.2, we were able to derive sampling-based, likelihood-ratio style algorithms for estimating the policy gradient ∇θρ(Z) of coherent static risk measures. The gradient estimation algorithms developed here for static risk measures will be used as a sub-routine in our subsequent treatment of dynamic risk measures."
    }, {
      "heading" : "5 Gradient Formula for Dynamic Risk",
      "text" : "In this section, we derive a new formula for the gradient of the Markov coherent dynamic risk measure, ∇θρ∞(M). Our approach is based on combining the static gradient formula of Theorem 4.2, with a dynamic-programming decomposition of ρ∞(M). The risk-sensitive value-function for an MDP M under the policy θ is defined as Vθ(x) = ρ∞(M|x0 = x), where with a slight abuse of notation, ρ∞(M|x0 = x) denotes the Markovcoherent dynamic risk in (3) when the initial state x0 is x. It is shown in [30] that due to the structure of the Markov dynamic risk ρ∞(M), the value function is the unique solution to the risk-sensitive Bellman equation\nVθ(x) = C(x) + γ max ξPθ(·|x)∈U(x,Pθ(·|x))\nEξ[Vθ(x′)], (9)\nwhere the expectation is taken over the next state transition. Note that by definition, we have ρ∞(M) = Vθ(x0), and thus,∇θρ∞(M) = ∇θVθ(x0). We now develop a formula for ∇θVθ(x); this formula extends the well-known “policy gradient theorem” [34, 17], developed for the expected return, to Markov-coherent dynamic risk measures. We make a standard assumption, analogous to Assumption 4.1 of the static case. Assumption 5.1. The likelihood ratio ∇θ logµθ(a|x) is well-defined and bounded for all x ∈ X and a ∈ A. For each state x ∈ X , let (ξ∗θ,x, λ ∗,P θ,x , λ ∗,E θ,x , λ ∗,I θ,x) denote a saddle point of (6), corresponding to the state x, with Pθ(·|x) replacing Pθ in (6) and Vθ replacing Z. The next theorem presents a formula for ∇θVθ(x); the proof is in the supplementary material. Theorem 5.2. Under Assumptions 2.2 and 5.1, we have\n∇Vθ(x) = Eξ∗θ [ ∞∑ t=0 γt∇θ logµθ(at|xt)hθ(xt, at) ∣∣∣∣∣x0 = x ] ,\nwhere Eξ∗θ [·] denotes the expectation w.r.t. trajectories generated by the Markov chain with transition probabilities Pθ(·|x)ξ∗θ,x(·), and the stage-wise cost function hθ(x, a) is defined as hθ(x, a)=C(x)+ ∑ x′∈X P (x′|x, a)ξ∗θ,x(x′) [ γVθ(x ′)−λ∗,Pθ,x − ∑ i∈I λ∗,Iθ,x(i) dfi(ξ ∗ θ,x, p) dp(x′) − ∑ e∈E λ∗,Eθ,x(e) dge(ξ ∗ θ,x, p) dp(x′) ] .\nTheorem 5.2 may be used to develop an actor-critic style [34, 17] sampling-based algorithm for solving the DRP problem (5), composed of two interleaved procedures:\nCritic: For a given policy θ, calculate the risk-sensitive value function Vθ, and Actor: Using the critic’s Vθ and Theorem 5.2, estimate ∇θρ∞(M) and update θ. Space limitation restricts us from specifying the full details of our actor-critic algorithm and its analysis. In the following, we highlight only the key ideas and results. For the full details, we refer the reader to the full paper version, provided in the supplementary material.\nFor the critic, the main challenge is calculating the value function when the state space X is large and dynamic programming cannot be applied due to the ‘curse of dimensionality’. To overcome this, we exploit the fact that Vθ is equivalent to the value function in a robust MDP [24] and modify a recent algorithm in [37] to estimate it using function approximation.\nFor the actor, the main challenge is that in order to estimate the gradient using Thm. 5.2, we need to sample from an MDP with ξ∗θ -weighted transitions. Also, hθ(x, a) involves an expectation for each\ns and a. Therefore, we propose a two-phase sampling procedure to estimate ∇Vθ in which we first use the critic’s estimate of Vθ to derive ξ∗θ , and sample a trajectory from an MDP with ξ ∗ θ -weighted transitions. For each state in the trajectory, we then sample several next states to estimate hθ(x, a).\nThe convergence analysis of the actor-critic algorithm and the gradient error incurred from function approximation of Vθ are reported in the supplementary material."
    }, {
      "heading" : "6 Numerical Illustration",
      "text" : "In this section, we illustrate our approach with a numerical example. The purpose of this illustration is to emphasize the importance of flexibility in designing risk criteria for selecting an appropriate risk-measure – such that suits both the user’s risk preference and the problem-specific properties.\nWe consider a trading agent that can invest in one of three assets (see Figure 1 for their distributions). The returns of the first two assets, A1 and A2, are normally distributed: A1 ∼ N (1, 1) and A2 ∼ N (4, 6). The return of the third asset A3 has a Pareto distribution: f(z) = αzα+1 ∀z > 1, with α = 1.5. The mean of the return from A3 is 3 and its variance is infinite; such heavy-tailed distributions are widely used in financial modeling [27]. The agent selects an action randomly, with probability P (Ai) ∝ exp(θi), where θ ∈ R3 is the policy parameter. We trained three different policies π1, π2, and π3. Policy π1 is risk-neutral, i.e., maxθ E [Z], and it was trained using standard policy gradient [18]. Policy π2 is risk-averse and had a mean-semideviation objective maxθ E [Z] − SD[Z], and was trained using the algorithm in Section 4. Policy π3 is also risk-averse, with a mean-standarddeviation objective, as proposed in [35, 26], maxθ E [Z] − √ Var[Z], and was trained using the algorithm of [35]. For each of these policies, Figure 1 shows the probability of selecting each asset vs. training iterations. Although A2 has the highest mean return, the risk-averse policy π2 chooses A3, since it has a lower downside, as expected. However, because of the heavy upper-tail of A3, policy π3 opted to chooseA1 instead. This is counter-intuitive as a rational investor should not avert high returns. In fact, in this case A3 stochastically dominates A1 [15]."
    }, {
      "heading" : "7 Conclusion",
      "text" : "We presented algorithms for estimating the gradient of both static and dynamic coherent risk measures using two new policy gradient style formulas that combine sampling with convex programming. Thereby, our approach extends risk-sensitive RL to the whole class of coherent risk measures, and generalizes several recent studies that focused on specific risk measures.\nOn the technical side, an important future direction is to improve the convergence rate of gradient estimates using importance sampling methods. This is especially important for risk criteria that are sensitive to rare events, such as the CVaR [3].\nFrom a more conceptual point of view, the coherent-risk framework explored in this work provides the decision maker with flexibility in designing risk preference. As our numerical example shows, such flexibility is important for selecting appropriate problem-specific risk measures for managing the cost variability. However, we believe that our approach has much more potential than that.\nIn almost every real-world application, uncertainty emanates from stochastic dynamics, but also, and perhaps more importantly, from modeling errors (model uncertainty). A prudent policy should\nprotect against both types of uncertainties. The representation duality of coherent-risk (Theorem 2.1), naturally relates the risk to model uncertainty. In [24], a similar connection was made between model-uncertainty in MDPs and dynamic Markov coherent risk. We believe that by carefully shaping the risk-criterion, the decision maker may be able to take uncertainty into account in a broad sense. Designing a principled procedure for such risk-shaping is not trivial, and is beyond the scope of this paper. However, we believe that there is much potential to risk shaping as it may be the key for handling model misspecification in dynamic decision making."
    }, {
      "heading" : "A Proof of Theorem 4.2",
      "text" : "First note from Assumption 2.2 that\n(i) Slater’s condition holds in the primal optimization problem (1), (ii) Lθ(ξ, λP , λE , λI) is convex in ξ and concave in (λP , λE , λI).\nThus by the duality result in convex optimization [9], the above conditions imply strong duality and we have ρ(Z) = maxξ≥0 minλP ,λI≥0,λE Lθ(ξ, λP , λE , λI) = minλP ,λI≥0,λE maxξ≥0 Lθ(ξ, λ\nP , λE , λI). From Assumption 2.2, one can also see that the family of functions {Lθ(ξ, λP , λE , λI)}(ξ,λP ,λE ,λI)∈R|Ω|×R×R|E|×R|I| is equi-differentiable in θ, Lθ(ξ, λP , λE , λI) is Lipschitz, as a result, an absolutely continuous function in θ, and thus, ∇θLθ(ξ, λP , λE , λI) is continuous and bounded at each (ξ, λP , λE , λI). Then for every selection of saddle point (ξ∗θ , λ ∗,P θ , λ ∗,E θ , λ ∗,I θ ) ∈ S of (6), using the Envelop theorem for saddle-point problems (see Theorem 4 of [21]), we have\n∇θ max ξ≥0 min λP ,λI≥0,λE Lθ(ξ, λ P , λE , λI) = ∇θLθ(ξ, λP , λE , λI)|(ξ∗θ ,λ∗,Pθ ,λ∗,Eθ ,λ∗,Iθ ) . (10)\nThe result follows by writing the gradient in (10) explicitly, and using the likelihood-ratio trick:∑ ω∈Ω ξ(ω)∇θPθ(ω)Z(ω)−λP ∑ ω∈Ω ξ(ω)∇θPθ(ω) = ∑ ω∈Ω ξ(ω)P (ω)∇θ logP (ω) ( Z(ω)−λP ) ,\nwhere the last equality is justified by Assumption 4.1."
    }, {
      "heading" : "B Gradient Results for Static Mean-Semideviation",
      "text" : "In this section we consider the mean-semideviation risk measure, defined as follows: ρMSD(Z) = E [Z] + c ( E [ (Z − E [Z])2+ ])1/2 , (11)\nFollowing the derivation in [32], note that ( E [ |Z|2 ])1/2 = ‖Z‖2, where ‖ · ‖2 denotes the L2 norm of the space L2(Ω,F , Pθ). The norm may also be written as: ‖Z‖2 = sup\n‖ξ‖2≤1 〈ξ, Z〉,\nand hence( E [ (Z − E [Z])2+ ])1/2 = sup ‖ξ‖2≤1 〈ξ, (Z − E [Z])+〉 = sup ‖ξ‖2≤1,ξ≥0 〈ξ, Z − E [Z]〉\n= sup ‖ξ‖2≤1,ξ≥0\n〈ξ − E [ξ], Z〉.\nIt follows that Eq. (1) holds with\nU = {ξ′ ∈ Z∗ : ξ′ = 1 + cξ − cE [ξ] , ‖ξ‖q ≤ 1, ξ ≥ 0} . For this case it will be more convenient to write Eq. (1) in the following form\nρMSD(Z) = sup ‖ξ‖q≤1,ξ≥0\n〈1 + cξ − cE [ξ], Z〉. (12)\nLet ξ̄ denote an optimal solution for (12). In [32] it is shown that ξ̄ is a contact point of (Z−E [Z])+, that is ξ̄ ∈ arg max {〈ξ, (Z − E [Z])+〉 : ‖ξ‖2 ≤ 1} , and we have that\nξ̄ = (Z − E [Z])+ ‖(Z − E [Z])+‖2 = (Z − E [Z])+ SD(Z) . (13)\nNote that ξ̄ is not necessarily a probability distribution, but for c ∈ [0, 1], it can be shown [32] that 1 + cξ̄ − cE [ ξ̄ ] always is.\nIn the following we show that ξ̄ may be used to write the gradient ∇θρMSD(Z) as an expectation, which will lead to a sampling algorithm for the gradient.\nProposition B.1. Under Assumption 4.1, we have that\n∇θρMSD(Z) = ∇θE [Z] + c\nSD(Z) E [(Z − E [Z])+ (∇θ logP (ω)(Z − E [Z])−∇θE [Z])] ,\nand, according to the standard likelihood-ratio method,\n∇θE [Z] = E [∇θ logP (ω)Z] .\nProof. Note that in Eq. (12) the constraints do not depend on θ. Therefore, using the envelope theorem we obtain that\n∇θρ(Z) = ∇θ〈1 + cξ̄ − cE [ ξ̄ ] , Z〉\n= ∇θ〈1, Z〉+ c∇θ〈ξ̄, Z〉 − c∇θ〈E [ ξ̄ ] , Z〉.\n(14)\nWe now write each of the terms in Eq. (14) as an expectation. We start with the following standard likelihood-ratio result: ∇θ〈1, Z〉 = ∇θE [Z] = E [∇θ logP (ω)Z] . Also, we have that\n〈E [ ξ̄ ] , Z〉 = E [ ξ̄ ] E [Z] ,\ntherefore, by the derivative of a product rule: ∇θ〈E [ ξ̄ ] , Z〉 = ∇θE [ ξ̄ ] E [Z] + E [ ξ̄ ] ∇θE [Z].\nBy the likelihood-ratio trick and Eq. (13) we have that ∇θE [ ξ̄ ] = 1\nSD(Z) E [∇θ logP (ω)(Z − E [Z])+] .\nAlso, by the likelihood-ratio trick ∇θE [ ξ̄Z ] = E [ ∇θ logP (ω)ξ̄Z ] .\nPlugging these terms back in Eq. (14), we have that ∇θρ(Z) = ∇θE [Z] + c∇θE [ ξ̄Z ] − c∇θE [ ξ̄ ] E [Z]− cE [ ξ̄ ] ∇θE [Z]\n= ∇θE [Z] + cE [ ξ̄ (∇θ logP (ω)Z −∇θE [Z]) ] − c∇θE [ ξ̄ ] E [Z] = ∇θE [Z] + c\nSD(Z) E [(Z − E [Z])+ (∇θ logP (ω)Z −∇θE [Z])]− c∇θE\n[ ξ̄ ] E [Z]\n= ∇θE [Z] + c\nSD(Z) E [(Z − E [Z])+ (∇θ logP (ω)(Z − E [Z])−∇θE [Z])] .\nProposition 4.3 naturally leads to a sampling-based gradient estimation algortihm, which we term GMSD (Gradient of Mean Semi-Deviation). The algorithm is described in Algorithm 1."
    }, {
      "heading" : "C Consistency Proof",
      "text" : "Let (ΩSAA,FSAA, PSAA) denote the probability space of the SAA functions (i.e., the randomness due to sampling).\nLet Lθ;N (ξ, λP , λE , λI) denote the Lagrangian of the SAA problem\nLθ;N (ξ, λ P , λE , λI) = ∑ ω∈Ω ξ(ω)Pθ;N (ω)Z(ω)−λP (∑ ω∈Ω ξ(ω)Pθ;N (ω)−1 ) − ∑ e∈E λE(e)fe(ξ, Pθ;N )− ∑ i∈I λI(i)fi(ξ, Pθ;N ).\n(15)\nRecall that S ⊂ R|Ω| ×R×R|E| ×R|I|+ denotes the set of saddle points of the true Lagrangian (6). Let SN ⊂ R|Ω| × R× R|E| × R|I|+ denote the set of SAA Lagrangian (15) saddle points.\nSuppose that there exists a compact set C ≡ Cξ ×Cλ, where Cξ ⊂ R|Ω| and Cλ ⊂ R×R|E|×R|I|+ such that:\nAlgorithm 1 GMSD"
    }, {
      "heading" : "1: Given:",
      "text" : "• Risk level c • An i.i.d. sequence z1, . . . , zN ∼ Pθ.\n2: Set\nÊ [Z] = 1\nN N∑ i=1 zi.\n3: Set\nŜD(Z) =\n( 1\nN N∑ i=1 (zi − Ê [Z])2+\n)1/2 .\n4: Set\n∇̂θE [Z] = 1\nN N∑ i=1 ∇θ logP (zi)zi."
    }, {
      "heading" : "5: Return:",
      "text" : "ˆ∇θρ(Z) = ∇̂θE [Z] + c\nŜD(Z)\n1\nN N∑ i=1 (zi − Ê [Z])+ ( ∇θ logP (zi)(zi − Ê [Z])− ∇̂θE [Z] ) .\n(i) The set of Lagrangian saddle points S ⊂ C is non-empty and bounded. (ii) The functions fe(ξ, Pθ) for all e ∈ E and fi(ξ, Pθ) for all i ∈ I are finite valued and continuous\n(in ξ) on Cξ.\n(iii) For N large enough the set SN is non-empty and SN ⊂ C w.p. 1.\nRecall from Assumption 2.2 that for each fixed ξ ∈ B, both fi(ξ, p) and ge(ξ, p) are continuous in p. Furthermore, by the S.L.L.N. of Markov chains, for each policy parameter, we have Pθ,N → Pθ w.p. 1. From the definition of the Lagrangian function and continuity of constraint functions, one can easily see that for each (ξ, λP , λE , λI) ∈ R|Ω| × R × R|E| × R|I|+ , Lθ;N (ξ, λP , λE , λI) → Lθ(ξ, λ\nP , λE , λI) w.p. 1. Denote with D {A,B} the deviation of setA from setB, i.e., D {A,B} = supx∈A infy∈B ‖x− y‖. Further assume that:\n(iv) If ξN ∈ U(Pθ;N ) and ξN converges w.p. 1 to a point ξ, then ξ ∈ U(Pθ).\nAccording to the discussion in Page 161 of [32], the Slater condition of Assumption 2.2 guarantees the following condition:\n(v) For some point ξ ∈ P there exists a sequence ξN ∈ U(Pθ;N ) such that ξN → ξ w.p. 1,\nand from Theorem 6.6 in [32], we know that both sets U(Pθ;N ) and U(Pθ) are convex and compact. Furthermore, note that we have\n(vi) The objective function on (1) is linear, finite valued and continuous in ξ on Cξ (these conditions obviously hold for almost all ω ∈ Ω in the integrand function ξ(ω)Z(ω)).\n(vii) S.L.L.N. holds point-wise for any ξ.\nFrom (i,iv,v,vi,vii), and under the same lines of proof as in Theorem 5.5 of [32], we have that\nρN (Z)→ ρ(Z) w.p. 1 as N →∞, (16)\nD {PN ,P} → 0 w.p. 1 as N →∞, (17)\nIn part 1 and part 2 of the following proof, we show, by following similar derivations as in Theorem 5.2, Theorem 5.3 and Theorem 5.4 of [32], that Lθ;N (ξ∗θ;N , λ ∗,P θ;N , λ ∗,E θ;N , λ ∗,I θ;N ) →\nLθ(ξ ∗ θ , λ ∗,P θ , λ ∗,E θ , λ ∗,I θ ) w.p. 1 and D {SN ,S} → 0 w.p. 1 as N → ∞. Based on the definition of the deviation of sets, the limit point of any element in SN is also an element in S. Assumptions (i) and (iii) imply that we can restrict our attention to the set C.\nPart 1 We first show that Lθ;N (ξ∗θ;N , λ ∗,P θ;N , λ ∗,E θ;N , λ ∗,I θ;N ) converges to Lθ(ξ ∗ θ , λ ∗,P θ , λ ∗,E θ , λ ∗,I θ ) w.p. 1 as N →∞. For each fixed (λP , λE , λI) ∈ Cλ, the function Lθ(ξ, λP , λE , λI) is convex and continuous in ξ. Together with the point-wise S.L.L.N. property, Theorem 7.49 of [32] implies that Lθ;N (ξ, λP , λE , λI) − Lθ(ξ, λP , λE , λI)\ne→ 0, where e→ denotes epi-convergence. Furthermore, since the objective and constraint functions are convex in ξ and are finite valued on Cξ, the set domLθ(·, λP , λE , λI) has non-empty interior. It follows from Theorem 7.27 of [32] that epi-convergence of Lθ,N to Lθ implies uniform convergence on Cξ, i.e., supξ∈Cξ\n∣∣Lθ;N (ξ, λP , λE , λI)− Lθ(ξ, λP , λE , λI)∣∣ ≤ . On the other hand, for each fixed ξ ∈ Cξ, the function Lθ(ξ, λP , λE , λI) is linear and thus continuous in (λP , λE , λI) and domLθ(ξ, ·, ·, ·) = R×R|E|×R|I| has non-empty interior. It follows from analogous arguments that sup(λP ,λE ,λI)∈Cλ\n∣∣Lθ;N (ξ, λP , λE , λI)− Lθ(ξ, λP , λE , λI)∣∣ ≤ . Combining these results implies that for any > 0 and a.e. ωSAA ∈ ΩSAA there is a N∗( , ωSAA) such that\nsup (ξ,λP ,λE ,λI)∈C ∣∣Lθ;N (ξ, λP , λE , λI)− Lθ(ξ, λP , λE , λI)∣∣ ≤ . (18) Now, assume by contradiction that for some N > N∗( , ωSAA) we have Lθ;N (ξ ∗ θ;N , λ ∗,P θ;N , λ ∗,E θ;N , λ ∗,I θ;N ) − Lθ(ξ∗θ , λ ∗,P θ , λ ∗,E θ , λ ∗,I θ ) > . Then by definition of the saddle points\nLθ;N (ξ ∗ θ;N , λ ∗,P θ , λ ∗,E θ , λ ∗,I θ ) ≥ Lθ;N (ξ ∗ θ;N , λ ∗,P θ;N , λ ∗,E θ;N , λ ∗,I θ;N )\n> Lθ(ξ ∗ θ , λ ∗,P θ , λ ∗,E θ , λ ∗,I θ ) + ≥ Lθ(ξ ∗ θ;N , λ ∗,P θ , λ ∗,E θ , λ ∗,I θ ) + ,\ncontradicting (18).\nSimilarly, assuming by contradiction that Lθ(ξ∗θ , λ ∗,P θ , λ ∗,E θ , λ ∗,I θ ) − Lθ;N (ξ ∗ θ;N , λ ∗,P θ;N , λ ∗,E θ;N , λ ∗,I θ;N ) > gives\nLθ(ξ ∗ θ , λ ∗,P θ;N , λ ∗,E θ;N , λ ∗,I θ;N ) ≥ Lθ(ξ ∗ θ , λ ∗,P θ , λ ∗,E θ , λ ∗,I θ )\n> Lθ;N (ξ ∗ θ;N , λ ∗,P θ;N , λ ∗,E θ;N , λ ∗,I θ;N ) + ≥ Lθ;N (ξ ∗ θ , λ ∗,P θ;N , λ ∗,E θ;N , λ ∗,I θ;N ) + ,\nalso contradicting (18). It follows that ∣∣∣Lθ;N (ξ∗θ;N , λ∗,Pθ;N , λ∗,Eθ;N , λ∗,Iθ;N )− Lθ(ξ∗θ , λ∗,Pθ , λ∗,Eθ , λ∗,Iθ )∣∣∣ ≤ for all N > N∗( , ωSAA), and therefore\nlim N→∞\nLθ;N (ξ ∗ θ;N , λ ∗,P θ;N , λ ∗,E θ;N , λ ∗,I θ;N ) = Lθ(ξ ∗ θ , λ ∗,P θ , λ ∗,E θ , λ ∗,I θ ), (19)\nw.p. 1.\nPart 2 Let us now show that D {SN ,S} → 0. We argue by a contradiction. Suppose that D {SN ,S} 9 0. Since C is compact, we can assume that there exists a sequence (ξ∗θ;N , λ ∗,P θ;N , λ ∗,E θ;N , λ ∗,I θ;N ) ∈ SN that converges to a point (ξ̄∗, λ̄∗,P , λ̄∗,E , λ̄∗,I) ∈ C and (ξ̄∗, λ̄∗,P , λ̄∗,E , λ̄∗,I) 6∈ S. However, from (17) we must have that ξ̄∗ ∈ P . Therefore, we must have that\nLθ(ξ̄ ∗, λ̄∗,P , λ̄∗,E , λ̄∗,I) > Lθ(ξ̄ ∗, λ∗,Pθ , λ ∗,E θ , λ ∗,I θ ),\nby definition of the saddle point set.\nNow,\nLθ;N (ξ ∗ θ;N , λ ∗,P θ;N , λ ∗,E θ;N , λ ∗,I θ;N )− Lθ(ξ̄ ∗, λ̄∗,P , λ̄∗,E , λ̄∗,I) = [ Lθ;N (ξ ∗ θ;N , λ ∗,P θ;N , λ ∗,E θ;N , λ ∗,I θ;N )− Lθ(ξ ∗ θ;N , λ ∗,P θ;N , λ ∗,E θ;N , λ ∗,I θ;N ) ] +\n+ [ Lθ(ξ ∗ θ;N , λ ∗,P θ;N , λ ∗,E θ;N , λ ∗,I θ;N )− Lθ(ξ̄ ∗, λ̄∗,P , λ̄∗,E , λ̄∗,I) ] .\n(20)\nThe first term in the r.h.s. of (20) tends to zero, using the argument from (18), and the second by continuity of Lθ guaranteed by (ii). We thus obtain that Lθ;N (ξ∗θ;N , λ ∗,P θ;N , λ ∗,E θ;N , λ ∗,I θ;N ) tends to Lθ(ξ̄ ∗, λ̄∗,P , λ̄∗,E , λ̄∗,I) > Lθ(ξ ∗ θ , λ ∗,P θ , λ ∗,E θ , λ ∗,I θ ), which is a contradiction to (19).\nPart 3 We now show the consistency of ∇θ;Nρ(Z). Consider Eq. (8). Since ∇θ logP (·) is bounded by Assumption 4.1, and ∇θfi(·;Pθ) and ∇θge(·;Pθ) are bounded by Assumption 2.2, and using our previous result D {SN ,S} → 0, we have that for a.e. ωSAA ∈ ΩSAA\nlim N→∞ ∇θ;Nρ(Z) = ∑ ω∈Ω Pθ(ω)ξ ∗ θ (ω)∇θ logP (ω)(Z(ω)− λ ∗,P θ )\n− ∑ e∈E λ∗,Eθ (e)∇θge(ξ ∗ θ ;Pθ)\n− ∑ i∈I λ∗,Iθ (i)∇θfi(ξ ∗ θ ;Pθ)\n= ∇θρ(Z).\nwhere the first equality is obtained from the Envelop theorem (see Theorem 4.2) with (ξ∗θ , λ ∗,P θ , λ ∗,E θ , λ ∗,I θ ) ∈ SN ∩ S is the limit point of the converging sequence {(ξ∗θ;N , λ ∗,P θ;N , λ ∗,E θ;N , λ ∗,I θ;N )}N∈N."
    }, {
      "heading" : "D Proof of Theorem 5.2",
      "text" : "Similar to the proof of Theorem 4.2, recall the saddle point definition of (ξ∗θ,x, λ ∗,P θ,x , λ ∗,E θ,x , λ ∗,I θ,x) ∈ S and strong duality result, i.e.,\nmax ξ : ξPθ(·|x)∈U(x,Pθ(·|x)) ∑ x′∈X ξ(x′)Pθ(x ′|x)Vθ(x′) = max ξ≥0 min λP ,λI≥0,λE Lθ,x(ξ, λ P , λE , λI)\n= min λP ,λI≥0,λE max ξ≥0\nLθ,x(ξ, λ P , λE , λI).\nthe gradient formula in (10) can be written as ∇θVθ(x) = ∇θ [ Cθ(x)+γ max\nξ : ξPθ(·|x)∈U(x,Pθ(·|x)) Eξ[Vθ] ] = γ\n∑ x′∈X ξ∗θ,x(x ′)Pθ(x ′|x)∇θVθ(x′) + ∑ a∈A µθ(a|x)∇θ logµθ(a|x)hθ(x, a),\nwhere the stage-wise cost function hθ(x, a) is defined in (26). By defining ĥθ(x) =∑ a∈A µθ(a|x)∇θ logµθ(a|x)hθ(x, a) and unfolding the recursion, the above expression implies\n∇θVθ(x0) =ĥθ(x0) + γ ∑ x1∈X Pθ(x1|x0)ξ∗θ (x1)\n[ ĥθ(x1) + γ\n∑ x2∈X Pθ(x2|x1)ξ∗θ (x2)∇θVθ (x2)\n] .\nNow since ∇θVθ is continuously differentiable with bounded derivatives, when t → ∞, one obtains γt∇θVθ(x) → 0 for any x ∈ X . Therefore, by Bounded Convergence Theorem, limt→∞ ρ(γ tVθ(xt)) = 0, when x0 = x the above expression implies the result of this theorem."
    }, {
      "heading" : "E Gradient Formula for Dynamic Risk - Full Results",
      "text" : "In this section, we first derive a new formula for the gradient of a general Markov-coherent dynamic risk measure∇θρ∞(M) that involves the value function of the risk objective ρ∞(M) (e.g., the value function proposed by [30]). This formula extends the well-known “policy gradient theorem” [34, 17]\ndeveloped for the expected return to Markov-coherent dynamic risk measures. Using this formula, we suggest the following actor-critic style algorithm for estimating∇θρ∞(M): Critic: For a given policy θ, calculate the risk-sensitive value function of ρ∞(M) (see Section E.3), and Actor: Using the critic’s value function, estimate∇θρ∞(M) by sampling (see Section E.4). The value function proposed by [30] assigns to each state a particular value that encodes the longterm risk starting from that state. When the state space X is large, calculating the value function by dynamic programming (as suggested by [30]) becomes intractable due to the “curse of dimensionality”. For the risk-neutral case, a standard solution to this problem is to approximate the value function by a set of state-dependent features, and use sampling to calculate the parameters of this approximation [6]. In particular, temporal difference (TD) learning methods [33] are popular for this purpose, which have been recently extended to robust MDPs by [37]. We use their (robust) TD algorithm and show how our critic use it to approximates the risk-sensitive value function. We then discuss how the error introduced by this approximation affects the gradient estimate of the actor.\nE.1 Dynamic Risk\nWe provide a multi-period generalization of the concepts presented in Section 2.1. Here we closely follow the discussion in [30].\nConsider a probability space (Ω,F , Pθ), a filtration F0 ⊂ F1 ⊂ F2 · · · ⊂ FT ⊂ F , and an adapted sequence of real-valued random variables Zt, t ∈ {0, . . . , T}. We assume that F0 = {Ω, ∅}, i.e., Z0 is deterministic. For each t ∈ {0, . . . , T}, we denote by Zt the space of random variables defined over the probability space (Ω,Ft, Pθ), and also let Zt,T := Zt × · · · × ZT be a sequence of these spaces. The sequence of random variables Zt can be interpreted as the stage-wise costs observed along a trajectory generated by an MDP parameterized by a parameter θ, i.e., Z0,T . = ( Z0 = γ0C(x0, a0), . . . , ZT = γ TC(xT , aT ) ) ∈ Z0,T .\nIn particular, we are interested in the sequence of random variables induced by the trajectories from a Markov decision process (MDP) parameterized by parameter θ.\nExplicitly, for any t ≥ 0 and state dependent random variable Z(xt+1) ∈ Zt+1, the risk evaluation is given by\nρ ( Z(xt+1) ) = max ξ : ξPθ(·|xt)∈U(xt,Pθ(·|xt)) Eξ [ Z(xt+1) ] , (21)\nwhere we let U(xt, Pθ(·|xt)) denote the risk-envelope (2) with Pθ replaced with Pθ(·|xt). The Markovian assumption on the risk measure ρT (M) allows us to optimize it using dynamic programming techniques.\nE.2 Risk-Sensitive Bellman Equation\nOur value-function estimation method is driven by a Bellman-style equation for Markov coherent risks. Let B(X ) denote the space of real-valued bounded functions on X and Cθ(x) =∑ a∈A C(x, a)µθ(a|x) be the stage-wise cost function induced by policy µθ. We now define the risk sensitive Bellman operator Tθ[V ] : B(X ) 7→ B(X ) as\nTθ[V ](x) := Cθ(x) + γ max ξPθ(·|x)∈U(x,Pθ(·|x))\nEξ[V ]. (22)\nAccording to Theorem 1 in [30], the operator Tθ has a unique fixed-point Vθ, i.e., Tθ[Vθ](x) = Vθ(x), ∀x ∈ X , that is equal to the risk objective function induced by θ, i.e., Vθ(x0) = ρ∞(M). However, when the state space X is large, exact enumeration of the Bellman equation is intractable due to “curse of dimensionality”. Next, we provide an iterative approach to approximate the risk sensitive value function.\nE.3 Value Function Approximation\nConsider the linear approximation of the risk-sensitive value function Vθ(x) ≈ v>φ(x), where φ(·) ∈ Rκ2 is the κ2-dimensional state-dependent feature vector. Thus, the approximate value function belongs to the low dimensional sub-space V = {Φv|v ∈ Rκ2}, where Φ : X → Rκ2 is a function mapping such that Φ(x) = φ(x). The goal of our critric is to find a good approximation of Vθ from simulated trajectories of the MDP. In order to have a well-defined approximation scheme, we first impose the following standard assumption [6]. Assumption E.1. The mapping Φ has full column rank.\nFor a function y : X → R, we define its weighted (by d) `2-norm as ‖y‖d = √∑ x′ d(x ′|x)y(x′)2, where d is a distribution over X . Using this, we define Π : X → V , the orthogonal projection from R to V , w.r.t. a norm weighted by the stationary distribution of the policy, dθ(x′|x). Note that the TD methods approximate the value function Vθ with the fixed-point of the joint operator ΠTθ, i.e., Ṽθ(x) = v∗>θ φ(x), such that\n∀x ∈ X , Ṽθ(x) = ΠTθ[Ṽθ](x). (23) From Eq. 21 that has been derived from Theorem 2.1 for dynamic risks, it is easy to see that the risksensitive Bellman equation (22) is a robust Bellman equation [23] with uncertainty set U(x, Pθ(·|x)). Thus, we may use the TD approximation of the robust Bellman equation proposed by [37] to find an approximation of Vθ. We will need the following assumption analogous to Assumption 2 in [37]. Assumption E.2. There exists κ ∈ (0, 1) such that ξ(x′) ≤ κ/γ, for all ξ(·)Pθ(·|x) ∈ U(x, Pθ(·|x)) and all x, x′ ∈ X .\nGiven Assumption E.2, Proposition 3 in [37] guarantees that the projected risk-sensitive Bellman operator ΠTθ is a contraction w.r.t. dθ-norm. Therefore, Eq. 23 has a unique fixed-point solution Ṽθ(x) = v ∗> θ φ(x). This means that v ∗ θ ∈ Rκ2 satisfies v∗θ ∈ arg minv ‖Tθ[Φv] − Φv‖2dθ . By the projection theorem on Hilbert spaces, the orthogonality condition for v∗θ becomes∑ x∈X dθ(x|x0)φ(x)φ(x)>v∗θ = ∑ x∈X dθ(x|x0)φ(x)Cθ(x)\n+ γ ∑ x∈X dθ(x|x0)φ(x) max ξ : ξPθ(·|x)∈U(x,Pθ(·|x)) Eξ[Φv∗θ ].\nAs a result, given a long enough trajectory x0, a0, x1, a1, . . ., xN−1, aN−1 generated by policy θ, we may estimate the fixed-point solution v∗θ using the projected risk sensitive value iteration (PRSVI) algorithm with the update rule\nvk+1 =\n( 1\nN N−1∑ t=0 φ(xt)φ(xt) >\n)−1 [ 1\nN N−1∑ t=0 φ(xt)Cθ(xt)\n+ γ 1\nN N−1∑ t=0 φ(xt) max ξPθ(·|xt)∈U(xt,Pθ(·|xt)) Eξ[Φvk] ] . (24)\nNote that using the law of large numbers, as both N and k tend to infinity, vk converges w.p. 1 to v∗θ , the unique solution of the fixed point equation ΠTθ[Φv] = Φv.\nIn order to implement the iterative algorithm (24), one must repeatedly solve the inner optimization problem maxξPθ(·|x)∈U(x,Pθ(·|x)) Eξ[Φv]. When the state space X is large, solving this optimization problem is often computationally expensive or even intractable. Similar to Section 3.4 of [37], we propose the following SAA approach to solve this problem. For the trajectory, x0, a0, x1, a1, . . ., xN−1, aN−1, we define the empirical transition probability PN (x′|x, a)\n. =∑N−1\nt=0 1{xt=x, at=a, xt+1=x ′}∑N−1\nt=0 1{xt=x, at=a} 4 and Pθ;N (x′|x) =\n∑ a∈A PN (x\n′|x, a)µθ(a|x). Consider the following `2-regularized empirical robust optimization problem5\n4In the case when the sizes of state and action spaces are huge or when these spaces are continuous, the empirical transition probability can be found by kernel density estimation.\n5In the SAA approach, we only sum over the elements for which Pθ;N (x′|x) > 0, thus, the sum has at most N elements.\nρN (Φv) = max ξ:ξPθ;N∈U(x,Pθ;N ) ∑ x′∈X Pθ;N (x ′|x)ξ(x′)φ>(x′)v\n+ 1\n2N\n[ Pθ;N (x ′|x)ξ(x′) ]2 . (25)\nAs in [20], the `2-regularization term in this optimization problem guarantees convergence of optimizers ξ∗ and the corresponding KKT multipliers, whenN →∞. Convergence of these parameters is crucial for the policy gradient analysis in the next sections. We denote by ξ∗θ,x;N , the solution of the above empirical optimization problem, and by λ∗,Pθ,x;N , λ ∗,E θ,x;N , λ ∗,I θ,x;N , the corresponding KKT multipliers.\nWe obtain the empirical PRSVI algorithm by replacing the inner optimization maxξPθ(·|xt)∈U(xt,Pθ(·|xt)) Eξ[Φv∗θ ] in Eq. 24 with ρN (Φv) from Eq. 25. Similarly, as both N and k tend to infinity, vk converges w.p. 1 to v∗θ . More details can be found in the supplementary material.\nE.4 Gradient Estimation\nIn Section E.3, we showed that we may effectively approximate the value function of a fixed policy θ using the (empirical) PRSVI algorithm in Eq. 24. In this section, we first derive a formula for the gradient of the Markov-coherent dynamic risk measure ρ∞(M), and then propose a SAA algorithm for estimating this gradient, in which we use the SAA approximation of value function from Section E.3. As described in Section E.2, ρ∞(M) = Vθ(x0), and thus, we shall first derive a formula for ∇θVθ(x0).\nLet (ξ∗θ,x, λ ∗,P θ,x , λ ∗,E θ,x , λ ∗,I θ,x) be the saddle point of (6) corresponding to the state x ∈ X . In many common coherent risk measures such as CVaR and mean semi-deviation, there are closed-form formulas for ξ∗θ,x and KKT multipliers (λ ∗,P θ,x , λ ∗,E θ,x , λ ∗,I θ,x). We will briefly discuss the case when the saddle point does not have an explicit solution later in this section. Before analyzing the gradient estimation, we have the following standard assumption in analogous to Assumption 4.1 of the static case.\nAssumption E.3. The likelihood ratio ∇θ logµθ(a|x) is well-defined and bounded for all x ∈ X and a ∈ A.\nAs in Theorem 4.2 for the static case, we may use the envelope theorem and the risk-sensitive Bellman equation, Vθ(x) = Cθ(x)+γmaxξPθ(·|x)∈U(x,Pθ(·|x)) Eξ[Vθ], to derive a formula for∇θVθ(x). We report this result in Theorem E.4, which is analogous to the risk-neutral policy gradient theorem [34, 17, 7]. The proof is in the supplementary material.\nTheorem E.4. Under Assumptions 2.2, we have\n∇Vθ(x)=Eξ∗θ [ ∞∑ t=0 γt∇θ logµθ(at|xt)hθ(xt,at) |x0=x ] ,\nwhere Eξ∗θ [·] denotes the expectation w.r.t. trajectories generated by a Markov chain with transition probabilities Pθ(·|x)ξ∗θ,x(·), and the stage-wise cost function hθ(x, a) is defined as\nhθ(x, a) = C(x, a) + ∑ x′∈X P (x′|x, a)ξ∗θ,x(x′) [ γVθ(x ′)−λ∗,Pθ,x\n− ∑ i∈I λ∗,Iθ,x(i) dfi(ξ ∗ θ,x, p) dp(x′) − ∑ e∈E λ∗,Eθ,x(e) dge(ξ ∗ θ,x, p) dp(x′) ] . (26)\nTheorem E.4 indicates that the policy gradient of the Markov-coherent dynamic risk measure ρ∞(M), i.e., ∇θρ∞(M) = ∇θVθ, is equivalent to the risk-neutral value function of policy θ in a MDP with the stage-wise cost function ∇θ logµθ(a|x)hθ(x, a) (which is well-defined and bounded), and transition probability Pθ(·|x)ξ∗θ,x(·). Thus, when the saddle points are known and the state space X is not too large, we can compute∇θVθ using a policy evaluation algorithm. However, when the state space is large, exact calculation of ∇Vθ by policy evaluation becomes impossible,\nand our goal would be to derive a sampling method to estimate ∇Vθ. Unfortunately, since the risk envelop depends on the policy parameter θ, unlike the risk-neutral case, the risk sensitive (or robust) Bellman equation Tθ[Vθ](x) in (22) is nonlinear in the stationary Markov policy µθ. Therefore hθ cannot be considered using the action-value function (Q-function) of the robust MDP. Therefore, even if the exact formulation of the value function Vθ is known, it is computationally intractable to enumerate the summation over x′ to compute hθ(x, a). On top of that in many applications the value function Vθ is not known in advance, which further complicates gradient estimation. To estimate the policy gradient when the value function is unknown, we approximate it by the projected risk sensitive value function Φv∗θ . To address the sampling issues, we propose the following two-phase sampling procedure for estimating∇Vθ.\n(1) Generate N trajectories {x(j)0 , a (j) 0 , x (j) 1 , a (j) 1 , . . .}Nj=1 from the Markov chain induced by policy θ and transition probabilities P ξθ (·|x) := ξ∗θ,x(·)Pθ(·|x).\n(2) For each state-action pair (x(j)t , a (j) t ) = (x, a), generate N samples {y(k)}Nk=1 using the transition probability P (·|x, a) and calculate the following empirical average estimate of hθ(x, a)\nhθ,N (x,a) := C(x, a) + 1\nN N∑ k=1 ξ∗θ,x(y (k)) [ γv∗θ > φ(y(k))− λ∗,Pθ,x\n− ∑ i∈I λ∗,Iθ,x(i) dfi(ξ ∗ θ,x, p) dp(y(k)) − ∑ e∈E λ∗,Eθ,x(e) dge(ξ ∗ θ,x, p) dp(y(k))\n]\n(3) Calculate an estimate of ∇Vθ using the following average over all the samples: 1 N ∑N j=1 ∑∞ t=0 γ t∇θ logµθ(a(j)t |x (j) t )hθ,N (x (j) t , a (j) t ).\nIndeed, by the definition of empirical transition probability PN (x′|x, a), hθ,N (x, a) can be rewritten as in the same structure of hθ(x, a), except by replacing the transition probability P (x′|x, a) with PN (x′|x, a).\nFurthermore, in the case that the saddle points (ξ∗θ,x, λ ∗,P θ,x , λ ∗,E θ,x , λ ∗,I θ,x) do not have a closed-form solution, we may follow the SAA procedure of Section E.3 and replace them and the transition probabilities P (x′|x, a) with their sample estimates (ξ∗θ,x;N , λ ∗,P θ,x;N , λ ∗,E θ,x;N , λ ∗,I θ,x;N ) and PN (x\n′|x, a) respectively.\nAt the end, we show the convergence of the above two-phase sampling procedure. Let dP ξθ (x|x0) and πP ξθ (x, a|x0) be the state and state-action occupancy measure induced by the transition probability function P ξθ (·|x), respectively. Similarly, let dP ξθ;N (x|x0) and πP ξθ;N (x, a|x0) be the state and state-action occupancy measure induced by the estimated transition probability function P ξθ;N (·|x) := ξ∗θ,x;N (·)Pθ;N (·|x). From the two-phase sampling procedure for policy gradient estimation and by the strong law of large numbers, when N → ∞, with probability 1, we have that 1N ∑N j=1 ∑∞ t=0 γ t1{x(j)t = x, a (j) t = a} = πP ξθ;N (x, a|x0). Based on the strongly convex property of the `2-regularized objective function in the inner robust optimization problem ρN (Φv), we can show that both the state-action occupancy measure πP ξθ;N (x, a|x0) and the stage-wise cost hθ;N (x, a) converge to the their true values within a value function approximation error bound ∆ = ‖Φv∗θ − Vθ‖∞. We refer the readers to the supplementary materials for these technical results. These results together with Theorem E.4 imply the consistency of the policy gradient estimation.\nTheorem E.5. For any x0 ∈ X , the following expression holds with probability 1:∣∣∣∣ limN→∞ 1N N∑ j=1 ∞∑ t=0 γt ∇ logµθ(a(j)t |x (j) t ) hθ,N (x (j) t , a (j) t )\n−∇Vθ(x0) ∣∣∣∣ = O(∆).\nThm. E.5 guarantees that as the value function approximation error decreases and the number of samples increases, the sampled gradient converges to the true gradient."
    }, {
      "heading" : "F Convergence Analysis of Empirical PRSVI",
      "text" : "Lemma F.1 (Technical Lemma). Let P (·|·) and P̃ (·|·) be two arbitrary transition probability matrices. At state x ∈ X , for any ξ : ξP (·|x) ∈ U(x, P (·|x)), there exists a Mξ > 0 such that for some ξ̃ : ξ̃P̃ (·|x) ∈ U(x, P̃ (·|x)),∑\nx′∈X |ξ(x′)− ξ̃(x′)| ≤Mξ ∑ x′∈X ∣∣∣P (x′|x)− P̃ (x′|x)∣∣∣ . Proof. From Theorem 2.1, we know that U(x, P (·|x)) is a closed, bounded, convex set of probability distribution functions. Since any conditional probability mass function P is in the interior of dom(U) and the graph of U(x, P (·|x)) is closed, by Theorem 2.7 in [29], U(x, P (·|x)) is a Lipschitz set-valued mapping with respect to the Hausdorff distance. Thus, for any ξ : ξP (·|x) ∈ U(x, P (·|x)), the following expression holds for some Mξ > 0:\ninf ξ̂∈U(x,P̃ (·|x)) ∑ x′∈X |ξ(x′)− ξ̂(x′)| ≤Mξ ∑ x′∈X ∣∣∣P (x′|x)− P̃ (x′|x)∣∣∣ . Next, we want to show that the infimum of the left side is attained. Since the objective function is convex, and U(x, P̃ (·|x)) is a convex compact set, there exists ξ̃ : ξ̃P̃ (·|x) ∈ U(x, P̃ (·|x)) such that infimum is attained.\nLemma F.2 (Strong Law of Large Number). Consider the sampling based PRSVI algorithm with update sequence {v̂k}. Then as both N and k tend to∞, v̂k converges with probability 1 to v∗θ , the unique solution of projected risk sensitive fixed point equation ΠTµ[Φv] = Φv.\nProof. By the strong law of large number of Markov process, the empirical visiting distribution and transition probability asymptotically converges to their statistical limits with probability 1, i.e.,∑N−1\nt=0 1{xt = x} N → dθ(x|x0), and P̂ (x′|x, a)→ P (x′|x, a), ∀x, x′ ∈ X , a ∈ A.\nTherefore with probability 1,\n1\nN N−1∑ t=0 φ(xt)φ(xt) > → ∑ x dθ(x|x0) · φ(x)φ>(x),\n1\nN N−1∑ t=0 φ(xt)Cθ(xt)→ ∑ x dθ(x|x0) · φ(x)Cθ(x).\nNow we show that following expression holds with probability 1:\nmax ξ : ξPθ;N (·|xt)∈U(xt,Pθ;N (·|xt)) ∑ x′∈X ξ(x′)Pθ;N (x ′|xt)v>φ (x′) + 1 2N (ξ(x′)Pθ;N (x ′|xt))2\n→ max ξ : ξPθ(·|xt)∈U(xt,Pθ(·|xt)) ∑ x′∈X ξ(x′)Pθ(x ′|xt)v>φ (x′) .\n(27)\nNotice that for {ξ∗θ,xt;N (x ′)}x′∈X ∈ arg maxξ : ξPθ;N (·|xt)∈U(xt,Pθ;N (·|xt)) ∑ x′∈X ξ(x ′)Pθ;N (x ′|xt)v>φ (x′), Lemma F.1 implies\nmax ξ : ξPθ;N (·|xt)∈U(xt,Pθ;N (·|xt)) ∑ x′∈X ξ(x′)Pθ;N (x ′|xt)v>φ (x′) + 1 2N (ξ(x′)Pθ;N (x ′|xt))2\n− max ξ : ξPθ(·|xt)∈U(xt,Pθ(·|xt)) ∑ x′∈X ξ(x′)Pθ(x ′|xt)v>φ (x′)\n≤‖Φv‖∞ ( Mξ∗θ,xt;N + max x∈X |ξ∗θ,xt;N (x)| ) ∑ x′∈X |Pθ(x′|xt)− Pθ;N (x′|xt)|+ 1 2N .\nThe quantity maxx∈X |ξ∗θ,xt;N (x)| is bounded because U(xt, Pθ;N (·|xt)) is a closed and bounded convex set from the definition of coherent risk measures. By repeating the above analysis by interchanging Pθ and Pθ;N and combining previous arguments, one obtains∣∣∣∣∣ maxξ : ξPθ;N (·|xt)∈U(xt,Pθ;N (·|xt)) ∑ x′∈X ξ(x′)Pθ;N (x ′|xt)v>φ (x′) + 1 2N (ξ(x′)Pθ;N (x ′|xt))2\n− max ξ : ξPθ(·|xt)∈U(xt,Pθ(·|xt)) ∑ x′∈X ξ(x′)Pθ(x ′|xt)v>φ (x′) ∣∣∣∣∣ ≤‖Φv‖∞max {( Mξ∗ + max\nx∈X |ξ∗(x)|\n) , ( Mξ∗θ,xt;N + max x∈X |ξ∗θ,xt;N (x)| )} ∑ x′∈X |Pθ(x′|xt)− Pθ;N (x′|xt)|+ 1 2N .\nTherefore, the claim in expression (27) holds when N → ∞ and∑ x′∈X |Pθ(x′|xt)− Pθ;N (x′|xt)| → 0. On the other hand, the strong law of large numbers also implies that with probability 1,\n1\nN N−1∑ t=0 φ(xt)ρ(Φvt)→ dθ(x|x0)φ(x) max ξ : ξPθ(·|x)∈U(x,Pθ(·|x)) ∑ x′∈X ξ(x′)Pθ(x ′|x)v∗θ >φ (x′) .\nCombining the above arguments implies\n1\nN N−1∑ t=0 φ(xt)ρN (Φvt)→ dθ(x|x0)φ(x) max ξ : ξPθ(·|x)∈U(x,Pθ(·|x)) ∑ x′∈X ξ(x′)Pθ(x ′|x)v∗θ >φ (x′) .\nAs N → ∞, the above arguments imply that vk − v̂k → 0. On the other hand, Proposition 1 in [37] implies that the projected risk sensitive Bellman operator ΠTθ[V ] is a contraction, it follows that from the analysis in Section 6.3 in [5] that the sequence {Φv̂k} generated by projected value iteration converges to the unique fixed point Φv∗θ . This in turns implies that the sequence {Φvk} converges to Φv∗θ ."
    }, {
      "heading" : "G Technical Results",
      "text" : "Since by convention ξ∗θ,x;N (x ′) = 0 whenever Pθ;N (x′|x) = 0. In this section, we simplify the analysis by letting Pθ;N (x′|x) > 0 for any x′ ∈ X without loss of generality. Consider the following empirical robust optimization problem:\nmax ξ : ξPθ;N (·|x)∈U(x,Pθ;N (·|x)) ∑ x′∈X Pθ;N (x ′|x)ξ(x′)Vθ(x′), (28)\nwhere the solution of the above empirical problem is ξ̄∗θ,x;N and the corresponding KKT multipliers are (λ̄∗,Pθ,x;N , λ̄ ∗,E θ,x;N , λ̄ ∗,I θ,x;N ). Comparing to the optimization problem for ρN (Φv), i.e.,\nρN (Φv) = max ξ : ξPθ;N (·|x)∈U(x,Pθ;N (·|x)) ∑ x′∈X Pθ;N (x ′|x)ξ(x′)φ>(x′)v + 1 2N (ξ(x′)Pθ;N (x ′|x))2,\n(29) where the solution of the above empirical problem is ξ∗θ,x;N and the corresponding KKT multipliers are (λ∗,Pθ,x;N , λ ∗,E θ,x;N , λ ∗,I θ,x;N ), the optimization problem in (28) can be viewed as having a skewed objective function of the problem in (29), within the deviation of magnitude ∆ + 1/2N where ∆ = ‖Φv∗θ − Vθ‖∞. Before getting into the main analysis, we have the following observations.\n(i) Without loss of generality, we can also assume (ξ∗θ,x;N , (λ ∗,P θ,x;N , λ ∗,E θ,x;N , λ ∗,I θ,x;N )) follows the\nstrict complementary slackness condition6. 6The existence of strict complementary slackness solution follows from the KKT theorem and one can easily construct a strictly complementary pair using i.e. the Balinski-Tucker tableau with the linearized objective function and constraints, in finite time.\n(ii) Recall from Assumption 2.2 that the functions fi(ξ, p) and ge(ξ, p) are twice differentiable in ξ at p = Pθ,N (·|x) for any x ∈ X .\n(iii) The Slater’s condition in Assumption 2.2 implies the linear independence constraint qualification (LICQ).\n(iv) Since optimization problem (29) has a convex objective function and convex/affine constraints in ξ ∈ R|X |, equipped with the Slater’s condition we have that the first order KKT condition holds at ξ∗θ,x;N with the corresponding KKT multipliers are (λ ∗,P θ,x;N , λ ∗,E θ,x;N , λ ∗,I θ,x;N ).\nFurthermore, define the Lagrangian function\nL̂θ;N (ξ, λ P , λE , λI) . = ∑ x′∈X Pθ;N (x ′|x)ξ(x′)φ>(x′)v + 1 2N (Pθ;N (x ′|x)ξ(x′))2\n−λP (∑ x′∈X ξ(x′)Pθ;N (x ′|x)−1 ) − ∑ e∈E λE(e)fe(ξ, Pθ;N (·|x))− ∑ i∈I λI(i)fi(ξ, Pθ;N (·|x)).\nOne can easily conclude that ∇2L̂θ;N (ξ, λP , λE , λI) = −Pθ;N (·|x)>Pθ;N (·|x)/N −∑ i∈I λ I(i)∇2ξfi(ξ, Pθ;N (·|x)) such that for any vector ν 6= 0,\nν>∇2L̂θ;N (ξ∗θ,x;N , λ ∗,P θ,x;N , λ ∗,E θ,x;N , λ ∗,I θ,x;N )ν < 0,\nwhich further implies that the second order sufficient condition (SOSC) holds at (ξ∗θ,x;N , λ ∗,P θ,x;N , λ ∗,E θ,x;N , λ ∗,I θ,x;N ).\nBased on all the above analysis, we have the following sensitivity result from Corollary 3.2.4 in [13], derived based on Implicit Function Theorem.\nProposition G.1 (Basic Sensitivity Theorem). Under the Assumption 2.2, for any x ∈ X there exists a bounded non-singular matrix Kθ,x and a bounded vector Lθ,x, such that the difference between the optimizers and KKT multipliers of optimization problem (28) and (29) are bounded as follows:\nξ̄∗θ,x;N λ̄∗,Iθ,x;N λ̄∗,Pθ,x;N λ̄∗,Eθ,x;N  =  ξ∗θ,x;N λ∗,Iθ,x;N λ∗,Pθ,x;N λ∗,Eθ,x;N + Φ−1θ,xΨθ,x ( ∆ + 1 2N ) + o ( ∆ + 1 2N ) .\nOn the other hand, we know from Proposition 4.4 that ξ̄∗θ,x;N → ξ∗θ,x and (λ̄ ∗,P θ,x;N , λ̄ ∗,E θ,x;N , λ̄ ∗,I θ,x;N )→ (λ∗,Pθ,x , λ ∗,E θ,x , λ ∗,I θ,x) with probability 1 as N → ∞. Also recall from the law of large numbers that the sampled approximation error maxx∈X ,a∈A ‖P (·|x, a) − PN (·|x, a)‖1 → 0 almost surely as N →∞. Then we have the following error bound in the stage-wise cost approximation ĥθ;N (x, a) and γ−visiting distribution πN (x, a). Lemma G.2. There exists a constant Mh > 0 such that maxx∈X ,a∈A |hθ(x, a) − limN→∞ ĥθ;N (x, a)| ≤Mh∆.\nProof. First we can easily see that for any state x ∈ X and action a ∈ A, |ĥθ;N (x, a)− hθ(x, a)| ≤M ∑ i∈I ∣∣∣λ∗,Iθ,x;N (i)− λ∗,Iθ,x(i)∣∣∣+M∑ e∈E ∣∣∣λ∗,Eθ,x;N (e)− λ∗,Eθ,x(e)∣∣∣+ ∣∣∣λ∗,Pθ,x;N − λ∗,Pθ,x ∣∣∣ + γ‖Vθ‖∞‖ξ∗θ,x;N − ξ∗θ,x‖1 + γ‖Vθ − Φv∗θ‖∞ + γ‖Vθ‖∞max{‖ξ∗θ,x;N‖∞, ‖ξ∗θ,x‖∞}‖P (·|x, a)− PN (·|x, a)‖1.\nNote that at N → ∞, ‖P (·|x, a) − PN (·|x, a)‖1 → 0 with probability 1. Both ‖ξ∗θ;N‖∞ and ‖ξ∗θ,x‖∞ are finite valued because U(Pθ) and U(Pθ;N ) are convex compact sets of real vectors.\nTherefore, by noting that ‖Vθ‖∞ ≤ Cmax/(1− γ) and applying Proposition 4.4 and G.1, the proof of this Lemma is completed by letting N →∞ and defining\nMh(x) = max{1,M, γCmax 1− γ } ∥∥∥∥∥∥∥∥∥  ξ∗θ,x;N − ξ̄∗θ,x;N λ∗,Iθ,x;N − λ̄ ∗,I θ,x;N λ∗,Pθ,x;N − λ̄ ∗,P θ,x;N\nλ∗,Eθ,x;N − λ̄ ∗,E θ,x;N\n+  ξ̄∗θ,x;N − ξ∗θ,x λ̄∗,Iθ,x;N − λ ∗,I θ,x λ̄∗,Pθ,x;N − λ ∗,P θ,x\nλ̄∗,Eθ,x;N − λ ∗,E θ,x\n ∥∥∥∥∥∥∥∥∥\n1\n+ γ∆\n≤ (\nmax{1,M, γCmax 1− γ\n}‖Φ−1θ,xΨθ,x‖1 + γ ) ∆.\nLemma G.3. There exists a constant Mπ > 0 such that ‖π − limN→∞ πN‖1 ≤Mπ∆.\nProof. First, recall that the γ−visiting distribution satisfies the following identity: γ ∑ x′∈X dP ξθ (x′|x)P ξθ (x|x ′) = dP ξθ (x)− (1− γ)1{x0 = x}, (30)\nFrom here one easily notice this expression can be rewritten as follows:( I − γP ξθ )> dP ξθ (·|x) = 1{x0 = x}, ∀x ∈ X .\nOn the other hand, by repeating the analysis with Pθ;N (·|x), we can also write( I − γP ξθ;N )> dP ξθ;N = {1{x0 = z}}z∈X .\nCombining the above expressions implies for any x ∈ X ,\ndP ξθ − dP ξθ;N − γ\n(( P ξθ )> dP ξθ − (P ξθ;N ) >dP ξθ;N ) = 0,\nwhich further implies ( I − γP ξθ )> ( dP ξθ − dP ξθ;N ) = γ ( P ξθ − P ξ θ;N )> dP ξθ;N\n⇐⇒ ( dP ξθ − dP ξθ;N ) = ( I − γP ξθ )−> γ ( P ξθ − P ξ θ;N )> dP ξθ;N .\nNotice that with transition probability matrix P ξθ (·|x), we have (I − γP ξ θ ) −1 = ∑∞ t=0 ( γP ξθ )k <\n∞. The series is summable because by Perron-Frobenius theorem, the maximum eigenvalue of P ξθ is less than or equal to 1 and I − γP ξθ is invertible. On the other hand, for every given x0 ∈ X ,{(\nP ξθ − P ξ θ;N )> dP ξθ;N } (z′) = ∑ x∈X ∞∑ k=0 γk(1− γ)PP ξθ;N (xk = x|x0) ( P ξθ (z ′|x)− P ξθ;N (z ′|x) ) , ∀z′ ∈ X\n=EP ξθ;N ( ∞∑ k=0 γk(1− γ) ( P ξθ (z ′|xk)− P ξθ;N (z ′|xk) ) |x0 ) , ∀z′ ∈ X\n≤EP ξθ;N ( ∞∑ k=0 γk(1− γ) ∣∣∣P ξθ (z′|xk)− P ξθ;N (z′|xk)∣∣∣ |x0 ) , ∀z′ ∈ X . =Q(z′), ∀z′ ∈ X .\nNote that every element in matrix (I − γP ξθ )−1 = ∑∞ t=0 ( γP ξθ )k is non-negative. This implies for any z ∈ X ,∣∣∣{dP ξθ − dP ξθ;N} (z)∣∣∣ = ∣∣∣∣{(I − γP ξθ )−> γ (P ξθ − P ξθ;N)> dP ξθ;N } (z)\n∣∣∣∣ , ≤ ∣∣∣∣{(I − γP ξθ )−> γQ} (z)∣∣∣∣ = {(I − γP ξθ )−> γQ} (z).\nThe last equality is due to the fact that every element in vector Q is non-negative. Combining the above results with Proposition 4.4 and G.1, and noting that\n(I − γP ξθ ) −1e = ∞∑ t=0 ( γP ξθ )k e = 1 1− γ e,\nwe further have that\n‖π − πN‖1 =‖dP ξθ − dP ξθ;N ‖1 ≤e> ( I − γP ξθ )−> γQ\n= γ\n1− γ e>Q\n≤ γ 1− γ max x∈X ∥∥∥P ξθ (·|x)− P ξθ;N (·|x)∥∥∥ 1 ≤ γ 1− γ max x∈X ( ‖ξ∗θ,x(·)− ξ∗θ,x;N (·)‖1‖Pθ(·|x)‖∞ + max{‖ξ∗θ,x;N‖∞, ‖ξ∗θ,x‖∞}‖P (·|x, a)− PN (·|x, a)‖1 ) ,\nAs in previous arguments, when N → ∞, one obtains ‖P (·|x, a)− PN (·|x, a)‖1 → 0 with probability 1 and ‖ξ∗θ,x(·)−ξ∗θ,x;N (·)‖1 → 0. We thus set the constantMπ as γ‖Φ −1 θ,xΨθ,x‖1/(1−γ)."
    } ],
    "references" : [ ],
    "referenceMentions" : [ ],
    "year" : 2015,
    "abstractText" : "Several authors have recently developed risk-sensitive policy gradient methods<lb>that augment the standard expected cost minimization problem with a measure of<lb>variability in cost. These studies have focused on specific risk-measures, such as<lb>the variance or conditional value at risk (CVaR). In this work, we extend the pol-<lb>icy gradient method to the whole class of coherent risk measures, which is widely<lb>accepted in finance and operations research, among other fields. We consider<lb>both static and time-consistent dynamic risk measures. For static risk measures,<lb>our approach is in the spirit of policy gradient algorithms and combines a standard<lb>sampling approach with convex programming. For dynamic risk measures, our ap-<lb>proach is actor-critic style and involves explicit approximation of value function.<lb>Most importantly, our contribution presents a unified approach to risk-sensitive<lb>reinforcement learning that generalizes and extends previous results.",
    "creator" : "LaTeX with hyperref package"
  }
}