{
  "name" : "1503.05938.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "On Invariance and Selectivity in Representation Learning",
    "authors" : [ "Fabio Anselmi", "Lorenzo" ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : null,
      "text" : "Keywords:Invariance, Machine Learning The paper is submitted to Information and Inference Journal."
    }, {
      "heading" : "1 Introduction",
      "text" : "This paper considers the problem of learning ”good” data representation which can lower the need of labeled data (sample complexity) in machine learning (ML). Indeed, while current ML systems have achieved impressive results in a variety of tasks, an obvious bottleneck appears to be the huge amount of labeled data needed. This paper builds on the idea that data representation, which are learned in an unsupervised manner, can be key to solve the problem. Classical statistical learning theory focuses on supervised learning and postulates that a suitable hypothesis space is given. In turn, under very general conditions, the latter can be seen to be equivalent to a data representation. In other words, data representation and how to select and learn it, is classically not considered to be part of the learning problem, but rather as a prior information. In practice ad hoc solutions are often empirically found for each problem.\nThe study in this paper is a step towards developing a theory of learning data representation. Our starting point is the intuition that, since many learning\n1Center for Brains Minds and Machines, Massachusetts Institute of Technology, Cambridge, MA 02139\n2Laboratory for Computational Learning, Istituto Italiano di Tecnologia and Massachusetts Institute of Technology\n3DIBRIS, Universitá degli studi di Genova, Italy, 16146\nar X\niv :1\n50 3.\n05 93\n8v 1\n[ cs\n.L G\n] 1\n9 M\ntasks are invariant to transformations of the data, learning invariant representation from “unsupervised” experiences can significantly lower the ”size” of the problem, effectively decreasing the need of labeled data. In the following, we formalize the above idea and discuss how such invariant representations can be learned. Crucial to our reasoning is the requirement for invariant representations to satisfy a form of selectivity, broadly referred to as the property of distinguishing images which are not one the transformation of the other. Indeed, it is this latter requirement that informs the design of non trivial invariant representations. Our work is motivated by a theory of cortex and in particular visual cortex [5].\nData representation is a classical concept in harmonic analysis and signal processing. Here representations are typically designed on the basis of prior information assumed to be available. More recently, there has been an effort to automatically learn adaptive representation on the basis of data samples. Examples in this class of methods include so called dictionary learning [30], autoencoders [6] and metric learning techniques (see e.g. [33]). The idea of deriving invariant data representation has been considered before. For example in the analysis of shapes [19] and more generally in computational topology [10], or in the design of positive definite functions associated to reproducing kernel Hilbert spaces [12]. However, in these lines of study the selectivity properties of the representations have hardly been considered. The ideas in [22, 28] are close in spirit to the study in this paper. In particular, the results in [22] develop a different invariant and stable representation within a signal processing framework. In [28] an information theoretic perspective is considered to formalize the problem of learning invariant/selective representations.\nIn this work we develop a machine learning perspective closely following computational neuroscience models of the information processing in the visual cortex [15, 16, 26]. Our first and main result shows that, for compact groups, representation defined by nonlinear group averages can be shown to be invariant, as well as selective, to the action of the group. While invariance follows from the properties of the Haar measure associated to the group, selectivity is shown using probabilistic results that characterize a probability measure in terms of one dimensional projections. This set of ideas, which form the core of the paper, is then extended to local transformations, and multilayer architectures. These results bear some understanding to the nature of certain deep architecture, in particular neural networks of the convolution type.\nThe rest of the paper is organized as follows. We describe the concept of invariance and selective representation in Section 2 and their role for learning in Section 3. We discuss a family of invariant/selective representation for transformations which belong to compact groups in Section 4 that we further develop in Sections 5 and 6. Finally we conclude in Section 7 with some final comments."
    }, {
      "heading" : "2 Invariant and Selective Data Representations",
      "text" : "We next formalize and discuss the notion of invariant and selective data representation, which is the main focus of the rest of the paper.\nWe model the data space as a (real separable) Hilbert space I and denote by 〈·, ·〉 and ‖·‖ the inner product and norm, respectively. Example of data spaces are one dimensional signals (as in audio data), where we could let I ⊂ L2(R), or two dimensional signals (such as images), where we could let I ⊂ L2(R2). After discretization, data can often be seen as vectors in high-dimensional Euclidean spaces, e.g. I = Rd. The case of (digital) images serves as a main example throughout the paper.\nA data representation is a map from the data space in a suitable representation space, that is\nµ : I → F .\nIndeed, the above concept appears under different names in various branch of pure and applied sciences, e.g. it is called an encoding (information theory), a feature map (learning theory), a transform (harmonic analysis/signal processing) or an embedding (computational geometry).\nIn this paper, we are interested in representations which are invariant (see below) to suitable sets of transformations. The latter can be seen as a set of maps\nG ⊂ {g | g : I → I}.\nMany interesting examples of transformations have a group structure. Recall that a group is a set endowed with a well defined composition/multiplication operation satisfying four basic properties,\n• closure: gg′ ∈ G, for all g, g′ ∈ G\n• associativity: (gg′)g′′ = g(g′g′′), for all g, g′, g′′ ∈ G\n• identity: there exists Id ∈ G such that Idg = gId = g, for all g ∈ G.\n• invertibility: for all g ∈ G there exists g−1 ∈ G such that (gg−1) = Id.\nThere are different kind of groups. In particular, “small” groups such as compact (or locally compact, i.e. a group that admits a locally compact Hausdorff topology such that the group operations of composition and inversion are continuous.) groups, or “large” groups which are not locally compact. In the case of images, examples of locally compact groups include affine transformations (e.g. scaling, translations, rotations and their combinations) which can be thought of as suitable viewpoint changes. Examples of non locally compact groups are diffeomorphisms, which can be thought of as various kind of local or global deformations.\nExample 1. Let I ∈ L2(R). A basic example of group transformation is given by the translation group, which can be represented as a family of linear operators\nTτ : L 2(R)→ L2(R), TτI(p) = I(p− τ), ∀p ∈ R, I ∈ I,\nfor τ ∈ R. Other basic examples of locally compact groups include scaling (the multiplication group) and affine transformations (affine group). Given a smooth map d : R→ R a diffeomorphism can also be seen as a linear operator given by\nDd : L 2(R)→ L2(R), DdI(p) = I(d(p)), ∀p ∈ R, I ∈ I.\nNote that also in this case the representation is linear.\nClearly, not all transformations have a group structure– think for example of images obtained from three dimensional rotations of an object. Given the above premise, we next discuss, properties of data representation with respect to transformations. We first add one remark about the notation.\nRemark 1 (Notation: Group Action and Representation). If G is a group and I a set, the group action is the map (g, x) 7→ g.x ∈ I. In the following, with an abuse of notation we will denote by gx the group action. Indeed, when I is a linear space, we also often denote by g both a group element and its representation, so that g can be identified with a linear operator. Throughout the article we assume the group representation to be unitary [25].\nTo introduce the notion of invariant representation, we recall that an orbit associated to an element I ∈ I is the set OI ⊂ I given by OI = {I ′ ∈ I | I ′ = gI, g ∈ G}. Orbits form a partition of I in equivalence classes, with respect to the equivalence relation,"
    }, {
      "heading" : "I ∼ I ′ ⇔ ∃ g ∈ G such that gI = I ′,",
      "text" : "for all I, I ′ ∈ I. We have the following definition.\nDefinition 1 (Invariant Representation). We say that a representation µ is invariant with respect to G if\nI ∼ I ′ ⇒ µ(I) = µ(I ′),\nfor all I, I ′ ∈ I.\nIn words, the above definition states that if two data points are one the transformation of the other, than they will have the same representation. Indeed, if a representation µ is invariant\nµ(I) = µ(gI)\nfor all I ∈ I, g ∈ G. Clearly, trivial invariant representations can be defined, e.g. the constant function. This motivates a second requirement, namely selectivity.\nDefinition 2 (Selective Representation). We say that a representation µ is selective with respect to G if\nµ(I) = µ(I ′)⇒ I ∼ I ′,\nfor all I, I ′ ∈ I.\nTogether with invariance, selectivity asserts that two points have the same representation if and only if they are one a transformation of the other. Several comments are in order. First, the requirement of exact invariance as in Definition 1, seems desirable for (locally) compact groups, but not for non locally compact group such as diffeomorphisms. In this case, requiring a form of stability to small transformations seems to be natural, as it is more generally to require stability to small perturbations, e.g. noise (see [22]). Second, the concept of selectivity is natural and requires that no two orbits are mapped in the same representation. It corresponds to an injectivity property of a representation on the quotient space I/ ∼. Assuming F to be endowed with a metric dF , a stronger requirement would be to characterize the metric embedding induced by µ, that is to control the ratio (or the deviation) of the distance of two representation and the distance of two orbits. Indeed, the problem of finding invariant and selective representation, is tightly related to the problem of finding an injective embedding of the quotient space I/ ∼.\nWe next provide a discussion of the potential impact of invariant representations on the solution of subsequent learning tasks."
    }, {
      "heading" : "3 From Invariance to Low Sample Complexity",
      "text" : "In this section we first recall how the concepts of data representation and hypothesis space are closely related, and how the sample complexity of a supervised problem can be characterized by the covering numbers of the hypothesis space. Then, we discuss how invariant representations can lower the sample complexity of a supervised learning problem.\nSupervised learning amounts to finding an input-output relationship on the basis of a training set of input-output pairs. Outputs can be scalar or vector valued, as in regression, or categorical, as in multi-category or multi-label classification, binary classification being a basic example. The bulk of statistical learning theory is devoted to study conditions under which learning problems can be solved, approximately and up to a certain confidence, provided a suitable hypothesis space is given. A hypotheses space is a subset\nH ⊂ {f | f : I → Y},\nof the set of all possible input output relations. As we comment below, under very general assumptions hypothesis spaces and data representations are equivalent concepts."
    }, {
      "heading" : "3.1 Data Representation and Hypothesis Space",
      "text" : "Indeed, practically useful hypothesis spaces are typically endowed with a Hilbert space structure, since it is in this setting that most computational solutions can be developed. A further natural requirement is for evaluation functions to be well defined and continuous. This latter property allows to give a well defined\nmeaning of the evaluation of a function at every points, a property which is arguably natural since we are interested in making predictions. The requirements of 1) being a Hilbert space of of functions and 2) have continuous evaluation functionals, define so called reproducing kernel Hilbert spaces [24]. Among other properties, these spaces of functions are characterized by the existence of a feature map µ : I → F , which is a map from the data space into a feature space which is itself a Hilbert space. Roughly speaking, functions in a RKHS H with an associated feature map µ can be seen as hyperplanes in the feature space, in the sense that ∀f ∈ H, there exists w ∈ F such that\nf(I) = 〈w, µ(I)〉F , ∀I ∈ I.\nThe above discussion illustrates how, under mild assumptions, the choice of a hypothesis space is equivalent to the choice of a data representation (a feature map). In the next section, we recall how hypothesis spaces, hence data representation, are usually assumed to be given in statistical learning theory and are characterized in terms of sample complexity."
    }, {
      "heading" : "3.2 Sample Complexity in Supervised Learning",
      "text" : "Supervised statistical learning theory characterizes the difficulty of a learning problem in terms of the ”size” of the considered hypothesis space, as measured by suitable capacity measures. More precisely, given a measurable loss function V : Y × Y → [0,∞), for any measurable function f : I → Y the expected error is defined as\nE(f) = ∫ V (f(I), y)dρ(I, y)\nwhere ρ is a probability measure on I×Y. Given a training set Sn = {(I1, y1), . . . , (In, yn)} of input-output pairs sampled identically and independently with respect to ρ, and a hypothesis space H, the goal of learning is to find an approximate solution fn = fSn ∈ H to the problem\ninf f∈H E(f)\nThe difficulty of a learning problem is captured by the following definition.\nDefinition 3 (Learnability and Sample Complexity). A hypothesis space H is said to be learnable if, for all ∈ [0,∞), δ ∈ [0, 1], there exists n( , δ,H) ∈ N such that\ninf fn sup ρ\nP ( E(fn)− inf\nf∈H E(f) ≥\n) ≤ δ. (1)\nThe quantity n( , δ,H) is called the sample complexity of the problem.\nThe above definition characterizes the complexity of the learning problem associated to a hypothesis space H, in terms of the existence of an algorithm that, provided with at least n( , δ,H) training set points, can approximately solve the learning problem on H with accuracy and confidence δ.\nThe sample complexity associated to a hypothesis space H can be derived from suitable notions of covering numbers, and related quantities, that characterize the size of H. Recall that, roughly speaking, the covering number N associated to a (metric) space is defined as the minimal number of balls needed to cover the space. The sample complexity can be shown [31, 9] to be proportional to the logarithm of the covering number, i.e.\nn( , δ,H) ∝ 1 2 log N δ .\nAs a basic example, consider I to be d-dimensional and a hypothesis space of linear functions\nf(I) = 〈w, I〉 , ∀I ∈ I, w ∈ I,\nso that the data representation is simply the identity. Then the -covering number of the set of linear functions with ‖w‖ ≤ 1 is given by\nN ∼ −d.\nIf the input data lie in a subspace of dimension s ≤ d then the covering number of the space of linear functions becomes N ∼ −s. In the next section, we further comment on the above example and provide an argument to illustrate the potential benefits of invariant representations."
    }, {
      "heading" : "3.3 Sample Complexity of the Invariance Oracle",
      "text" : "Consider the simple example of a set of images of p × p pixels each containing an object within a (square) window of k×k pixels and surrounded by a uniform background. Imagine the object positions to be possibly anywhere in the image. Then it is easy to see that as soon as objects are translated so that they not overlap we get an orthogonal subspace. Then, we see that there are r2 = (p/k)2 possible subspaces of dimension k2, that is the set of translated images can be seen as a distribution of vectors supported within a ball in d = p2 dimensions. Following the discussion in the previous section the best algorithm based on a linear hypothesis space will incur in a sample complexity proportional to d. Assume now to have access to an oracle that can ”register” each image so that each object occupies the centered position. In this case, the distribution of images is effectively supported within a ball in s = k2 dimensions and the sample complexity is proportional to s rather than d. In other words a linear learning algorithm would need\nr2 = d/s\nless examples to achieve the same accuracy. The idea is that invariant representations can act as an invariance oracle, and have the same impact on the sample complexity. We add a few comments. First, while the above reasoning is developed for linear hypothesis space, a similar conclusion holds if non linear hypothesis spaces are considered. Second, one can see that the set of images obtained by translation is a low dimensional manifold, embedded in a very high\ndimensional space. Other transformations, such as small deformation, while being more complex, would have a much milder effect on the dimensionality of the embedded space. Finally, the natural question is how invariant representations can be learned, a topic we address next."
    }, {
      "heading" : "4 Compact Group Invariant Representations",
      "text" : "Consider a set of transformations G which is a locally compact group. Recall that each locally compact groups has a finite measure naturally associated to it, the so called Haar measure. The key feature of the Haar measure is its invariance to the group action, and in particular for all measurable functions f : G → R, and g′ ∈ G, it holds∫\ndgf(g) = ∫ dgf(g′g).\nThe above equation is reminding of the invariance to translation of Lebesgue integrals and indeed, the Lebesgue measure can be shown to be the Haar measure associated to the translation group. The invariance property of the Haar measure associated to a locally compact group, is key to our development of invariant representation, as we describe next."
    }, {
      "heading" : "4.1 Invariance via Group Averaging",
      "text" : "The starting point for deriving invariant representations is the following direct application of the invariance property of the Haar measure.\nTheorem 1. Let ψ : I → R be a, possibly non linear, functional on I. Then, the functional defined by\nµ : I → R, µ(I) = ∫ dgψ(gI), I ∈ I (2)\nis invariant in the sense of Definition 1.\nThe functionals ψ, µ can be thought to be measurements, or features, of the data. In the following we are interested in measurements of the form\nψ : I → R, ψ(I) = η(〈gI, t〉), I ∈ I, g ∈ G (3)\nwhere t ∈ T ⊆ I the set of unit vectors in I and η : R → R is a possibly non linear function. As discussed in [4], the main motivation for considering measurements of the above form is their interpretation in terms of biological or artificial neural networks, see the following remarks.\nRemark 2 (Hubel and Wiesel Simple and Complex Cells [14]). A measurement as in (3) can be interpreted as the output of a neuron which computes a possibly high-dimensional inner product with a template t ∈ T . In this interpretation,\nη can be seen as a, so called, activation function, for which natural choices are sigmoidal functions, such as the hyperbolic tangent or rectifying functions such as the hinge. The functional µ, obtained plugging (3) in (2) can be seen as the output of a second neuron which aggregates the output of other neurons by a simple averaging operation. Neurons of the former kind are similar to simple cells, whereas neurons of the second kind are similar to complex cells in the visual cortex.\nRemark 3 (Convolutional Neural Networks [20]). The computation of a measurement obtained plugging (3) in (2) can also be seen as the output of a so called convolutional neural network where each neuron, ψ is performing the inner product operation between the input, I, and its synaptic weights, t, followed by a pointwise nonlinearity η and a pooling layer.\nA second, reason to consider measurements of the form (3) is computational and, as shown later, have direct implications for learning. Indeed, to compute an invariant feature, according to (2) it is necessary to be able to compute the action of any element I ∈ I for which we wish to compute the invariant measurement. However, a simple observation suggests an alternative strategy. Indeed, since the group representation is unitary, then\n〈gI, I ′〉 = 〈 I, g−1I ′ 〉 , ∀I, I ′ ∈ I\nso that in particular we can compute ψ by considering\nψ(I) = ∫ dgη(〈I, gt〉), ∀I ∈ I, (4)\nwhere we used the invariance of the Haar measure. The above reasoning implies that an invariant feature can be computed for any point provided that for t ∈ T , the sequence gt, g ∈ G is available. This observation has the following interpretation: if we view a sequence gt, g ∈ G, as a ”movie” of an object undergoing a family of transformations, then the idea is that invariant features can be computed for any new image provided that a movie of the template is available.\nWhile group averaging provides a natural way to tackle the problem of invariant representation, it is not clear how a family of invariant measurements can be ensured to be selective. Indeed, in the case of compact groups selectivity can be provably characterized using a probabilistic argument summarized in the following three steps:\n1. A unique probability distribution can be naturally associated to each orbit.\n2. Each such probability distributions can be characterized in terms of onedimensional projections.\n3. One dimensional probability distributions are easy to characterize, e.g. in terms of their cumulative distribution or their moments.\nWe note in passing that the above development, which we describe in detail next, naturally provides as a byproduct indications on how the non linearity in (3) needs to be chosen and thus gives insights on the nature of the pooling operation."
    }, {
      "heading" : "4.2 A Probabilistic Approach to Selectivity",
      "text" : "Let I = Rd, and P(I) the space of probability measures on I. Recall that for any compact group, the Haar measure is finite, so that, if appropriately normalized, it correspond to a probability measure.\nAssumption 1. In the following we assume G to be Abelian and compact and the corresponding Haar measure to be normalized.\nThe first step in our reasoning is the following definition.\nDefinition 4 (Representation via Orbit Probability). For all I ∈ I, define the random variable\nZI : (G, dg)→ I, ZI(g) = gI, ∀g ∈ G,\nwith law\nρI(A) = ∫ Z−1I (A) dg,\nfor all measurable sets A ⊂ I. Let\nP : I → P(I), P (I) = ρI , ∀I ∈ I.\nThe map P associates to each point a corresponding probability distribution. From the above definition we see that we are essentially viewing an orbit as a distribution of points, and mapping each point in one such distribution. Then we have the following result.\nTheorem 2. For all I, I ′ ∈ I\nI ∼ I ′ ⇔ P (I) = P (I ′). (5)\nProof. We first prove that I ∼ I ′ ⇒ ρI = ρI′ . Recalling that if Cc(I) is the set of continuous functions on I with compact support, ρI can be alternatively defined as the unique probability distribution such that∫\nf(z)dρI(z) = ∫ f(ZI(g))dg, ∀f ∈ Cc(I). (6)\nTherefore ρI = ρI′ if and only if for any f ∈ Cc(I), we have ∫ G f(ZI(g))dg =∫\nG f(ZI′(g))dg which follows immediately by a change of variable and invariance of the Haar measure:∫\nG f(ZI(g))dg = ∫ G f(gI)dg = ∫ G f(gI ′)dg = ∫ G f(gg̃I)dg = ∫ G f(ĝI)dĝ\nTo prove that ρI = ρI′ ⇒ I ∼ I ′, note that ρI(A) − ρI′(A) = 0 for all measurable sets A ⊆ I implies in particular that the support of the probability distributions of I has non null intersection on a set of non zero measure. Since the support of the distributions ρI , ρI′ are exactly the orbits associated to I, I ′ respectively, then the orbits coincide, that is I ∼ I ′.\nThe above result shows that an invariant representation can be defined considering the probability distribution naturally associated to each orbit, however its computational realization would require dealing with high-dimensional distributions. Indeed, we next show that the above representation can be further developed to consider only probability distributions on the real line."
    }, {
      "heading" : "4.2.1 Tomographic Probabilistic Representations",
      "text" : "We need to introduce some notation and definitions. Let T = S, the unit sphere in I, and let P(R) denote the set of probability measures on the real line. For each t ∈ T , let πt : I → R, πt(I) = 〈I, t〉 , ∀I ∈ I. If ρ ∈ P(I), for all t ∈ T we denote by ρt ∈ P(R) the random variable with law given by\nρt(B) = ∫ π−1t (B) dρ,\nfor all measurable sets B ⊂ R.\nDefinition 5 (Radon Embedding). Let P(R)T = {h | h : T → P(R)} and define\nR : P(I)→ P(R)T , R(ρ)(t) = ρt, ∀I ∈ I.\nThe above map associates to each probability distribution a (continuous) family of probability distributions on the real line defined by one dimensional projections (tomographies). Interestingly, R can be shown to be a generalization of the Radon Transform to probability distributions [17]. We are going to use it to define the following data representation.\nDefinition 6 (TP Representation). We define the Tomographic Probabilistic (TP) representation as\nΨ : I → P(R)T , Ψ = R ◦ P,\nwith P and R as in Definitions 4, 5, respectively.\nThe TP representation is obtained by first mapping each point in the distribution supported on its orbit and then in a (continuous) family of corresponding one dimensional distributions. The following result characterizes the invariance/selectivity property of the TP representation.\nTheorem 3. Let Ψ be the TP representation in Definition 6, then for all I, I ′ ∈ I\nI ∼ I ′ ⇔ Ψ(I) = Ψ(I ′). (7)\nThe proof of the above result is obtained combining Theorem 2 with the following well known result, characterizing probability distributions in terms of their one dimensional projections.\nTheorem 4 (Cramer-Wold [8]). For any ρ, γ ∈ P(I), it holds\nρ = γ ⇔ ρt = γt, ∀t ∈ S. (8)\nThrough the TP representation, the problem of finding invariant/selective representations reduces to the study of one dimensional distributions, as we discuss next."
    }, {
      "heading" : "4.2.2 CDF Representation",
      "text" : "A natural way to describe a one-dimensional probability distribution is to consider the associated cumulative distribution function (CDF). Recall that if ξ : (Ω, p) → R is a random variable with law q ∈ P(R), then the associated CDF is given by\nfq(b) = q((∞, b]) = ∫ dp(a)H(b− ξ(a)), b ∈ R, (9)\nwhere where H is the Heaviside step function. Also recall that the CDF uniquely defines a probability distribution since, by the Fundamental Theorem of Calculus, we have\nd\ndb fq(b) =\nd\ndb\n∫ dp(a)H(b− ξ(a)) = d\ndb ∫ b −∞ dp(a) = p(b).\nWe consider the following map.\nDefinition 7 (CDF Vector Map). Let F(R) = {h | h : R→ [0, 1]}, and\nF(R)T = {h | h : T → F(R)}.\nDefine F : P(R)T → F(R)T , F (γ)(t) = fγt\nfor γ ∈ P(R)T and where we let γt = γ(t) for all t ∈ T .\nThe above map associates to a family of probability distributions on the real line their corresponding CDFs. We can then define the following representation.\nDefinition 8 (CDF Representation). Let\nµ : I → F(R)T , µ = F ◦R ◦ P,\nwith F ,P and R as in Definitions 7, 4, 5, respectively.\nThen, the following result holds.\nTheorem 5. For all I ∈ I and t ∈ T\nµt(I)(b) = ∫ dgηb(〈I, gt〉), b ∈ R, (10)\nwhere we let µt(I) = µ(I)(t) and, for all b ∈ R, ηb : R → R, is given by ηb(a) = H(b− a), a ∈ R. Moreover, for all I, I ′ ∈ I\nI ∼ I ′ ⇔ µ(I) = µ(I ′).\nProof. The proof follows noting that µ is the composition of the one to one maps F,R and a map P that is one to one w.r.t. the equivalence classes induced by the group of transformations G. Therefore µ is one to one w.r.t. the equivalence classes i.e. I ∼ I ′ ⇔ µ(I) = µ(I ′).\nWe note that, from a direct comparison, one can see that (10) is of the form (4). Different measurements correspond to different choices of the threshold b.\nRemark 4. [Pooling Functions: from CDF to Moments and Beyond] The above reasoning suggests that a principled choice for the non linearity in (4) is a step function, which in practice could be replaced by a smooth approximation such a sigmoidal function. Interestingly, other choices of non linearities could be considered. For example, considering different powers would yield information on the moments of the distributions (more general non linear function than powers would yield generalized moments). This latter point of view is discussed in some detail in Appendix A."
    }, {
      "heading" : "4.3 Templates Sampling and Metric Embedings",
      "text" : "We next discuss what happens if only a finite number of (possibly random) templates are available. In this case, while invariance can be ensured, in general we cannot expect selectivity to be preserved. However, it is possible to show that the representation is almost selective (see below) if a sufficiently large number number of templates is available.\nTowards this end we introduce a metric structure on the representation space. Recall that if ρ, ρ′ ∈ P(R) are two probability distributions on the real line and fρ, fρ′ their cumulative distributions functions, then the uniform Kolmogorov-Smirnov (KS) metric is induced by the uniform norm of the cumulative distributions that is\nd∞(fρ, fρ′) = sup s∈R |fρ(s)− fρ′(s)|,\nand takes values in [0, 1]. Then, if µ is the representation in (10) we can consider the metric\nd(I, I ′) = ∫ du(t)d∞(µ t(I), µt(I ′)) (11)\nwhere u is the (normalized) uniform measure on the sphere S. We note that, theorems 4 and 5 ensure that (11) is a well defined metric on the quotient space induced by the group transformations, in particular\nd(I, I ′) = 0⇔ I ∼ I ′.\nIf we consider the case in which only a finite set Tk = {t1, . . . , tk} ⊂ S of k templates is available, each point is mapped in a finite sequence of probability distributions or CDFs and (11) is replaced by\nd̂(I, I ′) = 1\nk k∑ i=1 d∞(µ ti(I), µti(I ′)) (12)\nClearly, in this case we cannot expect to be able to discriminate every pair of points, however we have the following result.\nTheorem 6. Consider n images In in I. Let k ≥ 2c 2 log n δ , where c is a constant. Then with probability 1− δ2,\n|d(I, I ′)− d̂(I, I ′)| ≤ . (13)\nfor all I, I ′ ∈ In.\nProof. The proof follows from a direct application of Höeffding’s inequality and a union bound. Fix I, I ′ ∈ In. Define the real random variable Z : S → [0, 1],\nZ(ti) = d∞(µ ti(I), µti(I ′)), i = 1, . . . , k.\nFrom the definitions it follows that ‖Z‖ ≤ 1 and E(Z) = d(I, I ′). Then, Höeffding inequality implies\n|d(I, I ′)− d̂(I, I ′)| = |1 k k∑ i=1 E(Z)− Z(ti)| ≥ ,\nwith probability at most 2e− 2k. A union bound implies that the result holds uniformly on In with probability at least n22e− 2k. The proof is concluded setting this probability to δ2 and taking k ≥ 2c 2 log n δ .\nWe note that, while we considered the KS metric for convenience, other metrics over probability distributions can be considered. Also, we note that a natural further question is how discretization/sampling of the group affects the representation. The above reasoning could be extended to yield results in this latter case. Finally, we note that, when compared to classical results on distance preserving embedding, such as Johnson Linderstrauss Lemma [18], Theorem 12 only ensures distance preservation up to a given accuracy which increases with a larger number of projections. This is hardly surprising, since the problem of finding suitable embedding for probability spaces is known to be considerably harder than the analogue problem for vector spaces [2]. The question of how devise strategies to define distance preserving embedding is an interesting open problem."
    }, {
      "heading" : "5 Locally Invariant and Covariant Representa-",
      "text" : "tions\nWe consider the case where a representation is given by collection of ”local” group averages, and refer to this situation as the partially observable group (POG) case. Roughly speaking, the idea is that this kind of measurements can be invariant to sufficiently small transformations, i.e. be locally invariant. Moreover, representations given by collections of POG averages can be shown to be covariant (see section 5.2 for a definition)."
    }, {
      "heading" : "5.1 Partially Observable Group Averages",
      "text" : "For a subset G0 ⊂ G consider a POG measurement of the form\nψ(I) = ∫ G0 dgη(〈I, gt〉). (14)\nThe above quantity can be interpreted as the ”response” of a cell that can perceive visual stimuli within a ”window” (receptive field) of size G0. A POG measurement corresponds to a local group average restricted to a subset of transformations G0. Clearly, such a measurement will not in general be invariant. Consider a POG measurement on a transformed point∫\nG0 dgη(〈g̃I, gt〉) = ∫ G0 dgη( 〈 I, g̃−1gt 〉 ) = ∫ g̃G0 dgη(〈I, gt〉).\nIf we compare the POG measurements on the same point with and without a transformation, we have\n| ∫ G0 dgη(〈I, gt〉)− ∫ g̃G0 dgη(〈I, gt〉)|. (15)\nWhile there are several situations in which the above difference can be zero, the intuition from the vision interpretation is that the same response should be obtained if a sufficiently small object does not move (transform) too much with respect to the receptive field size. This latter situation can be described by the assumption that the function\nh : G → R, h(g) = η(〈I, gt〉)\nis zero outside of the intersection of g̃G0 ∩ G0. Indeed, for all g̃ ∈ G satisfying this latter assumption, the difference in (15) would clearly be zero. The above reasoning results in the following theorem.\nTheorem 7. Given I ∈ I and t ∈ T , assume that there exists a set G̃ ⊂ G such that, for all g̃ ∈ G̃, η(〈I, gt〉) = 0 ∀g /∈ g̃G0 ∩ G0. (16) Then for g̃ ∈ G̃\nψ(I) = ψ(g̃I),\nwith ψ as in (14).\nWe add a few comments. First, we note that condition (16) can be weakened requiring only η(〈I, gt〉) = 0 for all g ∈ g̃G0∆G0, where we denote by ∆ the symmetric difference of two sets (A∆B = (A ∪ B)/(A ∩ B) with A,B sets). Second, we note that if the non linearity η is zero only in zero, then we can rewrite condition (16) as\n〈I, gt〉 = 0, ∀g ∈ g̃G0∆G0.\nFinally, we note that the latter expression has a simple interpretation in the case of the translation group. In fact, we can interpret (16) as a spatial localization condition on the image I and the template t (assumed to be positive valued functions), see Figure 1. We conclude with the following remark.\nRemark 5 (Localization Condition and V1). Regarding the localization condition discussed above, as we comment elsewhere [3], the fact that a template needs to be localized could have implications from a biological modeling standpoint. More precisely, it could provides a theoretical foundation of the Gabor like shape of the responses observed in V1 cells in the visual cortex [23, 3, 5].\nRemark 6 (More on the Localization Condition). From a more mathematical point of view, an interesting question is about conditions under which whether the localization condition (16) is also necessary rather than only sufficient."
    }, {
      "heading" : "5.2 POG Representation",
      "text" : "For all ḡ ∈ G, let ḡG0 = {g ∈ G | g = ḡg′, g′ ∈ G0}, the collection of ”local” subsets of the group obtained from the subset G0. Moreover, let\nV = ∫ G0 dg.\nClearly, by the invariance of the measure, we have ∫ ḡG0 dg = V , for all ḡ ∈ G. Then, for all I ∈ I, ḡ ∈ G, define the random variables\nZI,ḡ : ḡG0 → I, ZI,ḡ(g) = gI, g ∈ ḡG0, (17)\nwith laws\nρI,ḡ(A) = 1\nV ∫ Z−1I,ḡ(A) dg, t\nfor all measurable sets A ⊂ I. For each I ∈ I, ḡ ∈ G, the measure ρI,ḡ corresponds to the distribution on the fraction of the orbit corresponding to the observable group subset ḡG0. Then we can represent each point with a collection of POG distributions.\nDefinition 9 (Representation via POG Probabilities). Let P(I)G = {h | h : G → P(I)} and define\nP̄ : I → P(I)G , P̄ (I)(g) = ρI,g ∀I ∈ I, g ∈ G\nEach point is mapped in the collection of distributions obtained considering all possible fractions of the orbit corresponding to ḡG0, ḡ ∈ G. Note that, the action of an element g̃ ∈ G of the group on the POG probability representation is given by\ng̃P̄ (I)(g) = P̄ (I)(g̃g)\nfor all g ∈ G. The following result holds.\nTheorem 8. Let P̄ as in Definition (9). Then for all I, I ′ ∈ I if\nI ∼ I ′ ⇒ ∃g̃ ∈ G such that P̄ (I ′) = g̃P̄ (I). (18)\nEquivalently, for all I, I ′ ∈ I if I ′ = g̃I\nthen P̄ (I ′)(g) = P̄ (I)(gg̃), ∀g ∈ G. (19)\ni.e. P̄ is covariant.\nProof. The proof follows noting that ρI′,ḡ = ρI,ḡg̃ holds since, using the same characterization of ρ as in (6),we have that for any f ∈ Cc(I)∫\nḡG0 f(ZI′,ḡ(g))dg = ∫ ḡG0 f(gI ′)dg = ∫ ḡG0 f(gg̃I)dg = ∫ ḡG0g̃ f(gI)dg\nwhere we used the invariance of the measure.\nFollowing the reasoning in the previous sections and recalling Definition 5, we consider the mapping given by one dimensional projections (tomographies) and corresponding representations.\nDefinition 10 (TP-POG Representation). Let P(R)G×T = {h | h : G × T → P(R)} and define\nR̄ : P(I)G → P(R)G×T , R̄(h)(g, t) = R(h(g))(t) = ht(g),\nfor all h ∈ P(I)G , g ∈ G, t ∈ T . Moreover, we define the Tomographic Probabilistic POG representation as\nΨ̄ : I → P(R)G×T , Ψ̄ = R̄ ◦ P̄ ,\nwith P̄ as in Definition 9.\nWe have the following result:\nTheorem 9. The representation Ψ̄ defined in 10 is covariant, i.e. Ψ̄(g̃I)(g) = Ψ̄(I)(g̃g).\nProof. The map Ψ̄ = R̄ ◦ P̄ is covariant if both R̄ and P̄ are covariant. The map P̄ was proven to be covariant in Theorem 8. We then need to prove the covariance of R̄ i.e. g̃R̄(h)(g, t) = R̄(h)(g̃g, t) for all h ∈ P(I)G . This follows from\nR̄(g̃h)(g, t) = R(g̃h(g))(t) = R(h(g̃g))(t) = R(h)(g̃g, t).\nThe TP-POG representation is obtained by first mapping each point I in the family of distributions ρI,g, g ∈ G supported on the orbit fragments corresponding to POG and then in a (continuous) family of corresponding one dimensional distributions ρtI,g, g ∈ G, t ∈ T . Finally, we can consider the representation obtained representing each distribution via the corresponding CDF.\nDefinition 11 (CDF-POG Representation). Let F(R)G×T = {h | h : G ×T → F(R)} and define\nF̄ : P(I)G×T → P(R)G×T , F̄ (h)(g, t) = F (h(g, t)) = fh(g,t),\nfor all h ∈ P(I)G×T and g ∈ G, t ∈ T . Moreover, define the CDF-POG representation as µ̄ : I → F(R)G×T , µ̄ = F̄ ◦ R̄ ◦ P̄ , with P̄ ,F̄ as in Definition 9, 10, respectively.\nIt is easy to show that\nµḡ,t(I)(b) = ∫ ḡG0 ηb(〈I, gt〉)dg. (20)\nwhere we let µḡ,t(I) = µ(I)(ḡ, t)."
    }, {
      "heading" : "6 Further Developments: Hierarchical Repre-",
      "text" : "sentation\nIn this section we discuss some further developments of the framework presented in the previous section. In particular, we sketch how multi-layer (deep) representations can be obtained abstracting and iterating the basic ideas introduced before.\nHierarchical representations, based on multiple layers of computations, have naturally arisen from models of information processing in the brain [11, 26]. They have also been critically important in recent machine learning successes in a variety of engineering applications, see e.g. [27]. In this section we address the question of how to generalize the framework previously introduced to consider multi-layer representations.\nRecall that the basic idea for building invariant/selective representation is to consider local (or global) measurements of the form∫\nG0 η(〈I, gt〉)dg, (21)\nwith G0 ⊆ G. A main difficulty to iterate this idea is that, following the development in previous sections, the representation (11)-(20), induced by collection of (local) group averages, maps the data space I in the space P(R)G×T . The latter space lacks an inner product as well as natural linear structure needed to define the measurements in (21). One possibility to overcome this problem is to consider an embedding in a suitable Hilbert space. The first step in this direction is to consider an embedding of the probability space P(R) in a (real separable) Hilbert space H. Interestingly, this can be achieved considering a variety of reproducing kernels over probability distributions, as we describe in Appendix B. Here we note that if Φ : P(R)→ H is one such embeddings, then we could consider a corresponding embedding of P(R)G×T in the space\nL2(G × T ,H) = {h : G × T → H | ∫ ‖h(g, t)‖2 dgdu(t)}\nwhere ‖·‖H is the norm induced by the inner product 〈·, ·〉H in H and u is the uniform measure on the sphere S ⊂ I. The space L2(G×T ,H) is endowed with the inner product\n〈h, h′〉H = ∫ 〈h(g, t), h′(g, t)〉2H dgdu(t),\nfor all h, h′ ∈ L2(G × T ,H), so that the corresponding norm is exactly ‖h‖2H = ∫ ‖h(g, t)‖2 dgdu(t).\nThe embedding of P(R)G×T in L2(G × T ,H) is simply given by\nJΦ : P(R)G×T → L2(G × T ,H), JΦ(ρ)(g, t) = Φ(ρ(g, t)) i.e.\nfor all ρ ∈ P(R)G×T . Provided with above notation we have the following result.\nTheorem 10. The representation defined by\nQ̄ : I → L2(G × T ,H), Q̄ = JΦ ◦ Ψ̄. (22)\nwith Ψ̄ as in Definition 10, is covariant, in the sense that,\nQ̄(gI) = gQ̄(I)\nfor all I ∈ I, g ∈ G.\nProof. The proof follows checking that by definition both R̄ and JΦ are covariant and using Theorem 8. The fact that R̄ is covariant was proven in Th. 9. The covariance of JΦ, i.e. g̃JΦ(h)(g, t) = JΦ(h)(g̃g, t) for all h ∈ P(R)G×T , follows from\nJΦ(g̃h)(g, t) = Φ(g̃h(g, t)) = Φ(h(g̃g, t)) = JΦ(h)(g̃g, t).\nNow since P̄ was already proven covariant in Th. 8 we have that, being Q̄ = JΦ ◦ R̄ ◦ P̄ composition of covariant representations, Q̄ is covariant i.e. g̃Q̄(I) = Q̄(g̃I).\nUsing the above definitions a second layer invariant measurement can be defined considering,\nv : I → R, v(I) = ∫ G0 η( 〈 Q̄(x), gτ 〉 2 )dg (23)\nwhere τ ∈ L2(G × T ,H) has unit norm. We add several comments. First, following the analysis in the previous sections Equation (23) can be used to define invariant (or locally invariant) measurements and hence representations defined by collections of measurements. Second, the construction can be further iterated to consider multi-layer representations, where at each layer an intermediate representation is obtained considering ”distributions of distributions”. Third, considering multiple layers naturally begs the question of how the number and properties of each layer affect the properties of the representation. Preliminary answers to these questions are described in [3, 4, 21, 23]. A full mathematical treatment is beyond the scope of the current paper which however provides a formal framework to tackle them in future work."
    }, {
      "heading" : "7 Discussion",
      "text" : "Motivated by the goal of characterizing good data representation that can be learned, this paper studies the mathematics of an approach to learn data representation that are invariant and selective to suitable transformations. While invariance can be proved rather directly from the invariance of the Haar measure associated with the group, characterizing selectivity requires a novel probabilistic argument developed in the previous sections.\nSeveral extensions of the theory are natural and have been sketched with preliminary results in [3, 4, 21, 23]. The main directions that need a rigorous theory extending the results of this paper are:\n• Hierarchical architectures. We described how the theory can be used to analyze local invariance properties, in particular for locally compact groups. We described covariance properties. Covariant layers can integrate representations that are locally invariant into representations that are more globally invariant.\n• Approximate invariance for transformations that are not groups. The same basic algorithm analyzed in this paper is used to yield approximate invariance, provided the templates transforms as the image, which requires the templates to be tuned to specific object classes.\nWe conclude with a few general remarks connecting our paper with this special issue on deep learning and especially with an eventual theory of such networks. Hierarchical architectures of simple and complex units. Feedforward architecture with n layers, consisting of dot products and nonlinear pooling functions, are quite general computing devices, basically equivalent to Turing machines running for n time points (for example the layers of the HMAX architecture in [26] can be described as AND operations (dot products) followed by OR operations (pooling), i.e. as disjunctions of conjunctions.). Given a very large set of labeled examples it is not too surprising that greedy algorithms such as stochastic gradient descent can find satisfactory parameters in such an architecture, as shown by the recent successes of Deep Convolutional Networks. Supervised learning with millions of examples, however, is not, in general, biologically plausible. Our theory can be seen as proving that a form of unsupervised learning in convolutional architectures is possible and effective, because it provides invariant representations with small sample complexity. Two stages: group and non-group transformations. The core of the theory applies to compact groups such as rotations of the image in the image plane. Exact invariance for each module is equivalent to a localization condition which could be interpreted as a form of sparsity [3]. If the condition is relaxed to hold approximately it becomes a sparsity condition for the class of images w.r.t. the dictionary tk under the group G when restricted to a subclass of similar images. This property, which is similar to compressive sensing “incoherence” (but in a group context), requires that I and tk have a representation with rather sharply peaked autocorrelation (and correlation) and guarantees approximate invariance for transformations which do not have group structure, see [21]. Robustness of pooling. It is interesting that the theory is robust with respect to the pooling nonlinearity. Indeed, as discussed, very general class of nonlinearities will work, see Appendix A. Any nonlinearity will provide invariance, if the nonlinearity does not change with time and is the same for all the simple cells pooled by the same complex cells. A sufficient number of different nonlinearities, each corresponding to a complex cell, can provide selectivity [3]. Biological predictions and biophysics, including dimensionality reduction and\nPCAs. There are at least two possible biophysical models for the theory. The first is the original Hubel and Wiesel model of simple cells feeding into a complex cell. The theory proposes the ”ideal” computation of a CDF, in which case the nonlinearity at the output of the simple cells is a threshold. A complex cell, summating the outputs of a set of simple cells, would then represent a bin of the histogram; a different complex cell in the same position pooling a set of similar simple cells with a different threshold would represent another bin of the histogram. The second biophysical model for the HW module that implements the computation required by i-theory consists of a single cell where dendritic branches play the role of simple cells (each branch containing a set of synapses with weights providing, for instance, Gabor-like tuning of the dendritic branch) with inputs from the LGN; active properties of the dendritic membrane distal to the soma provide separate threshold-like nonlinearities for each branch separately, while the soma summates the contributions for all the branches. This model would solve the puzzle that so far there seems to be no morphological difference between pyramidal cells classified as simple vs complex by physiologists. Further if the synapses are Hebbian it can be proved that Hebb’s rule, appropriately modified with a normalization factor, is an online algorithm to compute the eigenvectors of the input covariance matrix, therefore tuning the dendritic branches weights to principal components and thus providing an efficient dimensionality reduction. (n→ 1).The present phase of Machine Learning is characterized by supervised learning algorithms relying on large sets of labeled examples (n→∞). The next phase is likely to focus on algorithms capable of learning from very few labeled examples (n→ 1), like humans seem able to do. We propose and analyze a possible approach to this problem based on the unsupervised, automatic learning of a good representation for supervised learning, characterized by small sample complexity (n). In this view we take a step towards a major challenge in learning theory beyond the supervised learning, that is the problem of representation learning, formulated here as the unsupervised learning of invariant representations that significantly reduce the sample complexity of the supervised learning stage."
    }, {
      "heading" : "Acknowledgment",
      "text" : "We would like to thank the McGovern Institute for Brain Research for their support. This research was sponsored by grants from the National Science Foundation, AFSOR-THRL (FA8650-05-C-7262). Additional support was provided by the Eugene McDermott Foundation."
    }, {
      "heading" : "A Representation Via Moments",
      "text" : "In Section 4.2.2 we have discussed the derivation of invariant selective representation considering the CDFs of suitable one dimensional probability distributions. As we commented in Remark 4 alternative representations are possible, for example by considering moments. Here we discuss this point of view in some more detail.\nRecall that if ξ : (Ω, p)→ R is a random variables with law q ∈ P(R), then the associated moment vector is given is given by\nmrq = E|ξ|r = ∫ dq|ξ|r, r ∈ N. (24)\nIn this case we have the following definitions and results.\nDefinition 12 (Moments Vector Map). Let M(R) = {h | h : N→ R}, and\nM(R)T = {h | h : T →M(R)}.\nDefine M : P(R)T →M(R)T , M(µ)(t) = mµt\nfor µ ∈ P(R) and where we let µ(t) = µt, for all t ∈ T .\nThe above mapping associates to each one dimensional distribution the corresponding vector of moments. Recall that this association uniquely determines the probability distribution if the so called Carleman’s condition is satisfied:\n∞∑ r=1 m − 12r 2r = +∞\nwhere mr is the set of moments of the distribution. We can then define the following representation.\nDefinition 13 (Moments Representation). Let\nµ : I →M(R)T , µ = M ◦R ◦ P,\nwith M ,P and R as in Definitions 12, 4, 5, respectively.\nThen, the following result holds.\nTheorem 11. For all I ∈ I and t ∈ T\nµt(I)(r) = ∫ dg| 〈I, gt〉 |r, r ∈ N,\nwhere we let µ(I)(t) = µt(I). Moreover, for all I, I ′ ∈ I\nI ∼ I ′ ⇔ µ(I) = µ(I ′).\nProof. µ = M ◦R◦P is a composition of a one to one map R, a map P that is one to one w.r.t. the equivalence classes induced by the group of transformations G and a map M that is one to one since Carleman’s condition is satisfied. Indeed, we have,\n∞∑ r=1 (∫ dg 〈I, gt〉2r )− 12r ≤ ∞∑ r=1 (∫ dg| 〈I, gt〉 | )− 12r 2r = ∞∑ r=1 1 C = +∞\nwhere C = ∫\ndg| 〈I, gt〉 |. Therefore µ is one to one w.r.t. the equivalence classes i.e. I ∼ I ′ ⇔ µ(I) = µ(I ′).\nWe add one remark regarding possible developments of the above result.\nRemark 7. Note that the above result essentially depends on the characterization of the moment problem of probability distributions on the real line. In this view, it could be further developed to consider for example the truncated case when only a finite number of moments is considered or the generalized moments problem, where families of (nonlinear) continuous functions, more general than powers, are considered (see e.g. [1])."
    }, {
      "heading" : "B Kernels on probability distributions",
      "text" : "To consider multi-layers within the framework proposed in the paper we need to embed probability spaces in Hilbert spaces. A natural way to do so is by considering appropriate positive definite (PD) kernels, that is symmetric functions K : X ×X → R such that\nn∑ i,j=1 K(ρi, ρj)αiαj ≥ 0\nfor all ∀ρ1, . . . , ρn ∈ X,α1, . . . , αn ∈ R and where X is any set, e.g. X = R or X = P(R). Indeed, PD kernels are known to define a unique reproducing kernel Hilbert space (RKHS) HK for which they correspond to reproducing kernels, in the sense that if HK is the RKHS defined by K, then Kx = K(x, ·) ∈ HK for all x ∈ X and\n〈f,Kx〉K = f(x), ∀f ∈ HK , x ∈ X, (25)\nwhere 〈·, ·〉K is the inner product in HK (see for example [7] for an introduction to RKHS). Many examples of kernels on distributions are known and have been studied. For example [13, 32] discuss a variety of kernels of the form\nK(ρ, ρ′) = ∫ ∫ dγ(x)κ(pρ(x), pρ′(x))\nwhere pρ, pρ′ are the densities of the measures ρ, ρ ′ with respect to a dominating measure γ (which is assumed to exist) and κ : R+0 ×R + 0 → R is a PD kernel. Recalling that a PD kernel defines a pseudo-metric via the equation\ndK(ρ, ρ ′)2 = K(ρ, ρ) +K(ρ′, ρ)− 2K(ρ, ρ′).\nit is shown in [13, 32] how different classic metric on probability distributions can be recovered by suitable choices of the kernel κ. For example,\nκ(x, x′) = √ xx′,\ncorresponds to the Hellinger’s distance, see [13, 32] for other examples. A different approach is based on defining kernels of the form\nK(ρ, ρ′) = ∫ ∫ dρ(x)dρ′(x′)k(x, x′), (26)\nwhere k : R×R → R is a PD kernel. Using the reproducing property of k we can write\nK(ρ, ρ′) = 〈∫ dρ(x′)kx, ∫ dρ(x)kx′ 〉 k = 〈Φ(ρ),Φ(ρ′)〉\nwhere Φ : P(R)→ H is the embedding Φ(x) = ∫ dρ(x′)kx mapping each distribution in a corresponding kernel mean, see e.g. [7]. Condition on the kernel k, hence on K, ensuring that the corresponding function dK is a metric have been studied in detail, see e.g. [29]."
    } ],
    "references" : [ {
      "title" : "The classical moment problem: and some related questions in analysis, University mathematical monographs",
      "author" : [ "N. Akhiezer" ],
      "venue" : null,
      "citeRegEx" : "1",
      "shortCiteRegEx" : "1",
      "year" : 1965
    }, {
      "title" : "Efficient Sketches for Earth-Mover Distance, with Applications",
      "author" : [ "A. Andoni", "K.D. Ba", "P. Indyk", "D.P. Woodruff" ],
      "venue" : "in FOCS,",
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 2009
    }, {
      "title" : "Unsupervised Learning of Invariant Representations in Hierarchical Architectures. arXiv preprint 1311.4158",
      "author" : [ "F. Anselmi", "J.Z. Leibo", "L. Rosasco", "J. Mutch", "A. Tacchetti", "T. Poggio" ],
      "venue" : null,
      "citeRegEx" : "3",
      "shortCiteRegEx" : "3",
      "year" : 2013
    }, {
      "title" : "Representation Learning in Sensory Cortex: a theory. CBMM memo n 26",
      "author" : [ "F. Anselmi", "T. Poggio" ],
      "venue" : null,
      "citeRegEx" : "4",
      "shortCiteRegEx" : "4",
      "year" : 2010
    }, {
      "title" : "Magic Materials: a theory of deep hierarchical architectures for learning sensory representations",
      "author" : [ "T.T.A. P" ],
      "venue" : "CBCL paper",
      "citeRegEx" : "5",
      "shortCiteRegEx" : "5",
      "year" : 2013
    }, {
      "title" : "Learning Deep Architectures for AI",
      "author" : [ "Y. Bengio" ],
      "venue" : "Foundations and Trends in Machine Learning",
      "citeRegEx" : "6",
      "shortCiteRegEx" : "6",
      "year" : 2009
    }, {
      "title" : "Reproducing kernel Hilbert spaces in probability and statistics",
      "author" : [ "A. Berlinet", "C. Thomas-Agnan" ],
      "venue" : null,
      "citeRegEx" : "7",
      "shortCiteRegEx" : "7",
      "year" : 2004
    }, {
      "title" : "Some theorems on distribution functions",
      "author" : [ "H. Cramer", "H. Wold" ],
      "venue" : "J. London Math. Soc.,",
      "citeRegEx" : "8",
      "shortCiteRegEx" : "8",
      "year" : 1936
    }, {
      "title" : "On the mathematical foundations of learning",
      "author" : [ "F. Cucker", "S. Smale" ],
      "venue" : "Bulletin of the American Mathematical Society,",
      "citeRegEx" : "9",
      "shortCiteRegEx" : "9",
      "year" : 2002
    }, {
      "title" : "Computational Topology, An Introduction",
      "author" : [ "H. Edelsbrunner", "J.L. Harer" ],
      "venue" : null,
      "citeRegEx" : "10",
      "shortCiteRegEx" : "10",
      "year" : 2010
    }, {
      "title" : "Neocognitron: A self-organizing neural network model for a mechanism of pattern recognition unaffected by shift in position",
      "author" : [ "K. Fukushima" ],
      "venue" : "Biological Cybernetics,",
      "citeRegEx" : "11",
      "shortCiteRegEx" : "11",
      "year" : 1980
    }, {
      "title" : "Invariant Kernel Functions for Pattern Analysis and Machine Learning",
      "author" : [ "B. Haasdonk", "H. Burkhardt" ],
      "venue" : "Mach. Learn.,",
      "citeRegEx" : "12",
      "shortCiteRegEx" : "12",
      "year" : 2007
    }, {
      "title" : "Hilbertian Metrics and Positive Definite Kernels on Probability Measures",
      "author" : [ "M. Hein", "O. Bousquet" ],
      "venue" : "AISTATS",
      "citeRegEx" : "13",
      "shortCiteRegEx" : "13",
      "year" : 2005
    }, {
      "title" : "Receptive fields, binocular interaction and functional architecture in the cat’s visual cortex",
      "author" : [ "D. Hubel", "T. Wiesel" ],
      "venue" : "The Journal of Physiology,",
      "citeRegEx" : "14",
      "shortCiteRegEx" : "14",
      "year" : 1962
    }, {
      "title" : "Receptive fields and functional architecture in two nonstriate visual areas (18 and 19) of the cat",
      "author" : [ "D. Hubel", "T. Wiesel" ],
      "venue" : "Journal of Neurophysiology,",
      "citeRegEx" : "15",
      "shortCiteRegEx" : "15",
      "year" : 1965
    }, {
      "title" : "Receptive fields and functional architecture of monkey striate cortex",
      "author" : [ "D. Hubel", "T. Wiesel" ],
      "venue" : "The Journal of Physiology,",
      "citeRegEx" : "16",
      "shortCiteRegEx" : "16",
      "year" : 1968
    }, {
      "title" : "Support Theorems for the Radon Transform and Cramr-Wold Theorems",
      "author" : [ "F.L. Jan Boman" ],
      "venue" : "Journal of Theoretical Probability,",
      "citeRegEx" : "17",
      "shortCiteRegEx" : "17",
      "year" : 2009
    }, {
      "title" : "Extensions of Lipschitz mappings into a Hilbert space",
      "author" : [ "Johnson", "J.W.B. Lindenstrauss" ],
      "venue" : "Contemporary Mathematics,",
      "citeRegEx" : "18",
      "shortCiteRegEx" : "18",
      "year" : 1984
    }, {
      "title" : "Rotation Invariant Spherical Harmonic Representation of 3D Shape Descriptors",
      "author" : [ "M. Kazhdan", "T. Funkhouser", "S. Rusinkiewicz" ],
      "venue" : "Proceedings of the 2003 Eurographics/ACM SIGGRAPH Symposium on Geometry Processing,",
      "citeRegEx" : "19",
      "shortCiteRegEx" : "19",
      "year" : 2003
    }, {
      "title" : "Convolutional networks for images, speech, and time series",
      "author" : [ "Y. LeCun", "Y. Bengio" ],
      "venue" : "The handbook of brain theory and neural networks,",
      "citeRegEx" : "20",
      "shortCiteRegEx" : "20",
      "year" : 1995
    }, {
      "title" : "The invariance hypothesis implies domain-specific regions in visual cortex. http://dx.doi.org/10.1101/004473",
      "author" : [ "J.Z. Leibo", "Q. Liao", "F. Anselmi", "T. Poggio" ],
      "venue" : null,
      "citeRegEx" : "21",
      "shortCiteRegEx" : "21",
      "year" : 2014
    }, {
      "title" : "Group Invariant Scattering",
      "author" : [ "S. Mallat" ],
      "venue" : "Communications on Pure and Applied Mathematics,",
      "citeRegEx" : "22",
      "shortCiteRegEx" : "22",
      "year" : 2012
    }, {
      "title" : "Does invariant recognition predict tuning of neurons in sensory cortex?. MIT-CSAIL-TR-2013-019, CBCL-313",
      "author" : [ "T. Poggio", "J. Mutch", "F. Anselmi", "A. Tacchetti", "L. Rosasco", "J.Z. Leibo" ],
      "venue" : null,
      "citeRegEx" : "23",
      "shortCiteRegEx" : "23",
      "year" : 2013
    }, {
      "title" : "On the theory of reproducing kernel hilbert spaces",
      "author" : [ "A.G. Ramm" ],
      "venue" : null,
      "citeRegEx" : "24",
      "shortCiteRegEx" : "24",
      "year" : 1998
    }, {
      "title" : "Methods of modern mathematical physics. II. , Fourier Analysis, Self-Adjointness",
      "author" : [ "M. Reed", "B. Simon" ],
      "venue" : null,
      "citeRegEx" : "25",
      "shortCiteRegEx" : "25",
      "year" : 1978
    }, {
      "title" : "Hierarchical models of object recognition in cortex",
      "author" : [ "M. Riesenhuber", "T. Poggio" ],
      "venue" : "Nature Neuroscience,",
      "citeRegEx" : "26",
      "shortCiteRegEx" : "26",
      "year" : 1999
    }, {
      "title" : "OverFeat: Integrated Recognition, Localization and Detection using Convolutional Networks",
      "author" : [ "P. Sermanet", "D. Eigen", "X. Zhang", "M. Mathieu", "R. Fergus", "Y. LeCun" ],
      "venue" : "in International Conference on Learning Representations (ICLR2014). CBLS",
      "citeRegEx" : "27",
      "shortCiteRegEx" : "27",
      "year" : 2014
    }, {
      "title" : "Actionable information in vision",
      "author" : [ "S. Soatto" ],
      "venue" : "Computer Vision,",
      "citeRegEx" : "28",
      "shortCiteRegEx" : "28",
      "year" : 2009
    }, {
      "title" : "Dictionary learning: What is the right representation for my signal",
      "author" : [ "I. Tosic", "P. Frossard" ],
      "venue" : "IEEE Signal Processing Magazine,",
      "citeRegEx" : "30",
      "shortCiteRegEx" : "30",
      "year" : 2011
    }, {
      "title" : "Estimation of dependencies based on empirical data",
      "author" : [ "V. Vapnik" ],
      "venue" : null,
      "citeRegEx" : "31",
      "shortCiteRegEx" : "31",
      "year" : 1982
    }, {
      "title" : "Efficient Additive Kernels via Explicit Feature Maps",
      "author" : [ "A. Vedaldi", "A. Zisserman" ],
      "venue" : "Pattern Analysis and Machine Intellingence,",
      "citeRegEx" : "32",
      "shortCiteRegEx" : "32",
      "year" : 2011
    } ],
    "referenceMentions" : [ {
      "referenceID" : 2,
      "context" : "[3, 4, 5].",
      "startOffset" : 0,
      "endOffset" : 9
    }, {
      "referenceID" : 3,
      "context" : "[3, 4, 5].",
      "startOffset" : 0,
      "endOffset" : 9
    }, {
      "referenceID" : 4,
      "context" : "[3, 4, 5].",
      "startOffset" : 0,
      "endOffset" : 9
    }, {
      "referenceID" : 4,
      "context" : "Our work is motivated by a theory of cortex and in particular visual cortex [5].",
      "startOffset" : 76,
      "endOffset" : 79
    }, {
      "referenceID" : 28,
      "context" : "Examples in this class of methods include so called dictionary learning [30], autoencoders [6] and metric learning techniques (see e.",
      "startOffset" : 72,
      "endOffset" : 76
    }, {
      "referenceID" : 5,
      "context" : "Examples in this class of methods include so called dictionary learning [30], autoencoders [6] and metric learning techniques (see e.",
      "startOffset" : 91,
      "endOffset" : 94
    }, {
      "referenceID" : 18,
      "context" : "For example in the analysis of shapes [19] and more generally in computational topology [10], or in the design of positive definite functions associated to reproducing kernel Hilbert spaces [12].",
      "startOffset" : 38,
      "endOffset" : 42
    }, {
      "referenceID" : 9,
      "context" : "For example in the analysis of shapes [19] and more generally in computational topology [10], or in the design of positive definite functions associated to reproducing kernel Hilbert spaces [12].",
      "startOffset" : 88,
      "endOffset" : 92
    }, {
      "referenceID" : 11,
      "context" : "For example in the analysis of shapes [19] and more generally in computational topology [10], or in the design of positive definite functions associated to reproducing kernel Hilbert spaces [12].",
      "startOffset" : 190,
      "endOffset" : 194
    }, {
      "referenceID" : 21,
      "context" : "The ideas in [22, 28] are close in spirit to the study in this paper.",
      "startOffset" : 13,
      "endOffset" : 21
    }, {
      "referenceID" : 27,
      "context" : "The ideas in [22, 28] are close in spirit to the study in this paper.",
      "startOffset" : 13,
      "endOffset" : 21
    }, {
      "referenceID" : 21,
      "context" : "In particular, the results in [22] develop a different invariant and stable representation within a signal processing framework.",
      "startOffset" : 30,
      "endOffset" : 34
    }, {
      "referenceID" : 27,
      "context" : "In [28] an information theoretic perspective is considered to formalize the problem of learning invariant/selective representations.",
      "startOffset" : 3,
      "endOffset" : 7
    }, {
      "referenceID" : 14,
      "context" : "In this work we develop a machine learning perspective closely following computational neuroscience models of the information processing in the visual cortex [15, 16, 26].",
      "startOffset" : 158,
      "endOffset" : 170
    }, {
      "referenceID" : 15,
      "context" : "In this work we develop a machine learning perspective closely following computational neuroscience models of the information processing in the visual cortex [15, 16, 26].",
      "startOffset" : 158,
      "endOffset" : 170
    }, {
      "referenceID" : 25,
      "context" : "In this work we develop a machine learning perspective closely following computational neuroscience models of the information processing in the visual cortex [15, 16, 26].",
      "startOffset" : 158,
      "endOffset" : 170
    }, {
      "referenceID" : 24,
      "context" : "Throughout the article we assume the group representation to be unitary [25].",
      "startOffset" : 72,
      "endOffset" : 76
    }, {
      "referenceID" : 21,
      "context" : "noise (see [22]).",
      "startOffset" : 11,
      "endOffset" : 15
    }, {
      "referenceID" : 23,
      "context" : "The requirements of 1) being a Hilbert space of of functions and 2) have continuous evaluation functionals, define so called reproducing kernel Hilbert spaces [24].",
      "startOffset" : 159,
      "endOffset" : 163
    }, {
      "referenceID" : 0,
      "context" : "A hypothesis space H is said to be learnable if, for all ∈ [0,∞), δ ∈ [0, 1], there exists n( , δ,H) ∈ N such that inf fn sup ρ P ( E(fn)− inf f∈H E(f) ≥ ) ≤ δ.",
      "startOffset" : 70,
      "endOffset" : 76
    }, {
      "referenceID" : 29,
      "context" : "The sample complexity can be shown [31, 9] to be proportional to the logarithm of the covering number, i.",
      "startOffset" : 35,
      "endOffset" : 42
    }, {
      "referenceID" : 8,
      "context" : "The sample complexity can be shown [31, 9] to be proportional to the logarithm of the covering number, i.",
      "startOffset" : 35,
      "endOffset" : 42
    }, {
      "referenceID" : 3,
      "context" : "As discussed in [4], the main motivation for considering measurements of the above form is their interpretation in terms of biological or artificial neural networks, see the following remarks.",
      "startOffset" : 16,
      "endOffset" : 19
    }, {
      "referenceID" : 13,
      "context" : "Remark 2 (Hubel and Wiesel Simple and Complex Cells [14]).",
      "startOffset" : 52,
      "endOffset" : 56
    }, {
      "referenceID" : 19,
      "context" : "Remark 3 (Convolutional Neural Networks [20]).",
      "startOffset" : 40,
      "endOffset" : 44
    }, {
      "referenceID" : 16,
      "context" : "Interestingly, R can be shown to be a generalization of the Radon Transform to probability distributions [17].",
      "startOffset" : 105,
      "endOffset" : 109
    }, {
      "referenceID" : 7,
      "context" : "Theorem 4 (Cramer-Wold [8]).",
      "startOffset" : 23,
      "endOffset" : 26
    }, {
      "referenceID" : 0,
      "context" : "Let F(R) = {h | h : R→ [0, 1]}, and F(R)T = {h | h : T → F(R)}.",
      "startOffset" : 23,
      "endOffset" : 29
    }, {
      "referenceID" : 0,
      "context" : "and takes values in [0, 1].",
      "startOffset" : 20,
      "endOffset" : 26
    }, {
      "referenceID" : 0,
      "context" : "Define the real random variable Z : S → [0, 1], Z(ti) = d∞(μ i(I), μi(I ′)), i = 1, .",
      "startOffset" : 40,
      "endOffset" : 46
    }, {
      "referenceID" : 17,
      "context" : "Finally, we note that, when compared to classical results on distance preserving embedding, such as Johnson Linderstrauss Lemma [18], Theorem 12 only ensures distance preservation up to a given accuracy which increases with a larger number of projections.",
      "startOffset" : 128,
      "endOffset" : 132
    }, {
      "referenceID" : 1,
      "context" : "This is hardly surprising, since the problem of finding suitable embedding for probability spaces is known to be considerably harder than the analogue problem for vector spaces [2].",
      "startOffset" : 177,
      "endOffset" : 180
    }, {
      "referenceID" : 2,
      "context" : "Regarding the localization condition discussed above, as we comment elsewhere [3], the fact that a template needs to be localized could have implications from a biological modeling standpoint.",
      "startOffset" : 78,
      "endOffset" : 81
    }, {
      "referenceID" : 22,
      "context" : "More precisely, it could provides a theoretical foundation of the Gabor like shape of the responses observed in V1 cells in the visual cortex [23, 3, 5].",
      "startOffset" : 142,
      "endOffset" : 152
    }, {
      "referenceID" : 2,
      "context" : "More precisely, it could provides a theoretical foundation of the Gabor like shape of the responses observed in V1 cells in the visual cortex [23, 3, 5].",
      "startOffset" : 142,
      "endOffset" : 152
    }, {
      "referenceID" : 4,
      "context" : "More precisely, it could provides a theoretical foundation of the Gabor like shape of the responses observed in V1 cells in the visual cortex [23, 3, 5].",
      "startOffset" : 142,
      "endOffset" : 152
    }, {
      "referenceID" : 10,
      "context" : "Hierarchical representations, based on multiple layers of computations, have naturally arisen from models of information processing in the brain [11, 26].",
      "startOffset" : 145,
      "endOffset" : 153
    }, {
      "referenceID" : 25,
      "context" : "Hierarchical representations, based on multiple layers of computations, have naturally arisen from models of information processing in the brain [11, 26].",
      "startOffset" : 145,
      "endOffset" : 153
    }, {
      "referenceID" : 26,
      "context" : "[27].",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 2,
      "context" : "Preliminary answers to these questions are described in [3, 4, 21, 23].",
      "startOffset" : 56,
      "endOffset" : 70
    }, {
      "referenceID" : 3,
      "context" : "Preliminary answers to these questions are described in [3, 4, 21, 23].",
      "startOffset" : 56,
      "endOffset" : 70
    }, {
      "referenceID" : 20,
      "context" : "Preliminary answers to these questions are described in [3, 4, 21, 23].",
      "startOffset" : 56,
      "endOffset" : 70
    }, {
      "referenceID" : 22,
      "context" : "Preliminary answers to these questions are described in [3, 4, 21, 23].",
      "startOffset" : 56,
      "endOffset" : 70
    }, {
      "referenceID" : 2,
      "context" : "Several extensions of the theory are natural and have been sketched with preliminary results in [3, 4, 21, 23].",
      "startOffset" : 96,
      "endOffset" : 110
    }, {
      "referenceID" : 3,
      "context" : "Several extensions of the theory are natural and have been sketched with preliminary results in [3, 4, 21, 23].",
      "startOffset" : 96,
      "endOffset" : 110
    }, {
      "referenceID" : 20,
      "context" : "Several extensions of the theory are natural and have been sketched with preliminary results in [3, 4, 21, 23].",
      "startOffset" : 96,
      "endOffset" : 110
    }, {
      "referenceID" : 22,
      "context" : "Several extensions of the theory are natural and have been sketched with preliminary results in [3, 4, 21, 23].",
      "startOffset" : 96,
      "endOffset" : 110
    }, {
      "referenceID" : 25,
      "context" : "Feedforward architecture with n layers, consisting of dot products and nonlinear pooling functions, are quite general computing devices, basically equivalent to Turing machines running for n time points (for example the layers of the HMAX architecture in [26] can be described as AND operations (dot products) followed by OR operations (pooling), i.",
      "startOffset" : 255,
      "endOffset" : 259
    }, {
      "referenceID" : 2,
      "context" : "Exact invariance for each module is equivalent to a localization condition which could be interpreted as a form of sparsity [3].",
      "startOffset" : 124,
      "endOffset" : 127
    }, {
      "referenceID" : 20,
      "context" : "This property, which is similar to compressive sensing “incoherence” (but in a group context), requires that I and t have a representation with rather sharply peaked autocorrelation (and correlation) and guarantees approximate invariance for transformations which do not have group structure, see [21].",
      "startOffset" : 297,
      "endOffset" : 301
    }, {
      "referenceID" : 2,
      "context" : "A sufficient number of different nonlinearities, each corresponding to a complex cell, can provide selectivity [3].",
      "startOffset" : 111,
      "endOffset" : 114
    } ],
    "year" : 2015,
    "abstractText" : "We discuss data representation which can be learned automatically from data, are invariant to transformations, and at the same time selective, in the sense that two points have the same representation only if they are one the transformation of the other. The mathematical results here sharpen some of the key claims of i-theory – a recent theory of feedforward processing in sensory cortex. [3, 4, 5].",
    "creator" : "LaTeX with hyperref package"
  }
}