{
  "name" : "1506.05849.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "An Iterative Convolutional Neural Network Algorithm Improves Electron Microscopy Image Segmentation",
    "authors" : [ ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "To further expand our understanding on the structure and working mechanisms of the human brain, it has been deemed necessary to map the entire neural connections of the nervous system at the micro-scale level. One main approach is to acquire serial 2-D images of brain tissue at nanometric resolution with serial-section Transmitted Electron Microscopy (ssTEM). To generate a connection map in 3-D, an expert is then needed to manually analyze those 2-D images to segment different neural tissues in the image [6;7;21]. This task is only realistic if the volume of images that needs to be processed is reasonably small. However, that usually is not the case. For example, a typical image set of the V1 area of a mouse brain with resolution of 4×4×45 nm produces 12TB of data[5]. Processing this amount of data manually becomes quite impractical.\nMuch effort has been put to develop tools to automatically process those images. Previous approaches [8;14;16] use the contextual information surrounding a pixel to give a probability value to distinguish the cell membrane. Applying those detectors to every pixel of an original EM image leads to a pixel wise MDPM.\nPost-processing on top of these detection maps is necessary in order to obtain the final region segmentation results. The post-processing can be simple, for example, simple thresholding, or creating a smooth probability map by using a median filter [8]. Other more graphical models based on region merge/clustering techniques such as superpixel [10] and watershed merge [18;19]have also been applied on this or similar tasks to refine segmentation on top of a detection map.\nIn this work, we introduce a new algorithm without resorting to any kind of graphical model based region merge/clustering algorithms. Simply by training a Convolutional Neural Network (I-CNN) to recover the masked out center pixel value of patches sampled from MDPM, and then iteratively applying this network over MDPM, one can obtain a high quality segmentation map both visually and measured by the foreground-restrict Rand score [1;13]. The algorithm significantly improves the foreground-restrict Rand score over the original MDPM map and achieves a similar level of performance to the current leading algorithms on ISBI 2012 EM segmentation challenge dataset.\n2 Related works\nComputer vision research on real world image contour detection and segmentation tasks has come up with many solutions to ensure the consistency of image segmentation. A good number of them use some kind of over-segmentation to obtain super-pixel like presegmentation [3;10]. This process is then followed by graphical models to merge sub-regions and reach a final segmentation map. Models such as tree merge, Conditional Random Fields (CRFs), Markov Random Fields (MRFs) or graph cuts algorithm have been used for this purpose [10;12;17;22].\nFor the EM image segmentation task, the detection of membrane resembles the contour detection problem in general computer vision. The quality of membrane detection can be directly measured by the pixels error, but just like in contour detection, a high quality membrane detection does not guarantee a good segmentation [4]. A small gap in the contour formed by the detected membrane can lead to an incorrect merge of two different regions. Or a false section of membrane can incorrectly split one region into two parts. This is especially important for neural circuit reconstruction, as one need to identify every neurite to re-link them in 3-D. The quality of the segmentation can be measured by the Rand index[13], which measures the resemblance of two clusters of segmentations. Specifically, the ISBI 2012 EM segmentation challenge dataset uses the fore-ground restrict Rand error index as one leading index to score different algorithms [1].\nIn a typical MDPM such as the one from Ciresan’s work [8] the detection probability of every pixel is made in isolation, which increases the possibility of having gaps in the boundaries. In Ciresan’s work they used a simple median filter of small radius to smooth out the detection map. This procedure gained them a state-of-the-art level of result back in 2012. However, the limitation of applying a median filter is its isotropy; that is, if one applies a median filter of increasing radius to the MDPM the performance will quickly deteriorate as the radius becomes larger. Therefore, an algorithm that can not only take long range information into consideration to smooth out the map but that it is also able to avoid isotropy smoothing was needed. To avoid this limitation, we have developed an Iterative Convolutional Neural Network (ICNN) that significantly improves the definition of boundaries.\nLike in natural image segmentation, several authors have proposed a graphical model algorithm to merge regions starting from MDPM. For example Andres and later Liu [2;19] trained a classifier which merges over-segmented regions generated from water-shed over segmentation. Funke et al. [11] used a tree structure for segmentation hypothesis and reach segmentation with MAP inference in a CRF. Unlike their work, we did not train for the target to reduce segmentation error. What our network does is to simply enforce constraints to push MDPM toward the manifold of the membrane structure distribution that it learned through recovering missing information. While this new algorithm did not rank at first place on the Rand error score, it performs significantly better than all top leading groups on the other two scores.\nOur approach is also related to the image super resolution convolutional neural network [9] where a convolutional neural network is trained to restore high resolution from low resolution images, and to de-noise network [15] where the purpose is to restore a noisy image. If we only think about a single iteration, we use a similar convolutional neural network architecture to those two networks, where their training targets can all be thought of as to recover original pixel values from distorted images either caused by noise or blurring. Our network is different in that it applies multiple iterations instead of only modifying a single pixel in isolation. Multiple iterations give our method the power to turn on/off a whole section of membrane (see Figure 2) resulting in a great improvement in boundary consistency."
    }, {
      "heading" : "3 System description and result",
      "text" : ""
    }, {
      "heading" : "3 .1 Da ta se t descr ip t io n",
      "text" : "The dataset used in this experiment consists of two stacks of EM images used in the ISBI 2012 EM segmentation challenge. One stack has 30 EM images and their corresponding labels for training. The other stack also contain 30 images, their labels are concealed."
    }, {
      "heading" : "3 .2 B a se co nv o lut io na l ne tw o rk t ra in ing",
      "text" : "The network used in this part is analogous to the convolutional network implemented by Ciresan [8]. However, it can be replaced by any other algorithm that generates a high quality membrane detection probability map. To differentiate the two networks, we call this base network CNN and the Iteration Convolutional Neural Network I-CNN from here on. As in the work of Ciresan [8], CNN is trained to yield the probability of whether the pixel at the center of a given image patch (65x65 size) is a membrane pixel. The difference is that our network has 4 convolutional layers, one fully connected layer and one softmax layer. Rectified linear activation functions are used in the network except in the last layer, where a softmax function is used. Also, similar to the work of Ciresan[8], we augment the dataset by rotation, flipping and mirroring images in a total of 8 different transformations. One example is shown in the original probability map image of Figure 1. A detailed network architecture and hyper parameter settings will be made available in the code that will be released with the final version of the paper.\nThe darkest pixel value means that the probability of being membrane is 1. Original image is a raw EM image; Original P map is the MDPM output from the base CNN network. Round 1, 2, 4, 8, 16 are the maps processed by I-CNN 1, 2, 4, 8, 16 rounds, respectively. Ground truth is the map labeled by a human expert, black indicates a membrane pixel, and white indicates a nonmembrane pixel.\nTo test the performance of this network, a network was trained with patches extracted from 25 images from a training set where 5 images were left out as a validation set. As reported by Ciresan [8], we sampled the example patches evenly from both membrane and non-membrane classes for the training of both CNN and ICNN networks. Also similar to Ciresan work [8], we trained a bias correction curve to correct for bias caused by this sampling process. This correction curve is used throughout the whole work to correct for sampling bias. After the validation set likelihood stops to improve, we save the network parameters where we obtain the best likelihood loss on the validation set for the next step. The trained network is then applied on the images from the test set to generate the probability map of those images. For better precision, the test images are also processed in 8 different transformed images and resulting maps are averaged to obtain one single probability map. The resulting map is submitted to the ISBI challenge 2012 server for evaluation; the score is shown in Table 1 compared against the congregated result (averaged results from multiple networks output) published by Ciresan [8]. Although our score is slightly lower, our performance is better than each of their single networks. The probability map generated from this\nnetwork is used for the next stage. Since this part is not the focus of this work, we did not attempt to implement multiple networks of different architectures for better precision [8]."
    }, {
      "heading" : "3 . 3 Genera t io n o f M DPM f o r t ra in ing se t i ma g e s",
      "text" : "In the next section, we will describe our approach to refine the probability map for better segmentation accuracy. The idea here is to train another convolutional network, which can refine the raw MDPM in order to obtain better segmentation performance. For this task, we use the raw MDPM with its corresponding ground-truth segment map to train the network. In order to train an I-CNN that can refine a MDPM to reach the final segmentation map, we need the MDPM we can train with. If we apply the CNN described in the last section to the training image set that was used to train the CNN, maps will have severe overfitting, and thus, cannot be used for training. To overcome this, we performed a ten-fold split on the training set so the network is trained with ten different versions of splits each containing 27 training images and 3 left out images. After training each model, the procedure is applied on their corresponding 3 left out images to generate the corresponding probability maps. In this manner, we collect 30 MDPMs that do not have an overfitting issue. As a by-product, each model is also applied to the 30 testing images to obtain their MDPM stack, and ten versions of probability MDPM stack are averaged to obtain one MDPM stack of slightly better quality (score shown in table 1). This averaged test set MDPM stack is used in the next step."
    }, {
      "heading" : "3 .4 I t era t iv e co nv o lut io n neura l ne tw o rk",
      "text" : "The pixel wise likelihood map generated from the network described in the last section showed high pixel wise accuracy yet it was short of local consistency in certain areas (see Figures 1 & 2), which is inconsistent with the spatial continuity of the cell membrane. A human labeler with the implicit model of the cell membrane spatial continuity in mind will integrate contextual information and conform to the spatial continuity constraint. In the approach described in the last two sections, although contextual information is used for generating pixel detection probability values, those probability values are generated independently. This may leave gaps in a continuous boundary and lead to an eventually low quality connectome. On the other hand, we want to let longer range information outside the patch window (in our typical case 65x65 pixels) to propagate into the window and improve\nthe detection probability.\nmembrane sections. Blue arrows indicate where the model adds or solidifies a section of link between membrane parts; red arrows indicate where the model removes sections of uncertain membrane. As we can see the model does not always make the right decision. In D, the model failed badly because it was not able to properly process the distorted map that was possibly caused by an uneven cut during tissue slice preparation.\nHere we propose a simple convolutional network (I-CNN) which directly learns the statics of segmentation maps to significantly improve the segmentation quality. The main difference between this network and the previous network is the input images. In the earlier CNN network, the input to the network is the raw EM image. In this case, the input image patches are replaced by the patches extracted from MDPM, while the label of the center pixel is removed. The training target stays the same as the label of the center pixel from the ground\ntruth map. Since the structure used is quite similar as to the CNN network, it will not be described here. All detail and code will be made available with the final version of the paper. The same training procedure as in 3.2 is used for this network. We also resample the patch to maintain balanced class as in 3.2 and the correction curve used in 3.2 is again used here to correct sampling bias. This step will lead to slightly reduced pixel error as revealed by a smaller likelihood loss value at the end of the training on the validation dataset (0.228 vs. 0.239). As we stated earlier, we try to improve segmentation by integrating longer range information that is included in the neighboring pixel detection probability. On the other hand, when we apply this network to a MDPM we tend to push every pixel in the new map toward a higher likelihood given its neighborhood. This leads to another important change; the detection probability of neighboring pixels is not generated in isolation anymore. What will happen if you repeatedly apply the same I-CNN on the membrane detection probability refined by the last round of the same I-CNN?"
    }, {
      "heading" : "3 .5 Resu l t",
      "text" : "As shown in Figure 1, when we iteratively apply I-CNN to the MDPM, the first thing we notice is that by iteratively refining the probability, we gradually remove the noise in the map. After 16 rounds, the map turns out to be a map with rather clear boundaries vs. fuzzy boundaries in the original MDPM. More importantly, if we zoom into areas where CNN cannot make an affirmative inference about pixels, as shown in Figure 2, we can see that ICNN is able to integrate information in a neighborhood to recognize (blue arrows) a section of membrane shown with low probability but with good spatial continuity, and eventually labels the section with high confidence and closes gaps at the boundary. At the same time ICNN can identify noise pixel and areas (Red arrow) that do not appear like a section of membrane and eventually completely remove it. Yet, it can make mistakes in areas of great uncertainty, for example, in the case shown in Figure 2D.\nWe then measured the segmentation result by the standard score used by ISBI EM segmentation challenge. For this part of experiment, two different I-CNNs are trained each with 25 MDPM and grounding truth label map, and 5 MDPM are left out as validation set from training. Different 5 subsets are used for those two networks. After training, I-CNN is applied to their corresponding left out MDPM set for a total of 20 rounds; their segmentation error scores are then measured for\nFigure 3. Change of error rates with rounds of iterations\nA. Foreground-strict Rand error rate B. Minimum Splits and Mergers Warping error C. Pixel error\nevery round by the code provided by the challenge website[1]. Resulting scores are then averaged across ten maps and shown in Figure 3. Surprisingly, even though originally we train our network only to recover pixel error, we can observe that by iteratively applying I-CNN on the membrane detection map one can dramatically reduce the Rand error of the segmentation result at the beginning of the iteration. This reduction in Rand error disappears only after about 6 rounds and afterwards deteriorates. At the same time, as expected it indeed reduces the pixel error (Figure 3- C) and warping error (Figure 3-B) rates at the very beginning of the iteration. Although the effect reversed in the 2nd round, this is not very important for the neural circuit reconstruction task. We also applied the I-CNN to the test image stack for 6 rounds and submitted the result to ISBI 2012 EM segmentation challenge website obtaining a Rand error score of 0.0263, which is much better than the score of 0.0551 obtained from the original CNN result before refining (Full score comparison in Table 1)."
    }, {
      "heading" : "4 Conclusion and Discussion",
      "text" : "The new algorithm presented in this work learns the manifold of membrane morphology distribution; it enforces these constraints through iteration on a MDPM, refining it to fit a membrane morphology distribution learned from the training data. Through this process, a much better neurite segmentation results can be obtained. In other perspective, instead of generating a membrane detection probability of every pixel in isolation, through applying ICNN iteratively over MDPM, we congregated information in the local neighborhood and obtained significantly better consistency in neighboring pixels. A great improvement, measured by Rand error, was achieved over the original MDPM result. The resulting score is competitive with the state-of-the-art result even when we did not start with the MDPM result with much better precision as the authors of the current state-of-the art holder did. Furthermore, we achieved much better scores on two other metrics (see Table 1).\nCurrently, we apply networks to images pixels wisely at the iteration stage, which causes a large amount of redundant computation on neighboring pixels. Long et al. [20] and other groups, developed full convolutional neural network that can avoid this redundant computation cost by converting a patch-wise trained convolutional neural network to a network that is able to efficiently process a whole image. In the future, we can apply this technique to our approach for more efficiency at the iteration stage. A small modification to our training stage, where instead of replacing the center pixel label with a fixed value of 0, we inject random noise to the center pixel so that the network will learn to ignore this pixel. In this way, we can take advantage of the efficiency of full convolutional neural network.\nBearing in mind that the continuity of the cell membrane extends beyond a 2-D plane, it is shown that adding 3-D information from neighboring planes will likely improve the segmentation accuracy [11;18], especially in the regions of low confidence. Expanding this algorithm to include 3-D information is straight forward; however, it will require more data for training. Given the enormous volume of data that are involved in generating the connectome, it does make sense to enable this approach to gain more accuracy in the future.\nIn the EM segmentation, what our I-CNN network learns is relatively simple statistical structures. It would be even more interesting if we can apply the same architecture to other tasks, for example, to generate realistic looking natural images or to regenerate an image from a partially damaged photo to have a natural looking."
    } ],
    "references" : [ {
      "title" : "W",
      "author" : [ "B. Andres", "U. Kothe", "M. Helmstaedter" ],
      "venue" : "Denk, F.A. Hamprecht Segmentation of SBFSEM volume data of neural tissue by hierarchical classification. Pattern recognition, Springer",
      "citeRegEx" : "2",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "Contour detection and hierarchical image segmentation",
      "author" : [ "P. Arbelaez", "M. Maire", "C. Fowlkes", "J. Malik" ],
      "venue" : "Pattern Analysis and Machine Intelligence, IEEE Transactions on. 33",
      "citeRegEx" : "3",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Contour detection and hierarchical image segmentation",
      "author" : [ "P. Arbelaez", "M. Maire", "C. Fowlkes", "J. Malik" ],
      "venue" : "Pattern Analysis and Machine Intelligence, IEEE Transactions on. 33",
      "citeRegEx" : "4",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Network anatomy and in vivo physiology of visual cortical neurons",
      "author" : [ "D.D. Bock", "W.C.A. Lee", "A.M. Kerlin", "M.L. Andermann", "G. Hood", "A.W. Wetzel", "S. Yurgenson", "E.R. Soucy", "H.S. Kim", "R.C. Reid" ],
      "venue" : "Nature. 471",
      "citeRegEx" : "5",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "An integrated micro-and macroarchitectural analysis of the Drosophila brain by computer-assisted serial section electron microscopy",
      "author" : [ "A. Cardona", "S. Saalfeld", "S. Preibisch", "B. Schmid", "A. Cheng", "J. Pulokas", "P. Tomancak", "V. Hartenstein" ],
      "venue" : "PLoS biology. 8",
      "citeRegEx" : "6",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "Semi-automated reconstruction of neural circuits using electron microscopy",
      "author" : [ "D.B. Chklovskii", "S. Vitaladevuni", "L.K. Scheffer" ],
      "venue" : "Current opinion in neurobiology. 20",
      "citeRegEx" : "7",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "Deep neural networks segment neuronal membranes in electron microscopy images. In Advances in neural information processing systems (NIPS), 2843-2851",
      "author" : [ "D. Ciresan", "A. Giusti", "L.M. Gambardella", "J. Schmidhuber" ],
      "venue" : null,
      "citeRegEx" : "8",
      "shortCiteRegEx" : "8",
      "year" : 2012
    }, {
      "title" : "Image Super-Resolution Using Deep Convolutional Networks",
      "author" : [ "C. Dong", "C.C. Loy", "K. He", "X. Tang" ],
      "venue" : "arXiv preprint arXiv:1501.00092.",
      "citeRegEx" : "9",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Scene parsing with multiscale feature learning",
      "author" : [ "C. Farabet", "C. Couprie", "L. Najman", "Y. LeCun" ],
      "venue" : "purity trees and optimal covers. In International Conference on Machine Learning (ICML)",
      "citeRegEx" : "10",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Multi-hypothesis crfsegmentation of neural tissue in anisotropic EM volumes, Arxiv preprint.(2011)",
      "author" : [ "J. Funke", "B.r. Andres", "F.A. Hamprecht", "A. Cardona", "M. Cook" ],
      "venue" : null,
      "citeRegEx" : "11",
      "shortCiteRegEx" : "11",
      "year" : 2011
    }, {
      "title" : "Decomposing a scene into geometric and semantically consistent regions",
      "author" : [ "S. Gould", "R. Fulton", "D. Koller" ],
      "venue" : "International Conference on Computer Vision (ICCV)",
      "citeRegEx" : "12",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "Boundary learning by optimization with topological constraints",
      "author" : [ "V. Jain", "B. Bollmann", "M. Richardson", "D.R. Berger", "M.N. Helmstaedter", "K.L. Briggman", "W. Denk", "J.B. Bowden", "J.M. Mendenhall", "W.C. Abraham" ],
      "venue" : "Computer Vision and Pattern Recognition (CVPR)",
      "citeRegEx" : "13",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "Supervised learning of image restoration with convolutional networks",
      "author" : [ "V. Jain", "J.F. Murray", "F. Roth", "S. Turaga", "V. Zhigulin", "K.L. Briggman", "M.N. Helmstaedter", "W. Denk", "H.S. Seung" ],
      "venue" : "In International Conference on Computer Vision (ICCV)",
      "citeRegEx" : "14",
      "shortCiteRegEx" : "14",
      "year" : 2007
    }, {
      "title" : "Natural image denoising with convolutional networks. In Advances in neural information processing systems (NIPS), 769-776",
      "author" : [ "V. Jain", "S. Seung" ],
      "venue" : null,
      "citeRegEx" : "15",
      "shortCiteRegEx" : "15",
      "year" : 2009
    }, {
      "title" : "Detection of neuron membranes in electron microscopy images using a serial neural network architecture",
      "author" : [ "E. Jurrus", "A.R. Paiva", "S. Watanabe", "J.R. Anderson", "B.W. Jones", "R.T. Whitaker", "E.M. Jorgensen", "R.E. Marc", "T. Tasdizen" ],
      "venue" : "Medical image analysis. 14",
      "citeRegEx" : "16",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "Associative hierarchical crfs for object class image segmentation",
      "author" : [ "L. Ladicky", "C. Russell", "P. Kohli", "P.H. Torr" ],
      "venue" : "In IEEE 12th International Conference on Computer Vision (ICCV),",
      "citeRegEx" : "17",
      "shortCiteRegEx" : "17",
      "year" : 2009
    }, {
      "title" : "Watershed merge forest classification for electron microscopy image stack segmentation",
      "author" : [ "T. Liu", "M. Seyedhosseini", "M. Ellisman", "T. Tasdizen" ],
      "venue" : "In IEEE International Conference on Computer Vision (ICCV)",
      "citeRegEx" : "18",
      "shortCiteRegEx" : "18",
      "year" : 2013
    }, {
      "title" : "Watershed merge tree classification for electron microscopy image segmentation",
      "author" : [ "T. Liu", "E. Jurrus", "M. Seyedhosseini", "M. Ellisman", "T. Tasdizen" ],
      "venue" : "International Conference on Pattern Recognition (ICPR)",
      "citeRegEx" : "19",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Fully convolutional networks for semantic segmentation",
      "author" : [ "J. Long", "E. Shelhamer", "T. Darrell" ],
      "venue" : "arXiv preprint arXiv:1411.4038.",
      "citeRegEx" : "20",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "The human connectome: a structural description of the human brain",
      "author" : [ "O. Sporns", "G. Tononi", "R. Kotter" ],
      "venue" : "PLoS computational biology. 1",
      "citeRegEx" : "21",
      "shortCiteRegEx" : null,
      "year" : 2005
    }, {
      "title" : "Superparsing: scalable nonparametric image parsing with superpixels",
      "author" : [ "J. Tighe", "S. Lazebnik" ],
      "venue" : "Computer Vision−ECCV 2010, Springer",
      "citeRegEx" : "22",
      "shortCiteRegEx" : null,
      "year" : 2010
    } ],
    "referenceMentions" : [ {
      "referenceID" : 3,
      "context" : "For example, a typical image set of the V1 area of a mouse brain with resolution of 4×4×45 nm produces 12TB of data[5].",
      "startOffset" : 115,
      "endOffset" : 118
    }, {
      "referenceID" : 6,
      "context" : "The post-processing can be simple, for example, simple thresholding, or creating a smooth probability map by using a median filter [8].",
      "startOffset" : 131,
      "endOffset" : 134
    }, {
      "referenceID" : 8,
      "context" : "Other more graphical models based on region merge/clustering techniques such as superpixel [10] and watershed merge [18;19]have also been applied on this or similar tasks to refine segmentation on top of a detection map.",
      "startOffset" : 91,
      "endOffset" : 95
    }, {
      "referenceID" : 2,
      "context" : "The quality of membrane detection can be directly measured by the pixels error, but just like in contour detection, a high quality membrane detection does not guarantee a good segmentation [4].",
      "startOffset" : 189,
      "endOffset" : 192
    }, {
      "referenceID" : 11,
      "context" : "The quality of the segmentation can be measured by the Rand index[13], which measures the resemblance of two clusters of segmentations.",
      "startOffset" : 65,
      "endOffset" : 69
    }, {
      "referenceID" : 6,
      "context" : "In a typical MDPM such as the one from Ciresan’s work [8] the detection probability of every pixel is made in isolation, which increases the possibility of having gaps in the boundaries.",
      "startOffset" : 54,
      "endOffset" : 57
    }, {
      "referenceID" : 9,
      "context" : "[11] used a tree structure for segmentation hypothesis and reach segmentation with MAP inference in a CRF.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 7,
      "context" : "Our approach is also related to the image super resolution convolutional neural network [9] where a convolutional neural network is trained to restore high resolution from low resolution images, and to de-noise network [15] where the purpose is to restore a noisy image.",
      "startOffset" : 88,
      "endOffset" : 91
    }, {
      "referenceID" : 13,
      "context" : "Our approach is also related to the image super resolution convolutional neural network [9] where a convolutional neural network is trained to restore high resolution from low resolution images, and to de-noise network [15] where the purpose is to restore a noisy image.",
      "startOffset" : 219,
      "endOffset" : 223
    }, {
      "referenceID" : 6,
      "context" : "The network used in this part is analogous to the convolutional network implemented by Ciresan [8].",
      "startOffset" : 95,
      "endOffset" : 98
    }, {
      "referenceID" : 6,
      "context" : "As in the work of Ciresan [8], CNN is trained to yield the probability of whether the pixel at the center of a given image patch (65x65 size) is a membrane pixel.",
      "startOffset" : 26,
      "endOffset" : 29
    }, {
      "referenceID" : 6,
      "context" : "Also, similar to the work of Ciresan[8], we augment the dataset by rotation, flipping and mirroring images in a total of 8 different transformations.",
      "startOffset" : 36,
      "endOffset" : 39
    }, {
      "referenceID" : 6,
      "context" : "As reported by Ciresan [8], we sampled the example patches evenly from both membrane and non-membrane classes for the training of both CNN and ICNN networks.",
      "startOffset" : 23,
      "endOffset" : 26
    }, {
      "referenceID" : 6,
      "context" : "Also similar to Ciresan work [8], we trained a bias correction curve to correct for bias caused by this sampling process.",
      "startOffset" : 29,
      "endOffset" : 32
    }, {
      "referenceID" : 6,
      "context" : "The resulting map is submitted to the ISBI challenge 2012 server for evaluation; the score is shown in Table 1 compared against the congregated result (averaged results from multiple networks output) published by Ciresan [8].",
      "startOffset" : 221,
      "endOffset" : 224
    }, {
      "referenceID" : 6,
      "context" : "Since this part is not the focus of this work, we did not attempt to implement multiple networks of different architectures for better precision [8].",
      "startOffset" : 145,
      "endOffset" : 148
    }, {
      "referenceID" : 6,
      "context" : "Convolutional network in [8] 0.",
      "startOffset" : 25,
      "endOffset" : 28
    }, {
      "referenceID" : 18,
      "context" : "[20] and other groups, developed full convolutional neural network that can avoid this redundant computation cost by converting a patch-wise trained convolutional neural network to a network that is able to efficiently process a whole image.",
      "startOffset" : 0,
      "endOffset" : 4
    } ],
    "year" : 2015,
    "abstractText" : "To build the connectomics map of the brain, we developed a new algorithm that can automatically refine the Membrane Detection Probability Maps (MDPM) generated to perform automatic segmentation of electron microscopy (EM) images. To achieve this, we executed supervised training of a convolutional neural network to recover the removed center pixel label of patches sampled from a MDPM. MDPM can be generated from other machine learning based algorithms recognizing whether a pixel in an image corresponds to the cell membrane. By iteratively applying this network over MDPM for multiple rounds, we were able to significantly improve membrane segmentation results.",
    "creator" : "Acrobat PDFMaker 9.0 for Word"
  }
}