{
  "name" : "1509.02437.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Improved Twitter Sentiment Prediction through ‘Cluster-then-Predict Model’",
    "authors" : [ "Rishabh Soni", "K. James Mathai" ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : null,
      "text" : "particular social media and microblogging websites such as Facebook, Twitter, YouTube and also mobile applications such as WhatsApp, Line, etc. Many companies have identified these resources as a rich mine of marketing knowledge. This knowledge provides valuable feedback which allows them to further develop the next generation of their product. In this paper, sentiment analysis of a product is performed by extracting tweets about that product and classifying the tweets showing it as positive and negative sentiment. The authors propose a hybrid approach which combines unsupervised learning in the form of K-means clustering to cluster the tweets and then performing supervised learning methods such as Decision Trees and Support Vector Machines for classification.\nKeywords - Twitter, Clustering, Decision Trees, Sentiment Analysis, Social Media."
    }, {
      "heading" : "1. Introduction",
      "text" : "Companies traditionally rely on interviews, questionnaires and surveys to gain insight through customer feedback about their products and the company itself. These traditional methods are often extremely time consuming and expensive. They does not always return the desired results that the companies were looking for due to environmental factors and poorly designed survey instrument. In this paper, the results of sentiment analysis is carried out to get public perception of the company ‘Apple’.\nThe Twitter Streaming API was used to obtain real-time tweets as text about the company for sentiment prediction. The real-time collection of tweets at three stages i.e. after\nthe initial announcement of the product, at the product launch and after the product has been launched; have helped in analyzing the sentiment towards the company.\nDecision trees such as Classification and Regression Trees (CART) and Random Forests were used for classifying tweets sentiments as positive or negative. They also provided visual insight as which words as features are most prominent in swaying the perception of the company. This would help the company to identify the services and products which satisfies the customers.\nThere are different methods for classifying tweets such as Support Vector Machines (SVM), Logistic Regression, Classification and Regression Trees (CART), Random Forests etc. The author(s) propose a hybrid method by which:\n• The tweets are clustered based on the words they contain by applying K-means clustering on the\ndata, and\n• Train the data by applying Random Forest on each of the subset of tweets for classification.\nThe predicted results of this research when compared with the results of traditional approaches such as CART, Random Forests and SVM, have shown better accuracy.\nThis method can also be called as ‘cluster-then-predict Model’ because in this model, firstly the similar type of tweets are clustered depending upon the sentiment of words they contain and then train the model for prediction. The accuracy of the results can be shown using a confusion matrix. Thus, the proposed hybrid approach shows that prediction with such a method results in better accuracy.\n560"
    }, {
      "heading" : "2. Related Work",
      "text" : "Due to the widespread presence of internet and growth of social media websites such as Facebook and Twitter, online social network analysis has become a hot research topic. Twitter has an easy to use API that provides textual data for a variety of purposes. In paper [1], authors Alexander Pak et al. focusses on twitter for the task of sentiment analysis. They perform linguistic analysis of the collected corpus and explains the discovered phenomena. They build a classifier based on the multinomial Naïve Bayes classifier that used N-gram and POS-tags as features.\nStock prediction using twitter corpora is a major research area and provides direction of work. Many researches have been carried out in this aspect. In the study [2], the authors Vu, Tien-Thanh et al., harnesses features from twitter messages to capture public mood related to four Tech companies for predicting the daily up and down price movements of these companies’ NASDAQ stocks. In the study [3], author Linhao Zhang examines the effectiveness of various machine learning techniques on providing a positive or negative sentiment on a twitter corpus. The author have applied supervised machine learning techniques like SVM, Naïve Bayes, maximum Entropy etc. and compared the results. They also looked for correlation between twitter sentiments with stock prices and determined which words in tweets correlate to changes in stock prices by doing a post analysis of price change and tweets.\nDue to the varied nature of textual information available on twitter, various analyses like public opinion on a television show [4], sentiment analysis on movie reviews [5], stock prediction [2][3][6], automatic crime prediction [7] and election results prediction [8] have been carried out. In this research, authors have used sentiment analysis technique for finding out public perception about the company so that it can devise its future strategy for itself."
    }, {
      "heading" : "3. Proposed Work",
      "text" : "Authors proposes a hybrid approach which comprises of both unsupervised and supervised learning for predicting the sentiment (refer section 3.3 & 3.4). After obtaining the data(refer section 3.1) and preprocessing it, K-means clustering is performed to form clusters of tweets data points, such that similar tweets (based on the words they contain) gets clustered into one cluster. The unsupervised learning stage is mostly used in conjunction with feature extraction stage. After performing K-means clustering i.e. unsupervised training on the data; supervised training is\ndone on the same data. In it, the data is divided into training and testing sets, each containing 70% and 30% of the data, respectively. After that, proposed learning model is applied to each of the training data set individually. There are various supervised learning methods for building the model, but author(s) found that the Random Forests algorithm is best suited for the problem because it provides best trade-off between accuracy, interpretability and execution time.\nAuthor(s) proposes supervised learning pipeline as shown by the diagram below, clustering is done in conjunction with feature extraction stage, to implement ‘cluster-thenpredict Model’ for better prediction results.\n3.1 Obtaining Raw Data\nTo verify sentiment prediction through proposed ‘Clusterthen-predict Model’, Twitter’s tweets have been used as text data. Twitter data that is publically available were collected by Twitter API. Twitter’s streaming API service is used to store real-time tweets. Python’s API named Tweepy [9] have been used to implement streaming API of Twitter. It provides libraries to collect streaming twitter data. The incoming tweets were stored in CSV (Comma Separated Values) file format in real-time by importing Python’s CSV library functions.\nFor this research, 1200 tweets were collected for the company ‘Apple’ for analysis. After the tweets have been saved in the CSV file, the sentiment value for each tweet is assigned for the sake of supervised learning. This sentiment value assigned by workers on job by Amazon’s Mechanical Turk (MTurk) [11] is used in the proposed work.\n561\n3.2 Feature Extraction\nThe feature extraction process is derived from Bag-ofwords [10] approach. (Here the text is represented as a bag of its words.) The frequency of occurrence of each word is used as a feature for training the classifierRadom Forest Algorithm. Redundant and sparse data is also removed from initial raw data, so that the reduced set of features takes less time in algorithms and also it reduces overfitting of the training set.\n3.3 Unsupervised Learning: K-means Clustering\nAfter forming the bag-of-words from twitter corpus, Kmeans clustering has been performed on it, to partition the dataset into K clusters. This action, partitions the tweets according to the words they contain. This classifies the tweets having the similar words will get one cluster. This process will in turn lead to a better prediction on the test dataset.\nThe K-means clustering follows a simple and easy way to classify a given dataset through a certain number of cluster ‘k’, fixed prior to implementing it. The main steps of K-means clustering can be shown by the Table 1 below:\nThis algorithm aims at minimizing an objective function, in this case a squared error function. The objective function can be represented as follow:\nwhere ||xi (j) - cj || 2 is a chosen distance measure between a data point xi (j) and the cluster center cj, is an indicator of the distance of the n data points from their respective cluster centers.\n3.4 Supervised Learning: Decision Trees\nDecision trees are one of the most widely used machine learning algorithms much of their popularity is due to the fact that they can be adapted to almost any type of data. They are a supervised machine learning algorithm that\ndivides its training data into smaller and smaller parts in order to identify patterns which can be used for classification. The knowledge is then presented in the form of logical structure similar to a flow chart that can be easily understood without any statistical knowledge. The algorithm is particularly well suited to cases where many hierarchical categorical distinctions can be made.\nHere, the Random Forest algorithm is used to classify the tweets as positive or negative. By plotting the model, prominent keywords generated can be depicted which sway public perception.\nUsing decision trees such as Random Forests makes solution more interpretable. For example, in this case, if the word freak appears in the tweet, then it is most likely to be classified into TRUE, or showing negative emotion towards the company.\n3.5 Evaluation\nApart from using Random Forest Algorithm, many other classification algorithms can be used such as CART, Support Vector Machines (SVM), logistic regression, etc. They were also evaluated based on the parameters such as accuracy, area under ROC curve and interpretability for prediction the sentiment.\n3.6 Prediction\nAfter selecting and evaluating the proposed ‘Cluster-thenpredict Model’, predictions on the test set was done. The predicted and actual results can then be compared using a confusion matrix shown below.\n562\nIn this paper the accuracy of the model has been found out by the confusion matrix by the formula given below:\nAccuracy = TP + TN\nTP + FN + FP + TN\nAnother way to examine the performance of the model is ROC (Receiver Operator Characteristic) graph. A ROC graph is a plot with the false positive tare on the X-axis and the true positive rate on the Y-axis. The ROC curves for k=2 clusters are shown in following figure:\nThe area beneath an ROC curve can be used as a measure of accuracy.\nFor the proposed hybrid model, the Area under Curve\n(AUC) and prediction accuracy derived from the confusion matrix is higher as compared to the standalone models, as well as baseline accuracy, which is 54.23%.\nBelow is a short review table summarizing the evaluation of different approaches:\nThe table here shows that proposed “cluster-then-predict” approach has better Accuracy and AUC for sentiment prediction. It also has better interpretability so that companies can gain insights to make better decisions in the future."
    }, {
      "heading" : "4. Conclusions",
      "text" : "This paper presents a hybrid mechanism- ‘Cluster-thenpredict Model’ to improve accuracy of predicting twitter sentiment. The possibility of combining both unsupervised learning and supervised learning, in the form of K-means clustering and Random Forest, respectively performed better, than various supervised learning algorithms, such as CART, SVM, logistic Regression, etc.\nThe architecture of this model is scalable, so it can accommodate large amount of twitter text data. This hybrid model will perform even better when the raw data is very large and diversified.\nIn future work, author(s) will try to include sentiment from emoticons, make the classification multi-class i.e. showing strongly negative, negative, neutral, positive or strongly positive emotions.\n563"
    } ],
    "references" : [ {
      "title" : "Twitter as a Corpus for Sentiment Analysis and Opinion Mining.",
      "author" : [ "Pak", "Alexander", "Patrick Paroubek" ],
      "venue" : "LREC. Vol",
      "citeRegEx" : "1",
      "shortCiteRegEx" : "1",
      "year" : 2010
    }, {
      "title" : "An experiment in integrating sentiment features for tech stock prediction in twitter.",
      "author" : [ "Vu", "Tien-Thanh" ],
      "venue" : null,
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 2012
    }, {
      "title" : "Sentiment analysis on Twitter with stock price and significant keyword correlation.",
      "author" : [ "Zhang", "Linhao" ],
      "venue" : "PhD diss.,",
      "citeRegEx" : "3",
      "shortCiteRegEx" : "3",
      "year" : 2013
    }, {
      "title" : "Stock prediction using twitter sentiment analysis.\" Stanford University, CS229(2011  http://cs229",
      "author" : [ "Mittal", "Anshul", "Arpit Goel" ],
      "venue" : "stanford. edu/proj2011/GoelMittal- StockMarketPredictionUsingTwitterSentimentAnalysis",
      "citeRegEx" : "6",
      "shortCiteRegEx" : "6",
      "year" : 2012
    }, {
      "title" : "Automatic crime prediction using events extracted from twitter posts.\" Social Computing, Behavioral-Cultural Modeling and Prediction",
      "author" : [ "Wang", "Xiaofeng", "Matthew S. Gerber", "Donald E. Brown" ],
      "venue" : null,
      "citeRegEx" : "7",
      "shortCiteRegEx" : "7",
      "year" : 2012
    }, {
      "title" : "I Wanted to Predict Elections with Twitter and all I got was this Lousy Paper\"--A Balanced Survey on Election Prediction using Twitter Data.",
      "author" : [ "Gayo-Avello", "Daniel" ],
      "venue" : null,
      "citeRegEx" : "8",
      "shortCiteRegEx" : "8",
      "year" : 2012
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "In paper [1], authors Alexander Pak et al.",
      "startOffset" : 9,
      "endOffset" : 12
    }, {
      "referenceID" : 1,
      "context" : "In the study [2], the authors Vu, Tien-Thanh et al.",
      "startOffset" : 13,
      "endOffset" : 16
    }, {
      "referenceID" : 2,
      "context" : "In the study [3], author Linhao Zhang examines the effectiveness of various machine learning techniques on providing a positive or negative sentiment on a twitter corpus.",
      "startOffset" : 13,
      "endOffset" : 16
    }, {
      "referenceID" : 1,
      "context" : "Due to the varied nature of textual information available on twitter, various analyses like public opinion on a television show [4], sentiment analysis on movie reviews [5], stock prediction [2][3][6], automatic crime prediction [7] and election results prediction [8] have been carried out.",
      "startOffset" : 191,
      "endOffset" : 194
    }, {
      "referenceID" : 2,
      "context" : "Due to the varied nature of textual information available on twitter, various analyses like public opinion on a television show [4], sentiment analysis on movie reviews [5], stock prediction [2][3][6], automatic crime prediction [7] and election results prediction [8] have been carried out.",
      "startOffset" : 194,
      "endOffset" : 197
    }, {
      "referenceID" : 3,
      "context" : "Due to the varied nature of textual information available on twitter, various analyses like public opinion on a television show [4], sentiment analysis on movie reviews [5], stock prediction [2][3][6], automatic crime prediction [7] and election results prediction [8] have been carried out.",
      "startOffset" : 197,
      "endOffset" : 200
    }, {
      "referenceID" : 4,
      "context" : "Due to the varied nature of textual information available on twitter, various analyses like public opinion on a television show [4], sentiment analysis on movie reviews [5], stock prediction [2][3][6], automatic crime prediction [7] and election results prediction [8] have been carried out.",
      "startOffset" : 229,
      "endOffset" : 232
    }, {
      "referenceID" : 5,
      "context" : "Due to the varied nature of textual information available on twitter, various analyses like public opinion on a television show [4], sentiment analysis on movie reviews [5], stock prediction [2][3][6], automatic crime prediction [7] and election results prediction [8] have been carried out.",
      "startOffset" : 265,
      "endOffset" : 268
    } ],
    "year" : 2015,
    "abstractText" : "Over the past decade humans have experienced exponential growth in the use of online resources, in particular social media and microblogging websites such as Facebook, Twitter, YouTube and also mobile applications such as WhatsApp, Line, etc. Many companies have identified these resources as a rich mine of marketing knowledge. This knowledge provides valuable feedback which allows them to further develop the next generation of their product. In this paper, sentiment analysis of a product is performed by extracting tweets about that product and classifying the tweets showing it as positive and negative sentiment. The authors propose a hybrid approach which combines unsupervised learning in the form of K-means clustering to cluster the tweets and then performing supervised learning methods such as Decision Trees and Support Vector Machines for classification.",
    "creator" : "PScript5.dll Version 5.2"
  }
}