{
  "name" : "1511.06910.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "ICU PATIENT DETERIORATION PREDICTION: A DATA-MINING APPROACH",
    "authors" : [ "Noura AlNuaimi", "Mohammad M Masud" ],
    "emails" : [ "200835338}@uaeu.ac.ae" ],
    "sections" : [ {
      "heading" : null,
      "text" : "A huge amount of medical data is generated every day, which presents a challenge in analysing these data. The obvious solution to this challenge is to reduce the amount of data without information loss. Dimension reduction is considered the most popular approach for reducing data size and also to reduce noise and redundancies in data. In this paper, we investigate the effect of feature selection in improving the prediction of patient deterioration in ICUs. We consider lab tests as features. Thus, choosing a subset of features would mean choosing the most important lab tests to perform. If the number of tests can be reduced by identifying the most important tests, then we could also identify the redundant tests. By omitting the redundant tests, observation time could be reduced and early treatment could be provided to avoid the risk. Additionally, unnecessary monetary cost would be avoided. Our approach uses state-ofthe-art feature selection for predicting ICU patient deterioration using the medical lab results. We apply our technique on the publicly available MIMIC-II database and show the effectiveness of the feature selection. We also provide a detailed analysis of the best features identified by our approach.\nKEYWORDS\nBig data analytics; data mining; ICU; lab test; feature selection; learning algorithm"
    }, {
      "heading" : "1. INTRODUCTION",
      "text" : "Healthcare is changing from traditional medical practice to modern evidence-based healthcare. Evidence is based on patient data, which are collected from different resources like electronic health record (EHR) systems, monitoring devices and sensors [1]. One specific example of these technological advances is the observation and monitoring technologies for intensive care unit (ICU) patients. Currently, the data generated in the process of medical care ICUs are huge, complex and unstructured. Such data can be called big data due to their complexity, large size and difficulty to process in real-time [2]. However, these data could be used with the help of intelligent systems, such as big data analytics and decision support systems, to determine which patients are at an increased risk of death. This could support making the right decision to enhance the efficiency, accuracy and timeliness of clinical decision making in the ICU. Reducing the amount of data without losing information is a great challenge. Dimension reduction would be the first solution to eliminate duplicate, useless and irrelevant features. In this paper, our goal is to propose an efficient mining technique to reduce the observation time in ICUs by predicting patient deterioration in its early stages through big data analytics. Our proposed technique has several contributions. First, we use the lab test results to predict patient deterioration. To the best of our knowledge, this is the first work that primarily uses medical lab tests to predict patient deterioration. Lab test results have a crucial role in medical decision making. Second, we identify most important medical lab tests using state-of-the-art featureselection techniques without using any informed domain knowledge. Finally, our approach helps reduce redundant medical lab tests. Thus, healthcare professionals could focus on the most important lab tests to assist them, which would save not only costs but also valuable time in recovering the patient from a critical condition.\nThe paper is organised as follows. Section 2 presents the related work of predicting ICU death, Section 3 gives background on data mining and big data analytics, Section 4 illustrates our proposed approach, Section 5 summarises the MIMIC II dataset, Section 6 illustrates the experiment’s work, Section 7 discusses the findings, and finally, the conclusion of this research is presented in Section 8."
    }, {
      "heading" : "2. LITERATURE REVIEW",
      "text" : "This section reviews related works for predicting ICU death or the deterioration of ICU patients. We highlight some similarities and differences between some of the related works and the proposed work. In [3], the authors developed an integrated data-mining approach to give early deterioration warnings for patients under real-time monitoring in the ICU and real-time data sensing (RDS). They synthesised a large feature set that included first- and second-order time-series features, detrended fluctuation analysis (DFA), spectral analysis, approximative entropy and cross-signal features. Then, they systematically applied and evaluated a series of established data-mining methods, including forward feature selection, linear and nonlinear classification algorithms, and exploratory under sampling for class imbalance. In our work, we are using the same dataset. However, we are using only the medical lab tests. Also, in our approach, we depend on feature selection to reduce the size of the dataset. A health-data search engine was developed in [4] that supported predictions based on the summarised clusters patient types which claimed that it was better than predictions based on the non-summarised original data. In our work, we use only the medical lab tests, and we attempt to highlight the most important medical labs. Liu et al. [4] investigated the critical feature size dimension. In their work, an ad hoc heuristic method based on feature-ranking algorithms was used to perform the experiment on six datasets. They found that the heuristic method is useful in finding the critical feature dimension for large datasets. In our work, we also use the ranking to rank the most useful features. However, we attempt to investigate the percentage of selected features that would be enough to have moderate model accuracy. A survey of feature selection is presented in [6]. The authors presented a basic taxonomy of feature-selection techniques and discussed their use, variety and potential in a number of common and upcoming bioinformatics applications. Cismondi et al. [5] proposed reducing unnecessary lab testing in the ICU. They applied artificial intelligence to study the predictability of future lab test results for gastrointestinal bleeding. This work is the closest work to our research; they have the same objective of reducing unnecessary lab tests. However, they only focus on gastrointestinal bleeding. In our work, we are targeting all cases in the ICUs."
    }, {
      "heading" : "3. BACKGROUND ON DATA MINING AND BIG DATA ANALYTICS",
      "text" : "Healthcare, like other sectors, is facing the need for analysing large amounts of information, otherwise known as big data, which has become a major driver of innovation and success. Big data has potential to support a wide range of medical and healthcare functions, including clinical decision support [2].\nData mining is the analysis step of knowledge discovery. It is about the ‘extraction of interesting (non-trivial, implicit, previously unknown, and potentially useful) patterns or knowledge from huge amount of data [10]’. When mining massive datasets, two of the most common, important and immediate problems are sampling and feature selection. Appropriate sampling and feature selection contribute to reducing the size of the dataset while obtaining satisfactory results in model building [4]."
    }, {
      "heading" : "3.1. Feature Selection",
      "text" : "In machine learning, feature selection or attribute selection is the process of selecting a subset of relevant features (variables, predictors) for use in model construction. Feature selection techniques are used (a) to avoid overfitting and improve model performance, i.e. predict performance in the case of supervised classification and better cluster detection in the case of clustering, (b) to provide faster and more cost-effective models and (c) to gain deeper insight into the underlying processes that generated the data. In the context of classification, feature selection techniques can be organized into three categories, depending on how they perform the feature selection search to build the classification model: filter methods, wrapper methods and embedded methods, presented in table 1 [6] [7]:\n1) Filter Methods are based on applying a statistical measure to assign a scoring to each feature. Then, features are ranked by score and either selected or removed from the dataset.\nThe methods are often univariate and consider the feature independently or with regard to the dependent variable. 2) Wrapper Methods are based on the selection of a set of features as a search problem, where different combinations are prepared, evaluated and compared to other combinations. A\npredictive model is used to evaluate a combination of features and assign a score based on model accuracy. 3) Embedded Methods are based on learning which features most contribute to the accuracy of the model while the model is being created."
    }, {
      "heading" : "3.2. Data Classification Techniques",
      "text" : "Classification is a pattern-recognition task that has applications in a broad range of fields. It requires the construction of a model that approximates the relationship between input features and output categories [8]. Some of the most popular techniques are discussed here in brief, all of which are used in our work.\n1) The Naïve Bayes classifier is based on applying Bayes’ theorem with strong independence assumptions between the features. As one of its main features, the Naïve Bayes classifier is\neasy to implement because it requires a small amount of training data in order to estimate the parameters, and good results can be found in most cases. However, it has class conditional independence, meaning it causes losses of accuracy and dependency [9]. 2) Sequential minimal optimization (SMO) is an algorithm for efficiently solving the optimization problem which arises during the training of support vector machines [10]. The\namount of memory required for SMO is linear in the training set size, which allows SMO to handle very large training sets [11].\n3) The ZeroR classifier simply predicts the majority category, which relies on the target and ignores all predictors. Although there is no predictability power in ZeroR, it is useful for\ndetermining a baseline performance as a benchmark for other classification methods [10].\n4) A decision tree (J48) is a fast algorithm to train and generally gives good results. Its output is human readable, therefore one can see if it makes sense. It has tree visualizers to aid\nunderstanding. It is among the most used data mining algorithms. The decision tree partitions the input space of a data set into mutually exclusive regions, each of which is assigned a label, a value or an action to characterize its data points [10]. 5) A RandomForest is a combination of tree predictors such that each tree depends on the values of a random vector sampled independently and with the same distribution for all\ntrees in the forest [12]."
    }, {
      "heading" : "4. PROPOSED APPROACH",
      "text" : "In this section we introduce our approach for the Big Data mining technique for predicting ICU patient deterioration. Figure 1 shows the architecture of the proposed technique.\nThe data are collected from the database of ICU patients (step 1). Then the data are integrated, cleaned and relevant features are extracted (step 2). After that, feature selection or dimensionality reduction techniques are applied to obtain the best set of features and reduce the data dimension (step 3). Then the prediction model is learned using a machine learning approach (step 4). When a new patient is admitted to the CPU, the patient’s data are collected incrementally (step 5). The patient data are evaluated by the prediction model (step 6) to predict the possibility of deterioration of the patient, and warnings are generated accordingly. Each of these steps is summarized here, and more details of the dataset are given in Section 5.\n1) ICU Patient Data: The details of the data and the collection process are discussed in Section 5.\n2) Preprocessing: At the preprocessing stage, we used two different datasets. These datasets were generated from a Labevents table. The first dataset contained the average value of\napplied medical tests, and the second contained the total number of times for each test was applied. 3) Feature Selection / Dimension Reduction: attribute selection is the process of selecting a subset of relevant features (variables, predictors) for use in model construction. The goal\nhere is to reduce the attributes so medical professional can identify the most important medical lab tests used by reducing the redundant tests. In our work, we select filter methods because they are moderately robust against the overfitting problem, as follows:\na. Attribute evaluator: InfoGrainAttributeEval b. Search method: Ranker c. Attribute selection mode: use full training set\n4) Learning: In our experiment we use a classification technique and five of the most popular classifier techniques: Naïve Bayes classifier, Support vector machine (SVM), ZeroR\nclassifier, decision tree (J48) and RandomForest. We use different types of machine learning order to avoid random results. 5) Model: The developed model aims to predict ICU patient deterioration by mining lab test results. Thus, observation time can be reduced in the ICUs and more actions can be taken in\nthe early stages.\n6) New patient data: When a new patient is admitted to the ICU, all his information is stored in the database. Some of these are incremental, such as vital sign readings, lab test results,\nmedication events etc. The data of the patient again go through the preprocessing and feature extraction phases before they can be applied to the model. 7) Prediction: After each new test result, medication event, etc., the patient data are preprocessed and features are extracted to supply to the prediction model. The model\npredicts the probability of deterioration for the patient. This probability may change when new data (e.g. more test results) are accumulated and applied to the model. When the deterioration probability reaches a certain threshold specified by the healthcare providers, a warning is generated. This would help the healthcare providers to take proactive measures to save the patient from getting into a critical or fatal condition."
    }, {
      "heading" : "5. MIMIC II DATABASE",
      "text" : "The MIMIC-II database is part of the Multiparameter Intelligent Monitoring in Intensive Care project funded by the National Institute of Biomedical Imaging and Bioengineering at the Laboratory of Computational Physiology at MIT, which was collected from 2001 to 2008 and represents 26,870 adult hospital admissions. In our work, we use MIMIC-II version 2.6 because is more stable than the newer version 3, which is still in the beta phase and needs further work of cleaning, optimizing and testing. MIMIC-II consists of two major components: clinical data and physiological waveforms. The MIMIC dataset has three main features: (1) it is public; (2) it has a diverse and very large population of ICU patients; and (3) it contains high temporal resolution data, including lab results, electronic documentation, and bedside monitor trends and waveforms[13]. Several works have used the MIMIC dataset, such as [14], [15] and [16]. In our work, we focus on the clinical data, the LABEVENTS and LABITEMS tables. The Labevents table contains data of each patient’s ICU stay, as presented in table 2, and table 3 contains descriptions of the lab events. Considering medical lab choice was done because we wanted to investigate the relationship between medical lab tests and patient deterioration so we could identify which medical tests have a major effect on clinical decision making. For example, the following information is about a patient who was staying at the ICU and was given a medical test. The following information was recorded at that time:\n Subject_ID: 2\n Hadm_ID: 25967\n IcuStay_ID: 3\n ItemID: 50468\n Charttime: 6/15/2806 21:48\n Value: 0.1\n ValueNum: 0.1\n Flag: abnormal\n ValueUOM: K/uL"
    }, {
      "heading" : "6. EXPERIMENTS",
      "text" : "We conducted four experiments to fulfil the different approaches to reach our goal of predicting ICU patient deterioration by mining lab test results. In each experiment, a different dataset resulted from pre-processing the MIMIC II v2.6 database."
    }, {
      "heading" : "6.1. Experiment 1: Building a Baseline of the Medical Lab Tests Average",
      "text" : "1) Experiment Goal: The goal of this experiment was to investigate the effect of lab testing on predicting patient deterioration. Usually, medical professionals compare the result of the lab\ntest with a reference range [17]. If the value is not within this range, the patient may face fatal consequences. Thus, the patient is kept under observation and the test is repeated again during a specific period. In our experiment, we investigated the average value of the same repeated test and, more precisely, how the average value of lab results could assist medical professionals in evaluating patient status. Since we dealt with real cases, the only way to assess the quality and characteristics of a data mining model was through the final status of the patient, i.e. whether the patient survived or not. Thus, our evaluation criterion was how accurately our approach could predict whether the patient died or not. 2) Building the Dataset: The dataset was constructed by taking the average test result of each patient for each kind of test and make it one attribute. Thus one patient would be\nrepresented as one instance having 700 attributes, one for each test. If a test was not done, then the value of that attribute would be 0. For example, the first patient record in the dataset would look like this: P_ID Avg1 Avg2 ..... Avg700 Dead/Alive 1 5.3 10 0 D\n3) Pre-processing: After building the dataset, some values could not be reported because they were in text format. We used default values for these types of data. The total number of\nattributes was 619 with 2900 instances.\n4) Base learners: In our experiment we used five classification algorithms to construct the model, namely NaiveBayes, SMO, ZeroR, J48 and RandomForest.\n5) Evaluation: For a performance measurement, we did a 10-fold cross-validation of the\ndataset, and the confusion matrix was obtained to estimate four measures: accuracy, sensitivity, specificity and F-measure. As a result, RandomForest had the highest accuracy of 77.58%, followed by SMO with 76.86%, J48 with 75.27%, ZeroR with 70.24% and NavieBayes with 42.96%, as shown in Table 4. RandomForest and SMO have the same F-\nmeasures. The reason for the best performance by RandomForest is that it works relatively well when used with high-dimensional data with a redundant/noisy set of features [12]."
    }, {
      "heading" : "6.2. Experiment 2: Average Medical Lab Tests Feature Selection",
      "text" : "1) Experiment Goal: The goal of this experiment was to study the relationship between feature selection and classification accuracy. Feature selection is one of the dimensionality\nreduction techniques for reducing the attribute space of a feature set. More precisely, it determines how many features should be enough to give moderate accuracy. 2) Building the Dataset: In this experiment we used the same dataset that we used in experiment 1. 3) Pre-processing: In this experiment we built ten datasets depending on the number of selected features. We start with the first dataset, which contained only 10% of the total\nattributes. Then each time, we increased the total feature selections by 10%. For example, dataset 1 contains 10% of the total attributes, dataset 2 contains 20% of the total attributes, dataset 3 contains 30% of the total attributes and so on till dataset 10 contains all 100% of the total attributes. For feature selection, we use supervised.attribute. InfoGainAttributeEval from WEKA. This filter is a wrapper for the Weka class that computes the information gain on a class [18].\n Attribute Subset Evaluator: InfoGainAttributeEval\n Search Method: Ranker.\n Evaluation mode: evaluate all training data\n4) Base learner: After generating all of the reduced datasets, we use the J48 algorithm to construct a model.\n5) Evaluation: For each reduced dataset, we applied 10-fold cross-validation for evaluating the\naccuracy. Table V shows the results in numbers, and Figure 2 shows them as a chart. The results indicate that taking only the most related 10% of the total features can give a 75.10% accurate result, which is comparable to the accuracy of the full feature set. This indicates that not all of the features are required to get the highest accuracy. However, there are some fluctuations, such as at 20%, the accuracy drops a little. We conclude that selecting 50 to 80% of the attributes should give moderately satisfying accuracy.\n6.3. Experiment 3: Building a Baseline for the Total Number of Medical Lab Tests\n1) Experiment Goal: The goal of this experiment was to investigate the effect of the total number of lab tests conducted on predicting patient deterioration. Usually, medical\nprofessionals keep requesting the same medical test over a brief period to compare the result with a reference range [17]. If the value is not within the range, it means the patient may be in danger, so the test is repeated again and again. Our goal was to predict at what total number a medical professional should start immediate action and, more precisely, how the total number of medical lab tests could assist the medical professional in evaluating the patient’s status. 2) Building the Dataset: The dataset was built by taking the total number of tests taken for each patient for each type of test and make it one attribute. Then one patient would be\nrepresented as one instance having 700 attributes, one for each test. If a test was not done, then the value of that attribute would be 0. For example, the dataset would look like this: P_ID Count1 Count2 … Count700 Dead/Alive 1 5 0 1 D\n3) Pre-processing: The dataset was randomized first, then two datasets were generated, Count_Training_Validation_Dataset and Count_testing_Dataset. This step was repeated ten\ntimes because we used randomization to distribute the instances between the two datasets.\n4) Base learners: Five learning algorithms were used to build the model, namely NaiveBayes, SMO, ZeroR, J48 and RandomForest.\n5) Evaluation: The training data were first used to build the model and then evaluated using a\npercentage split via test data. For a performance measurement, the confusion matrix was obtained to estimate four measures: accuracy, sensitivity, specificity and F-measure. Table 6 shows that SMO and RandomForest have almost equal levels of accuracy, around 75%. Even after testing the model with the test datasets, SMO and RandomForest still have the highest accuracy among the other techniques. The reason for this higher accuracy is that the amount of memory required for SMO is linear in the training set size, which allows SMO to handle very large training sets [11]."
    }, {
      "heading" : "6.4. Experiment 4: Feature Selection for Total Number of Medical Lab Tests",
      "text" : "1) Experiment Goal: The goal of this experiment was to study the relationship between feature selection and classification accuracy. Feature selection is one of the dimensionality\nreduction techniques for reducing the attribute space of a feature set. More precisely, it measures how many features should be enough to give moderate accuracy. 2) Building the Dataset: In this experiment we used a count dataset. 3) Pre-processing: In the pre-processing step, we built ten datasets depending on the number of\nselected features. The first dataset contained only 10% of the total attributes. Then we increased the total feature selections by 10% with each new dataset. For example, dataset 1 contained 10% of the total attributes, dataset 2 contained 20% of the total attributes, dataset 3 contained 30% of the total attributes and so on till dataset 10 contained all 100% of the total attributes. 4) For feature selection, we used supervised.attribute. InfoGainAttributeEval from WEKA. This filter is a wrapper for the Weka class that computes the information gain on a class\n[18].\n Attribute Subset Evaluator: InfoGainAttributeEval\n Search Method: Ranker.\n Evaluation mode: evaluate on all training data\n5) Base learner: After generating all reduced datasets, we used the J48 algorithm as a base learner.\n6) Evaluation: Each feature-reduced dataset went through a 10-fold cross-validation for evaluation. Figure 3 shows the accuracy of all count datasets. The detail values are also\nreported in Table 4. From the results we observe that selecting 60 to 70% of the attributes gives the highest accuracy. This also concludes that all features (i.e., lab tests) may not be necessary to attain a highly accurate prediction of patient deterioration."
    }, {
      "heading" : "7. DISCUSSION",
      "text" : "It should be noted that the feature selections were done without any domain knowledge and without any intervention from medical experts. However, in the analysis we would like to emphasize the merit of feature selection in choosing the best tests, which could be further verified and confirmed by a medical expert.\nFirst we compare the selected features selected from the two datasets, namely the average dataset and the count dataset. Table 9 shows the 10 best features chosen by the two approaches and highlights the common lab tests between the two approaches (i.e. using the average of tests and count of tests). Table 10 shows more details about the common tests.\nDetailed Description\nT es\nt_ N\na m\ne\nF lu\nid\nC a\nte g\no ry\nL O\nIN C\n_ C\no d\ne\nL O\nIN C\n_ D\nes c\n50440 PTT\nB L\nO O\nD\nH E\nM A\nT O\nL O\nG Y\n3173-2 Activated partial thromboplastin time\n(aPTT) in blood by coagulation assay\n50439 PT\nB L\nO O\nD\nH E\nM A\nT O\nL O\nG Y\n5964-2 Prothrombin time (PT) in blood by\ncoagulation assay\n50112 GLUCOSE\nB L\nO O\nD\nC H\nE M\nIS T\nR Y\n2345-7 Glucose [mass/volume] in serum or plasma\nLOINC is an abbreviation for logical observation identifiers names and codes. LOINC is clinical terminology important for laboratory test orders and results [19]. ARUP Laboratories [20] is a national clinical and anatomic pathology reference laboratory and a worldwide leader in innovative laboratory research and development. We used their web page and others to clarify more about the medical lab tests in table 10 as follows:\n UREAN (50177): This test is conducted using the patient’s blood. This test is recommended to screen for kidney dysfunction in patients with known risk factors (e.g.\nhypertension, diabetes, obesity, family history of kidney disease). The panel includes albumin, calcium, carbon dioxide, creatinine, chloride, glucose, phosphorous, potassium, sodium and BUN and a calculated anion gap value. Usually, the result is reported within 24 hours [20].\n CREAT (50090): This test is conducted using the patient’s blood. It is a screening test to evaluate kidney function [20].\n INR(PT) (50399): This test is conducted using the patient’s blood by coagulation assay [13].\n PTT (50440): This test is carried out to answer two main questions: does the patient have antiphospholipid syndrome (APLS), and does the patient have von Willebrand\ndisease? If so, which type? It is carried out by mechanical clot detection [21].\n PT (50439): This test is conducted using the patient’s blood by coagulation assay [13].\n GLUCOSE (50112): This test is used to check glucose, which is a common medical analytic measured in blood samples. Eating or fasting prior to taking a blood sample has\nan effect on the result. Higher than usual glucose levels may be a sign of prediabetes or diabetes mellitus [22].\n The result of the top 10 selected features from the average dataset allows us to build a model using decision tree J48. This model would allow a medical professional to\npredict the status of a patient in the ICU as follows:\n50440 <= 20.757143: 1 (772.0/22.0) 50440 > 20.757143 | 50177 <= 25.923077 | | 50060 <= 0 | | | 50112 <= 138.333333 | | | | 50383 <= 28.155556 | | | | | 50112 <= 110.470588 | | | | | | 50399 <= 1.204545: 0 (5.0)\nFor example, if the lab test (name: PTT, ID 50440, LOINC: 3173-2) result value is <= 20.757143, then the probability is very high (772.0/22.0~ 97.2%) that the patient is going to die (class:1). This model has 78.6897% overall accuracy."
    }, {
      "heading" : "8. CONCLUSION AND FUTURE WORK",
      "text" : "In this paper, we presented our proposed approach to reduce the observation time in the ICU by predicting patient deterioration in its early stages. In our work, we presented experiments 1 and 3 to build a model to predict patient deterioration. Experiments 2 and 4 identified the most important medical lab tests, then highlighted the common tests between the two datasets. The four experiments would help medical professionals to take better decisions in a very short time.\nFor future work, the authors are planning to carry out more experiments using bigger data. Big data analytics would bring potential benefits to support taking the right decision to enhance the efficiency, accuracy and timeliness of clinical decision making in the ICU."
    } ],
    "references" : [ {
      "title" : "Big data analytics in healthcare: promise and potential",
      "author" : [ "Raghupathi", "Wullianallur", "Raghupathi", "Viju" ],
      "venue" : "Health Inf. Sci. Syst., vol. 2, no. 1, p. 3, 2014.",
      "citeRegEx" : "2",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "An integrated data mining approach to real-time clinical monitoring and deterioration warning",
      "author" : [ "Yi Mao", "Wenlin Chen", "Yixin Chen", "Chenyang Lu", "Marin Kollef", "Thomas Bailey" ],
      "venue" : "Knowledge discovery and data mining, 2012, pp. 1140–1148.",
      "citeRegEx" : "3",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Mining the Big Data: The Critical Feature Dimension Problem",
      "author" : [ "Q. Liu", "Sung", "Andrew H", "Ribeiro", "Bernardete", "Suryakumar", "Divya" ],
      "venue" : "Adv. Appl. Inform. IIAIAAI 2014 IIAI 3rd Int. Conf. On, pp. 499–504, 2014.",
      "citeRegEx" : "4",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Reducing unnecessary lab testing in the ICU with artificial intelligence",
      "author" : [ "Federico Cismondi", "Leo A. Celi", "André S. Fialho", "Susana M. Vieira", "Shane R. Reti", "Joao MC Sousa", "Stan N. Finkelstein" ],
      "venue" : "Int. J. Med. Inf., vol. 82, no. 5, pp. 345–358, 2013.",
      "citeRegEx" : "5",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "A review of feature selection techniques in bioinformatics",
      "author" : [ "Yvan Saeys", "Iñaki Inza", "Pedro Larrañaga" ],
      "venue" : "bioinformatics, vol. 23, no. 19, pp. 2507–2517, 2007.",
      "citeRegEx" : "6",
      "shortCiteRegEx" : null,
      "year" : 2007
    }, {
      "title" : "Ant Colony Optimization Algorithm for Interpretable Bayesian Classifiers Combination: Application to Medical Predictions",
      "author" : [ "S. Bouktif" ],
      "venue" : "PLoS ONE, vol. 9, no. 2, 2014.",
      "citeRegEx" : "8",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Top 10 algorithms in data mining",
      "author" : [ "X. Wu" ],
      "venue" : "Knowl. Inf. Syst., vol. 14, no. 1, pp. 1–37, 2008.",
      "citeRegEx" : "9",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "Evaluation of Different Classification Techniques for WEB Data",
      "author" : [ "Chitra Nasa", "Suman" ],
      "venue" : "Int. J. Comput. Appl., vol. 52, no. 9, 2012.",
      "citeRegEx" : "10",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Sequential Minimal Optimization: A Fast Algorithm for Training Support Vector Machines",
      "author" : [ "John C. Platt" ],
      "venue" : "Adv. Kernel Methods—support Vector Learn., vol. 3, 1999.",
      "citeRegEx" : "11",
      "shortCiteRegEx" : null,
      "year" : 1999
    }, {
      "title" : "Random Forests",
      "author" : [ "Leo Breiman" ],
      "venue" : "Mach. Learn., vol. 45, no. 1, pp. 5–32, 2001.",
      "citeRegEx" : "12",
      "shortCiteRegEx" : null,
      "year" : 2001
    }, {
      "title" : "Customized prediction of short length of stay following elective cardiac surgery in elderly patients using a genetic algorithm",
      "author" : [ "J Lee", "S Govindan", "L Celi", "K Khabbaz", "B Subramaniam" ],
      "venue" : "World J Cardiovasc Surg, vol. 3, no. 5, pp. 163–170, Sep. 2013.",
      "citeRegEx" : "14",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Methods of blood pressure measurement in the ICU",
      "author" : [ "LH Lehman", "M Saeed", "D Talmor", "R Mark", "A Malhotra" ],
      "venue" : "Crit Care Med, vol. 41, no. 1, pp. 34–40, 2013.",
      "citeRegEx" : "15",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Latent topic discovery of clinical concepts from hospital discharge summaries of a heterogeneous patient cohort",
      "author" : [ "L Lehman", "W Long", "M Saeed", "R Mark" ],
      "venue" : "Proceedings of the 36th International Conference of the IEEE Engineering in Medicine and Biology Society, 2014.",
      "citeRegEx" : "16",
      "shortCiteRegEx" : null,
      "year" : 2014
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "Such data can be called big data due to their complexity, large size and difficulty to process in real-time [2].",
      "startOffset" : 108,
      "endOffset" : 111
    }, {
      "referenceID" : 1,
      "context" : "In [3], the authors developed an integrated data-mining approach to give early deterioration warnings for patients under real-time monitoring in the ICU and real-time data sensing (RDS).",
      "startOffset" : 3,
      "endOffset" : 6
    }, {
      "referenceID" : 2,
      "context" : "A health-data search engine was developed in [4] that supported predictions based on the summarised clusters patient types which claimed that it was better than predictions based on the non-summarised original data.",
      "startOffset" : 45,
      "endOffset" : 48
    }, {
      "referenceID" : 2,
      "context" : "[4] investigated the critical feature size dimension.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 4,
      "context" : "A survey of feature selection is presented in [6].",
      "startOffset" : 46,
      "endOffset" : 49
    }, {
      "referenceID" : 3,
      "context" : "[5] proposed reducing unnecessary lab testing in the ICU.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 0,
      "context" : "Big data has potential to support a wide range of medical and healthcare functions, including clinical decision support [2].",
      "startOffset" : 120,
      "endOffset" : 123
    }, {
      "referenceID" : 7,
      "context" : "It is about the ‘extraction of interesting (non-trivial, implicit, previously unknown, and potentially useful) patterns or knowledge from huge amount of data [10]’.",
      "startOffset" : 158,
      "endOffset" : 162
    }, {
      "referenceID" : 2,
      "context" : "Appropriate sampling and feature selection contribute to reducing the size of the dataset while obtaining satisfactory results in model building [4].",
      "startOffset" : 145,
      "endOffset" : 148
    }, {
      "referenceID" : 4,
      "context" : "In the context of classification, feature selection techniques can be organized into three categories, depending on how they perform the feature selection search to build the classification model: filter methods, wrapper methods and embedded methods, presented in table 1 [6] [7]:",
      "startOffset" : 272,
      "endOffset" : 275
    }, {
      "referenceID" : 5,
      "context" : "It requires the construction of a model that approximates the relationship between input features and output categories [8].",
      "startOffset" : 120,
      "endOffset" : 123
    }, {
      "referenceID" : 6,
      "context" : "However, it has class conditional independence, meaning it causes losses of accuracy and dependency [9].",
      "startOffset" : 100,
      "endOffset" : 103
    }, {
      "referenceID" : 7,
      "context" : "2) Sequential minimal optimization (SMO) is an algorithm for efficiently solving the optimization problem which arises during the training of support vector machines [10].",
      "startOffset" : 166,
      "endOffset" : 170
    }, {
      "referenceID" : 8,
      "context" : "The amount of memory required for SMO is linear in the training set size, which allows SMO to handle very large training sets [11].",
      "startOffset" : 126,
      "endOffset" : 130
    }, {
      "referenceID" : 7,
      "context" : "Although there is no predictability power in ZeroR, it is useful for determining a baseline performance as a benchmark for other classification methods [10].",
      "startOffset" : 152,
      "endOffset" : 156
    }, {
      "referenceID" : 7,
      "context" : "The decision tree partitions the input space of a data set into mutually exclusive regions, each of which is assigned a label, a value or an action to characterize its data points [10].",
      "startOffset" : 180,
      "endOffset" : 184
    }, {
      "referenceID" : 9,
      "context" : "5) A RandomForest is a combination of tree predictors such that each tree depends on the values of a random vector sampled independently and with the same distribution for all trees in the forest [12].",
      "startOffset" : 196,
      "endOffset" : 200
    }, {
      "referenceID" : 10,
      "context" : "Several works have used the MIMIC dataset, such as [14], [15] and [16].",
      "startOffset" : 51,
      "endOffset" : 55
    }, {
      "referenceID" : 11,
      "context" : "Several works have used the MIMIC dataset, such as [14], [15] and [16].",
      "startOffset" : 57,
      "endOffset" : 61
    }, {
      "referenceID" : 12,
      "context" : "Several works have used the MIMIC dataset, such as [14], [15] and [16].",
      "startOffset" : 66,
      "endOffset" : 70
    }, {
      "referenceID" : 9,
      "context" : "The reason for the best performance by RandomForest is that it works relatively well when used with high-dimensional data with a redundant/noisy set of features [12].",
      "startOffset" : 161,
      "endOffset" : 165
    }, {
      "referenceID" : 8,
      "context" : "The reason for this higher accuracy is that the amount of memory required for SMO is linear in the training set size, which allows SMO to handle very large training sets [11].",
      "startOffset" : 170,
      "endOffset" : 174
    } ],
    "year" : 2015,
    "abstractText" : "A huge amount of medical data is generated every day, which presents a challenge in analysing these data. The obvious solution to this challenge is to reduce the amount of data without information loss. Dimension reduction is considered the most popular approach for reducing data size and also to reduce noise and redundancies in data. In this paper, we investigate the effect of feature selection in improving the prediction of patient deterioration in ICUs. We consider lab tests as features. Thus, choosing a subset of features would mean choosing the most important lab tests to perform. If the number of tests can be reduced by identifying the most important tests, then we could also identify the redundant tests. By omitting the redundant tests, observation time could be reduced and early treatment could be provided to avoid the risk. Additionally, unnecessary monetary cost would be avoided. Our approach uses state-ofthe-art feature selection for predicting ICU patient deterioration using the medical lab results. We apply our technique on the publicly available MIMIC-II database and show the effectiveness of the feature selection. We also provide a detailed analysis of the best features identified by our approach.",
    "creator" : "Microsoft® Word 2013"
  }
}