{
  "name" : "1511.06348.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : null,
    "authors" : [ "Junghwan Cho", "Kyewook Lee", "Ellie Shin", "Garry Choy" ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : null,
      "text" : "ar X\niv :1\n51 1.\n06 34\n8v 1\n[ cs\n.L G\n] 1\n9 N\nov 2\n01 5"
    }, {
      "heading" : "1 INTRODUCTION",
      "text" : "The rapidly increasing amount of medical images and modalities that must be considered presents a growing risk for human error and delayed diagnosis. The current answer to these concerns remains the computer aided detection (CADe) and diagnosis (CADx) systems. However, despite recent development and improvement of these systems, they remain limited in their potential by their use of hand-crafted features (Shiraishi et al. (2011)). This limitation suggests the potential of a deep-learning approach, which would rather allow the system to extract these features itself (Jones (2014)). However, while recent years have shown significant advances in image classification problems using Convolutional Neural Networks (CNN), its potential in medical applications has only been minimally explored (Ypsilantis et al. (2015), Hua et al. (2015)).\nLarge medical image data sets within a hospital Picture Archiving and Communication System (PACS) combined with advanced high performance parallel computing promises the capacity to accelerate a machine learning technique to more accurately detect clinical imaging findings and diagnose specific diseases (Roth et al. (2015b), Roth et al. (2015a)). This potential is heightened by the qualifications and characteristics of medical images that make them so ideal for deep learning.\nHowever, while medical images present an ideal format and structure for deep learning, it is difficult to secure a large quantity of such medical images because of patient privacy and security policies, such as the Health Insurance Portability and Accountability Act (HIPAA) privacy rule. Regardless of such limitations, such a platform presents an uncompromisable necessity to be of the highest accuracy, consistent in its performance, and fast, as its functionality is directly linked to human life.\nTogether, these concerns present the crucial question of how much data is needed to train a medical image deep learning system to achieve necessary high accuracy. Several approaches to this question\n∗This project is approved by Institutional Review Board of Massachusetts General Hospital.\nhave been introduced and explored in different applications (Figueroa et al. (2012), Beleites et al. (2013), Dobbin & Simon (2007), Dobbin et al. (2008)). Upon thorough evaluation and consideration of these approaches, we chose the learning curve method due to its shown promise and robustness within other applications (Figueroa et al. (2012)).\nIn this paper, we present our initial results from applying deep learning to medical image classification and our approach to determining the ideal training data size to achieve high accuracy. While the learning curve will vary for different problems within this application, our work presents a general methodology that can be easily applied to such different problems to generate learning curves and determine respective necessary target data set sizes."
    }, {
      "heading" : "1.1 MEDICAL IMAGE UNIQUENESS",
      "text" : "Compared to natural images, medical images have unique characteristics well fitted to machine learning. The potential of medical image deep learning platforms is heightened by the unique inherent characteristics of medical images that make them ideal for machine learning.\nFirst, all the images are standardized. Medical images are acquired from many different modalities (i.e., X-ray radiography, Mammography, Ultrasound, Computed Tomography (CT), Magnetic Resonance Image (MRI), Positron Emission Tomography (PET), Single Photon Emission Computed Tomography (SPECT) etc). However, all the resulting images must be saved and archived in a single format, the Digital Imaging and Communications in Medicine (DICOM) format. DICOM file meta data include the field of view of image, matrix size, pixel pitch, slice thickness, imaging modality, bit resolution, scan protocol, patient information, etc. DICOM files are easy to handle, store, print, and transmit because they include a file format definition and a network communications protocol. Resultingly, the DICOM format is used by all medical imaging systems to generate images and by Picture Archiving and Communication System (PACS) to achieve and retrieve images.\nAdditionally, not only are all medical images standardized by format, they are also regulated for high quality. Since the quality of medical images directly affects patient safety and quality of healthcare, all hospitals have a quality control division or committee to constantly ensure that the image quality meets the required compliance.\nLastly, all images come with manually annotated radiologist’s reports which are structured to report their findings, impressions, and diagnoses, saved in the Electronic Health Record (EHR). These reports present an extremely useful resource for supervised medical image machine learning. However, it is difficult to obtain access to these images as medical images are protected by the Health\nInsurance Portability and Accountability Act (HIPAA) security rule, which protects a patient’s medical records and other personal health information.\nAs a result, medical data sets are stored within the secure storage system in a hospital, and strict guidelines are put in place even after an anonymization process. Despite the availability of government research center repositories with medical images available for the use of healthcare research (i.e., National Biomedical Imaging Archive (NBIA), Digital Database for Screening Mammography (DDSM), Digital Retinal Images for Vessel Extraction (DRIVE) etc), it remains extremely difficult to find a database with millions of cases."
    }, {
      "heading" : "2 MATERIAL AND METHOD",
      "text" : ""
    }, {
      "heading" : "2.1 DATA ACQUISITION",
      "text" : "We first compiled a database of the CT images of patients from the clinical PACS of MGH with an Institutional Review Board (IRB) approval. We developed a preprocessing software to annotate and categorize these images into which body part is represented: brain, neck, shoulder, chest, abdomen, and pelvis.\nAs can be seen in Figure 1(A), we only utilized the scans of regions that could be clearly defined as one of the aforementioned body parts. The gaps account for transition regions, which were not used for a training algorithm due to their lack of clear regional definition.\nIn the axial CT image, each scan has different noise level because of different radiation dosage and different image reconstruction filters and different CT vendors. Also, each image voxel has different pitch because of image reconstruction fields are different. The slice thickness of each image are thicker than axial voxel pitch so voxel is anisotropic usually axial pixel pitch is (i.e., dx = dy = 0.3 ∼ 0.6mm) and slice thickness varies by image reconstruction parameters. (i.e., dz = 3 ∼ 5mm)"
    }, {
      "heading" : "2.2 CONVOLUTIONAL NEURAL NETWORK",
      "text" : "The body part classification problem is an important step in initial classification process for eventual disease classification and abnormal area detection problems. In addressing this problem, several issues must be considered. First, anatomical structures and the details of body regions vary dramatically between patients (i.e., complex brain areas, small bone structures in the neck, small lung nodules and thin pleura in the chest, closely located organs in the abdomen region). Also, major bone structures in the shoulder and pelvis lead to artifacts on medical images. As a result, it is possible that a huge training data set will be necessary for our algorithm to achieve the desired accuracy.\nAccordingly, the processing of such big data necessitates a robust algorithm. Over the years, many deep convolutional neural network algorithms have been proposed for natural image classification, such as GoogLeNet (Szegedy et al. (2014)), AlexNet (Krizhevsky et al. (2012)), ClarifaiNet (Zeiler & Fergus (2014)), VGGNet (Simonyan & Zisserman (2014)) etc. After extensive review of these algorithm, we chose to implement and use GoogLeNet for our specific application because it is computationally efficient and provides high quality classification based on the Hebbian principle and multi-scale processing as compared to other convolutional neural networks (CNN).\nThe typical CNN framework consists of several convolutional and sub-sampling layers, followed by a fully connected traditional multiple layer perceptron. The GoogLeNet uses 22 convolutional layers including 9 Inception modules and 4 different size of basis or kernel filters (i.e., 7 × 7, 5 × 5, 3 × 3, and 1 × 1). CNN algorithms can learn the basis vectors of images and extract useful higher-level features through a hierarchical process. Accordingly, feature maps were extracted by convolution from the learned basis vectors of input medical CT images since each body part has different anatomical structures (Roth et al. (2015a)). Currently, we are working on improving upon this baseline algorithm to further customize it for medical images.\nWe then ran the GoogLeNet network using the NVIDIA Deep Learning GPU Training System (DIGITS) DevBox, a deep learning optimized machine with four TITAN GPUs with 7 TFlops of single precision, 336.5 GB/s of memory bandwidth, and 12 GB of memory per board, to train our model using each experimental data set. The convolution filters of the GoogLeNet network were trained\nusing stochastic gradient descent (SGD) algorithms until it ran to 200 training epochs. Validation data sets were presented upon every epoch during the training process. The initial base learning rate was 0.01 and decreased by three steps according to the convergence to object function."
    }, {
      "heading" : "2.3 LEARNING CURVE",
      "text" : "The classification accuracy of deep-learning classifiers is largely dependent on the size of high quality initial training data sets. As a result, the investigation of how large a training data set is needed to achieve the target accuracy for anatomy image classification is imperative.\nThe learning curve approach of modeling classification performance as a function of the training sample size can predict the sample size needed to train a certain image classification system. Generally, this curve model is represented as an inverse power law function (Figueroa et al. (2012)) The classification accuracy (y) is expressed as a function of the training set size (x) where given unknown parameter (b = b1, b2). The learning curve was modeled by the following equation.\ny = f(x; b) = 100 + b1 · xb2 (1)\nwhere x = [x1, x2, · · · , x6]T , y = [y1, y2, · · · , y6]T , and b = [b1, b2]T . b1 and b2 represent the learning rate and decay rate respectively (Figueroa et al. (2012)). The model fit assumes that the classification accuracy (y) grows asymptotically to 100%, or maximum achievable performance.\nUsing the observed classification accuracy at six different sizes of training sets (5, 10, 20, 50, 100, and 200), unknown parameters (b = [b1, b2]T ) were estimated using weighted nonlinear regression (Jang et al. (1997)). Given a set of m = 6 training data pairs (x, t) = {(xp, tp) : p = 1, · · · ,m}, we find the optimal (b = [b1, b2]T ) that minimizes the sum of squared errors:\nE(b) = m∑\np=1\nwp · (tp − yp) 2 (2)\n=\nm∑\np=1\nwp · (tp − f(xp, b))2 (3)\n=\nm∑\np=1\nwp · rp(b)2 (4)\n= RTWR (5)\nwhere tp is the desired output when input is xp; yp = f(xp; b) is the model’s output when input is xp; rp(b) is the residual between tp and yp and R is the matrix form. The weight terms wp in the diagonal matrix W can be determined by applications. The weighted nonlinear least-squares estimator is more appropriate than a regular nonlinear regression method to fit the learning curve when measurement errors do not all have the same variance (Dennis Jr et al. (1981)).\nSince the observed classification accuracy using the larger sizes of training sets (such as 100 and 200) had a lower variance than when using smaller sample sizes (such as 5, 10, 20, and 50), the learning curve was fitted by higher weighting values at the points of larger data set sizes. We chose wp = {1, 1, 1, 1, 100, 150} in this study but it will be wp = {1, 1, 1, 1, 1, 1, 1} for unweighted nonlinear least-squares estimator."
    }, {
      "heading" : "3 RESULTS AND DISCUSSIONS",
      "text" : "Using the Caffe (Jia et al. (2014)) and GoogLeNet network implemented on DIGITS DevBox, we conducted six different experiments using varying sizes of training data sets and recorded the resulting classification accuracy. Each experiment was repeated 10 times for each body part and validated using data sets (25% randomly selected from each training set). We then tested the trained model by introducing 1000 new images of each body class, a total of 6000 CT images in this study but will be increased continuously.\nFigure 2 shows representative classification accuracy results for the testing of one repetition of the 200 training size. For all defined body parts, the classification accuracy was near or at 100%, as shown in Figure 2(A) and (C). In addition, although the system was not trained on any images of transition regions, it was able to infer with considerable accuracy the body parts in transition of such images, as shown in Figure 2(B). This ability of the system to classify images outside of just the six that it was trained on shows immense promise of future development of human anatomy learning algorithms not limited to specific regions but with the ability to classify any image of human anatomy.\nIn this classification application, a tested image is correctly recognized as the target class if it results in above a 95% recognition rate. It should also be noted that while the images presented to be tested varied in spatial complexity and variability, the deep learning classifier was still able to correctly identify nearly all of the images based off of feature recognition from its training period.\nFigure 3 shows tested CT images and their Inception (3a) modules outputs from GoogLeNet. Even though the nine images of the same anatomic region present a wide range of spatial complexity and variability, our trained system was able to extract and identify shared similar features at the level of Inception.\nThe average results for each body part and the whole body are summarized on Table 1. For all body parts, larger sets of training data led to increased accuracy in classification. This is further evidenced in Figure 4, which graphically shows that the number of misclassified images decreases for each body part with increasingly larger sets of training data. Figure 4(B) also shows that the standard deviation of misclassified images across each experiment repetition decreased with increasing training size except for the 5 and 10 sample sizes. Since too small a sample size led to high misclassification, it had a low standard deviation.\nWhen determining the size of the training data, our primary aim was to achieve high classification accuracy with low standard deviation. The learning curve described in Section 2 was fitted using the observed classification accuracy according to a given training sample size (5, 10, 20, 50, 100, and 200). As shown in Figure 5, the curve much better fit the data points at large sample sizes (100 and 200) by the weighted least square estimator. The classification accuracy increased rapidly from training size 5 to 50, while the accuracy did not increase significantly from training size 100 to 200. After that, the learning curve reached a steady state and did not change much in accuracy regardless of training size.\nWe also recorded the standard deviation at the six different sizes of training data set. A larger sample size led to a lower standard deviation, exemplified by the predicted classification at the 200 sample size being more accurately and consistently located in the true mean value than at the 20 sample size. The learning curve well predicted a 98% classification accuracy for the training data size of 1000 per body class, with the observed actual accuracy at 97.25%. Based on this learning curve, we can predict that our particular deep learning classifier needs a training data set per class of 4092 to reach the desired accuracy, 99.5%. Accordingly, we will start from a baseline training data set per class size of 5,000 and steadily increase from there in order to achieve a much higher system accuracy."
    }, {
      "heading" : "4 CONCLUSION",
      "text" : "While applications of medical image deep learning analysis have only recently begun to be explored, the potentials of such systems are immense due to the unique characteristics of medical images that make them ideal for deep learning. For example, all medical images are regulated for extremely high quality and also manually annotated with a radiologist’s report, or a ground truth. These qualities are especially ideal and necessary as such systems require exceptionally high sensitivity and specificity due to their their importance in disease diagnosis and treatment planning. However, patient privacy laws and policies make access to such medical images very difficult, presenting one of the most important questions as we move forward in the field of medical image machine learning - Exactly how large does our training data set have to be to solve a specific classification or detection problem with high accuracy?\nWe present a learning curve extrapolation method to estimate the required training data size, whose methodology is theoretically well formulated in other fields and similarly provided agreeable results\nwhen applied to our system. Further, it can be applied to future problems in medical image deep learning analysis. As the problem changes, the shape of the learning curve will also change.\nIn order to accurately predict the size and shape of that learning curve, three prerequisites must be met: (1) the training data set must be of high quality, (2) the sampling points must be able to be systematically increased, and (3) each point must be able to be repeated in order to accurately estimate the statistical mean.\nFuture applications of our work will extend our body part classification to disease classification and organ classification, and also the implementation of abnormal area detection algorithm for each body part. In addition, our approach can be extended to countless other medical imaging modalities."
    } ],
    "references" : [ {
      "title" : "Sample size planning for classification models",
      "author" : [ "Beleites", "Claudia", "Neugebauer", "Ute", "Bocklitz", "Thomas", "Krafft", "Christoph", "Popp", "Jürgen" ],
      "venue" : "Analytica chimica acta,",
      "citeRegEx" : "Beleites et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Beleites et al\\.",
      "year" : 2013
    }, {
      "title" : "An adaptive nonlinear least-squares algorithm",
      "author" : [ "Dennis Jr.", "John E", "Gay", "David M", "Walsh", "Roy E" ],
      "venue" : "ACM Transactions on Mathematical Software (TOMS),",
      "citeRegEx" : "Jr et al\\.,? \\Q1981\\E",
      "shortCiteRegEx" : "Jr et al\\.",
      "year" : 1981
    }, {
      "title" : "Sample size planning for developing classifiers using high-dimensional dna microarray",
      "author" : [ "Dobbin", "Kevin K", "Simon", "Richard M" ],
      "venue" : "data. Biostatistics,",
      "citeRegEx" : "Dobbin et al\\.,? \\Q2007\\E",
      "shortCiteRegEx" : "Dobbin et al\\.",
      "year" : 2007
    }, {
      "title" : "How large a training set is needed to develop a classifier for microarray data",
      "author" : [ "Dobbin", "Kevin K", "Zhao", "Yingdong", "Simon", "Richard M" ],
      "venue" : "Clinical Cancer Research,",
      "citeRegEx" : "Dobbin et al\\.,? \\Q2008\\E",
      "shortCiteRegEx" : "Dobbin et al\\.",
      "year" : 2008
    }, {
      "title" : "Predicting sample size required for classification performance",
      "author" : [ "Figueroa", "Rosa L", "Zeng-Treitler", "Qing", "Kandula", "Sasikiran", "Ngo", "Long H" ],
      "venue" : "BMC medical informatics and decision making,",
      "citeRegEx" : "Figueroa et al\\.,? \\Q2012\\E",
      "shortCiteRegEx" : "Figueroa et al\\.",
      "year" : 2012
    }, {
      "title" : "Computer-aided classification of lung nodules on computed tomography images via deep learning technique",
      "author" : [ "Hua", "Kai-Lung", "Hsu", "Che-Hao", "Hidayati", "Shintami Chusnul", "Cheng", "Wen-Huang", "Chen", "Yu-Jen" ],
      "venue" : "OncoTargets and therapy,",
      "citeRegEx" : "Hua et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Hua et al\\.",
      "year" : 2015
    }, {
      "title" : "Neuro-fuzzy and soft computing; a computational approach to learning and machine intelligence",
      "author" : [ "Jang", "Jyh-Shing Roger", "Sun", "Chuen-Tsai", "Mizutani", "Eiji" ],
      "venue" : null,
      "citeRegEx" : "Jang et al\\.,? \\Q1997\\E",
      "shortCiteRegEx" : "Jang et al\\.",
      "year" : 1997
    }, {
      "title" : "Caffe: Convolutional architecture for fast feature embedding",
      "author" : [ "Jia", "Yangqing", "Shelhamer", "Evan", "Donahue", "Jeff", "Karayev", "Sergey", "Long", "Jonathan", "Girshick", "Ross", "Guadarrama", "Sergio", "Darrell", "Trevor" ],
      "venue" : "In Proceedings of the ACM International Conference on Multimedia,",
      "citeRegEx" : "Jia et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Jia et al\\.",
      "year" : 2014
    }, {
      "title" : "Imagenet classification with deep convolutional neural networks. In Advances in neural information processing",
      "author" : [ "Krizhevsky", "Alex", "Sutskever", "Ilya", "Hinton", "Geoffrey E" ],
      "venue" : null,
      "citeRegEx" : "Krizhevsky et al\\.,? \\Q2012\\E",
      "shortCiteRegEx" : "Krizhevsky et al\\.",
      "year" : 2012
    }, {
      "title" : "Anatomy-specific classification of medical images using deep convolutional nets",
      "author" : [ "Roth", "Holger R", "Lee", "Christopher T", "Shin", "Hoo-Chang", "Seff", "Ari", "Kim", "Lauren", "Yao", "Jianhua", "Lu", "Le", "Summers", "Ronald M" ],
      "venue" : "arXiv preprint arXiv:1504.04003,",
      "citeRegEx" : "Roth et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Roth et al\\.",
      "year" : 2015
    }, {
      "title" : "Improving computer-aided detection using convolutional neural networks and random view aggregation",
      "author" : [ "Roth", "Holger R", "Lu", "Le", "Liu", "Jiamin", "Yao", "Jianhua", "Seff", "Ari", "Kevin", "Cherry", "Kim", "Lauren", "Summers", "Ronald M" ],
      "venue" : "arXiv preprint arXiv:1505.03046,",
      "citeRegEx" : "Roth et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Roth et al\\.",
      "year" : 2015
    }, {
      "title" : "Computer-aided diagnosis and artificial intelligence in clinical imaging",
      "author" : [ "Shiraishi", "Junji", "Li", "Qiang", "Appelbaum", "Daniel", "Doi", "Kunio" ],
      "venue" : "In Seminars in nuclear medicine,",
      "citeRegEx" : "Shiraishi et al\\.,? \\Q2011\\E",
      "shortCiteRegEx" : "Shiraishi et al\\.",
      "year" : 2011
    }, {
      "title" : "Very deep convolutional networks for large-scale image recognition",
      "author" : [ "Simonyan", "Karen", "Zisserman", "Andrew" ],
      "venue" : "arXiv preprint arXiv:1409.1556,",
      "citeRegEx" : "Simonyan et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Simonyan et al\\.",
      "year" : 2014
    }, {
      "title" : "Going deeper with convolutions",
      "author" : [ "Szegedy", "Christian", "Liu", "Wei", "Jia", "Yangqing", "Sermanet", "Pierre", "Reed", "Scott", "Anguelov", "Dragomir", "Erhan", "Dumitru", "Vanhoucke", "Vincent", "Rabinovich", "Andrew" ],
      "venue" : "arXiv preprint arXiv:1409.4842,",
      "citeRegEx" : "Szegedy et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Szegedy et al\\.",
      "year" : 2014
    }, {
      "title" : "Predicting response to neoadjuvant chemotherapy with pet imaging using convolutional neural networks",
      "author" : [ "Ypsilantis", "Petros-Pavlos", "Siddique", "Musib", "Sohn", "Hyon-Mok", "Davies", "Andrew", "Cook", "Gary", "Goh", "Vicky", "Montana", "Giovanni" ],
      "venue" : "PloS one,",
      "citeRegEx" : "Ypsilantis et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Ypsilantis et al\\.",
      "year" : 2015
    }, {
      "title" : "Visualizing and understanding convolutional networks",
      "author" : [ "Zeiler", "Matthew D", "Fergus", "Rob" ],
      "venue" : "In Computer Vision–ECCV",
      "citeRegEx" : "Zeiler et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Zeiler et al\\.",
      "year" : 2014
    } ],
    "referenceMentions" : [ {
      "referenceID" : 8,
      "context" : "However, despite recent development and improvement of these systems, they remain limited in their potential by their use of hand-crafted features (Shiraishi et al. (2011)).",
      "startOffset" : 148,
      "endOffset" : 172
    }, {
      "referenceID" : 8,
      "context" : "However, despite recent development and improvement of these systems, they remain limited in their potential by their use of hand-crafted features (Shiraishi et al. (2011)). This limitation suggests the potential of a deep-learning approach, which would rather allow the system to extract these features itself (Jones (2014)).",
      "startOffset" : 148,
      "endOffset" : 325
    }, {
      "referenceID" : 8,
      "context" : "However, despite recent development and improvement of these systems, they remain limited in their potential by their use of hand-crafted features (Shiraishi et al. (2011)). This limitation suggests the potential of a deep-learning approach, which would rather allow the system to extract these features itself (Jones (2014)). However, while recent years have shown significant advances in image classification problems using Convolutional Neural Networks (CNN), its potential in medical applications has only been minimally explored (Ypsilantis et al. (2015), Hua et al.",
      "startOffset" : 148,
      "endOffset" : 560
    }, {
      "referenceID" : 5,
      "context" : "(2015), Hua et al. (2015)).",
      "startOffset" : 8,
      "endOffset" : 26
    }, {
      "referenceID" : 5,
      "context" : "(2015), Hua et al. (2015)). Large medical image data sets within a hospital Picture Archiving and Communication System (PACS) combined with advanced high performance parallel computing promises the capacity to accelerate a machine learning technique to more accurately detect clinical imaging findings and diagnose specific diseases (Roth et al. (2015b), Roth et al.",
      "startOffset" : 8,
      "endOffset" : 354
    }, {
      "referenceID" : 5,
      "context" : "(2015), Hua et al. (2015)). Large medical image data sets within a hospital Picture Archiving and Communication System (PACS) combined with advanced high performance parallel computing promises the capacity to accelerate a machine learning technique to more accurately detect clinical imaging findings and diagnose specific diseases (Roth et al. (2015b), Roth et al. (2015a)).",
      "startOffset" : 8,
      "endOffset" : 375
    }, {
      "referenceID" : 1,
      "context" : "have been introduced and explored in different applications (Figueroa et al. (2012), Beleites et al.",
      "startOffset" : 61,
      "endOffset" : 84
    }, {
      "referenceID" : 0,
      "context" : "(2012), Beleites et al. (2013), Dobbin & Simon (2007), Dobbin et al.",
      "startOffset" : 8,
      "endOffset" : 31
    }, {
      "referenceID" : 0,
      "context" : "(2012), Beleites et al. (2013), Dobbin & Simon (2007), Dobbin et al.",
      "startOffset" : 8,
      "endOffset" : 54
    }, {
      "referenceID" : 0,
      "context" : "(2012), Beleites et al. (2013), Dobbin & Simon (2007), Dobbin et al. (2008)).",
      "startOffset" : 8,
      "endOffset" : 76
    }, {
      "referenceID" : 0,
      "context" : "(2012), Beleites et al. (2013), Dobbin & Simon (2007), Dobbin et al. (2008)). Upon thorough evaluation and consideration of these approaches, we chose the learning curve method due to its shown promise and robustness within other applications (Figueroa et al. (2012)).",
      "startOffset" : 8,
      "endOffset" : 267
    }, {
      "referenceID" : 10,
      "context" : "Over the years, many deep convolutional neural network algorithms have been proposed for natural image classification, such as GoogLeNet (Szegedy et al. (2014)), AlexNet (Krizhevsky et al.",
      "startOffset" : 138,
      "endOffset" : 160
    }, {
      "referenceID" : 8,
      "context" : "(2014)), AlexNet (Krizhevsky et al. (2012)), ClarifaiNet (Zeiler & Fergus (2014)), VGGNet (Simonyan & Zisserman (2014)) etc.",
      "startOffset" : 18,
      "endOffset" : 43
    }, {
      "referenceID" : 8,
      "context" : "(2014)), AlexNet (Krizhevsky et al. (2012)), ClarifaiNet (Zeiler & Fergus (2014)), VGGNet (Simonyan & Zisserman (2014)) etc.",
      "startOffset" : 18,
      "endOffset" : 81
    }, {
      "referenceID" : 8,
      "context" : "(2014)), AlexNet (Krizhevsky et al. (2012)), ClarifaiNet (Zeiler & Fergus (2014)), VGGNet (Simonyan & Zisserman (2014)) etc.",
      "startOffset" : 18,
      "endOffset" : 119
    }, {
      "referenceID" : 8,
      "context" : "(2014)), AlexNet (Krizhevsky et al. (2012)), ClarifaiNet (Zeiler & Fergus (2014)), VGGNet (Simonyan & Zisserman (2014)) etc. After extensive review of these algorithm, we chose to implement and use GoogLeNet for our specific application because it is computationally efficient and provides high quality classification based on the Hebbian principle and multi-scale processing as compared to other convolutional neural networks (CNN). The typical CNN framework consists of several convolutional and sub-sampling layers, followed by a fully connected traditional multiple layer perceptron. The GoogLeNet uses 22 convolutional layers including 9 Inception modules and 4 different size of basis or kernel filters (i.e., 7 × 7, 5 × 5, 3 × 3, and 1 × 1). CNN algorithms can learn the basis vectors of images and extract useful higher-level features through a hierarchical process. Accordingly, feature maps were extracted by convolution from the learned basis vectors of input medical CT images since each body part has different anatomical structures (Roth et al. (2015a)).",
      "startOffset" : 18,
      "endOffset" : 1067
    }, {
      "referenceID" : 4,
      "context" : "Generally, this curve model is represented as an inverse power law function (Figueroa et al. (2012)) The classification accuracy (y) is expressed as a function of the training set size (x) where given unknown parameter (b = b1, b2).",
      "startOffset" : 77,
      "endOffset" : 100
    }, {
      "referenceID" : 4,
      "context" : "b1 and b2 represent the learning rate and decay rate respectively (Figueroa et al. (2012)).",
      "startOffset" : 67,
      "endOffset" : 90
    }, {
      "referenceID" : 4,
      "context" : "b1 and b2 represent the learning rate and decay rate respectively (Figueroa et al. (2012)). The model fit assumes that the classification accuracy (y) grows asymptotically to 100%, or maximum achievable performance. Using the observed classification accuracy at six different sizes of training sets (5, 10, 20, 50, 100, and 200), unknown parameters (b = [b1, b2] ) were estimated using weighted nonlinear regression (Jang et al. (1997)).",
      "startOffset" : 67,
      "endOffset" : 436
    }, {
      "referenceID" : 1,
      "context" : "The weighted nonlinear least-squares estimator is more appropriate than a regular nonlinear regression method to fit the learning curve when measurement errors do not all have the same variance (Dennis Jr et al. (1981)).",
      "startOffset" : 202,
      "endOffset" : 219
    }, {
      "referenceID" : 7,
      "context" : "Using the Caffe (Jia et al. (2014)) and GoogLeNet network implemented on DIGITS DevBox, we conducted six different experiments using varying sizes of training data sets and recorded the resulting classification accuracy.",
      "startOffset" : 17,
      "endOffset" : 35
    } ],
    "year" : 2017,
    "abstractText" : "The use of Convolutional Neural Networks (CNN) in natural image classification systems has produced very impressive results. Combined with the inherent nature of medical images that make them ideal for deep-learning, further application of such systems to medical image classification holds much promise. However, the usefulness and potential impact of such a system can be completely negated if it does not reach a target accuracy. In this paper, we present a study on determining the optimum size of the training data set necessary to achieve high classification accuracy with low variance in medical image classification systems. The CNN was applied to classify axial Computed Tomography (CT) images into six anatomical classes. We trained the CNN using six different sizes of training data set (5, 10, 20, 50, 100, and 200) and then tested the resulting system with a total of 6000 CT images. All images were acquired from the Massachusetts General Hospital (MGH) Picture Archiving and Communication System (PACS). Using this data, we employ the learning curve approach to predict classification accuracy at a given training sample size. Our research will present a general methodology for determining the training data set size necessary to achieve a certain target classification accuracy that can be easily applied to other problems within such systems.",
    "creator" : "LaTeX with hyperref package"
  }
}