{
  "name" : "1511.02900.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Neighbourhood NILM: A Big-data Approach to Household Energy Disaggregation",
    "authors" : [ "Nipun Batra", "Amarjeet Singh", "Kamin Whitehouse" ],
    "emails" : [ "nipunb@iiitd.ac.in", "amarjeet@iiitd.ac.in", "whitehouse@virginia.edu" ],
    "sections" : [ {
      "heading" : null,
      "text" : "I. INTRODUCTION\n“Data is the new oil”, so said Ann Winbland, who has been called one most influential people in the digital age. In this paper, we investigate whether “big-data” is more valuable than “precise” data for the problem of energy disaggregation.\nEnergy disaggregation is the process of breaking down the household aggregate energy measured at a single point into constituent appliances, akin the itemised bills we get from grocery stores. The process typically involves measuring household aggregate power using a smart meter, and using a model to break down the aggregate signal. Disaggregated energy can be used to save energy is several ways. For example, utility companies can direct energy conservation programs toward specific homes that have unusually high energy usage for certain appliances. Additionally, energy feedback can help people save energy by creating behavior change. A recent pilot study in 850 homes performed by the power utility PG&E and startup company Bidgely found that eco-feedback including a\nbreakdown of household energy usage helped reduce energy usage by 7.7% on average1.\nHowever, the practical impact of energy disaggregation is limited by three key challenges. First, low-power loads such as lights get lost in the noise of larger loads, even though lighting is the third largest energy consumer in the average home [12]. Second, all existing approaches to disaggregation require a model of each electrical load, and a manual process is required to generate or train these models [14], [19]. Techniques to learn these models automatically are being developed but still have challenges with small loads such as lights and complex loads such as washing machines and dishwashers [4]. Lastly and most importantly, existing disaggregation techniques require power metering with approximately 1 minute sampling intervals [23] and some require rates of 10 kHz or more [3], [10]. However, the advanced metering infrastructure (AMI) that is currently being rolled out around the world provide data with 15-minute or hourly smart meter reads, which is just enough for time-of-use pricing. Companies are developing new technology to extract this information at higher sampling rates2, but the impact of energy disaggregation will grow only linearly with the rate at which this new technology is rolled out.\nIn this paper, we propose a new energy disaggregation technique called Neighborhood NILM to overcome all three of these issues. This technique does not require high frequency data collected using smart meters. Instead, it leverages data from ‘neighbouring’ homes to disaggregate energy given only a single energy reading per month. Neighbourhood NILM can be applied to any home that receives a monthly energy bill, and more frequent data collected through AMI meters could potentially make the approach more accurate. The key intuition behind our approach is that ‘similar’ homes have ‘similar’ energy consumption on a per-appliance basis. Neighborhood NILM requires three steps. First, we assume access to some number of homes with direct submetering infrastructure, i.e. power meters on individual circuits or loads. Many companies are already collecting submetering information from thousands of homes around the world3. Second, we match a new target home with its K nearest neighbours from among the set of submetered homes based on its monthly energy bills, as well as static characteristics of a household such as the size of the home and the number of occupants. These characteristics are often publicly available and are already being used by\n1http://www.bidgely.com/blog/pge-pilot-yields-7-7-energy-savings/ 2http://bit.ly/1LxZDCa 3http://powerhousedynamics.com/\nar X\niv :1\n51 1.\n02 90\n0v 1\n[ cs\n.L G\n] 2\n6 O\nct 2\n01 5\ncompanies to match homes based on similarity4. A home must only match with a small handful of homes in the submetered set in order to perform energy disaggregation. Finally, we estimate the appliance-level energy consumption of the target home to be the average appliance-level energy consumption across its K neighbours.\nUnlike conventional energy disaggregation, the potential of Neighbourhood NILM grows superlinearly as submetering infrastructure is rolled out. Indeed, Neighborhood NILM could probably be provided as a service today by the many companies that already have access to submetering data. Additionally, it does not require any models of power loads to be built or trained. Neighbourhood NILM only needs to decide which features indicate that two homes will be “similar” in terms of appliance-level energy usage, but it determines these features automatically based on the submetered homes, whose true similarity is already known. Finally, Neighbourhood NILM functions even with low-power loads like lights and complex loads like washing machines and dishwashers. Any loads that are directly submetered on the neighboring homes will be disaggregated on the target home.\nWe evaluate this approach using 25 homes from the publicly available Dataport data set [22] that have direct submetering infrastructure installed for one year or more. Results show that our approach gives comparable or better disaggregation performance across all appliances that we explored in comparison to four benchmarks, including state-of-the-art accuracy reported in the literature that depend on manual model training, high frequency power metering, or both. Results show that Neighbourhood NILM can achieve 83% and 79% accuracy disaggregating fridge and heating/cooling loads, compared to 74% and 73% for a technique called FHMM [19]. Furthermore, it achieves up to 64% accuracy on washing machine, dryer, dishwasher, and lighting loads, which is higher than previously reported results. Many existing techniques are not able to disaggregate these loads at all.\n4https://opower.com/\nResults indicate that a “big data” approach that leverages submetering data from neighboring homes compares favourably to collecting high resolution data from a smart meter. Thus, any companies or utilities that want to produce a per-appliance energy breakdown should consider installing submetering infrastructure in a select few homes rather than new high-frequency smart metering infrastucture in all homes."
    }, {
      "heading" : "II. RELATED WORK",
      "text" : "There are three broad categories of related work in the literature: 1) traditional NILM approaches; 2) NILM approaches leveraging large quantities of data; and 3) studies on the inter-relationship between household characteristics and energy consumption. We describe each of these now."
    }, {
      "heading" : "A. Traditional NILM approaches",
      "text" : "Since its inception in the early 1980s by George Hart [14], the field of NILM has seen various approaches based on different machine learning techniques leveraging different features of the power trace. However, many of these approaches require submetered data to learn a model of each appliance and these models have not been shown to generalize well across homes. Even if the models did generalize, these approaches would require high frequency power metering with resolutions of 1- minute or higher. High frequency approaches (>10 kHz) [10] use features such as voltage-current trajectories to detect events in aggregate power time series. All of these techniques grow linearly with the roll out of submetering and smart metering infrastructure. Current smart meters do not collect data at such high rates because they are designed and deployed for the purposes of time-of-use pricing and there are currently no efforts to deploy devices suitable for energy disaggregation on a large scale. Therefore, these techniques while promising must face real practical barriers before going into effect.\nAdditionally, existing approaches for energy disaggregation [14], [19], [23] require a model of each appliance. The main differences between these techniques are how they are created and how they are used to infer the hidden states\nof the appliances based on the aggregate power readings. For example, some systems model appliances as finite state machines (FSMs). However, such approaches generally show poor accuracy on complex appliances such as washing machine and other electronics, as a FSM is a poor model for such appliances. Some systems assume the model is manually generated, learned from training data [14], [19], and in rare cases learned automatically [4]. In all cases, however, the accuracy of these models depends on how well the model approximates the true appliances in the home and it has not yet been demonstrated that these model-based approaches generalize well across homes."
    }, {
      "heading" : "B. NILM approaches leveraging large quantities of data",
      "text" : "In the recent past, large quantities of data, both in the number of homes and time duration have been made available. Recently, the availability of large data has shown a lot of promise in related machine learning fields such as image classification, using deep neural networks. Kelly et al. [17] take inspiration from the success of deep neural networks and apply it to the energy disaggregation problem, where they show that their technique outperforms various benchmarks across all appliances, including appliances which show poor accuracies when modelled as FSMs. Their hypothesis is that given “enough” data, deep neural networks can learn features for an arbitrarily complex appliance and efficiently find its activations while disaggregating. Unlike their approach, which treats each home independently, our approach leverages the “higher order” relationship that exists between homes to disaggregate a home’s total energy. Recently, Gao et al. [13] released a crowd-sourced data set for creating a library of appliance\nsignatures. Like Kelly et al. [17], their work only deals with appliance signatures, without considering relationship between households.\nC. Inter-relationship between household energy and static characteristics\nPrevious work by Beckel et al. [9] has shown that given aggregate energy data for a large number of homes, one can predict various household characteristics such as the family income, number of occupants, area of home. Our work is inspired from their work and shows that various household characteristics can be used to find ‘similarity’ between homes. Additionally, many of the household characteristics that would be used by Neighborhood NILM are publicly available through city records or other sources. These values are already being used today by companies like OPOWER to match households based on similarity, for the purposes of establishing peers and norms of energy usage."
    }, {
      "heading" : "III. APPROACH",
      "text" : "The goal of Neighbourhood NILM algorithm is to predict the energy consumption of household appliances given only a single aggregate energy reading per month. The key intuition behind Neighbourhood NILM is that ‘similar’ homes have ‘similar’ energy consumption on a per-appliance basis. The basic approach is illustrated in Figure 1. First, we assume access to some number of homes with direct submetering infrastructure, i.e. power meters on individual circuits or loads. Many companies are already collected submetering information from thousands of homes around the world. For each of these homes, we generate a set of features, including the monthly energy bill, the size of the home, the number of occupants, the household income, or any other features that are available. Then, in any given test home, we generate the same feature set. We use a K-nearest neighbor (KNN) algorithm to find K neighbors for the test home. Finally, we define the disaggregated energy usage in the test home to be the average disaggregated energy usage in its K neighbors.\nThis approach must address two basic questions: how to find ‘similar’ homes, and how to combine information from these ‘similar’ homes to predict appliance energy consumption for a test home. In our approach, we define “similarity” differently for each disaggregated load. For example, neighbors may be similar for heating and cooling if they are in the same geographic region, and they may be neighbors for refrigerator loads if they are roughly comparable in size. By defining similarity differently for each load, we leverage the fact that no two homes are exactly identical in all respects, but that every home is likely to have a set of similar homes along any given dimension. In order to decide which features are most indicative of similarly with respect to any given load, we use the set of submetered homes. Since the true similarity of these homes can be calculated based on the submetered data values, we use cross-validation to first find the subset of home characteristics that is most correlated to similar energy levels for a given appliance. Then, we use that set of features to find neighbors in that dimension. The three steps to apply Neighborhood NILM are described in more detail below.\nI: Feature extraction and normalisation: In this step, we try to find candidate features for defining similarity between homes. Historical monthly energy data can suggest seasonal trends. Homes having similar historical aggregate energy consumption have similar response to seasons and thus can be considered similar. We also derive various features from historical monthly energy data such as its variance, range (difference between maximum and minimum), ratio of minimum to maximum monthly energy consumption, to learn specific time series characteristics. Static household characteristics such as area, number of occupants and number of rooms can also be used to define similarity between homes. Static household characteristics are often publicly available and are already being used by companies to match homes based on similarity. Table I summarises the features used in our approach. Next, we normalise these features in the range 0 to 1, since these features are on different scales. We compute these normalised features across both the submetered and the test home.\nII: Finding neighbourhood: Given a set of features, ‘similarity’ between homes can be found using distance functions. Standard distance functions such as Euclidean, Manhattan, etc.\ncan be used. For each test home, we find its ‘neighbourhood’ by finding its K nearest neighbours from the set of submetered homes, akin the well-known K nearest neighbours algorithm.\nIII: Predicting appliance energy consumption: Having found K nearest neighbours for the test home, we predict the energy consumption of an appliance in this test home as the average of energy consumption of that appliance across the K submetered homes. While we use the regular average, we can also use weighted average, which assigns higher weights to closer neighbours while making the prediction. We leave using weighted average for future work."
    }, {
      "heading" : "IV. EVALUATION",
      "text" : ""
    }, {
      "heading" : "A. Data set",
      "text" : "We use the publicly available Dataport data set [22] for evaluating our approach. Dataport data set contains aggregate and appliance level power information for more than 700 homes in Texas, USA for up to 3 years. Submetered and household aggregate power data was collected at 1-minute resolution. 70 homes contain data for 1 year (2013) across 6 appliances of interest (fridge, HVAC, lights, dryer, washing machine and dish washer) and house metadata such as the number of occupants, area of the home and number of rooms. While the data set contains submetered data from a large number of appliances, only the chosen 6 appliances had data across significant number of homes5. We further filtered homes which had data collection issues and were left with 25 homes."
    }, {
      "heading" : "B. Baseline approaches and upper bound",
      "text" : "We compare the accuracy of our approach against the following:\n1) National average: The US Energy Information Administration (EIA) provides a breakdown of residential electricity consumption in the US by end use [12] as shown in Table II. This provides an estimate of average contribution of different appliances to the aggregate household consumption. The “national average” energy consumption for an appliance is computed to be the fraction of aggregate household energy, as given by national estimates in Table II. It must be noted that US national average is going to under estimate the HVAC energy consumption for the Texas region, especially in the summer months. Texas shows higher temperature than most US states and thus has a higher contribution of 18% for HVAC loads, in comparison to the 13% in the national average [11]. For HVAC, we use the Texas average, and for all other appliances\n5http://blog.oliverparson.co.uk/2014/06/wikienergy-data-set-statistics.html\n(for which we don’t have Texas data), we use the national average while computing energy consumed by this baseline approach.\n2) Factorial Hidden Markov Model (FHMM): FHMM is a well known NILM technique [19], [23]. In this approach, each appliance is modelled as a hidden Markov model (HMM) containing ‘n’ states, where a state indicates mode of operation of the appliance. Many appliances can be modelled as 2 state appliances (ON or OFF). The HMM for each appliance is described by 3 parameters: 1) Initial probability (π)- containing the probability of each state at the initial time; 2) Transition matrix (A)- containing the probability of transition between states (e.g. ON to OFF ); and 3) Emission matrix (B)containing the power draw distribution of different states of the appliance.\n3) Best reported accuracy: We look at prior literature [6], [7], [17]–[20], [23]–[25] in top venues pertaining to energy disaggregation research and present the best reported accuracy for each appliance. This represents the best reported accuracy thus far, with the caveat that these numbers may be obtained under varied experimental conditions (assumptions, data set, etc.). It must be pointed that the state-of-the-art shows poor accuracy across low power loads such as lights, and complex loads such as washing machine and dish washer.\n4) Oracle: For any test home, the oracle finds the ‘optimal’ subset of ‘neighbourhood’ homes from all possible sub sets of homes for each home for each load. The appliance energy data from these ‘optimal’ homes is then averaged to predict the appliance energy consumption for the test home. Here, ‘optimality’ is defined as giving the best energy disaggregation accuracy. The oracle represents the upper bound on the accuracy obtainable by our approach, under the setting when there exists an optimal distance function, feature set and number of neighbours which can find the optimal ‘neighbourhood’ of homes for each test home."
    }, {
      "heading" : "C. Evaluation metric",
      "text" : "Based on the metrics used in the prior literature [6], [19], we define Energy accuracy (%) as:\n100 - |Predicted appliance energy - Actual appliance energy|×100%Actual appliance energy\nGiven that the ratio |Predicted appliance energy - Actual appliance energy|Actual appliance energy can be more than 1, when the prediction is way off from the actual usage, accuracy in such cases is considered to be 0. Higher ‘Energy accuracy (%)’ indicates better disaggregation performance."
    }, {
      "heading" : "D. Experimental setup",
      "text" : "Our experimental setup tries to replicate the following real world scenario- we have a small subset of submetered homes and a large number of homes without smart meters. However, our data set has the limitation that only a small number of homes (25) containing aggregate and appliance energy for long duration (1 year) and household characteristics is available. Thus, we use the Leave-one-out cross validation technique to evaluate our approach, where we assume the set of submetered homes to be all the homes except the test home.\nWe use data from 2013 for our evaluation. For all homes, we had aggregate and appliance monthly energy consumption for the 12 months. Our task was to predict the monthly energy consumption for each appliance across these 25 homes. For the HVAC, the evaluation was done only on the months (May-October) in which it is typically used in Texas. For our approach, we do a sweep on the number of neighbours (K) and all subsets of features, for all appliances, and report the best accuracy. This sweep is done on a per-appliance basis, denoting that each appliance may have a different feature for ‘similatity’ between homes.\nTo compare our performance with FHMM, we train an FHMM on the same home as the one on which we test using the NILMTK implementation [6], [15]. Since, FHMM is exponential in the number of appliances modelled, we choose top-5 appliance across each home, as is the practice in the NILM community [7]. Further, we modelled each appliance to consist of two states (ON or OFF). The FHMM training was done on data from August when all appliances were actively used. It must be noted that the result of FHMM disaggregation is a 1-minute power signal for each appliance. We sum up\nthis signal for all months to get the FHMM monthly energy prediction."
    }, {
      "heading" : "E. Results",
      "text" : "Our main result in Figure 3 shows that Neighbourhood NILM gives comparable or better disaggregation performance across all loads in comparison to FHMM, estimates from national average and best reported NILM accuracy. The optimal combination of K neighbours and feature subsets is shown in Table III. The fact that the ‘Oracle’ achieves sufficiently higher accuracy than our approach indicates that there is a scope to further improve our results using better features. Further, the ‘Oracle’ establishes our approach to be promising given that it outperforms best reported accuracy in NILM literature. The disaggregation performance of FHMM on washing machine, dish washer, dryer and lights is poor and their accuracy is 0%. This is in consonance with previous literature showing that these loads are particularly hard to disaggregate [4]. In contrast, our approach gives accuracy upto 64% for these appliances.\nNeighbourhood NILM accurately predicts the HVAC consumption and captures the seasonal trend (Figure 4). The prediction based on national average fares poorly. This can be explained by the fact the national average numbers are computed on the entire year and not on a per-month basis and thus show poor accuracy for appliances such as HVAC which have heavy seasonal variations. In general, FHMM gives comparable accuracy. However, its accuracy in the May (5th month) is poor, when it over predicts HVAC energy consumption. This is likely due to the presence of a load having similar power characteristics such as the HVAC. Our approach is agnostic of such load profiles."
    }, {
      "heading" : "F. Sensitivity analysis",
      "text" : "Having described the ‘highest’ accuracy achievable by our approach for all appliances, we now do a sensitivity analysis across the number of neighbours (K) and subsets of feature vectors. While computing the sensitivity of our approach to K, we choose the optimal feature (from Table III) for each appliance and vary K. Figure 5 shows the variation in accuracy across different K. Heavily used appliances such as fridge and HVAC show little variation in accuracy with varying K. Other appliances have a huge variance across homes and thus their accuracy varies significantly with K. The dish washer in particular has low accuracy for small number of neighbours. Since the prediction based on a larger number of neighbours would be a weighted factor of prediction based on smaller number of neighbours, dish washer shows low accuracy. This indicates that the feature set for dish washer needs further work.\nWhile computing the sensitivity of our approach to features, we choose the optimal K (from Table III) and test our approach on different features. There is no single feature which best describes the ‘similarity’ across all appliances as shown in Figure6. For washing machine, dish washer and dryer; number of occupants is one of the features in the optimal feature set. This dependence can be explained by the fact that there is usually a correlation between the number of people and number of clothes and dishes. For the HVAC, historical monthly energy trend is the best feature, which can be explained by the fact that the energy trend best captures the seasonal variations, which play a major role in HVAC energy consumption. Household area features helps improve the disaggregation accuracy of lights. This can be explained by the fact that larger homes in general have more lighting fixtures."
    }, {
      "heading" : "V. LIMITATIONS AND FUTURE WORK",
      "text" : "Our work has five major limitations, described below:\n1:Our work has only been tested on a single data set which had homes from a single geographical location (Texas), which are related being from the dataset. While many NILM data sets have been released in the past, none of the other data set satisfied the requirements of containing both aggregate and submetered power data for a large number of homes for at least one year. While the HES data set [26] contains data from a large number of homes for a large time, it does not contain\naggregate power data. Given the high variability present in submetering across homes, we can’t assume the aggregate to be the sum of submetered loads. The ECO data set [8] contains data from 6 homes for 8 months. But, there is no single load which is submetered across all these 6 homes. AMPds [21], iAWE [5], Blued [2] contain data only from a single home. REDD [20] contains data for a very short duration from 6 homes. While UK-Dale [16] contains data from 6 homes, only one of them has year long data. We believe that this concern can be addressed by considering geographical co-ordinates as a feature while computing similarity between homes.\n2:Furthermore, if people respond to energy breakdown and change their energy consumption, our feature vector consisting of historical energy usage is likely to be less effective. We believe that such changes can be captured by running changepoint detection algorithms over longer duration historical energy data.\n3:Since our approach only uses single reading per month, it can only estimate the monthly energy consumed by individual appliances, and cannot estimate the finer grained power signal. Estimating the power signal has been shown to enable various applications [1], [7]. However, in homes that do have AMI metering infrastructure, the results of Neighborhood NILM could potentially improve. This is a direction of future work.\n4:‘Outlier’ homes (such as homes consuming very high energy), which are likely candidates for energy feedback may have wrong predictions owing to the fact that ‘neighbouring’ homes are not representative of their energy consumption. We plan to address this concern in future work by first segregating these ‘outlier’ homes based on a model of home’s energy consumption as a factor of various static and dynamic characteristics such as: area, number of occupants, etc.\n5:This approach is less likely to work for very uncommon appliances. It is likely limited to appliances which are commonly present across a large number of homes. This concern is common to current NILM algorithms as well, which are typically suited for more common appliances. The generality of this approach will grow linearly with the number of homes on which submetering infrastructure is deployed."
    }, {
      "heading" : "VI. CONCLUSIONS",
      "text" : "For disaggregation purposes, traditional NILM techniques only use data from the home where they are disaggregating. Further, traditional NILM techniques require a smart meter per home. In this paper, we presented a novel technique which finds homes ‘similar’ to the test home and combine information from them to predict appliance energy consumption. Our approach works when a single reading is available per month (as is the case with traditional electricity meters). Results show that our approach outperforms state-of-the-art NILM technique which rely on smart meters. Neighbourhood NILM can achieve 83% and 79% accuracy disaggregating fridge and heating/cooling loads, compared to 74% and 73% for a technique called FHMM. Furthermore, it achieves up to 64% accuracy on washing machine, dryer, dishwasher, and lighting loads, which is higher than previously reported results. Many existing techniques are not able to disaggregate these loads at all. These results indicate a potentially substantial advantage to installing submetering infrastructure in a select few homes rather than installing new high-frequency smart metering infrastructure in all homes."
    } ],
    "references" : [ {
      "title" : "Detecting anomalies in activities of daily living of elderly residents via energy disaggregation and cox processes",
      "author" : [ "J. Alcalá", "O. Parson", "A. Rogers" ],
      "venue" : null,
      "citeRegEx" : "1",
      "shortCiteRegEx" : "1",
      "year" : 2015
    }, {
      "title" : "Bergés. BLUED: A fully labeled public dataset for Event-Based Non-Intrusive load monitoring research",
      "author" : [ "K. Anderson", "A. Ocneanu", "D. Benitez", "D. Carlson", "A. Rowe" ],
      "venue" : "In Proceedings of 2nd KDD Workshop on Data Mining Applications in Sustainability,",
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 2012
    }, {
      "title" : "Is disaggregation the holy grail of energy efficiency? The case of electricity",
      "author" : [ "K.C. Armel", "A. Gupta", "G. Shrimali", "A. Albert" ],
      "venue" : "Energy Policy,",
      "citeRegEx" : "3",
      "shortCiteRegEx" : "3",
      "year" : 2013
    }, {
      "title" : "Empirical characterization and modeling of electrical loads in smart homes",
      "author" : [ "S. Barker", "S. Kalra", "D. Irwin", "P. Shenoy" ],
      "venue" : "In IEEE International Green Computing Conference,",
      "citeRegEx" : "4",
      "shortCiteRegEx" : "4",
      "year" : 2013
    }, {
      "title" : "It’s Different: Insights into home energy consumption in India",
      "author" : [ "N. Batra", "M. Gulati", "A. Singh", "M.B. Srivastava" ],
      "venue" : "In Proceedings of the Fifth ACM Workshop on Embedded Sensing Systems for Energy- Efficiency in Buildings,",
      "citeRegEx" : "5",
      "shortCiteRegEx" : "5",
      "year" : 2013
    }, {
      "title" : "NILMTK: An Open Source Toolkit for Non-intrusive Load Monitoring",
      "author" : [ "N. Batra", "J. Kelly", "O. Parson", "H. Dutta", "W. Knottenbelt", "A. Rogers", "A. Singh", "M. Srivastava" ],
      "venue" : "Fifth International Conference on Future Energy Systems (ACM e-Energy),",
      "citeRegEx" : "6",
      "shortCiteRegEx" : "6",
      "year" : 2014
    }, {
      "title" : "The eco data set and the performance of non-intrusive load monitoring algorithms",
      "author" : [ "C. Beckel", "W. Kleiminger", "R. Cicchetti", "T. Staake", "S. Santini" ],
      "venue" : "In Proceedings of the First ACM International Conference on Embedded Systems For Energy-Efficient Buildings. ACM,",
      "citeRegEx" : "8",
      "shortCiteRegEx" : "8",
      "year" : 2014
    }, {
      "title" : "Automatic socio-economic classification of households using electricity consumption data",
      "author" : [ "C. Beckel", "L. Sadamori", "S. Santini" ],
      "venue" : "In Proceedings of the fourth international conference on Future energy systems,",
      "citeRegEx" : "9",
      "shortCiteRegEx" : "9",
      "year" : 2013
    }, {
      "title" : "Enhancing electricity audits in residential buildings with nonintrusive load monitoring",
      "author" : [ "M.E. Berges", "E. Goldman", "H.S. Matthews", "L. Soibelman" ],
      "venue" : "Journal of industrial ecology,",
      "citeRegEx" : "10",
      "shortCiteRegEx" : "10",
      "year" : 2010
    }, {
      "title" : "Bergés. Plaid: A public dataset of high-resolution electrical appliance measurements for load identification research: Demo abstract",
      "author" : [ "J. Gao", "S. Giri", "E.C. Kara" ],
      "venue" : "In Proceedings of the 1st ACM Conference on Embedded Systems for Energy-Efficient Buildings, BuildSys",
      "citeRegEx" : "13",
      "shortCiteRegEx" : "13",
      "year" : 2014
    }, {
      "title" : "Nonintrusive appliance load monitoring",
      "author" : [ "G.W. Hart" ],
      "venue" : "Proceedings of the IEEE,",
      "citeRegEx" : "14",
      "shortCiteRegEx" : "14",
      "year" : 1992
    }, {
      "title" : "Nilmtk v0. 2: a non-intrusive load monitoring toolkit for large scale data sets: demo abstract",
      "author" : [ "J. Kelly", "N. Batra", "O. Parson", "H. Dutta", "W. Knottenbelt", "A. Rogers", "A. Singh", "M. Srivastava" ],
      "venue" : "In Proceedings of the 1st ACM Conference on Embedded Systems for Energy-Efficient Buildings,",
      "citeRegEx" : "15",
      "shortCiteRegEx" : "15",
      "year" : 2014
    }, {
      "title" : "UK-DALE: A dataset recording UK Domestic Appliance-Level Electricity demand and whole-house demand",
      "author" : [ "J. Kelly", "W. Knottenbelt" ],
      "venue" : "ArXiv e-prints,",
      "citeRegEx" : "16",
      "shortCiteRegEx" : "16",
      "year" : 2014
    }, {
      "title" : "Neural nilm: Deep neural networks applied to energy disaggregation",
      "author" : [ "J. Kelly", "W. Knottenbelt" ],
      "venue" : "arXiv preprint arXiv:1507.06594,",
      "citeRegEx" : "17",
      "shortCiteRegEx" : "17",
      "year" : 2015
    }, {
      "title" : "Energy Disaggregation via Discriminative Sparse Coding",
      "author" : [ "J.Z. Kolter", "S. Batra", "A.Y. Ng" ],
      "venue" : "In Proceedings of the 24th Annual Conference on Neural Information Processing Systems,",
      "citeRegEx" : "18",
      "shortCiteRegEx" : "18",
      "year" : 2010
    }, {
      "title" : "Approximate Inference in Additive Factorial HMMs with Application to Energy Disaggregation",
      "author" : [ "J.Z. Kolter", "T. Jaakkola" ],
      "venue" : "In Proceedings of the International Conference on Artificial Intelligence and Statistics,",
      "citeRegEx" : "19",
      "shortCiteRegEx" : "19",
      "year" : 2012
    }, {
      "title" : "REDD: A public data set for energy disaggregation research",
      "author" : [ "J.Z. Kolter", "M.J. Johnson" ],
      "venue" : "In Proceedings of 1st KDD Workshop on Data Mining Applications in Sustainability,",
      "citeRegEx" : "20",
      "shortCiteRegEx" : "20",
      "year" : 2011
    }, {
      "title" : "AMPds: A Public Dataset for Load Disaggregation and Eco-Feedback Research",
      "author" : [ "S. Makonin", "F. Popowich", "L. Bartram", "B. Gill", "I.V. Bajic" ],
      "venue" : "In IEEE Electrical Power and Energy Conference,",
      "citeRegEx" : "21",
      "shortCiteRegEx" : "21",
      "year" : 2013
    }, {
      "title" : "Dataport and nilmtk: a building data set designed for non-intrusive load monitoring",
      "author" : [ "O. Parson", "G. Fisher", "A. Hersey", "N. Batra", "J. Kelly", "A. Singh", "W. Knottenbelt", "A. Rogers" ],
      "venue" : null,
      "citeRegEx" : "22",
      "shortCiteRegEx" : "22",
      "year" : 2015
    }, {
      "title" : "Non-intrusive load monitoring using prior models of general appliance types",
      "author" : [ "O. Parson", "S. Ghosh", "M. Weal", "A. Rogers" ],
      "venue" : "In Proceedings of the 26th AAAI Conference on Artificial Intelligence,",
      "citeRegEx" : "23",
      "shortCiteRegEx" : "23",
      "year" : 2012
    }, {
      "title" : "An unsupervised training method for non-intrusive appliance load monitoring",
      "author" : [ "O. Parson", "S. Ghosh", "M. Weal", "A. Rogers" ],
      "venue" : "Artificial Intelligence,",
      "citeRegEx" : "24",
      "shortCiteRegEx" : "24",
      "year" : 2014
    }, {
      "title" : "Household Electricity Survey. A study of domestic electrical product usage",
      "author" : [ "J.-P. Zimmermann", "M. Evans", "J. Griggs", "N. King", "L. Harding", "P. Roberts", "C. Evans" ],
      "venue" : "Technical Report R66141,",
      "citeRegEx" : "26",
      "shortCiteRegEx" : "26",
      "year" : 2012
    } ],
    "referenceMentions" : [ {
      "referenceID" : 10,
      "context" : "Second, all existing approaches to disaggregation require a model of each electrical load, and a manual process is required to generate or train these models [14], [19].",
      "startOffset" : 158,
      "endOffset" : 162
    }, {
      "referenceID" : 15,
      "context" : "Second, all existing approaches to disaggregation require a model of each electrical load, and a manual process is required to generate or train these models [14], [19].",
      "startOffset" : 164,
      "endOffset" : 168
    }, {
      "referenceID" : 3,
      "context" : "Techniques to learn these models automatically are being developed but still have challenges with small loads such as lights and complex loads such as washing machines and dishwashers [4].",
      "startOffset" : 184,
      "endOffset" : 187
    }, {
      "referenceID" : 19,
      "context" : "Lastly and most importantly, existing disaggregation techniques require power metering with approximately 1 minute sampling intervals [23] and some require rates of 10 kHz or more [3], [10].",
      "startOffset" : 134,
      "endOffset" : 138
    }, {
      "referenceID" : 2,
      "context" : "Lastly and most importantly, existing disaggregation techniques require power metering with approximately 1 minute sampling intervals [23] and some require rates of 10 kHz or more [3], [10].",
      "startOffset" : 180,
      "endOffset" : 183
    }, {
      "referenceID" : 8,
      "context" : "Lastly and most importantly, existing disaggregation techniques require power metering with approximately 1 minute sampling intervals [23] and some require rates of 10 kHz or more [3], [10].",
      "startOffset" : 185,
      "endOffset" : 189
    }, {
      "referenceID" : 18,
      "context" : "We evaluate this approach using 25 homes from the publicly available Dataport data set [22] that have direct submetering infrastructure installed for one year or more.",
      "startOffset" : 87,
      "endOffset" : 91
    }, {
      "referenceID" : 15,
      "context" : "Results show that Neighbourhood NILM can achieve 83% and 79% accuracy disaggregating fridge and heating/cooling loads, compared to 74% and 73% for a technique called FHMM [19].",
      "startOffset" : 171,
      "endOffset" : 175
    }, {
      "referenceID" : 10,
      "context" : "Since its inception in the early 1980s by George Hart [14], the field of NILM has seen various approaches based on different machine learning techniques leveraging different features of the power trace.",
      "startOffset" : 54,
      "endOffset" : 58
    }, {
      "referenceID" : 8,
      "context" : "High frequency approaches (>10 kHz) [10] use features such as voltage-current trajectories to detect events in aggregate power time series.",
      "startOffset" : 36,
      "endOffset" : 40
    }, {
      "referenceID" : 10,
      "context" : "Additionally, existing approaches for energy disaggregation [14], [19], [23] require a model of each appliance.",
      "startOffset" : 60,
      "endOffset" : 64
    }, {
      "referenceID" : 15,
      "context" : "Additionally, existing approaches for energy disaggregation [14], [19], [23] require a model of each appliance.",
      "startOffset" : 66,
      "endOffset" : 70
    }, {
      "referenceID" : 19,
      "context" : "Additionally, existing approaches for energy disaggregation [14], [19], [23] require a model of each appliance.",
      "startOffset" : 72,
      "endOffset" : 76
    }, {
      "referenceID" : 10,
      "context" : "Some systems assume the model is manually generated, learned from training data [14], [19], and in rare cases learned automatically [4].",
      "startOffset" : 80,
      "endOffset" : 84
    }, {
      "referenceID" : 15,
      "context" : "Some systems assume the model is manually generated, learned from training data [14], [19], and in rare cases learned automatically [4].",
      "startOffset" : 86,
      "endOffset" : 90
    }, {
      "referenceID" : 3,
      "context" : "Some systems assume the model is manually generated, learned from training data [14], [19], and in rare cases learned automatically [4].",
      "startOffset" : 132,
      "endOffset" : 135
    }, {
      "referenceID" : 13,
      "context" : "[17] take inspiration from the success of deep neural networks and apply it to the energy disaggregation problem, where they show that their technique outperforms various benchmarks across all appliances, including appliances which show poor accuracies when modelled as FSMs.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 9,
      "context" : "[13] released a crowd-sourced data set for creating a library of appliance Feature category Features",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 13,
      "context" : "[17], their work only deals with appliance signatures, without considering relationship between households.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 7,
      "context" : "[9] has shown that given aggregate energy data for a large number of homes, one can predict various household characteristics such as the family income, number of occupants, area of home.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 18,
      "context" : "We use the publicly available Dataport data set [22] for evaluating our approach.",
      "startOffset" : 48,
      "endOffset" : 52
    }, {
      "referenceID" : 15,
      "context" : "2) Factorial Hidden Markov Model (FHMM): FHMM is a well known NILM technique [19], [23].",
      "startOffset" : 77,
      "endOffset" : 81
    }, {
      "referenceID" : 19,
      "context" : "2) Factorial Hidden Markov Model (FHMM): FHMM is a well known NILM technique [19], [23].",
      "startOffset" : 83,
      "endOffset" : 87
    }, {
      "referenceID" : 5,
      "context" : "3) Best reported accuracy: We look at prior literature [6], [7], [17]–[20], [23]–[25] in top venues pertaining to energy disaggregation research and present the best reported accuracy for each appliance.",
      "startOffset" : 55,
      "endOffset" : 58
    }, {
      "referenceID" : 13,
      "context" : "3) Best reported accuracy: We look at prior literature [6], [7], [17]–[20], [23]–[25] in top venues pertaining to energy disaggregation research and present the best reported accuracy for each appliance.",
      "startOffset" : 65,
      "endOffset" : 69
    }, {
      "referenceID" : 16,
      "context" : "3) Best reported accuracy: We look at prior literature [6], [7], [17]–[20], [23]–[25] in top venues pertaining to energy disaggregation research and present the best reported accuracy for each appliance.",
      "startOffset" : 70,
      "endOffset" : 74
    }, {
      "referenceID" : 19,
      "context" : "3) Best reported accuracy: We look at prior literature [6], [7], [17]–[20], [23]–[25] in top venues pertaining to energy disaggregation research and present the best reported accuracy for each appliance.",
      "startOffset" : 76,
      "endOffset" : 80
    }, {
      "referenceID" : 5,
      "context" : "Based on the metrics used in the prior literature [6], [19], we define Energy accuracy (%) as: 100 - |Predicted appliance energy - Actual appliance energy|×100% Actual appliance energy",
      "startOffset" : 50,
      "endOffset" : 53
    }, {
      "referenceID" : 15,
      "context" : "Based on the metrics used in the prior literature [6], [19], we define Energy accuracy (%) as: 100 - |Predicted appliance energy - Actual appliance energy|×100% Actual appliance energy",
      "startOffset" : 55,
      "endOffset" : 59
    }, {
      "referenceID" : 5,
      "context" : "To compare our performance with FHMM, we train an FHMM on the same home as the one on which we test using the NILMTK implementation [6], [15].",
      "startOffset" : 132,
      "endOffset" : 135
    }, {
      "referenceID" : 11,
      "context" : "To compare our performance with FHMM, we train an FHMM on the same home as the one on which we test using the NILMTK implementation [6], [15].",
      "startOffset" : 137,
      "endOffset" : 141
    }, {
      "referenceID" : 3,
      "context" : "This is in consonance with previous literature showing that these loads are particularly hard to disaggregate [4].",
      "startOffset" : 110,
      "endOffset" : 113
    }, {
      "referenceID" : 21,
      "context" : "While the HES data set [26] contains data from a large number of homes for a large time, it does not contain",
      "startOffset" : 23,
      "endOffset" : 27
    }, {
      "referenceID" : 6,
      "context" : "The ECO data set [8] contains data from 6 homes for 8 months.",
      "startOffset" : 17,
      "endOffset" : 20
    }, {
      "referenceID" : 17,
      "context" : "AMPds [21], iAWE [5], Blued [2] contain data only from a single home.",
      "startOffset" : 6,
      "endOffset" : 10
    }, {
      "referenceID" : 4,
      "context" : "AMPds [21], iAWE [5], Blued [2] contain data only from a single home.",
      "startOffset" : 17,
      "endOffset" : 20
    }, {
      "referenceID" : 1,
      "context" : "AMPds [21], iAWE [5], Blued [2] contain data only from a single home.",
      "startOffset" : 28,
      "endOffset" : 31
    }, {
      "referenceID" : 16,
      "context" : "REDD [20] contains data for a very short duration from 6 homes.",
      "startOffset" : 5,
      "endOffset" : 9
    }, {
      "referenceID" : 12,
      "context" : "While UK-Dale [16] contains data from 6 homes, only one of them has year long data.",
      "startOffset" : 14,
      "endOffset" : 18
    }, {
      "referenceID" : 0,
      "context" : "Estimating the power signal has been shown to enable various applications [1], [7].",
      "startOffset" : 74,
      "endOffset" : 77
    } ],
    "year" : 2015,
    "abstractText" : "In this paper, we investigate whether “big-data” is more valuable than “precise” data for the problem of energy disaggregation: the process of breaking down aggregate energy usage on a per-appliance basis. Existing techniques for disaggregation rely on energy metering at a resolution of 1 minute or higher, but most power meters today only provide a reading once per month, and at most once every 15 minutes. In this paper, we propose a new technique called Neighborhood NILM that leverages data from ‘neighbouring’ homes to disaggregate energy given only a single energy reading per month. The key intuition behind our approach is that ‘similar’ homes have ‘similar’ energy consumption on a per-appliance basis. Neighborhood NILM matches every home with a set of ‘neighbours’ that have direct submetering infrastructure, i.e. power meters on individual circuits or loads. Many such homes already exist. Then, it estimates the appliance-level energy consumption of the target home to be the average of its K neighbours. We evaluate this approach using 25 homes and results show that our approach gives comparable or better disaggregation in comparison to state-of-the-art accuracy reported in the literature that depend on manual model training, high frequency power metering, or both. Results show that Neighbourhood NILM can achieve 83% and 79% accuracy disaggregating fridge and heating/cooling loads, compared to 74% and 73% for a technique called FHMM. Furthermore, it achieves up to 64% accuracy on washing machine, dryer, dishwasher, and lighting loads, which is higher than previously reported results. Many existing techniques are not able to disaggregate these loads at all. These results indicate a potentially substantial advantage to installing submetering infrastructure in a select few homes rather than installing new high-frequency smart metering infrastructure in all homes.",
    "creator" : "LaTeX with hyperref package"
  }
}