{
  "name" : "1512.01283.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Predicting the top and bottom ranks of billboard songs using Machine Learning",
    "authors" : [ "Vivek Datla", "Abhinav Vishnu" ],
    "emails" : [ "vivek.datla@pnnl.gov", "abhinav.vishnu@pnnl.gov" ],
    "sections" : [ {
      "heading" : "Introduction",
      "text" : "German philosopher Friedrich Nietzche famously said “without music, life would be a mistake”. In this digital age, we have access to a large collection of music composed at an amazing rate. iTunes music store alone offers 37 million songs, and has sold more than 25 billion songs worldwide.\nEvery society has its version of music and popularity of the songs, and sometimes they transcend the societies as well as continents. The 90ś era of pop and rock music was dominated by artists such as Micheal Jackson, Sting, U2 and many others. The whole generation of 90ś youth can immediately identify “Beat it!” a top song during that period.\nWhat makes a song catchy? The lyrics of the songs contain words that arouse several emotions such as anger, and love, which tend to play an important role in humans liking the songs. The liking of the songs does have not only a human emotion aspect but also has a direct economic impact on the $130 billion music industry.\nThe sales and evaluation of the songs directly impact the music companies and a computational model that predicts the popularity of a song is of great value for the music industry. Identifying the potential of a song earlier gives an edge for the companies to purchase the songs at a lower cost. Also, an artist usually composes the music for a song after the lyrics are written. For an organization investing in a music album, it is a great financial incentive to know whether the song would catch the pulse of the audience just based on the lyrics even before the music album is composed, as composing music requires considerable resources.\nCopyright c© 2015, Association for the Advancement of Artificial Intelligence (www.aaai.org). All rights reserved.\nSince songs are composed of several complex components such as lyrics, instrumental music, vocal and visual renditions, the nature of a song itself is highly complex. Lyrics is the language component that ties up the vocal, music, and visual components. There needs to be harmony between the components to produce a song. Songs have the potential to lift our moods, make us shake a leg or move us to tears. They also help us relate to our experiences, by triggering several emotional responses.\nThere has been a lot of work on genre classification using machine learning. Researchers identify the category of the songs based on the emotions such as sad, happy and party. All the songs tend to have an emotional component, but we see very few songs that catch the people’s pulse and become a hit.\nThe research question addressed in the paper are as follows:\n• Can machine learning models be trained on lyrics for predicting the top and bottom ranked songs?\nIn the current paper, we look at language features that help predict whether a song belongs to a top or a bottom ranked category. To the best of our knowledge, this is the first study addressing this problem."
    }, {
      "heading" : "Related Work",
      "text" : "Language is a strong indicator of stresses and mood of a person. Identifying these features has helped computational linguists as well as computer scientists to correlate the language features with several complex problems arising in tutoring systems (Rus et al., 2013; Graesser et al., 2005), affect recognition(DMello et al., 2008), sentiment mining (Hu and Liu, 2004), opinion mining, and many others.\nSu, Fung, and Auguin (2013) implemented a multimodal music emotion classification (MEC) for classifying 14 kinds of emotions from music and song lyrics of western music genre. Their dataset consisted of 3̃500 songs with emotions/mood such as sad, high, groovy, happy, lonely, sexy, energetic, romantic, angry, sleepy, nostalgic, funny, jazzy, and calm. They used AdaBoost with decision stumps for classification of the music and language features of the lyrics into their respective emotion categories. They have an accuracy of 0.78 using language as well as surface features of the audio. The authors claim that the language features played a\nar X\niv :1\n51 2.\n01 28\n3v 1\n[ cs\n.C L\n] 3\nD ec\n2 01\n5\nmore important role compared to the music features in classification.\nLaurier, Grivolla, and Herrera (2008) also indicated that the language features outperformed audio features for music mood classification. They have shown that language features extracted from the songs fit well with Russel’s valence(negative-positive) and arousal(inactive-active) model (Russell, 1980). Several cross-cultural studies show evidence for universal emotional cues in music and language across different cultures and traditions (McKay, 2002).\nWhile significant advances have been made in the area of emotion detection and mood classification based on music and lyrics analysis, through large-scale machine learning operating on vast feature sets, sometimes spanning multiple domains, applied to relatively short musical selections (Kim et al., 2010). Many times, these approaches help in identifying the genre and mood but do not reveal much in terms of why a song is popular, or what features of the song made it catch the pulse of the audience.\nMihalcea and Strapparava (2012) used LIWC and surface music components of all the phrases present in a small collection of songs as a dataset for identifying the emotions in that phrase. Each of the phrases was annotated for emotions. Using SVM classifier they obtained an accuracy of 0.87 using just the language features. They observed that the language components gave a higher accuracy than music features in predicting emotions. The accuracy is higher as they are looking at emotions in a phrase, where the chance of having multiple emotions inside such a small text is very low.\nWhen we look at a collection of popular songs, they belong to several emotional categories. It is clear from previous research that language is a strong indicator of emotions, but it is not clear if the language is an indicator of a song becoming a commercial success.\nWe used the language features extracted from the lyrics to train an SVM classifier to identify the top and bottom category of songs. Below is the description of both approaches:\n• A machine learning approach: We extracted the language features, performed dimensionality reduction using principal component analysis (PCA) in-order to reduce the noise in the data. We trained and tested SVM classifier on the new features for identifying the songs that belonged to the top and bottom of the Billboard rankings."
    }, {
      "heading" : "Data",
      "text" : "Billboard magazine (Billboard, 2015) is a world premier music publication since 1984. Billboard’s music charts have evolved into the primary source of information on trends and innovation in music industry. With more than 10 Million users, its ranking is considered as a standard in the music industry. Billboard releases the weekly ranking of top 100 songs in several categories such as rock, pop, hip-hop, etc. For this study, we used top 100 hot-hits of every week from 2001−2010. We collected the lyrics of the songs from www.lyrics.com. Since the ratings of the songs are given every week, there is a lot of repetition of the same song being in present in multiple weeks. For the simplifying the problem we selected the top rank of the song throughout the year\nas the rank of the song. After cleaning the lyrics from hypertext annotations and punctuations, we had a total of 2683 songs from 808 artists. The histogram of the peak rank of the songs in the dataset is shown in Figure 1. For our analysis, we build a model to identify the songs that belonged to the top 30 and bottom 30 ranks. There are a total of 1622 songs of which 991 belonged to top 30, and the rest belonged to bottom 30 ranks."
    }, {
      "heading" : "Features",
      "text" : "There are few analysis which conduct whole battery of linguistic algorithms that look at syntax, semantics, emotions, and affect contribution of words present in the lyrics. These algorithms can generally be classified into general structural (e.g., word count), syntactic(e.g., connectives) and semantic (e.g., word choice) dimensions of language, whereby some used a bag-of-word approach (e.g. LIWC), whereas others used a probability approach (MRC), whereas yet others relied on the computation of different factors (e.g., type-token ratio). There are eight computation linguistic algorithms that are used to analyze the language features inside the lyrics of the songs.\nFor general linguistic features, we used the frequency of 67 linguistic features described by (Biber, 1991). These features primarily operate at the word level (e.g., parts-ofspeech) and can be categorized as tense and aspect markers, place and time adverbials, pronouns and proverbs, questions, nominal forms, passives, stative forms, subordination features, prepositional phrases, adjectives and adverbs, lexical specificity, lexical classes, modals, specialized verb classes, reduced forms and dis-preferred structures, and co-ordinations and negations (Luno, Beck, and Louwerse, 2013).\nFor semantic categories of the words, we used Wordnet (Miller et al., 1998). Wordnet has 150000 words in 44 base\ntypes including 25 primitive groups for nouns (e.g. time, location, person, etc.), 15 for verbs (e.g. communication, cognition, etc.), 3 groups of adjectives and 1 group of adverbs. We also collected all the English words from Google unigrams (Brants and Franz, 2006) and binned them into one of the 44 categories if one of their synonyms belonged to those categories. These words represent the categories such as communication nouns, social nouns, and many others.\nThe linguistic category model (LCM) gives insight into the interpersonal language use. The model consists of a classification of interpersonal (transitive) verbs that are used to describe actions or psychological states and adjectives that are employed to characterize persons. To capture the various emotions expressed by the statement, we have used the emotion words given by (Tausczik and Pennebaker, 2010), classified into two classes broadly basic emotions (anger, fear, disgust, happiness, etc.) and complex emotions (guilt, pity, tenderness, etc.).\nThe basic emotions indicate no cognitive load hence they are also called as raw emotions, whereas the complex emotions indicate cognitive load. Inter-clausal relationships were captured using parameterization, including positive additive, (also, moreover), negative additive (however, but), positive temporal (after, before), negative temporal (until), and causal (because, so) connectives. To get the frequencies of the words, we have used CELEX database (Baayen, Piepenbrock, and Gulikers, 1995). The CELEX database consists of 17.9 million words taken from both spoken (news wire and telephonic conversations) and written (newspapers and books) corpora. Also, we used the MRC Psycholinguistic Database (Johnson-laird and Oatley, 1989), to get linguistic measures such as familiarity, concreteness, and meaningfulness."
    }, {
      "heading" : "Classification",
      "text" : "After the linguistic analysis, we approached the problem as a classification problem. As discussed earlier, we extracted the language features from the lyrics using the computational linguistic algorithms shown in Figure 2. We extracted 261 features from each of the 2616 songs. The goal is to build a classifier that predicts the top and bottom ranked songs of the Billboard. Since there are many features and very few songs, we removed the noise contributed by the features using principle component analysis (PCA). Features that explained 0.6 variance were selected, and this reduced the features to 39 from 261.\nIt is important to note that the major advantage of doing a PCA is noise reduction, and also identifying the best features that capture the variance in the data. The disadvantage is that the variables loose their semantic meaning compared to the raw features.\nThe classes of positive and negative samples i.e. the top 30 and bottom 30 songs were in the ratio of 1.5 to 1, and to balance the classes we performed synthetic minority oversampling (SMOTE) (Chawla et al., 2002). The SMOTE creates new synthetic samples that are similar to the minority class by picking data points that are closer to the original sample.\nAfter balancing the classes, we performed classification using support vector machine (SVM) using a radial(exponential), polynomial and linear kernel functions. The classification is done using a 10-fold cross validation\nmethod. SVM uses implicit mapping function defined by the kernel function, to map the input data into a very high dimensional feature space. Then it learns the plane of separation between the two classes of the high dimensional space. For the classification of top and bottom ranked songs we observe that the radial (exponential) function performs the best, with a precision 0.76, recall 0.76 and Cohen’s Kappa -0.51. The kappa score indicates that the classifier did the classification with great confidence.\nWe also attempted building a classifier using other classification algorithms such as Bayes, Naive-Bayes, and decision trees, but all of them performed poorly compared to the SVM."
    }, {
      "heading" : "Discussion",
      "text" : "There are several studies (Mihalcea and Strapparava, 2012; Su, Fung, and Auguin, 2013; Laurier, Grivolla, and Herrera, 2008; Kim et al., 2010) that have looked into emotions in music based on language as well as few audio features. All the studies explicitly indicated that language features were more useful than surface music features in identifying the emotion present in the songs.\nSongs contain both music and lyrics. In this work, we have used only the lyrics as our data. Lyrics of the songs are available publicly when compared to the music. Since previous studies have shown the importance of language in music for identifying emotions, we extended the investigation for identifying the language features that help in differentiating the top and bottom rated songs on the billboard. To the best of our knowledge this is a first study that uses computational linguistic algorithms and machine learning models to predict whether a song belongs to top or bottom of the Billboard rankings.\nWe used the language features extracted using the language model to train SVM classifiers under different kernel functions to identify whether a song belongs to the top or bottom of the billboard chart. The radial kernel function gives a precision 0.76with a kappa 0.51 which indicates that the confidence in classification.\nAlthough audio features of the song play an important role, they are expensive and not publicly available for download. In this paper, we focused only on the language features and the results from both the studies indicate that we can robustly identify whether a song goes to top or bottom of Billboard charts based on the language features alone. Although the precision is only 0.76 (chance is 0.5), given that we are in a very dense space of top 100 songs from Billboard, where all the songs are best of the best when taking into consideration all the music albums uploaded on to social media (youtube, facebook, twitter, etc.).\nOverall the take-home message of this paper is that language features can be exploited by the machine learning algorithms to predict whether a song reaches the top or bottom of the Billboard rankings."
    }, {
      "heading" : "Conclusion and Future Work",
      "text" : "The music industry is a vibrant business community, with many artists publishing their work in the form of albums, individual songs, and performances. There is a huge financial incentive for the businesses to identify the songs that are most likely to be a hit.\ncan use machine learning models to train on several language features to predict whether a song belongs to the top 30 or bottom 30 of the Billboard ratings.\nIn future, we would like to expand our research question to predict whether the song reaches to the class of top 100 Billboard list or not."
    } ],
    "references" : [ {
      "title" : "The CELEX lexical database",
      "author" : [ "H.R. Baayen", "R. Piepenbrock", "L. Gulikers" ],
      "venue" : "release 2 (CD-ROM). Philadelphia, Pennsylvania: Linguistic Data Consortium, University of Pennsylvania.",
      "citeRegEx" : "Baayen et al\\.,? 1995",
      "shortCiteRegEx" : "Baayen et al\\.",
      "year" : 1995
    }, {
      "title" : "Variation across speech and writing",
      "author" : [ "D. Biber" ],
      "venue" : "Cambridge University Press.",
      "citeRegEx" : "Biber,? 1991",
      "shortCiteRegEx" : "Biber",
      "year" : 1991
    }, {
      "title" : "Web 1T 5-gram Version 1",
      "author" : [ "T. Brants", "A. Franz" ],
      "venue" : "Philadelphia: Linguistic Data Consortium.",
      "citeRegEx" : "Brants and Franz,? 2006",
      "shortCiteRegEx" : "Brants and Franz",
      "year" : 2006
    }, {
      "title" : "Smote: synthetic minority over-sampling technique",
      "author" : [ "N.V. Chawla", "K.W. Bowyer", "L.O. Hall", "W.P. Kegelmeyer" ],
      "venue" : "Journal of artificial intelligence research 321– 357.",
      "citeRegEx" : "Chawla et al\\.,? 2002",
      "shortCiteRegEx" : "Chawla et al\\.",
      "year" : 2002
    }, {
      "title" : "The mrc psycholinguistic database",
      "author" : [ "M. Coltheart" ],
      "venue" : "The Quarterly Journal of Experimental Psychology 33(4):497–505.",
      "citeRegEx" : "Coltheart,? 1981",
      "shortCiteRegEx" : "Coltheart",
      "year" : 1981
    }, {
      "title" : "Automatic detection of learner?s affect from conversational cues",
      "author" : [ "S. DMello", "S. Craig", "A. Witherspoon", "B. McDaniel", "A. Graesser" ],
      "venue" : "User Modeling and UserAdapted Interaction 18(1-2):45–80.",
      "citeRegEx" : "DMello et al\\.,? 2008",
      "shortCiteRegEx" : "DMello et al\\.",
      "year" : 2008
    }, {
      "title" : "Autotutor: An intelligent tutoring system with mixed-initiative dialogue",
      "author" : [ "A.C. Graesser", "P. Chipman", "B.C. Haynes", "A. Olney" ],
      "venue" : "Education, IEEE Transactions on 48(4):612–618.",
      "citeRegEx" : "Graesser et al\\.,? 2005",
      "shortCiteRegEx" : "Graesser et al\\.",
      "year" : 2005
    }, {
      "title" : "Mining and summarizing customer reviews",
      "author" : [ "M. Hu", "B. Liu" ],
      "venue" : "Proceedings of the Tenth ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, KDD ’04, 168–177. New York, NY, USA: ACM.",
      "citeRegEx" : "Hu and Liu,? 2004",
      "shortCiteRegEx" : "Hu and Liu",
      "year" : 2004
    }, {
      "title" : "The language of emotions: An analysis of a semantic field",
      "author" : [ "P.N. Johnson-laird", "K. Oatley" ],
      "venue" : "Cognition and Emotion 3(2):81–123.",
      "citeRegEx" : "Johnson.laird and Oatley,? 1989",
      "shortCiteRegEx" : "Johnson.laird and Oatley",
      "year" : 1989
    }, {
      "title" : "Music emotion recognition: A state of the art review",
      "author" : [ "Y.E. Kim", "E.M. Schmidt", "R. Migneco", "B.G. Morton", "P. Richardson", "J. Scott", "J.A. Speck", "D. Turnbull" ],
      "venue" : "Proc. ISMIR, 255–266. Citeseer.",
      "citeRegEx" : "Kim et al\\.,? 2010",
      "shortCiteRegEx" : "Kim et al\\.",
      "year" : 2010
    }, {
      "title" : "Multimodal music mood classification using audio and lyrics",
      "author" : [ "C. Laurier", "J. Grivolla", "P. Herrera" ],
      "venue" : "Machine Learning and Applications, 2008. ICMLA’08. Seventh International Conference on, 688–693. IEEE.",
      "citeRegEx" : "Laurier et al\\.,? 2008",
      "shortCiteRegEx" : "Laurier et al\\.",
      "year" : 2008
    }, {
      "title" : "An analytic and cognitive parametrization of coherence relations",
      "author" : [ "M. Louwerse" ],
      "venue" : "Cognitive Linguistics 12(3):291–316.",
      "citeRegEx" : "Louwerse,? 2001",
      "shortCiteRegEx" : "Louwerse",
      "year" : 2001
    }, {
      "title" : "Tell us your story: Investigating the linguistic features of trauma narrative",
      "author" : [ "J.A. Luno", "J.G. Beck", "M. Louwerse" ],
      "venue" : "The Cognitive Science Society.",
      "citeRegEx" : "Luno et al\\.,? 2013",
      "shortCiteRegEx" : "Luno et al\\.",
      "year" : 2013
    }, {
      "title" : "Emotion and music: Inherent responses and the importance of empirical cross-cultural research",
      "author" : [ "C. McKay" ],
      "venue" : "Course Paper, McGill University, Canada.",
      "citeRegEx" : "McKay,? 2002",
      "shortCiteRegEx" : "McKay",
      "year" : 2002
    }, {
      "title" : "Lyrics, music, and emotions",
      "author" : [ "R. Mihalcea", "C. Strapparava" ],
      "venue" : "Proceedings of the 2012 Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning, 590–599. Association for Computational Linguistics.",
      "citeRegEx" : "Mihalcea and Strapparava,? 2012",
      "shortCiteRegEx" : "Mihalcea and Strapparava",
      "year" : 2012
    }, {
      "title" : "Five Papers on WordNet",
      "author" : [ "G.A. Miller", "R. Beckwith", "C. Fellbaum", "D. Gross", "K. Miller" ],
      "venue" : "Fellbaum, C., ed., WordNet: An Electronic Lexical Database. MIT Press.",
      "citeRegEx" : "Miller et al\\.,? 1998",
      "shortCiteRegEx" : "Miller et al\\.",
      "year" : 1998
    }, {
      "title" : "Recommendations for the generalized intelligent framework for tutoring based on the development of the deeptutor tutoring service",
      "author" : [ "V. Rus", "N. Niraula", "M. Lintean", "R. Banjade", "D. Stefanescu", "W. Baggett" ],
      "venue" : "AIED 2013 Workshops Proceedings Volume 7, 116.",
      "citeRegEx" : "Rus et al\\.,? 2013",
      "shortCiteRegEx" : "Rus et al\\.",
      "year" : 2013
    }, {
      "title" : "A circumplex model of affect",
      "author" : [ "J.A. Russell" ],
      "venue" : "Journal of personality and social psychology 39(6):1161.",
      "citeRegEx" : "Russell,? 1980",
      "shortCiteRegEx" : "Russell",
      "year" : 1980
    }, {
      "title" : "The cognitive functions of linguistic categories in describing persons: Social cognition and language",
      "author" : [ "G.R. Semin", "K. Fiedler" ],
      "venue" : "Journal of Personality and Social Psychology 54(4):558–568.",
      "citeRegEx" : "Semin and Fiedler,? 1988",
      "shortCiteRegEx" : "Semin and Fiedler",
      "year" : 1988
    }, {
      "title" : "The linguistic category model, its bases, applications and range",
      "author" : [ "G.R. Semin", "K. Fiedler" ],
      "venue" : "European Review of Social Psychology 2(1):1–30.",
      "citeRegEx" : "Semin and Fiedler,? 1991",
      "shortCiteRegEx" : "Semin and Fiedler",
      "year" : 1991
    }, {
      "title" : "Multimodal music emotion classification using adaboost with decision stumps",
      "author" : [ "D. Su", "P. Fung", "N. Auguin" ],
      "venue" : "Acoustics, Speech and Signal Processing (ICASSP), 2013 IEEE International Conference on, 3447–3451.",
      "citeRegEx" : "Su et al\\.,? 2013",
      "shortCiteRegEx" : "Su et al\\.",
      "year" : 2013
    }, {
      "title" : "The psychological meaning of words: Liwc and computerized text analysis methods",
      "author" : [ "Y.R. Tausczik", "J.W. Pennebaker" ],
      "venue" : "Journal of Language and Social Psychology 29(1):24–54.",
      "citeRegEx" : "Tausczik and Pennebaker,? 2010",
      "shortCiteRegEx" : "Tausczik and Pennebaker",
      "year" : 2010
    } ],
    "referenceMentions" : [ {
      "referenceID" : 16,
      "context" : "Identifying these features has helped computational linguists as well as computer scientists to correlate the language features with several complex problems arising in tutoring systems (Rus et al., 2013; Graesser et al., 2005), affect recognition(DMello et al.",
      "startOffset" : 186,
      "endOffset" : 227
    }, {
      "referenceID" : 6,
      "context" : "Identifying these features has helped computational linguists as well as computer scientists to correlate the language features with several complex problems arising in tutoring systems (Rus et al., 2013; Graesser et al., 2005), affect recognition(DMello et al.",
      "startOffset" : 186,
      "endOffset" : 227
    }, {
      "referenceID" : 5,
      "context" : ", 2005), affect recognition(DMello et al., 2008), sentiment mining (Hu and Liu, 2004), opinion mining, and many others.",
      "startOffset" : 27,
      "endOffset" : 48
    }, {
      "referenceID" : 7,
      "context" : ", 2008), sentiment mining (Hu and Liu, 2004), opinion mining, and many others.",
      "startOffset" : 26,
      "endOffset" : 44
    }, {
      "referenceID" : 17,
      "context" : "They have shown that language features extracted from the songs fit well with Russel’s valence(negative-positive) and arousal(inactive-active) model (Russell, 1980).",
      "startOffset" : 149,
      "endOffset" : 164
    }, {
      "referenceID" : 13,
      "context" : "Several cross-cultural studies show evidence for universal emotional cues in music and language across different cultures and traditions (McKay, 2002).",
      "startOffset" : 137,
      "endOffset" : 150
    }, {
      "referenceID" : 9,
      "context" : "While significant advances have been made in the area of emotion detection and mood classification based on music and lyrics analysis, through large-scale machine learning operating on vast feature sets, sometimes spanning multiple domains, applied to relatively short musical selections (Kim et al., 2010).",
      "startOffset" : 288,
      "endOffset" : 306
    }, {
      "referenceID" : 1,
      "context" : "For general linguistic features, we used the frequency of 67 linguistic features described by (Biber, 1991).",
      "startOffset" : 94,
      "endOffset" : 107
    }, {
      "referenceID" : 15,
      "context" : "For semantic categories of the words, we used Wordnet (Miller et al., 1998).",
      "startOffset" : 54,
      "endOffset" : 75
    }, {
      "referenceID" : 8,
      "context" : "Louwerse (2001), Biber (1991), Semin and Fiedler (1988, 1991), Johnson-laird and Oatley (1989), Miller et al.",
      "startOffset" : 0,
      "endOffset" : 16
    }, {
      "referenceID" : 1,
      "context" : "Louwerse (2001), Biber (1991), Semin and Fiedler (1988, 1991), Johnson-laird and Oatley (1989), Miller et al.",
      "startOffset" : 17,
      "endOffset" : 30
    }, {
      "referenceID" : 1,
      "context" : "Louwerse (2001), Biber (1991), Semin and Fiedler (1988, 1991), Johnson-laird and Oatley (1989), Miller et al.",
      "startOffset" : 17,
      "endOffset" : 95
    }, {
      "referenceID" : 1,
      "context" : "Louwerse (2001), Biber (1991), Semin and Fiedler (1988, 1991), Johnson-laird and Oatley (1989), Miller et al. (1998), Coltheart (1981), Baayen, Piepenbrock, and Gulikers (1995), Tausczik and Pennebaker (2010)",
      "startOffset" : 17,
      "endOffset" : 117
    }, {
      "referenceID" : 1,
      "context" : "Louwerse (2001), Biber (1991), Semin and Fiedler (1988, 1991), Johnson-laird and Oatley (1989), Miller et al. (1998), Coltheart (1981), Baayen, Piepenbrock, and Gulikers (1995), Tausczik and Pennebaker (2010)",
      "startOffset" : 17,
      "endOffset" : 135
    }, {
      "referenceID" : 1,
      "context" : "Louwerse (2001), Biber (1991), Semin and Fiedler (1988, 1991), Johnson-laird and Oatley (1989), Miller et al. (1998), Coltheart (1981), Baayen, Piepenbrock, and Gulikers (1995), Tausczik and Pennebaker (2010)",
      "startOffset" : 17,
      "endOffset" : 177
    }, {
      "referenceID" : 1,
      "context" : "Louwerse (2001), Biber (1991), Semin and Fiedler (1988, 1991), Johnson-laird and Oatley (1989), Miller et al. (1998), Coltheart (1981), Baayen, Piepenbrock, and Gulikers (1995), Tausczik and Pennebaker (2010)",
      "startOffset" : 17,
      "endOffset" : 209
    }, {
      "referenceID" : 2,
      "context" : "We also collected all the English words from Google unigrams (Brants and Franz, 2006) and binned them into one of the 44 categories if one of their synonyms belonged to those categories.",
      "startOffset" : 61,
      "endOffset" : 85
    }, {
      "referenceID" : 21,
      "context" : "To capture the various emotions expressed by the statement, we have used the emotion words given by (Tausczik and Pennebaker, 2010), classified into two classes broadly basic emotions (anger, fear, disgust, happiness, etc.",
      "startOffset" : 100,
      "endOffset" : 131
    }, {
      "referenceID" : 8,
      "context" : "Also, we used the MRC Psycholinguistic Database (Johnson-laird and Oatley, 1989), to get linguistic measures such as familiarity, concreteness, and meaningfulness.",
      "startOffset" : 48,
      "endOffset" : 80
    }, {
      "referenceID" : 3,
      "context" : "5 to 1, and to balance the classes we performed synthetic minority oversampling (SMOTE) (Chawla et al., 2002).",
      "startOffset" : 88,
      "endOffset" : 109
    }, {
      "referenceID" : 14,
      "context" : "There are several studies (Mihalcea and Strapparava, 2012; Su, Fung, and Auguin, 2013; Laurier, Grivolla, and Herrera, 2008; Kim et al., 2010) that have looked into emotions in music based on language as well as few audio features.",
      "startOffset" : 26,
      "endOffset" : 142
    }, {
      "referenceID" : 9,
      "context" : "There are several studies (Mihalcea and Strapparava, 2012; Su, Fung, and Auguin, 2013; Laurier, Grivolla, and Herrera, 2008; Kim et al., 2010) that have looked into emotions in music based on language as well as few audio features.",
      "startOffset" : 26,
      "endOffset" : 142
    } ],
    "year" : 2015,
    "abstractText" : "The music industry is a $130 billion industry. Predicting whether a song catches the pulse of the audience impacts the industry. In this paper we analyze language inside the lyrics of the songs using several computational linguistic algorithms and predict whether a song would make to the top or bottom of the billboard rankings based on the language features. We trained and tested an SVM classifier with a radial kernel function on the linguistic features. Results indicate that we can classify whether a song belongs to top and bottom of the billboard charts with a precision of 0.76.",
    "creator" : "LaTeX with hyperref package"
  }
}