{
  "name" : "1512.03423.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Predicting proximity with ambient mobile sensors for non-invasive health diagnostics",
    "authors" : [ "Sylvester Olubolu Orimaye", "Foo Chuan Leong", "Chen Hui Lee", "Eddy Cheng", "Han Ng" ],
    "emails" : [ "sylvester.orimaye@monash.edu" ],
    "sections" : [ {
      "heading" : null,
      "text" : "I. INTRODUCTION The importance of predicting with mobile sensors can be seen in various mobile apps that help people’s lifestyle. In most cases, the acceleration sensor in mobile devices have been used to capture activity patterns using the x, y and z coordinate values generated by the sensor. This has given substantial accuracy, especially for activities that generate vivid alternating patterns, such as running and jogging [1]. However, it is rather unclear whether other sensors could as well contribute to the prediction, and perhaps, the combination of two or more sensors could lead to better prediction of different activities.\nIn this paper, we predict a novel activity that has to do with the nearness or proximity distance of a human body to the mobile device without physically touching or holding the mobile device. As such, for the purpose of this work, we refer to proximity distance recognition as “nearness recognition”, and hence, will be used consistently for the rest of this paper.\nHuman-mobile nearness recognition is important and could significantly change the way humans communicate with their mobile devices. Nearness recognition could be used in the area of ambient health intelligence, whereby human health information such as wellness or exposure to environmental hazards can be autonomously detected by a mobile app. For example, [2] used the ambient temperature and pressure sensors to measure a user’s physiological conditions and disorders in hazardous environments. High humidity can cause mold and fungus to grow and affect people with asthma and allergies, while in low humidity, dry skin and eyes itchiness could develop [3]. Thus, detecting these ambient changes around humans could potentially prevent health problems.\nAs such, we perform experiments by collecting data from steady and non-steady spaces and perform several data transformations to show that both exhibit different patterns or signatures, and thus can be studied and used as features to train machine learning algorithms. Second, we predict that a human is near to a mobile device by up to 88.75% accuracy (88.3% sensitivity) and then collect several ambient information for diagnostic purposes as shown in Figure 1.\nSmart Phonert Diagnostic Interface\nPatient Doctor\nSend Ambient Sensor Readings\nFig. 1. Using mobile ambient sensors for health diagnostics.\nThe rest of this paper is organized as follows. Related works are discussed in Section II; steady and non-steady spaces in Section III; nearness recognition in Section IV; experiments and results in Section V; and conclusion in Section VI."
    }, {
      "heading" : "II. RELATED WORK",
      "text" : "Most related works have performed activity recognition for healthy lifestyle and fitness using the acceleration sensor [1], [4]. For example,[1] performed activity recognition using the acceleration sensor on Android based mobile device. Several activities including walking, jogging, standing, sitting, and ascending or descending stairs were predicted having learned a set of transformed features. Acceleration data was transformed into 43 learn-able features. Multilayer perceptron has the best predictive accuracy of 91.7% followed by J48 with 85.1%. Our work differs from [1] as we predict nearness or noticeable proximity of the human body to a mobile device.\nMore recently, proximity detection has been introduced for creating several non-invasive health diagnostic tool for the health industry using Body Area Network (BAN) techniques [5]. Our work falls in this category, and more importantly, novel in the sense that we do not use only one sensor point\nar X\niv :1\n51 2.\n03 42\n3v 1\n[ cs\n.C Y\n] 1\n0 D\nec 2\n01 5\n2 or multiple devices in our prediction. We combined multiple sensors’ data on one mobile device alone to improve the proximity prediction accuracy."
    }, {
      "heading" : "III. STEADY AND NON-STEADY SPACES",
      "text" : "In this work, we identify a three-dimensional space as a habitable area that supports physical interactions between a human body and other objects therein. Steady and non-steady spaces can be likened to the popular steady and transient states in thermodynamics [6], and audio signal processing [7], whereby the output of a filter generates unsteady sinewave before resulting to a steady sinewave of similar frequency, see Figures 2 and 3.\nSimilarly, we propose that, at a certain spatio-temporal window Sw, a space could be in a steady state within a particular time interval t1− tn−1, and subsequently enters into a non-steady space in another time interval t1 − tm−1 due to a sudden interference caused by a human body on the steady space."
    }, {
      "heading" : "A. Steady Space",
      "text" : "We refer to a steady space as a three-dimensional space around a mobile device with measurable sinusoids at a specific period T . The steady state excludes the presence or existence of a human body at a close proximity to the mobile device as illustrated in Figure 2. Figure 4 shows a steady threedimensional space with the sinusoidal output of a pressure sensor within a 60 seconds period (i.e. T = 60s).\nAs such, we define the characteristic of a steady space as\nf(t) = Sn∑ i=1 a sinωt+ λ (1)\nwhere Sn is the number of sinusoidal signals present, a is the constant amplitude of each sinusoid, ω is the frequency of each sinusoid, and λ is a normalization parameter for each steady space signal.\n0 10 20 30 40 50 601 0 0 5 .9\n1 1 0 0 5 .9\n4 1 0 0 5 .9\n7\nTime(s)\nP re\ns s u\nre (\nh P\na )\nSteady Space\nFig. 4. An example of a steady three-dimensional space sinusoidal output for a pressure sensor with T=60s."
    }, {
      "heading" : "B. Non-Steady Space",
      "text" : "We identify a non-steady space as a three-dimensional steady space that enters into transient as a result of the extra oscillation and radiation introduced to the steady space with an entry of a human body. Thus, Figure 5 shows a non-steady three-dimensional space, again with the sinusoidal output of a pressure sensor within a 60 seconds period (i.e. T = 60s).\nThus, we define the characteristic of a non-steady space as\nf(t) = Sn+H∑ i=1 γ(t) sinωt+ λ (2)\nwhere H is the extra human oscillation or signal introduced to the set of existing sinusoidal signals,γ(t) is the transient component introduced as a result of the introduction of H , ω is the frequency of each sinusoid, and λ is a normalization factor for the sinusoids."
    }, {
      "heading" : "IV. NEARNESS RECOGNITION",
      "text" : "Having defined the characteristics of steady and non-steady spaces, we propose to learn the characteristics in order to detect human-mobile nearness. We propose that a human is likely to be near or in a close proximity to a mobile device when the condition in Equation 2 is satisfied. Moreover, signals that are characterized by Equation 2, have also been characterized by a similar and popular equation in speech signal processing [8]:\n3 F (t) = g(t)ejωt + h(t), t = 0, ...n− 1 (3) where g(t) is the random amplitude, h(t) is a noise compo-\nnent, and ω is defined as the transient frequency. In order to detect human-mobile nearness, one could learn the g(t), ω, and h(t) components [9]. In addition, research have shown that the human body is capable of generating waveforms as a result of the endogenous electromagnetic fields which radiate from the human body to the three-dimensional space [10], [11]. In a recent research by [12], it was shown that the human body could significantly alter the electromagnetic waves that are generated by sensors, thereby leading to noisy wave pattern."
    }, {
      "heading" : "A. Data Collection",
      "text" : "We developed an Android application to log several sensor readings from a Samsung Galaxy S4 mobile device in a controlled environment. The sensors include, Pressure, Gravity, Accelerometer, Ambient Temperature, Relative Humidity, Magnetometer, Gyroscope, Ambient Light, and Rotation Vector. The data logged per one reading instance include the X,Y,Z coordinates of each sensor and the reading timestamp in milliseconds.\nOur controlled environment is a designated behavioral lab, which was designed for the purpose of conducting behavioral experiments relating to humans. Thus, we regard the behavioral lab as a three-dimensional space as discussed in Section III. Since we propose to learn both steady and non-steady spaces, we performed data collection in two phases.\nIn phase 1, a three-dimensional steady space is simulated by starting the data collection app with the mobile device placed on a table at the common area within the lab. In this phase, no human presence is required in the lab. We then log readings from the 9 sensors over a period of 60 minutes.\nIn phase 2, we simulated a three-dimensional non-steady space by maintaining the setup in phase 1 and include a human subject to walk or sit around the mobile device up to a distance of 1 meter from it over a period of 10 minutes while logging the sensor readings.\nPhase 2 was performed with 20 different participants who are regular mobile phone users. Furthermore, the total reading instances per phase from each human subject was divided into several reading windows. Each 10 minute period in a phase, generated approximately 6000 reading instances on average. We limit each reading window to a maximum of 512 in order to allow the sinusoidal outputs generate enough unique and learn-able characteristics as suggested in [9]."
    }, {
      "heading" : "B. Data Transformation",
      "text" : "It is essential to transform the raw time-series readings to generate different learn-able features [9]. As such, we use several statistical and numerical techniques to transform the data for each sensor. • Mean (µ) [1]: average of each coordinate X,Y, and Z\nover the total number of reading instances in a reading window.\nµ(X,Y, Z) = ∑N i=1 ri Wr\n(4)\nwhere N is the number of readings in each coordinate, r is a reading value, and Wr is the reading window set to 512. • Standard Deviation (SD) [1]: the standard deviation for each coordinate X,Y, and Z over the total number of reading instances in a reading window.\nSD(X,Y, Z) = √√√√ 1 N N∑ i=1 (ri − µ)2 (5)\nwhere N is the number of readings in each coordinate, r is a reading value, and µ is the mean of the reading values. • Entropy(η): the entropy for each coordinate X,Y, and Z over the total number of reading instances in a reading window. Entropy measures the level of uncertainty in the sample data, where the entropy is minimal for a less random data and larger for a more random data [13].\nη(X,Y, Z) = 1\n2 ln(2πeσ2) (6)\nwhere X,Y,Z are sets of reading instances for the coordinates, e is an exponential function, and σ2 is the variance. • Mean Absolute Difference (MAD) [1]: For each X,Y,Z coordinates in a sensor, we compute the mean absolute difference as the mean of the difference between the values in each coordinate and the mean value for that coordinate.\nMAD(X,Y, Z) = ∑N i=1 ri − µ Wr\n(7)\n• Mean Resultant Weight(MRW) [1]: The weight is computed as the square root of the sum of the square of each value in the X,Y,Z coordinates divided by the number of reading instances in the reading window.\nMRWXY Z =\n√∑N i=1 x 2 i + y 2 i + z 2 i\nWr (8)\nwhere x, y and z are reading values from X,Y,Z coordinates, and Wr is the reading window. • Gaussian Coverage Strength (GCS): Gaussian distribution has been successfully used in signal processing for interpreting random variables [14]. Similarly, we transformed the values of the X, Y, Z coordinates with the Gaussian’s Probability Density Function (PDF) [15], and the Cumulative Distribution Function (CDF) [16], to represent the Gaussian distributions, respectively. The PDF is computed as follows:\nPDF = 1\nσ √ 2π e−\n(ri−µ) 2\n2σ2 (9)\nwhere σ is the standard deviation, e is an exponential function, ri is each reading, µ is the mean, and σ2 is the variance. Similarly, we compute the CDF as follows:\n4 CDF = 1\n2 [1 + erf( ri − µ σ √ 2 )] (10)\nwhere erf is the Gaussian error function for each reading ri [17], thus computed as:\nerf(r) = 2√ π ∫ r 0 e−t 2 dt (11)\nFigures 6 shows the differences in the Gaussian transformations (CDF) of the X-axis of a magnetometer sensor readings.\n0 10 20 30 40 50 60\n0 .0\n0 .5\n1 .0\n1 .5\nTime(s)\nM a g\nn e ti\nc F\nie ld\n(µ T\n)\nSteady Space Non−Steady Space\nADPI =\n∑N i=1 pki − pki+1\nWr ; pki ≥ µ(magFFT )\n(14) where µ(magFFT ) is the mean of the magnitudes generated by the FFT. Note that we did not compute the interval between the distinct peaks as the difference between the “log” of the peaks as in Equation 13. This is because the FFT generates relatively smooth graphs or patterns (see Figure 7), which makes the magnitudes of its sinusoids very small [9], and thus, generates peaks that are very close to the origin. As such, the log of such peaks could lead to ambiguous intervals. Since the CDF generates visible regular patterns with more distinct peaks (see figures 6), our FFT-ADPI is computed on the CDF function over X,Y,Z axis of each sensor."
    }, {
      "heading" : "C. Features Set",
      "text" : "Table I shows the combined features set resulting from the transformation processes. The set will be used in training different machine learning algorithms for predicting the nearness of a human to a mobile device."
    }, {
      "heading" : "V. EXPERIMENTS",
      "text" : "We performed experiments by learning three different Machine Learning (ML) classifiers (algorithms) using the WEKA ML platfom with default settings [18]. The classifiers consist of, Sequential Minimum Optimization (SMO), which is a variant of Support Vector Machines (SVM), Naı̈ve Bayes (NB), and Neural Networks with Multilayer Perceptron (NN-MP).\nFor learning the classifiers, we used a meta classification approach that combines attribute selection techniques to reduce the features space while discarding the less contributing features. As such, we used the InfoGain attribute selection algorithm, together with the Ranker algorithm [19].\nOur dataset1 consists of 1000 instances comprising of 500 instances for steady-space (labeled control), 500 instances for non-steady space (labeled near).\n1See dataset on https://github.com/soori1/NearnessRecognition\n5\nTABLE I. COMBINED FEATURES SET FROM EACH SENSOR FOR LEARNING ML ALGORITHMS\nSN Feature Description/Summary Symbols 1 Mean Average over the values in each X,Y,Z coordinate. Mean-X, Mean-Y, Mean-Z. 2 SD Standard Deviation over the values in each X,Y,Z\ncoordinate. SD-X, SD-Y, SD-Z.\n3 Entropy Level of uncertainty over the values in each X,Y,Z coordinate. Entropy-X, Entropy-Y, Entropy-Z. 4 MAD Mean of the difference between each X,Y,Z coordinate value and their means. MAD-X, MAD-Y, MAD-Z. 5 MRW Square of the sum of square roots of X,Y,Z coordinate values divided by reading window. MRW. 6 GCS-CDF Cumulative Distribution Function over each X,Y,Z coordinate values. GCS-CDF-X, GCS-CDF-Y, GCSCDF-Z. 7 GAPI-PDF Average of peak-to-peak interval of the Probability Density Function over each X,Y,Z coordinate values. GAPI-PDF-X, GAPI-PDF-Y, GAPI-PDF-Z. 8 GAPI-CDF Average of peak-to-peak interval of the Cumulative Distribution Function over each X,Y,Z coordinate values. GAPI-CDF-X, GAPI-CDF-Y, GAPI-CDF-Z. 9 FFT-ADPICDF\nAverage of intervals between distinct peaks of the Fast Fourier Transformation of the Cumulative Distribution Function for X,Y,Z coordinates. FFT-ADPI-CDF-X, FFT-ADPICDF-Y, FFT-ADPI-CDF-Z."
    }, {
      "heading" : "A. Results and Discussion",
      "text" : "In the first stage, we evaluated the prediction performance of the three ML classifiers on the control and near categories with random 60% training and 40% testing set, see Table II.\nIn the second stage of our experiment, we evaluated the contributions of each sensor to predicting the near category with the SVM-SMO classifier using a 60%-40% split on the 1000 instances. This is to know which sensor(s) are more effective for prediction. As such, we removed each sensor’s readings one at a time and then classify with every other sensors, see Table III.\nUsing the SVM-SMO 79.4% F-measure as baseline (see Table II), we identified which sensor did not improve the performance of the classifier. If a sensor is removed, and the performance of the model increases more than 79.4% Fmeasure, then that sensor is considered as not improving the performance of the model.\nFurther, we evaluated by using SVM-SMO with 60%-40% split to compare the performance of the model with all the 9 sensors to the model with just the 5 sensors that gave better performance (i.e. light, gravity, accelerometer, rotationvector, and temperature). We then compute the sensitivity and 1-specificity of the two models for comparison. Table IV shows the comparison for the two models. The 5-sensor model clearly showed better sensitivity of 88.3% for performing the nearness recognition task [10], [12].\nFurthermore, we compared between the Receiver Operator Characteristic (ROC) curves of the two models [20]. Figure 8 shows the ROC curve for a model with all 9 sensors and Figure 9 shows the ROC curve for a model with the 5 sensors. The 5-sensor model shows better Area Under Curve (AUC) of 0.87 compared to 0.80 for 9 sensors."
    }, {
      "heading" : "VI. CONCLUSION AND FUTURE WORK",
      "text" : "We performed human-mobile nearness recognition for noninvasive health diagnostic purposes by analyzing and learning data from 9 different sensors on a mobile device. Several data transformation were done to learn the unique characteristics of both steady and non-steady three-dimensional spaces for\npredicting human nearness to a mobile device. The limitation of this work lies in the fact that test data consists of sensor readings that are limited to a controlled environment. It could be better to consider several uncontrolled environments including a public space which might contain several ambient noise signals at different weather and day times. Also, it could be challenging to execute the complex state-of-the-art ML algorithms on the devices. As such, collected ambient sensors data could be sent to a remote server in real-time, where the trained model can be used for prediction and then send the output back to the device. In the future, we plan to detect human breathing rate using the same technique and include a diagnostic web interface for medical practitioners.\n6"
    }, {
      "heading" : "ACKNOWLEDGEMENT",
      "text" : "This project was funded by the VITAL and the Tropical Medicine and Biology grants of Monash University Malaysia."
    } ],
    "references" : [ {
      "title" : "Activity recognition using cell phone accelerometers",
      "author" : [ "J.R. Kwapisz", "G.M. Weiss", "S.A. Moore" ],
      "venue" : "ACM SigKDD Explorations Newsletter, vol. 12, no. 2, pp. 74–82, 2011.",
      "citeRegEx" : "1",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Wireless sensor networks for health monitoring",
      "author" : [ "R. Jafari", "A. Encarnacao", "A. Zahoory", "F. Dabiri", "H. Noshadi", "M. Sarrafzadeh" ],
      "venue" : "Mobile and Ubiquitous Systems: Networking and Services. The Second Annual International Conference on. IEEE, July 2005, pp. 479–481.",
      "citeRegEx" : "2",
      "shortCiteRegEx" : null,
      "year" : 2005
    }, {
      "title" : "Opposing effects of particle pollution, ozone, and ambient temperature on arterial blood pressure",
      "author" : [ "B. Hoffmann", "H. Luttmann-Gibson", "A. Cohen", "A. Zanobetti", "C. de Souza", "C. Foley", "H.H. Suh", "B.A. Coull", "J. Schwartz", "M. Mittleman" ],
      "venue" : "Environmental health perspectives, vol. 120, no. 2, p. 241, 2012.",
      "citeRegEx" : "3",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Activity recognition from accelerometer data on a mobile phone",
      "author" : [ "T. Brezmes", "J.-L. Gorricho", "J. Cotrina" ],
      "venue" : "Distributed computing, artificial intelligence, bioinformatics, soft computing, and ambient assisted living. Springer, 2009, pp. 796–799.",
      "citeRegEx" : "4",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "Body area networks: A survey",
      "author" : [ "M. Chen", "S. Gonzalez", "A. Vasilakos", "H. Cao", "V.C. Leung" ],
      "venue" : "Mobile networks and applications, vol. 16, no. 2, pp. 171–193, 2011.",
      "citeRegEx" : "5",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Steady and transient states thermal analysis of a 7.5kw squirrel-cage induction machine at rated-load operation",
      "author" : [ "O.I. Okoro" ],
      "venue" : "Energy Conversion, IEEE Transactions on, vol. 20, no. 4, pp. 730–736, 2005.",
      "citeRegEx" : "6",
      "shortCiteRegEx" : null,
      "year" : 2005
    }, {
      "title" : "A psychoacoustic bass enhancement system with improved transient and steady-state performance",
      "author" : [ "H. Mu", "W.-S. Gan", "E.-L. Tan" ],
      "venue" : "Acoustics, Speech and Signal Processing (ICASSP), 2012 IEEE International Conference on. IEEE, 2012, pp. 141–144.",
      "citeRegEx" : "7",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Multiplicative noise models: Parameter estimation using cumulants",
      "author" : [ "A. Swami" ],
      "venue" : "Signal processing, vol. 36, no. 3, pp. 355–373, 1994.",
      "citeRegEx" : "8",
      "shortCiteRegEx" : null,
      "year" : 1994
    }, {
      "title" : "Discrimination of steady state and transient state of extremum seeking control via sinusoidal detection",
      "author" : [ "B. Mu", "Y. Li", "J.E. Seem" ],
      "venue" : "ASME 2013 Dynamic Systems and Control Conference. American Society of Mechanical Engineers, 2013, pp. 36A006–36A006.",
      "citeRegEx" : "9",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Statistical analysis on human body radiation points",
      "author" : [ "M.H. Haron", "M.N. Taib", "M.S.A.M. Ali", "M.M. Yunus", "S.Z.A. Jalil" ],
      "venue" : "Control and System Graduate Research Colloquium (ICSGRC), 2012 IEEE. IEEE, 2012, pp. 100–105.",
      "citeRegEx" : "10",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "The human body characteristics as a signal transmission medium for intrabody communication",
      "author" : [ "N. Cho", "J. Yoo", "S.-J. Song", "J. Lee", "S. Jeon", "H.-J. Yoo" ],
      "venue" : "Microwave Theory and Techniques, IEEE Transactions on, vol. 55, no. 5, pp. 1080–1086, 2007.",
      "citeRegEx" : "11",
      "shortCiteRegEx" : null,
      "year" : 2007
    }, {
      "title" : "A statistical analysis of the influence of the human body on the radiation pattern of wearable antennas",
      "author" : [ "M. Mackowiak", "C. Oliveira", "C. Lopes", "L.M. Correia" ],
      "venue" : "Personal Indoor and Mobile Radio Communications (PIMRC), 2011 IEEE 22nd International Symposium on. IEEE, 2011, pp. 2214–2218.",
      "citeRegEx" : "12",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Signal processing with compressive measurements",
      "author" : [ "M.A. Davenport", "P.T. Boufounos", "M.B. Wakin", "R.G. Baraniuk" ],
      "venue" : "Selected Topics in Signal Processing, IEEE Journal of, vol. 4, no. 2, pp. 445–460, 2010.",
      "citeRegEx" : "14",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "On estimation of a probability density function and mode",
      "author" : [ "E. Parzen" ],
      "venue" : "The annals of mathematical statistics, pp. 1065–1076, 1962.",
      "citeRegEx" : "15",
      "shortCiteRegEx" : null,
      "year" : 1962
    }, {
      "title" : "Table for estimating the goodness of fit of empirical distributions",
      "author" : [ "N. Smirnov" ],
      "venue" : "The Annals of Mathematical Statistics, pp. 279–281, 1948.",
      "citeRegEx" : "16",
      "shortCiteRegEx" : null,
      "year" : 1948
    }, {
      "title" : "Chernoff-type bounds for the gaussian error function",
      "author" : [ "S.-H. Chang", "P.C. Cosman", "L.B. Milstein" ],
      "venue" : "Communications, IEEE Transactions on, vol. 59, no. 11, pp. 2939–2944, 2011.",
      "citeRegEx" : "17",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "The weka data mining software: an update",
      "author" : [ "M. Hall", "E. Frank", "G. Holmes", "B. Pfahringer", "P. Reutemann", "I.H. Witten" ],
      "venue" : "ACM SIGKDD explorations newsletter, vol. 11, no. 1, pp. 10–18, 2009.",
      "citeRegEx" : "18",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "Feature ranking fusion for text classifier",
      "author" : [ "M. Makrehchi", "M.S. Kamel" ],
      "venue" : "Intelligent Data Analysis, vol. 16, no. 6, pp. 879–896, 2012.",
      "citeRegEx" : "19",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Roc analysis of classifiers in machine learning: A survey",
      "author" : [ "M. Majnik", "Z. Bosnić" ],
      "venue" : "Intelligent Data Analysis, vol. 17, no. 3, pp. 531– 558, 2013.",
      "citeRegEx" : "20",
      "shortCiteRegEx" : null,
      "year" : 2013
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "This has given substantial accuracy, especially for activities that generate vivid alternating patterns, such as running and jogging [1].",
      "startOffset" : 133,
      "endOffset" : 136
    }, {
      "referenceID" : 1,
      "context" : "For example, [2] used the ambient temperature and pressure sensors to measure a user’s physiological conditions and disorders in hazardous environments.",
      "startOffset" : 13,
      "endOffset" : 16
    }, {
      "referenceID" : 2,
      "context" : "High humidity can cause mold and fungus to grow and affect people with asthma and allergies, while in low humidity, dry skin and eyes itchiness could develop [3].",
      "startOffset" : 158,
      "endOffset" : 161
    }, {
      "referenceID" : 0,
      "context" : "Most related works have performed activity recognition for healthy lifestyle and fitness using the acceleration sensor [1], [4].",
      "startOffset" : 119,
      "endOffset" : 122
    }, {
      "referenceID" : 3,
      "context" : "Most related works have performed activity recognition for healthy lifestyle and fitness using the acceleration sensor [1], [4].",
      "startOffset" : 124,
      "endOffset" : 127
    }, {
      "referenceID" : 0,
      "context" : "For example,[1] performed activity recognition using the acceleration sensor on Android based mobile device.",
      "startOffset" : 12,
      "endOffset" : 15
    }, {
      "referenceID" : 0,
      "context" : "Our work differs from [1] as we predict nearness or noticeable proximity of the human body to a mobile device.",
      "startOffset" : 22,
      "endOffset" : 25
    }, {
      "referenceID" : 4,
      "context" : "More recently, proximity detection has been introduced for creating several non-invasive health diagnostic tool for the health industry using Body Area Network (BAN) techniques [5].",
      "startOffset" : 177,
      "endOffset" : 180
    }, {
      "referenceID" : 5,
      "context" : "Steady and non-steady spaces can be likened to the popular steady and transient states in thermodynamics [6], and audio signal processing [7], whereby the output of a filter generates unsteady sinewave before resulting to a steady sinewave of similar frequency, see Figures 2 and 3.",
      "startOffset" : 105,
      "endOffset" : 108
    }, {
      "referenceID" : 6,
      "context" : "Steady and non-steady spaces can be likened to the popular steady and transient states in thermodynamics [6], and audio signal processing [7], whereby the output of a filter generates unsteady sinewave before resulting to a steady sinewave of similar frequency, see Figures 2 and 3.",
      "startOffset" : 138,
      "endOffset" : 141
    }, {
      "referenceID" : 7,
      "context" : "Moreover, signals that are characterized by Equation 2, have also been characterized by a similar and popular equation in speech signal processing [8]:",
      "startOffset" : 147,
      "endOffset" : 150
    }, {
      "referenceID" : 8,
      "context" : "In order to detect human-mobile nearness, one could learn the g(t), ω, and h(t) components [9].",
      "startOffset" : 91,
      "endOffset" : 94
    }, {
      "referenceID" : 9,
      "context" : "In addition, research have shown that the human body is capable of generating waveforms as a result of the endogenous electromagnetic fields which radiate from the human body to the three-dimensional space [10], [11].",
      "startOffset" : 206,
      "endOffset" : 210
    }, {
      "referenceID" : 10,
      "context" : "In addition, research have shown that the human body is capable of generating waveforms as a result of the endogenous electromagnetic fields which radiate from the human body to the three-dimensional space [10], [11].",
      "startOffset" : 212,
      "endOffset" : 216
    }, {
      "referenceID" : 11,
      "context" : "In a recent research by [12], it was shown that the human body could significantly alter the electromagnetic waves that are generated by sensors, thereby leading to noisy wave pattern.",
      "startOffset" : 24,
      "endOffset" : 28
    }, {
      "referenceID" : 8,
      "context" : "We limit each reading window to a maximum of 512 in order to allow the sinusoidal outputs generate enough unique and learn-able characteristics as suggested in [9].",
      "startOffset" : 160,
      "endOffset" : 163
    }, {
      "referenceID" : 8,
      "context" : "Data Transformation It is essential to transform the raw time-series readings to generate different learn-able features [9].",
      "startOffset" : 120,
      "endOffset" : 123
    }, {
      "referenceID" : 0,
      "context" : "• Mean (μ) [1]: average of each coordinate X,Y, and Z over the total number of reading instances in a reading window.",
      "startOffset" : 11,
      "endOffset" : 14
    }, {
      "referenceID" : 0,
      "context" : "• Standard Deviation (SD) [1]: the standard deviation for each coordinate X,Y, and Z over the total number of reading instances in a reading window.",
      "startOffset" : 26,
      "endOffset" : 29
    }, {
      "referenceID" : 0,
      "context" : "• Mean Absolute Difference (MAD) [1]: For each X,Y,Z coordinates in a sensor, we compute the mean absolute difference as the mean of the difference between the values in each coordinate and the mean value for that coordinate.",
      "startOffset" : 33,
      "endOffset" : 36
    }, {
      "referenceID" : 0,
      "context" : "• Mean Resultant Weight(MRW) [1]: The weight is computed as the square root of the sum of the square of each value in the X,Y,Z coordinates divided by the number of reading instances in the reading window.",
      "startOffset" : 29,
      "endOffset" : 32
    }, {
      "referenceID" : 12,
      "context" : "• Gaussian Coverage Strength (GCS): Gaussian distribution has been successfully used in signal processing for interpreting random variables [14].",
      "startOffset" : 140,
      "endOffset" : 144
    }, {
      "referenceID" : 13,
      "context" : "Similarly, we transformed the values of the X, Y, Z coordinates with the Gaussian’s Probability Density Function (PDF) [15], and the Cumulative Distribution Function (CDF) [16], to represent the Gaussian distributions, respectively.",
      "startOffset" : 119,
      "endOffset" : 123
    }, {
      "referenceID" : 14,
      "context" : "Similarly, we transformed the values of the X, Y, Z coordinates with the Gaussian’s Probability Density Function (PDF) [15], and the Cumulative Distribution Function (CDF) [16], to represent the Gaussian distributions, respectively.",
      "startOffset" : 172,
      "endOffset" : 176
    }, {
      "referenceID" : 15,
      "context" : "where erf is the Gaussian error function for each reading ri [17], thus computed as:",
      "startOffset" : 61,
      "endOffset" : 65
    }, {
      "referenceID" : 8,
      "context" : "• Fast Fourier Transform Average Distinct Peak Interval(FFT-ADPI): As in [9], we use the FFT to transform the values from the X,Y,Z coordinates of each sensor readings and then characterize the sinusoidal output using the resulting FFT magnitudes.",
      "startOffset" : 73,
      "endOffset" : 76
    }, {
      "referenceID" : 8,
      "context" : "This is because the FFT generates relatively smooth graphs or patterns (see Figure 7), which makes the magnitudes of its sinusoids very small [9], and thus, generates peaks that are very close to the origin.",
      "startOffset" : 142,
      "endOffset" : 145
    }, {
      "referenceID" : 16,
      "context" : "We performed experiments by learning three different Machine Learning (ML) classifiers (algorithms) using the WEKA ML platfom with default settings [18].",
      "startOffset" : 148,
      "endOffset" : 152
    }, {
      "referenceID" : 17,
      "context" : "As such, we used the InfoGain attribute selection algorithm, together with the Ranker algorithm [19].",
      "startOffset" : 96,
      "endOffset" : 100
    }, {
      "referenceID" : 9,
      "context" : "3% for performing the nearness recognition task [10], [12].",
      "startOffset" : 48,
      "endOffset" : 52
    }, {
      "referenceID" : 11,
      "context" : "3% for performing the nearness recognition task [10], [12].",
      "startOffset" : 54,
      "endOffset" : 58
    }, {
      "referenceID" : 18,
      "context" : "Furthermore, we compared between the Receiver Operator Characteristic (ROC) curves of the two models [20].",
      "startOffset" : 101,
      "endOffset" : 105
    } ],
    "year" : 2015,
    "abstractText" : "Modern smart phones are becoming helpful in the areas of Internet-Of-Things (IoT) and ambient health intelligence. By learning data from several mobile sensors, we detect nearness of the human body to a mobile device in a three-dimensional space with no physical contact with the device for non-invasive health diagnostics. We show that the human body generates wave patterns that interact with other naturally occurring ambient signals that could be measured by mobile sensors, such as, temperature, humidity, magnetic field, acceleration, gravity, and light. This interaction consequentially alters the patterns of the naturally occurring signals, and thus, exhibits characteristics that could be learned to predict the nearness of the human body to a mobile device, hence provide diagnostic information for medical practitioners. Our prediction technique achieved 88.75% accuracy and 88.3% specificity.",
    "creator" : "LaTeX with hyperref package"
  }
}