{
  "name" : "1601.01675.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Ensemble Methods of Classification for Power Systems Security Assessment",
    "authors" : [ "Alexei Zhukov", "Victor Kurbatsky", "Nikita Tomin", "Denis Sidorov", "Daniil Panasetsky", "Aoife Foley" ],
    "emails" : [ "tomin}@isem.sei.irk.ru", "a.foley@qub.ac.uk" ],
    "sections" : [ {
      "heading" : null,
      "text" : "Index Terms—power system, ensemble methods; boosting; classification; heuristics; random forests; security assessment.\nI. INTRODUCTION\nAssessment of security of bulk electric power systems is one of the pressing problems in the modern power engineering. The trends towards liberalization and the need to increase electricity transmission due to growing loads and generation expansion make existing power companies operate their electrical networks in critical conditions, close to their admissible security limits [1]. In such conditions the unforeseen excess disturbances, weak connections, hidden defects of the relay protection system and automated devices, human factors as well as a great amount of other factors can cause a drop in the system security or even the development of catastrophic accidents.\nFor the time being there is a wide spectrum of approaches and tools for the assessment of security. All the variety of the methods can be divided into: • Traditional approaches based on a detailed modeling\nof potential disturbances in electric power systems and\nThis work is funded by the RSF project “Development of an intelligent system for preventing large-scale emergencies in power systems” under grant No. 14-19-00054.\nnumerical calculations of nonlinear capacity equations [3, 4]; • Intelligent approaches which involve the artificial intelligence algorithms learning on a limited set of power system states, such as artificial neural networks, support vector machine, decision trees, etc. [1, 2, 5, 19].\nAn analysis of methods for the assessment of security and voltage stability of electric power system shows that the existing traditional approaches cannot be effectively applied in the online and real time conditions because of their computation complexity. For example load flow calculation for the assessment of the aftermath of a system component fault, which underlies the classical approaches to the assessment of security in electric power systems and does not seem to be fully implemented because of complex modeling of corresponding protections, that trip the overloaded line or load feeder in case of inadmissible voltage level. Moreover, currently to meet the demand for electricity as well to ensure quality and reliability of electricity supply systems, the distributed generation is connected as a local energy source.\nAlthough, many of the developed approaches on the basis of intelligent models are more adapted to real changes in the power system topology and system conditions, they still do not have sufficient sensitivity to these changes, not always offer the possibility of predicting voltage stability losses, and do not allow us to estimate the probability of identifying a potentially dangerous state.\nAt the transmission level (i.e. bulk power), phasor measurement units (PMU’s) have been introduced to improve grid reliability. A PMU is a calculated real time phasor measurement synchronised to an absolute reference unit provided by a Global Positioning System (GPS). These PMU’s are used to assess grid (e.g. MVARs, kV, frequency changes etc.) conditions because they synchronise power quality in real time by comparing phase angle measurements. To date PMU are only deployed for Wide Area Measurement (WAM) [20, 21]. One of the issues of applying and using the large amounts of PMU datasets for rapid decision making. The decision making and onus is usually still with the expertise of the grid operators. However, as the number of market participants, renewable power sources, storage devices and smart loads\nar X\niv :1\n60 1.\n01 67\n5v 1\n[ cs\n.A I]\n7 J\nan 2\n01 6\nincrease in the power system both at the transmission (and distribution) level the decision making will become ever more complex. Hence this research employs the ensemble methods on the basis of decision trees. The calculations involved the following modifications of random forest models (Extremely Randomized Trees, Oblique Random Forests) and boosting models (Stochastic Gradient Boosting, AdaBoost). The effectiveness of their application is confirmed by a great number of calculations on the basis of power system test scheme. The suggested ensemble methods of classification are implemented in the free software environment R intended for calculations with an open-source code."
    }, {
      "heading" : "II. PROBLEM STATEMENT",
      "text" : "Security is an ability of electric power system to withstand sudden disturbances without unforeseen effects on the electricity consumers. It is provided by control capabilities of power systems. In the operational practices the required level of security can be achieved by both the preventive control actions (before a disturbance) and the emergency control actions (after disturbance). Control in the pre-emergency conditions is mainly a responsibility of the operational dispatching control. At the same time there can be situations where the speed of power system control by the dispatching personnel appears to be insufficient to avoid dangerous situations. The complexity of a problem here lies in the fact that most of dangerous (pre-emergency) states of electric power system which lead to large-scale blackouts are unique and there is no single algorithm (for solving) to effectively reveal such conditions as the time. The problem gets complicated by the fact that the security limit of electric power system constantly changes, therefore fast methods for real time security monitoring are required to analyze the current level of security and accurately trace the limit and detect the most vulnerable regions along it.\nThe key idea of the pre-emergency control concept is the fact that the voltage instability following the emergency disturbance which accompanies many system emergencies does not develop as fast as the dynamic instability of the electric power system [6]. Thus, when the phase of slow emergency development comes, the balance between generation and consumption is maintained for a long time and this makes it possible to detect potentially dangerous states, which appear after the disturbance, and generate respective preventive control actions [2]."
    }, {
      "heading" : "III. ENSEMBLE ALGORITHMS OF CLASSIFICATION AND THE PROBLEM OF POWER SECURITY ASSESSMENT",
      "text" : "A great many studies show that the effective solution to this problem can be found on the basis of machine learning methods which normally include artificial neural networks, decision trees, ensemble (committee) models, etc. This is related to their capabilities of fast detection of the images, patterns (i.e. typical samples), learning/generalization and, which is important, high speed of identifying the instability boundaries.\nOne of the advanced approaches to the analysis of complex technical systems is ensemble methods of classification. They make it possible to form reliable decision rules of classification for a set of potential system states. In this approach the key idea is to build a universal classifier of power system states which is capable of tracing dangerous pre-emergency conditions and predicting emergency situations on the basis of certain system security indices. In this case the detection of dangerous operation patterns is not effective without considering probable disturbance/faults, whose calculation leads to a considerable increase in the computational complexity and a potential decrease in the accuracy for basic algorithms. This leads to the need of finding a way to improve the accuracy of the classifier of power system states. One of such methods is the creation of ensembles of the classification models and their training.\nOne of the first most general theory of algorithmic ensembles was proposed in the algebraic approach by Y.I. Zhuravlev [7]. According to this theory the composition of N basic algorithms ht = C(at(x)), t = 1, . . . , N is taken to mean a superposition of algorithmic operators at : X → R, of a correction operation F : RN → R and decision rule C : R→ Y such as H(x) = C (F(a1(x), . . . , aN (x))), where x ∈ X , X is a space of objects, Y is a set of answers, and R is a space of estimates.\nLater Valiant and Kearns [8] were the first to pose the question about whether or not a weak learning algorithm can be strengthened to an arbitrary accurate learning algorithm. This process was called boosting. Schapire [9] developed the first provable polynomial-time boosting algorithm. It was intended for the conversion of weak models into strong ones by constructing an ensemble of classifiers. The main idea of the boosting algorithm is step-by-step enhancement of the algorithm ensemble. One of the popular implementations of this idea is Schapires AdaBoost algorithm which involves ensemble of decision trees [10].\nAnother approach to the classification and regression problems using the ensembles was suggested by Leo Breiman [11]. This approach is an extension of the bagging idea. According to this idea, a collective decision can be obtained by using an elementary committee method which classifies an object according to a decision of most of the algorithms. Unlike the boosting method bagging is based on parallel learning of base classifiers. One of the progressive baggingbased approaches is the method called Random Forest [11, 12]. Later there appeared the most effective modifications of both Random forests and boosting algorithms such as Extremely Randomized Trees, Oblique Random Forests and Stochastic Gradient Boosting [13].\nIn the researches devoted to the security assessment there are many approaches oriented to the construction of models on the basis of decision trees [1, 2, 5,13]. These models use both off-line (periodically updated) and on-line methods. Single trees are easily interpretable, yet do not always allow us to obtain the required accuracy when approximating complex\ntarget relationships. Therefore, it is considered reasonable to use compositions [14]."
    }, {
      "heading" : "IV. CALCULATION OF A POWER SYSTEM SECURITY ON THE BASIS OF ENSEMBLE MODELS",
      "text" : "Figure 1 presents a general scheme of the suggested approach for the estimation of power system security. The primary principle of the approach lies in the mathematical model learning on the basis of the ensemble method of classification to automatically make a sufficiently accurate assessment of the power system conditions according to the criterion secure/insecure on the basis of significant classification attributes of a power system state, for example active and reactive power flows, bus voltage, etc. A great amount of such attributes are obtained on the basis of randomly generated data sample consisting of a set of really possible states of electric power system [2].\nDepending on the ensemble method applied each decision rule will be trained by its subsampling according to the bagging and boosting principles. The final decision on the classification of any power system state is made within the generalized classifier according to different principles of simple majority voting, weighted voting or by choosing the most competent decision rule.\nIn the paper a list of potential power system states for the model learning is formed using quasi-dynamic modeling with a special program in the MATLAB environment (Fig.2). The load model was represented by static characteristics depending on voltage. When critical values of voltage are achieved the load is automatically transferred to shunts. The method of a proportional increase in load at all nodes of the test scheme was optimized for the security analysis in such a way that the initial condition for each emergency disturbance is a stable condition closest to it, from those calculated. Thus, at each stage of an increase in the test scheme load the emergency events (primary disturbances) are randomly modeled by the N − 1 reliability principle. As a result, the database including a set of various pre-emergency and emergency states of the test scheme is built.\nIn order to obtain a problem book each of such states is assigned a security index (here readers may refer to [14]) which is calculated by the following expression:\nSI = w1 ·\n∑nL i=1 LOIi + w2 · ∑nB i=1 V DIi\nnL + nB , (1)\nwhere w1 and w2 are the weighting factors of system security; LOI is line overload index; V DI is index of voltage deviation at nodes; nL and nB represent the number of lines and buses respectively.\nThus, the security index is determined by calculating the VDI and LOI, which are obtained using the following expressions:\nLOIkm =\n{ Skm−Slim\nSkm · 100, if Skm > Slim;\n0, if Skm < Slim. (2)\nV DIk =  |Umink |−|Uk| |Umink |\n· 100, if |Uk| < |Umink |; 0, if |Umink | ≤ |Uk| ≤ |Umaxk |; |Uk|−|Umaxk | |Umaxk |\n· 100, if |Uk| > |Umaxk |, (3)\nwhere Skm and Slim represent the MVA flow and MVA limit of branch k-m correspondingly, |Uk|, |Umaxk | and |Umaxk | are the minimum voltage limit, maximum voltage limit and bus voltage magnitude of k-bus respectively.\nEvaluating the security index as given by (1), each pattern is labeled as belonging to one of the four classes as shown in Table IV.\nTo give an idea of the criteria without going into details, the system states are presented. • Normal state implies that all parameters of the power\nsystem are maintained within specified normal operation limits.\n• Alarm state that some of the system parameters exceed the specified normal limits (for example, bus voltage can exceed 5%, but remain within 10%). Depending on the operation rules, actions can take place to bring the system to the normal state. • Emergency 1 state implies the system is still intact; however, some system constraints are violated. The system can be restored to the normal state (or at least to the alarm state), if the suitable corrective actions are taken. • Emergency 2 state implies that the current situation cannot be corrected and will lead to major emergency. Control actions, like load shedding or controlled system separation are used for saving as much of the system as possible from a widespread blackout.\nIn the case where the values of the indices exceed the specified limits on security and the high probability of emergency situations that correspond to these values, respective preventive or emergency control measures can be formed."
    }, {
      "heading" : "V. CASE STUDY",
      "text" : "The feasibility of the approach in a proof-of-concept has been demonstrated on the IEEE 118 power system consisting of more than 118 buses, 54 generators, and 186 transmission lines. An open-source environment R [16] with caret package [17] is used as a computing environment for proposed models design and testing."
    }, {
      "heading" : "A. Data base generation",
      "text" : "Operating conditions are all generated using the Powertrain System Analysis Toolkit (PSAT) [18]. The database generation and data conversion are conducted in MATLAB. The overall data base generation procedure, whose aim was to provide a representative sample of possible power system states, combining various prefault operating states and disturbances, is illustrated in Fig. 2.\nA data base representative of the potential power system states was obtained by generating, firstly, a sample of various prefault situations, and applying to each state the random disturbances to produce the corresponding stability scenarios. To obtain the data base composed of 6877 states, each of the prefault normal or heavy load states was combined with the possible disturbances. These have been simulated with a variable step MATLAB/PSAT quasi-dynamic simulation program, which computed the attribute values and allowed us to classify based on the security index the scenarios as normal, alarm, emergency 1 and emergency 2. The 490 initial candidate attributes such as active and reactive power flow, voltages used to characterize the power system states. They represent essentially power system quantities which may be available\nfrom the SCADA system or the Phasor Data Concentrator system in the power system state."
    }, {
      "heading" : "B. Estimating Performance For Classification",
      "text" : "In current paper we need to use proper performance measurement metrics for classification problems. We used the following metrics: • The overall accuracy of a model indicates how well the\nmodel predicts the actual data. • the Kappa statistic takes into account the expected error\nrate: k =\nO − E 1− E\n(4)\nwhere O is the observed accuracy and E is the expected accuracy under chance agreement."
    }, {
      "heading" : "C. Overview of obtained results",
      "text" : "Ensemble and single trees methods have been built for classifying the power system states, for various candidate attributes and four different security classifications. Tab. II shows comparison of accuracy achieved by the state-of-the-art classification tree learning algorithms. Namerly, the following classifiers where tested: J48 decision tree, conventional Breiman’s non-parametric decision tree learning technique CART, bagged CART (BCART), Random Forest, Extra Trees (ET) and Stochastic Gradient Descent (SGB) method. The ensemble and single tree methods were trained on 6877 samples dataset and tested on 1715 samples. Confusion matrix is shown in Tab. I. Each column of the matrix represents the instances in a predicted class while each row represents the instances in an actual class\nFig. 3 shows testing errors with respect to the number of trees for normal, alarm, emergency1 and emergency2 cases. As footnote its to be noted that all obtained accuracy values are close. But some of the models enjoy additional useful properties. For example Extra Trees needs less memory comparing with classical Random Forest but comparable with Stohastical gradient boosting.\nFig. 4 shows variable importance for all classes obtained by computing of mean gini index decrease. The classification trees select voltages under normal states as the most important attributes for security monitoring and assessment. It may be\nexplained by the fact that the voltage sag observed in the power system state reflects proportional increase in load, when the static characteristics of the load model depend on voltage. Under alarm and emergency states the power and reactive flow attributes were selected in preference to voltages. A possible explanation lies in the fact that this security criterion is more preventive like.\nWe also demonstrated the feasibility of dealing with incomplete and distorted data. Taking into consideration SCADA malfunctions, the corrupted patterns were used to train ensemble classification trees. The results showed that the test error rate did not changed even if 50% of gaps (Tab. IV)."
    }, {
      "heading" : "VI. CONCLUSION",
      "text" : "The ensemble classification methods were tested on the modified IEEE 118 power system showing that proposed technique can be employed to examine whether the power system is secured under steady-state operating conditions. The experimental studies showed that the ensemble methods can identify key system parameters as security indicators with high accuracy and, if required, the obtained security tree-based model can produce an alarm for triggering emergency control system. The next stage of this work will involve taking real power system data and modelling multiply decision making with many grid participants."
    } ],
    "references" : [ {
      "title" : "Development of software for modelling decentralized intelligent systems for security monitoring and control in power systems",
      "author" : [ "D. Panasetsky", "D. Tomin", "N. Voropai", "V. Kurbatsky", "A. Zhukov", "D. Sidorov" ],
      "venue" : "In Proc. of PowerTech Conf., IEEE PES,",
      "citeRegEx" : "1",
      "shortCiteRegEx" : "1",
      "year" : 2015
    }, {
      "title" : "Machine Learning Approaches to Power System Security Assessment",
      "author" : [ "L. Wehenkel" ],
      "venue" : "Dissertation, University of Liege",
      "citeRegEx" : "2",
      "shortCiteRegEx" : null,
      "year" : 1995
    }, {
      "title" : "Methods for rapid analysis in the problem of security assessment based on short-term forecasting system behavior",
      "author" : [ "A.B. Osak", "A.I. Shalaginov" ],
      "venue" : "Saint-Petersburg",
      "citeRegEx" : "3",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Decision tree-based online voltage security assessment using PMU measurements",
      "author" : [ "R. Diao" ],
      "venue" : "IEEE Trans. Power Syst. IEEE,",
      "citeRegEx" : "5",
      "shortCiteRegEx" : "5",
      "year" : 2009
    }, {
      "title" : "On the algebraic approach to solving the problems of recognition and classification",
      "author" : [ "Yu. I. Zhuravlev" ],
      "venue" : "Problemy kibernetiki, Moscow,",
      "citeRegEx" : "7",
      "shortCiteRegEx" : "7",
      "year" : 1978
    }, {
      "title" : "Cryptographic limitations on learning Boolean formulae and finite automata",
      "author" : [ "M. Kearns", "L. Valiant" ],
      "venue" : "J. ACM - ACM",
      "citeRegEx" : "8",
      "shortCiteRegEx" : null,
      "year" : 1994
    }, {
      "title" : "The boosting approach to machine learning: an overview",
      "author" : [ "R.E. Schapire" ],
      "venue" : "Nonlinear Estimation and Classification, Springer",
      "citeRegEx" : "9",
      "shortCiteRegEx" : null,
      "year" : 2003
    }, {
      "title" : "Experiments with a new boosting algorithm",
      "author" : [ "Y. Freund", "R.E. Schapire" ],
      "venue" : "Proc. ICML",
      "citeRegEx" : "10",
      "shortCiteRegEx" : null,
      "year" : 1996
    }, {
      "title" : "Random Forrest",
      "author" : [ "L. Breiman" ],
      "venue" : "Mach. Learn.",
      "citeRegEx" : "11",
      "shortCiteRegEx" : null,
      "year" : 2001
    }, {
      "title" : "Power System Security Assessment Using Ada Boost Algorithm",
      "author" : [ "M. Sadeghi", "M.A. Sadeghi", "S. Nourizadeh", "A.M. Ranjbar", "S. Azizi" ],
      "venue" : "Pros. of the NAPS’09, Starkville, MI",
      "citeRegEx" : "13",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "Design of pattern recognition system for static security assessment and classification",
      "author" : [ "S. Kalyani", "K. Shanti Swarup" ],
      "venue" : "Pattern Analysis & Applications, Aug. 2012,",
      "citeRegEx" : "15",
      "shortCiteRegEx" : "15",
      "year" : 2012
    }, {
      "title" : "Language and Environment for Statistical Computing, The R Core Team, version",
      "author" : [ "A R" ],
      "venue" : null,
      "citeRegEx" : "16",
      "shortCiteRegEx" : "16",
      "year" : 2015
    }, {
      "title" : "S",
      "author" : [ "M. Kuhm", "J. Wing" ],
      "venue" : "Weston et al. caret: Classification and Regression Training",
      "citeRegEx" : "17",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Power System Analysis Toolbox",
      "author" : [ "F. Milano" ],
      "venue" : "Documentation for PSAT, University College Dublin",
      "citeRegEx" : "18",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Integral Dynamical Models: Singularities",
      "author" : [ "D. Sidorov" ],
      "venue" : "Signals and Control. World Scientific Series on Nonlinear Sciences. Vol. 87, Singapore: World Sc. Pub.",
      "citeRegEx" : "19",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Redundancy and Observability Analysis of Conventional and PMU Measurements",
      "author" : [ "J.B.A. London", "S.A.R. Piereti", "R.A.S. Benedito", "N.G. Bretas" ],
      "venue" : "IEEE Transactions on Power Systems",
      "citeRegEx" : "20",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "Transmission line fault detection and localisation methodology using PMU measurements",
      "author" : [ "P. Gopakumar", "M.J.B. Reddy", "D.K. Mohanta" ],
      "venue" : "IET on Generation, Transmission & Distribution,2015,",
      "citeRegEx" : "21",
      "shortCiteRegEx" : "21",
      "year" : 2014
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "The trends towards liberalization and the need to increase electricity transmission due to growing loads and generation expansion make existing power companies operate their electrical networks in critical conditions, close to their admissible security limits [1].",
      "startOffset" : 260,
      "endOffset" : 263
    }, {
      "referenceID" : 2,
      "context" : "numerical calculations of nonlinear capacity equations [3, 4]; • Intelligent approaches which involve the artificial intelligence algorithms learning on a limited set of power system states, such as artificial neural networks, support vector machine, decision trees, etc.",
      "startOffset" : 55,
      "endOffset" : 61
    }, {
      "referenceID" : 0,
      "context" : "[1, 2, 5, 19].",
      "startOffset" : 0,
      "endOffset" : 13
    }, {
      "referenceID" : 1,
      "context" : "[1, 2, 5, 19].",
      "startOffset" : 0,
      "endOffset" : 13
    }, {
      "referenceID" : 3,
      "context" : "[1, 2, 5, 19].",
      "startOffset" : 0,
      "endOffset" : 13
    }, {
      "referenceID" : 14,
      "context" : "[1, 2, 5, 19].",
      "startOffset" : 0,
      "endOffset" : 13
    }, {
      "referenceID" : 15,
      "context" : "To date PMU are only deployed for Wide Area Measurement (WAM) [20, 21].",
      "startOffset" : 62,
      "endOffset" : 70
    }, {
      "referenceID" : 16,
      "context" : "To date PMU are only deployed for Wide Area Measurement (WAM) [20, 21].",
      "startOffset" : 62,
      "endOffset" : 70
    }, {
      "referenceID" : 1,
      "context" : "Thus, when the phase of slow emergency development comes, the balance between generation and consumption is maintained for a long time and this makes it possible to detect potentially dangerous states, which appear after the disturbance, and generate respective preventive control actions [2].",
      "startOffset" : 289,
      "endOffset" : 292
    }, {
      "referenceID" : 4,
      "context" : "Zhuravlev [7].",
      "startOffset" : 10,
      "endOffset" : 13
    }, {
      "referenceID" : 5,
      "context" : "Later Valiant and Kearns [8] were the first to pose the question about whether or not a weak learning algorithm can be strengthened to an arbitrary accurate learning algorithm.",
      "startOffset" : 25,
      "endOffset" : 28
    }, {
      "referenceID" : 6,
      "context" : "Schapire [9] developed the first provable polynomial-time boosting algorithm.",
      "startOffset" : 9,
      "endOffset" : 12
    }, {
      "referenceID" : 7,
      "context" : "One of the popular implementations of this idea is Schapires AdaBoost algorithm which involves ensemble of decision trees [10].",
      "startOffset" : 122,
      "endOffset" : 126
    }, {
      "referenceID" : 8,
      "context" : "Another approach to the classification and regression problems using the ensembles was suggested by Leo Breiman [11].",
      "startOffset" : 112,
      "endOffset" : 116
    }, {
      "referenceID" : 8,
      "context" : "One of the progressive baggingbased approaches is the method called Random Forest [11, 12].",
      "startOffset" : 82,
      "endOffset" : 90
    }, {
      "referenceID" : 9,
      "context" : "Later there appeared the most effective modifications of both Random forests and boosting algorithms such as Extremely Randomized Trees, Oblique Random Forests and Stochastic Gradient Boosting [13].",
      "startOffset" : 193,
      "endOffset" : 197
    }, {
      "referenceID" : 0,
      "context" : "In the researches devoted to the security assessment there are many approaches oriented to the construction of models on the basis of decision trees [1, 2, 5,13].",
      "startOffset" : 149,
      "endOffset" : 161
    }, {
      "referenceID" : 1,
      "context" : "In the researches devoted to the security assessment there are many approaches oriented to the construction of models on the basis of decision trees [1, 2, 5,13].",
      "startOffset" : 149,
      "endOffset" : 161
    }, {
      "referenceID" : 3,
      "context" : "In the researches devoted to the security assessment there are many approaches oriented to the construction of models on the basis of decision trees [1, 2, 5,13].",
      "startOffset" : 149,
      "endOffset" : 161
    }, {
      "referenceID" : 9,
      "context" : "In the researches devoted to the security assessment there are many approaches oriented to the construction of models on the basis of decision trees [1, 2, 5,13].",
      "startOffset" : 149,
      "endOffset" : 161
    }, {
      "referenceID" : 1,
      "context" : "A great amount of such attributes are obtained on the basis of randomly generated data sample consisting of a set of really possible states of electric power system [2].",
      "startOffset" : 165,
      "endOffset" : 168
    }, {
      "referenceID" : 11,
      "context" : "An open-source environment R [16] with caret package [17] is used as a computing environment for proposed models design and testing.",
      "startOffset" : 29,
      "endOffset" : 33
    }, {
      "referenceID" : 12,
      "context" : "An open-source environment R [16] with caret package [17] is used as a computing environment for proposed models design and testing.",
      "startOffset" : 53,
      "endOffset" : 57
    }, {
      "referenceID" : 13,
      "context" : "Operating conditions are all generated using the Powertrain System Analysis Toolkit (PSAT) [18].",
      "startOffset" : 91,
      "endOffset" : 95
    } ],
    "year" : 2016,
    "abstractText" : "One of the most promising approaches for complex technical systems analysis employs ensemble methods of classification. Ensemble methods enable to build a reliable decision rules for feature space classification in the presence of many possible states of the system. In this paper, novel techniques based on decision trees are used for evaluation of the reliability of the regime of electric power systems. We proposed hybrid approach based on random forests models and boosting models. Such techniques can be applied to predict the interaction of increasing renewable power, strage devices and swiching of smart loads from intelligent domestic appliances, storage heaters and air-conditioning units and electric vehicles with grid for enhanced decision making. The ensemble classification methods were tested on the modified 118-bus IEEE power system showing that proposed technique can be employed to examine whether the power system is secured under steady-state operating conditions.",
    "creator" : "LaTeX with hyperref package"
  }
}