{
  "name" : "1602.00575.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Multi-object Classification via Crowdsourcing with a Reject Option",
    "authors" : [ "Qunwei Li" ],
    "emails" : [ "qli33@syr.edu;", "varshney@syr.edu).", "avempat@us.ibm.com).", "varshney@illinois.edu)." ],
    "sections" : [ {
      "heading" : null,
      "text" : "ar X\niv :1\n60 2.\n00 57\n5v 2\n[ cs\n.L G\n] 1\n0 Ju\nn 20\n16 1\nIndex Terms—Classification, crowdsourcing, distributed inference, information fusion, reject option\nI. INTRODUCTION\nOPTIMIZATION problems that arise in communication,computation, and sensing systems have driven signal processing advances over the last several decades. Now, engineered social systems such as crowdsensing, crowdsourcing, social production, social networks, and data analytics deployments that interact with people are becoming prevalent for all of these informational tasks. Yet, they are often constructed in an ad hoc manner. Advances in signal processing theory and methods to optimize these novel human-oriented approaches to signal acquisition and processing are needed [1].\nCrowdsourcing has particularly attracted intense interest [2]–[8] as a new paradigm for signal processing tasks such as handwriting recognition, paraphrase acquisition, speech transcription, image quality assessment, and photo tagging [9]– [16], that essentially all boil down to the classical statistical\nThis work was supported in part by ARO under Grant W911NF-14-1-0339 and by NSF under Grant IIS-1550145.\nQ. Li and P. K. Varshney are with the Department of Electrical Engineering and Computer Science, Syracuse University, Syracuse, NY 13244 USA (email: qli33@syr.edu; varshney@syr.edu).\nA. Vempaty was with the Department of Electrical Engineering and Computer Science, Syracuse University, Syracuse, NY 13244 USA. He is now with the IBM Thomas J. Watson Research Center, Yorktown Heights, NY 10598 USA (e-mail: avempat@us.ibm.com).\nL. R. Varshney is with the Department of Electrical and Computer Engineering and with the Coordinated Science Laboratory, University of Illinois at Urbana-Champaign, Urbana, IL 61801 USA (e-mail: varshney@illinois.edu).\nFig. 1. An illustrative example of the proposed crowdsourcing framework.\ninference problem of M -ary classification. Unfortunately, the low quality of crowdsourced output remains a key challenge [17]–[19].\nLow-quality work may arise not only because workers are insufficiently motivated to perform well [20], [21], but also because workers may lack the skills to perform the task that is posed to them [22]. Decomposing larger tasks into smaller subtasks for later aggregation allows workers lacking certain skills to contribute useful information [22], [23], by polarizing the lack of skill into a subset of subtasks.\nAs an illustrative example of lack of skill, consider the problem of mismatched crowdsourcing for speech transcription, which has garnered interest in the signal processing community [24]–[30]. The basic idea is to use crowd workers to transcribe a language they do not speak, into nonsense text in their own native language orthography. There are certain phonological dimensions, such as aspiration or voicing, that are used to differentiate phonemes in one language but not another [26]. Moreover due to categorical perception that is learned in childhood, workers lacking a given phonological dimension in their native language may be unable to make relevant distinctions. That is, they lack the skill for the task.\nFig. 1 depicts the task of language transcription of Hindi. Suppose the four possibilities for a velar stop consonant to transcribe are R = { к, х, g, G}. The simple binary question of “whether it is aspirated or unaspirated” differentiates between { х, G} and { к, g}, whereas the binary question of “whether it is voice or unvoiced” differentiates between { g, G} and { к, х }. Now suppose the first worker is a native Italian speaker. Since Italian does not use aspiration, this worker will be unable to differentiate between { к} and { х}, or between { g} and { G}. It would be of benefit if this worker would specify the inability to perform the task through a special symbol λ, rather than guessing randomly.\n2 Suppose the second worker is a native Bengali speaker; since this language makes a four-way distinction among velar stops, such a worker will probably answer both questions without a λ. Now suppose the third worker is a native speaker of Hawaiian; since this language does not use voicing, such a worker will not be able to differentiate between { к} and { g}, or between { х} and { G}. Hence, it would be useful if this worker answered λ for the question of differentiating among these two subchoices.\nThe present paper allows workers to not respond, i.e. allowing a reject option, as in the example. Research in psychology suggests a greater tendency to select the reject option when the choice set offers several attractive alternatives but none that can be easily justified as the best, resulting in less arbitrary decisions [31]. The reject option has previously been considered in the machine learning and signal processing literatures [32]–[36], but we specifically consider worker behavior and aggregation rules for crowdsourcing with a reject option. To characterize performance, we derive a closed-form expression for the probability of a microtask being correct, together with the asymptotic performance when the crowd size is large.\nSeveral methods have been proposed to deal with noisy crowd work when crowd workers are required to provide a definitive yes/no response [21]–[23], [37]–[41], rather than allowing a reject option. Without the reject option, noisy responses to tasks cannot be tagged before aggregation so appropriate weights cannot be assigned [37]. For instance, the popular majority voting rule weights all answers equally [42], though new weighted aggregation rules have also been developed [37], [39]. We employed error-control codes and decoding algorithms to design reliable crowdsourcing systems with unreliable workers [22]. A group control mechanism where worker reputation is used to partition the crowd into groups is presented in [40], [41]; comparing group control to majority voting indicates majority voting is more cost-effective on less complex tasks [21].\nNote that under typical crowdsourcing incentive schemes based on work volume, workers may respond to tasks for which they are not sufficiently skilled, even when a reject option is available. We therefore also consider the case where a greedy fraction of the anonymous crowd workers complete all microtasks with random guesses to maximize their rewards.\nThe main contributions of this paper are threefold. 1) We study a new crowdsourcing paradigm where\nsimilarly-difficult microtasks are performed by workers having a reject option so they can skip microtasks if they believe they cannot respond reliably. We assign a weight for every worker’s response based on the number of skipped microtasks and this gives rise to significant performance improvement when compared to when all workers must respond. We also provide asymptotic performance analysis as crowd size increases. Asymptotic behavior is insightful since crowdsourcing worker pools are typically large. 2) In our weight assignment, a crowd worker’s response is given more weight during aggregation if he/she responds to more microtasks. We also consider the setting where a fraction of greedy crowd workers respond to all\ntasks, first continuing to employ the oblivious strategy proposed above and investigating the error performance as a function of the fraction of greedy workers in the crowd. We then study another strategy, an expurgation strategy, where responses of workers that respond to all microtasks are discarded and the remaining workers’ responses are assigned optimized weights. 3) An adaptive algorithm to switch between oblivious and expurgation strategies is derived, based on estimating several crowd parameters such as fraction of greedy workers in the crowd.\nAlthough the contributions listed above are stated for the crowdsourcing paradigm, our results hold for other signal classification tasks when decisions are made using signals that are quite uncertain. This is known as classification with a reject option [43] and has been focus of several recent studies in signal processing research including pattern recognition, image and speech classification [33], [34], [36], [44], [45]. More specifically, for a classification problem consisting of multiple (potentially unreliable) classifiers with a reject option, one can use the weighted aggregation rule where each classifier’s weight is a function of its reject behavior and its reliability. Our analysis presented in this paper characterizes the asymptotic behavior of such a system."
    }, {
      "heading" : "II. CLASSIFICATION TASK FOR CROWDS",
      "text" : "Consider the situation where W workers take part in an M -ary classification task. Each worker is asked N simple binary questions, termed microtasks, which eventually lead to a decision among the M classes. We assume it is possible to construct N = ⌈log2M⌉ independent microtasks of equal difficulty. The workers submit results that are combined to give the final decision. A worker’s answer to a single microtask is represented by either “1” (Yes) or “0” (No) [22], [46] and so the wth worker’s ordered answers aw(i), i ∈ {1, 2, . . . , N} to all microtasks form an N -bit word, denoted aw.\nEach worker has the reject option of skipping microtasks; we denote a skipped answer as λ, whereas “1/0” (Yes/No) responses are termed definitive answers. Due to variability in worker expertise, the probability of submitting definitive answers is different for different workers. Let pw,i represent the probability the wth worker submits λ for the ith microtask. Similarly, let ρw,i be the probability aw(i), the ith answer of the wth worker, is correct given a definitive answer has been submitted. Due to worker anonymity, we study performance when pw,i and ρw,i are realizations of certain probability distributions, denoted by FP (p) and Fρ(ρ), respectively. The corresponding means are denoted m and µ. Let H0 and H1 denote hypotheses corresponding to bits “0” and “1” for a single microtask, respectively. For simplicity of performance analysis, “0” and “1” are assumed equiprobable for every microtask. The crowdsourcing platform or fusion center (FC) collects the N -bit words from W workers and aggregates results, as discussed next."
    }, {
      "heading" : "A. Weighted Majority Voting",
      "text" : "We first investigate weighted majority voting as the fusion rule for classification. Let us consider all object classes as\n3 elements in the set D = {ej, j = 1, 2, . . . ,M}, where ej represents the jth class. As indicated earlier, a worker’s definitive responses to the microtasks determine a subset in the original set D, consisting of multiple elements/classes. If all the responses from the crowd are definitive, the final subsets are singletons and a single class is identified as the object class. Since in our framework here, some microtasks may be answered with a response λ, the resulting subsets in this case will not be singletons and each element of the same corresponding subsets will have equal probability to be selected as the classification decision. Let us denote the subset determined by the definitive answers of the wth worker as Dw ∈ D. The task manager assigns the same weight to all elements in Dw based on the wth worker’s answer. With the submitted answers from W workers, we determine the overall weight assigned to any jth element of D as\nW (ej) =\nW ∑\nw=1\nWwIDw 〈ej〉, j = 1, 2, . . . ,M, Dw ∈ D, (1)\nwhere Ww is the weight1 assigned to Dw, and IDw 〈ej〉 is an indicator function which equals 1 if ej ∈ Dw and 0 otherwise. Then the element eD with the highest weight is selected as the final class, and the classification rule is stated as\neD = arg max ej∈D\n{W (ej)} . (2)\nNotice that conventional majority voting requires full completion of all microtasks without the reject option and has identical Ww for each worker’s decision.\nNext, we show how the problem formulated in (2) can be further decomposed.\nProposition 1: The classification rule in (2) is equivalent to a bit-by-bit decision rule as the ith bit, i = 1, . . . , N , is decided by\nW ∑\nw=1\nWwI1 〈i, w〉 H1 ≷ H0\nW ∑\nw=1\nWwI0 〈i, w〉, (3)\nwhere Is 〈i, w〉, s ∈ {0, 1}, is the indicator function which is 1 if the wth worker’s answer to the ith bit is “s”, otherwise Is 〈i, w〉 = 0. For tie-breaking, randomly choose 0 or 1.\nProof: The class eD corresponds to a unique N -bit word. Thus, if the ith bit of the N -bit word corresponding to the class eD is equal to s, s has the same weight as assigned to eD, which is greater than or equal to the symbol 1− s. This gives the decision rule stated in (3)."
    }, {
      "heading" : "B. Optimal Bit-by-bit Bayesian Aggregation",
      "text" : "Let A(i) = [a1(i), a2(i), . . . , aW (i)] denote all the answers to ith microtask collected from the crowd. For the binary hypothesis testing problem corresponding to the ith bit of the N -bit word, the log-likelihood ratio test is\nlog P (H1|A(i)) P (H0|A(i)) H1 ≷ H0 0. (4)\n1The assignment of these weights will be discussed later in the paper.\nWe can express the likelihood ratio as\nP (H1|A(i)) P (H0|A(i)) =\nW ∏\nw=1\nP (aw(i)|H1)\nW ∏\nw=1\nP (aw(i)|H0)\n=\n∏\nS1\n(1− pw,i) ρw,i ∏\nS0\n(1− pw,i) (1− ρw,i) ∏\nSλ\npw,i\n∏\nS1\n(1− pw,i) (1− ρw,i) ∏\nS0\n(1− pw,i) ρw,i ∏\nSλ\npw,i ,\n(5)\nwhere S1 is the set of w such that aw(i) = 1, S0 is the set of w such that aw(i) = 0 and Sλ is the set of w such that aw(i) = λ, respectively. Then, it is straightforward to show that the test for the decision on the ith bit is\n∑\nw∈S1 log\nρw,i 1− ρw,i H1 ≷ H0 ∑\nw∈S0 log\nρw,i 1− ρw,i . (6)\nNote that the optimal Bayesian criterion can also be viewed as the general weighted majority voting rule in (3) with weight Ww = log\nρw,i 1−ρw,i , which is also called the Chair-Varshney rule\n[47]. Note that (3) represents majority voting when Ww = 1. However, this optimal Bayesian criterion can only be used if ρw,i for every worker is known a priori, which is usually not available since the crowd involved is anonymous and thus it is not possible to extract prior information such as ρw,i from the answers they submit. The difficulty in obtaining prior information makes the simple majority voting scheme very effective and therefore widely used [42]. We will show later in the paper that our proposed method can be employed in practical situations and outperforms conventional majority voting. Estimation of ρw,i is not needed while the mean of ρw,i, µ, is estimated in a practical way."
    }, {
      "heading" : "C. Class-based Aggregation Rule",
      "text" : "For the general weighted majority voting scheme where eC denotes the correct class, the probability of misclassification is\nPm = Pr (eD 6= eC)\n= Pr\n(\narg max ej∈D\n{\nW ∑\nw=1\nWwIDw 〈ej〉 } 6= eC )\n= 1− Pr (\narg max ej∈D\n{\nW ∑\nw=1\nWwIDw 〈ej〉 } = eC ) . (7)\nA closed-form expression for the error probability Pm cannot be derived without an explicit expression for Ww; hence it is difficult to determine the optimal weights to minimize Pm.\nConsequently, we consider an optimization problem based on a different objective function and propose a novel weighted majority voting method that outperforms simple majority voting. Note that eD is chosen as the decision for classification such that eD has the maximum overall weight collected from all the workers. Thus, we maximize the average overall weight assigned to the correct class while the overall weight collected by all the elements remains the same as the other existing\n4 methods such as majority voting. We state the optimization problem over the weights as\nmaximize EC [W] subject to EO [W] = K\n(8)\nwhere EC [W] denotes the crowd’s average weight contribution to the correct class and EO [W] denotes the average weight contribution to all the possible classes. K is set to a constant so that we are looking for a maximized portion of weight contribution to the correct class while the weight contribution to all the classes remains fixed. This procedure ensures that one can not obtain greater EC [W] by simply increasing the weight for each worker’s answer, while K results in a normalized weight assignment scheme. If two weight assignment schemes share the same value of EO [W], one can expect better performance by the scheme with higher EC [W]. Thus, K facilitates a relatively easier performance comparison of different weight assignment schemes."
    }, {
      "heading" : "III. CROWDSOURCING SYSTEM WITH HONEST CROWD WORKERS",
      "text" : "We first consider the case where the crowd is entirely composed of honest workers, which means that the workers are not greedy and honestly observe, think, and answer the questions corresponding to microtasks, and skip a question that they are not confident about. The wth worker responds with a λ to the ith microtask with probability pw,i. Next, we derive the optimal weight Ww for the wth worker in this case.\nProposition 2: To maximize the normalized average weight assigned to the correct classification element, the weight for wth worker’s answer is given by\nWw = µ −n, (9)\nwhere µ = E[ρw,i] and n is the number of definitive answers that the wth worker submits.\nProof: See Appendix A. Note that in previous works on crowdsourcing, workers were forced to make a hard decision for every single bit, which is the case when the weight derived above is set to an identical value. Here the weight depends on the number of questions answered by a worker. In fact, if more questions are answered, the weight assigned to the corresponding worker’s answer is larger. In our crowdsourcing framework, if the worker believes a definitive answer can be generated, we assume that the corresponding correct probability is greater than one half. Then, a larger number of definitive answers results in a greater chance that the quality of the worker is higher than others. Increased weight can put more emphasis on the contribution of high-quality workers in that sense and improve overall classification performance."
    }, {
      "heading" : "A. Estimation of µ",
      "text" : "Before the proposed aggregation rule can be used, note that µ has to be estimated to assign the weight for every worker’s answers. Here, we give two approaches to estimate µ.\n1) Training-based: In addition to the N microtasks, the task manager inserts additional questions to estimate the value of µ of the crowd. The answers to such “gold standard” questions are of course known to the manager [48], [49]. By checking the crowd worker’s answers, µ can be estimated. Suppose that the first T questions are training questions, followed by N questions for classification. Let B̄ be the T -bit correct answers to the training questions that the manager has. First, we calculate the ratio r(w) as\nr(w) =\nT ∑\ni=1\nI B̄(i) 〈aw(i)〉\nI(w) , (10)\nwhere Ix〈y〉 is the indicator function which equal 1 if x = y and 0 otherwise, and I(w) =\n∑T i=1 (I1〈i, w〉+ I0〈i, w〉). In\norder to avoid the cases where some workers submit λ for all the training questions, we estimate µ as follows\nµ̂ = 1\nW − ǫ\nW ∑\nw=1\nr(w), (11)\nwhere ǫ is the number of workers that submit all λ for the training questions and the corresponding r(w) is set to 0.\n2) Majority-voting based: We use majority voting to obtain the initial aggregation result and set it as the benchmark to estimate µ. First, all the answers aw(i) are collected to obtain the benchmark B(i) by traditional majority voting, where i = 1, . . . , N . Note that B(i) may contain λ since it is possible that all answers aw(i) have λ at the same position. Then, for the wth worker, we calculate the ratio r(w) as\nr(w) =\nN ∑\ni=1\nIB(i) 〈aw(i)〉 I (w) , (12)\nwhere we set Iλ〈λ〉 = 0, and I(w) = ∑N\ni=1 (I1〈i, w〉+ I0〈i, w〉). As before, we estimate µ as in (11), but where ǫ is the number of workers that submit λ for all microtasks."
    }, {
      "heading" : "B. Performance Analysis",
      "text" : "In this subsection, we characterize performance of the proposed classification framework in terms of probability of correct classification Pc. Note that we have overall correct classification only when all the bits are classified correctly.2\nFirst, we restate the bit decision criterion in (3) as W ∑\nw=1\nTw H1 ≷ H0 0 (13)\nwith Tw = Ww (I1〈i, w〉 − I0〈i, w〉), where the resulting Tw ∈ {−µ−N ,−µ−N+1, . . . ,−µ−1, 0, µ1, . . . , µN−1, µN}.\nProposition 3: For the ith bit, the probability mass function of Tw under hypothesis Hs, Pr (Tw|Hs), for s ∈ {0, 1}, is:\nPr ( Tw = I(−1)t+1µ−n|Hs )\n=\n{ ρ 1−|s−t| w,i (1− ρw,i) |s−t|ϕn(w), I = 1 pw,i, I = 0 ,\nt ∈ {0, 1}, n ∈ {1, . . . , N}, (14) 2When N > log2 M , the N -bit answer after aggregation may correspond\nto a class that does not exist; this is also misclassification.\n5 where I = I1〈i, w〉 + I0〈i, w〉, ϕn(w) = (1 − pw,i) ∑\nC\n∏N j=1 j 6=i p kj w,j(1− pw,j) 1−kj and C is the set\nC =\n\n \n \n{k1, k2, . . . , ki−1, ki+1, . . . , kN} : N ∑\nj=1 j 6=i\nkj = N − n\n\n \n \n(15)\nwith kj ∈ {0, 1}. Proof: See Appendix B.\nSince hypotheses H0 and H1 are assumed equiprobable, the correct classification probability for the ith bit Pc,i is\nPc,i = 1 + Pd,i − Pf,i\n2 , (16)\nwhere Pd,i is the probability of deciding the ith bit as “1” when the true bit is “1” and Pf,i is the probability of deciding the ith bit as “1” when the true bit is “0”.\nProposition 4: The probability of correct classification for the ith bit Pc,i is\nPc,i = 1\n2 +\n1\n2\n∑\nS\n(\nW\nQ\n)\n(Fi (Q)− F ′i (Q))\n+ 1\n4\n∑\nS′\n(\nW\nQ\n)\n(Fi (Q)− F ′i (Q)) (17)\nwith\nFi(Q) = ∏\nw∈Gλ\npw,i ∏ w∈G0 (1− ρw,i)ϕn (w) ∏ w∈G1 ρw,iϕn (w)\n(18)\nand\nFi ′(Q) =\n∏\nw∈Gλ\npw,i ∏ w∈G1 (1− ρw,i)ϕn (w) ∏ w∈G0 ρw,iϕn (w) ,\n(19)\nwhere\nQ =\n{\n(q−N , q−N+1, . . . qN ) : N ∑\nn=−N qn = W\n}\n(20)\nwith natural numbers qn and q0, G0 denotes the worker group that submits “0” for ith microtask, G1 the group that submits “1” and Gλ the group that submits λ, and\nS =\n{\nQ :\nN ∑\nn=1\nµ−n (qn − q−n) > 0 } , (21)\nS′ =\n{\nQ :\nN ∑\nn=1\nµ−n (qn − q−n) = 0 } , (22)\nand ( W Q ) = W ! N∏\nn=−N\nqn!\n.\nProof: See Appendix C. Proposition 5: The probability of correct classification Pc\nin the crowdsourcing system is\nPc = [1\n2 +\n1\n2\n∑\nS\n(\nW\nQ\n)\n(F (Q)− F ′ (Q))\n+ 1\n4\n∑\nS′\n(\nW\nQ\n)\n(F (Q)− F ′ (Q)) ]N , (23)\nwhere\nF (Q) = mq0 N ∏\nn=1\n(1− µ)q−nµqn (\nC n−1 N−1(1−m) n m\nN−n )q−n+qn\n(24)\nand\nF ′(Q) = mq0\nN ∏\nn=1\n(1− µ)qnµq−n (\nC n−1 N−1(1−m) n m\nN−n )q−n+qn\n,\n(25)\nProof: See Appendix D. In practice, the number of workers for the crowdsourcing task is large (in the hundreds). Thus it is of value to investigate the asymptotic system performance when W increases without bound.\nProposition 6: As the number of workers W approaches infinity, the probability of correct classification Pc can be expressed as\nPc =\n[\nQ\n(\n− M√ V\n)]N\n, (26)\nwhere Q(x) = 1√ 2π ∫∞ x e −t2 2 dt, and M and V are given as\nM = W (2µ− 1) (1−m)\nµ\n(\n1 µ − ( 1 µ − 1 ) m )N−1 , (27)\nand\nV = W (1−m)\nµ2\n(\n1 µ2 − ( 1 µ2 − 1 ) m )N−1 − M 2 W . (28)\nProof: See Appendix E. For large but finite crowds, the asymptotic result (26) is a good characterization of actual performance. Let us therefore consider (26) in more detail. First, we rewrite (26) as\nPc =\n[\nQ\n(\n− √\nW 1\nf(µ,m) − 1\n)]N\n, (29)\nwhere\nf (µ,m) = (1−m) (2µ− 1)2(g (µ,m))N−1, (30) and\ng (µ,m) = (1− (1− µ)m)2 1− (1− µ2)m . (31)\nTheorem 1: The probability of correct classification in the crowdsourcing system increases with increasing size of the crowd W .\nProof: Follows from (29) as the probability of correct classification increases monotonically with respect to W .\nTheorem 2: The probability of correct classification in the crowdsourcing system increases with increasing µ.\nProof: We take the partial derivative of g(µ,m) with respect to µ and obtain\n∂g ∂µ = 2m(1− µ) (1−m)A B2 , (32)\nwhere A = mµ−m+ 1, and B = mµ2 −m+ 1.\n6 Clearly ∂g ∂µ\n> 0. Recall (29), (30), and (31): a larger Pc results as µ increases. Then, the classification performance of the task in the crowdsourcing system also increases.\nTo obtain the relation between crowd’s performance in terms of Pc and m, we take the partial derivative of f(µ,m) with respect to m and obtain\n1 (2µ− 1)2 ∂f ∂m\n= (N − 1) (1−m)\n(\nA 2 ( µ2 − 1 )\nB2 +\n2A (1− µ)\nB\n)\n(\nA 2\nB\n)N−2\n−\n(\nA 2\nB\n)N−1\n. (33)\nAfter some mathematical manipulations, we observe: • When m > 11+µ , we can guarantee that ∂f ∂m\n< 0, which means that the crowd performs better as Pc increases with decreasing m.\n• When m < 11+µ and N ≥ (mµ−m+1)2 (1−m)(1−µ)2(mµ+m−1)+1, we\ncan guarantee that ∂f ∂m > 0, which means that the crowd performs better as Pc increases with increasing m.\nThese two observations indicate that a larger probability of the crowd responding to the ith microtask with λ does not necessarily degrade crowd’s performance in terms of the detection of the ith microtask.\nThis counterintuitive result follows since even though the crowd skips more microtasks, the optimized weight takes advantage of the number of unanswered questions and extracts more information. For this to happen, the number of microtasks N has to be greater than a lower limit. Since a larger N induces more diversity in the number of unanswered questions, the existence of the lower limit means that this diversity can actually benefit the performance using the proposed scheme."
    }, {
      "heading" : "C. Simulation Results",
      "text" : "In this subsection, we compare the performance of the proposed crowdsourcing system where crowd workers are allowed to skip microtasks with the conventional majority voting method in a hard-decision fashion, which means workers are forced to make a decision even if the workers believe that no definitive answers could be provided. The number of equiprobable classes is set as M = 8.\nFig. 2 compares performance when W = 20 workers take part in the task. We consider here that workers have a fixed pw,i for each microtask and ρw,i = 0.8. We observe that performance degrades as pw,i gets larger, which means that the workers have a higher probability of not submitting an answer to the microtask. A remarkable performance improvement associated with our proposed approach is observed. The two curves converge at pw,i = 1 with Pc being equal to 0.125. At this point, with the majority-based approach, each worker gives random answers for each microtask whereas the workers using the proposed scheme skip all the questions and the tiebreaking criterion is used to pick a random bit for every microtask. In Fig. 3, we fix pw,i = 0.5 and vary ρw,i to compare the resulting Pc. Notable performance improvement is also seen. The point at ρw,i = 0.5 indicates that the\nworker is making a random guess even if he/she believes that he/she can complete the corresponding microtask correctly. The performance improves as ρw,i gets larger, which means that the crowd is able to give higher-quality definitive answers.\nIn Fig. 4, we compare performance with different number of workers, also showing the asymptotic performance characterization. Here, we consider different qualities of the individuals in the crowd which is represented by variable pw,i with uniform distribution U(0, 1) and ρw,i with U(0.6, 1). First, it is observed that a larger crowd completes the classification task with higher quality. The asymptotic curves are derived under the assumption of a very large crowd, which are the bounds on the performance of the systems. It is not a very difficult task to derive that the asymptotic performance for conventional majority voting is\nPc =\n[\nQ\n(\n− √ W 2(2l − 1) 4l− 4l2\n)]N\n,\nwhere l = µ + m(0.5 − µ). Therefore, the asymptotic gap in the performance between conventional majority voting and the proposed method can also be obtained. We find that the asymptotic curves are quite a tight match to the actual performance. Again, we can see a significant improvement in Pc brought by the proposed approach.\nWe now include the estimation of µ in Fig. 5 for weight assignment. Observe in Fig. 5(a) that the performance improves as the number of workers increases and also observe that the proposed approach is significantly better than majority voting. Second, the performance of the proposed approach is significantly better than that of traditional majority voting, and it changes for different estimation settings. As is expected, a larger number of training questions result in higher performance of the system as observed in Fig. 5(b). Another interesting finding is that the performance with training based estimation can exceed that with majority voting as a benchmark only when a relatively large number of training questions are used. We can see from the figure that the “Training” method with T = 10 slightly outperforms the method without training and based on “Majority-voting”. However, the number\nof microtasks N is only 3, which is much smaller than the training size. Quite a bit of extra overhead besides the classification task will need to be added if the training method is adopted. Hence, it is reasonable to employ “Majorityvoting” method together with the proposed approach for the classification task with crowdsourcing.\nFig. 6 shows the performance as a function of overhead with different numbers of microtasks, to illustrate the performance gap between the two methods. Observe that the method without training exhibits remarkable advantage in probability of correct classification Pc when a reasonable number of additional microtasks are inserted. Improved performance of the training-based method is shown when T gets larger as this results in more accurate estimation. To have comparable performance with the method without training, the trainingbased method requires even more additional microtasks when the original number of microtasks N increases. With enough microtasks inserted, the training method can outperform the one without. Again, this result encourages employing the method without training in practice.\n14.95 15 15.05 15.1 15.15 15.2\n0.776\n0.777\n0.778\n0.779\n0.78\n0.781\n0.782\n0.783\nNumber of workers W\nP c\nNo training T=10 T=5 T=1\n(b) Zoomed-in version\nFig. 5. Proposed approach compared to majority voting with various worker sizes at pw,i ∼ U(0, 1) and ρ ∼ U(0.5, 1). Two methods are used to estimate µ for weight assignment. One uses training to insert T additional microtasks for estimation, whereas the other one uses the decision results of majority voting as a benchmark to estimate µ. (a) provides the performance comparison while (b) is a zoomed-in region which is indicated in the box in (a)."
    }, {
      "heading" : "IV. CROWDSOURCING SYSTEM WITH GREEDY CROWD WORKERS",
      "text" : "In the previous section, we considered conscientious crowd workers who respond only if they have confidence in their ability to respond. In our formulation, the weight assigned to a worker’s response increases with the number of microtasks that the worker responds to and this contributes to the selection of the correct class thereby enhancing classification performance. In a reward-based system, such honest workers should be compensated and actually rewarded for completing as many tasks as possible. However, if there are workers in the crowd who are greedy and their goal is to obtain as much compensation without regard to the system goal of enhanced classification performance, such a reward mechanism can encourage greedy workers to randomly complete all microtasks to get a higher reward. This would result in a degradation in the classification performance of the system. Indeed, Mason and Watts observed that increasing financial incentives increases\nthe quantity of work performed, but not necessarily the quality [50]. In this section, we study system performance when a part of the crowd completes all microtasks with random guesses. In other words, these “greedy” workers submit N -bit codewords, which are termed as full-length answers in the sequel. We investigate the crowdsourcing system with such workers by assuming the correct probability for each microtask is 1/2 to represent the situation where the worker responds randomly to each microtask.\nInsertion of a gold standard question set is the most widely used method to address the issue of greedy workers. This, however, comes at the cost of a large question set to avoid workers spotting recurrent questions [48]. Besides, this is not effective in practice since one of the fundamental reasons for crowdsourcing is to collect classified labels that we do not have [49]. In this paper, we do not insert a gold standard question set and instead study two different strategies for this problem. The Oblivious Strategy continues to use the same scheme we derived in the previous section ignoring the existence of greedy workers. In the Expurgation Strategy, we discard the answers of workers who only give full-length answers, to reduce the impact of greedy workers on the overall system performance. Let α denote the fraction of greedy workers in the crowd. Note that in this strategy, we will also discard the responses of those honest workers that provided definitive answers to all microtasks. Note the greedy workers are not being punished in any way here; only in the aggregation strategy their responses are being ignored."
    }, {
      "heading" : "A. Oblivious Strategy",
      "text" : "In this strategy, we continue to use the same weight allocation scheme as for honest workers, which can be expressed as\nWw = α1µ −n, (34)\nwhere the factor α1 is introduced to satisfy the constraint EO [W] = K .\nThe average contribution from the crowd to the correct class and all the classes can be given respectively as\nEC [W] =\nWα ∑\nw=1\nα1µ −N 1\n2N\n+\nW ∑\nw=Wα+1\nN−1 ∑\nn=0\nα1µ −nCnN [(1−m)µ]nmN−n\n= Wαα1\n(2µ)N + α1W (1− α) , (35)\nand\nEO [W] = Wα ∑\nw=1\nα1\n(\n1\nµ\n)N\n+ W ∑\nw=Wα+1\nN−1 ∑\nn=0\nα1µ −n2N−nCnN (1−m)nmN−n\n=Wαα1\n(\n1\nµ\n)N\n+ (W −Wα)α1 ( 1−m µ + 2m\n)N\n=K. (36)\nTherefore, we can calculate α1 and obtain EC [W] as:\nα1 = K\nWα (\n1 µ\n)N\n+ (W −Wα) ( 1−m µ + 2m )N\n, (37)\nEC [W] = Kα\n(\n1 2µ\n)N\n+K (1− α)\nα (\n1 µ\n)N\n+ (1− α) (\n1−m µ\n+ 2m )N\n. (38)\nProposition 7: The probability of correct classification Pc when the Oblivious Strategy is used is\nPc = [1\n2 +\n1\n2\n∑\nS\n(\nW\nQ1\n)\n(F (Q1)− F ′(Q1))\n+ 1\n4\n∑\nS′\n(\nW\nQ1\n)\n(F (Q1)− F ′(Q1)) ]N\n(39)\nwith\nF (Q1)\n= mq0\n2Wα\nN ∏\nn=1\n(1− µ)q−nµqn ( Cn−1N−1(1−m) n mN−n )q−n+qn\n(40)\nand\nF ′(Q1)\n= mq0\n2Wα\nN ∏\nn=1\n(1− µ)qnµq−n ( Cn−1N−1(1−m) n mN−n )q−n+qn\n(41)\nwhere\nQ1 =\n{\n(q−N , q−N+1, . . . qN ) : N ∑\nn=−N qn = W −Wα\n}\n,\n(42)\n9 with natural numbers qn,\nS1 =\n{\nQ1 :\nN ∑\nn=1\nµ−n (qn − q−n) + µ−NWα > 0 } , (43)\nS1 ′ =\n{\nQ1 : N ∑\nn=1\nµ−n (qn − q−n) + µ−NWα = 0 } , (44)\nand ( W Q1 ) = W !∏N n=−N qn! .\nProof: See Appendix F."
    }, {
      "heading" : "B. Expurgation Strategy",
      "text" : "In this strategy, all definitive answers of length of N bits are discarded to avoid answers from greedy workers. The classification decision is made based on the answers with maximum number of bits equal to N − 1. To proceed, we need the weight for every worker’s answer in this case. We begin by restating the optimization problem\nmaximize EC [W] subject to EO [W] = K\n(45)\nand we have\nEC [W] =\nW−Wα ∑\nw=1\nN−1 ∑\nn=0\nWw\n(\nN\nn\n)\n[(1−m)µ]nmN−n\n=\nW−Wα ∑\nw=1\nN−1 ∑\nn=0\nWwµ nxn−NPx (n), (46)\nwhere\nPx (n) =\n(\nN\nn\n)\n(1−m)n(mx)N−n, (47)\nand x is such that N−1 ∑\nn=0\nPx (n) = 1. (48)\nThen, we can write\nEC [W] ≤ W−Wα ∑\nw=1\n√ √ √ √ N−1 ∑\nn=0\n(Wwµnxn−N ) 2 Px (n)\n√ √ √ √ N−1 ∑\nn=0\nPx (n),\n(49)\nand the equality holds only if\nWwµ nxn−N\n√ Px (n) = α2 √ Px (n), (50)\nwhere the factor α2 is introduced to satisfy the constraint EO[W] = K . Hence, we have the maximum of EC [Ww] as\nEC [W] = W (1− α)α2, (51)\nwhen\nWw = α2µ −nxN−n. (52)\nTo obtain the value of x, we rewrite (48) as:\n(1−m+mx)N − (1−m)N = 1, (53)\nand x is given as\nx =\n( 1 + (1−m)N )\n1 N\n+m− 1 m . (54)\nFor this strategy, the overall weight constraint is given as\nEO [W] =\nW−Wα ∑\nw=1\nN−1 ∑\nn=0\nα2µ −n x N−n2N−n\n(\nN\nn\n)\n(1−m)nmN−n\n= W (1− α)α2\n[\n(\n1−m\nµ + 2mx\n)N\n−\n(\n1−m\nµ\n)N ]\n= K. (55)\nBy substituting this result back into (51), the maximum value of EC [W] can be written as\nEC [W] = K\n(\n1−m µ\n+ 2mx )N − (\n1−m µ\n)N . (56)\nNote that the weight could be Ww = µ−nx−n when the Expurgation Strategy is employed in practice, where x is given by (54).\nProposition 8: The probability of correct classification Pc when the Expurgation Strategy is used is\nPc = [1\n2 +\n1\n2\n∑\nS\n(\nW\nQ2\n)\n(F (Q2)− F ′(Q2))\n+ 1\n4\n∑\nS′\n(\nW\nQ2\n)\n(F (Q2)− F ′(Q2)) ]N\n(57)\nwith\nF (Q2) = m q0\nN−1 ∏\nn=1\n(1− µ)q−nµqn (\nC n−1 N−1(1−m) n m\nN−n )q−n+qn\n(58)\nand\nF ′(Q2) = m\nq0\nN−1 ∏\nn=1\n(1− µ)qnµq−n (\nC n−1 N−1(1−m) n m\nN−n )q−n+qn\n,\n(59)\nwhere\nQ2 =\n{\n(q−N+1, q−N+2, . . . qN−1) :\nN−1 ∑\nn=−N+1\nqn ≤ W −Wα\n}\n(60)\nwith natural numbers qn, and\nS2 =\n{\nQ2 :\nN−1 ∑\nn=1\nµ−nx−n (qn − q−n) > 0 } , (61)\nS2 ′ =\n{\nQ2 :\nN ∑\nn=1\nµ−nx−n (qn − q−n) = 0 }\n(62)\nand ( W Q2 ) = W !∏N−1 n=−N+1 qn! .\nProof: See Appendix G.\n10\nαK (\n1 2µ\n)N\n+K(1− α)\nα (\n1 µ\n)N\n+ (1− α) (\n1−m µ\n+ 2m )N\nOblivious Strategy ≷\nExpurgation Strategy\nK (\n1−m µ\n+ 2mx )N − (\n1−m µ\n)N , (63)"
    }, {
      "heading" : "C. Adaptive Algorithm",
      "text" : "We now investigate the adaptive use of our two strategies to improve system performance. The goal is to find a threshold to distinguish when one strategy will outperform the other, so as to allow switching.\nNote that the two strategies described in the previous subsections are associated with the same overall weight for all classes. Thus, we compare the crowd’s total contribution to the correct class under this condition and derive the corresponding switching scheme. From (38) and (51), this can be expressed in (63), which can be simplified to have the switching threshold of α as\nα\n(\n(\n1\nµ\n)N\n− γ1 ( 1\n2µ\n)N − γ2 + γ1 ) Expurgation Strategy ≷\nOblivious Strategy γ1 − γ2,\n(64)\nwhere\nγ1 =\n( 1−m µ + 2mx\n)N\n− ( 1−m µ\n)N\n, (65)\nand\nγ2 =\n( 1−m µ + 2m\n)N\n. (66)\nTo obtain the threshold associated with α in the switching criterion (64), µ and m should be estimated first. The previous section established a simple and effective method to estimate µ based on majority voting. Therefore, we again use majority voting to get initial detection results, which are then set as the benchmark to estimate µ. Note that estimation of µ is based on the answers without the full-length ones to avoid degradation resulting from the greedy workers.\nThe performance of this integrated scheme can be derived using Propositions 7, 8 and the switching criterion (64)."
    }, {
      "heading" : "D. Joint Estimation of m and α",
      "text" : "The threshold on α is specified based on the estimated values of m and µ. Then, we estimate α and compare it with the corresponding threshold to switch the strategies adaptively. Even though we discard the full-length answers and take advantage of the rest and estimate m, it is an inaccurate estimate because the discarded answers also contain those from the honest workers.\nSeveral works have studied the estimation of α in crowdsourcing systems [18], [21], [41], which can be divided into two categories: one studies the behavior of the workers in comparison to the honest control group [21]; the other one learns worker’s reputation profile [18], [41], which is stored and updated over time to identify the greedy ones from the crowd. However, both categories of estimation methods are not\nsuitable here due to the anonymous nature of crowd workers. The first category suffers from the difficulty in extracting the honest group from the anonymous crowd while the second requires identification of every worker.\nSince the worker’s quality is assumed to be i.i.d., we give a joint parametric estimation method of both m and α based on maximum likelihood estimation (MLE).\nAs defined earlier, out of W workers, qn+q−n workers submit answers of n bits, 0 ≤ n ≤ N . Thus, the probability mass function of the number of submitted answers given m and α is obtained in (67), where AN,n,m = ( N n )\n(1−m)nmN−n, is defined as the expectation of the probability of a single worker submitting n definitive answers.\nBecause of the independence of workers, we can form the likelihood statistic as\nL (m,α) =\nN ∑\nn=0\nlogf (qn + q−n|m,α) . (68)\nTherefore, the ML estimates of m and α, which are denoted by m̂ and α̂, can be obtained as\n{m̂, α̂} = arg max {m,α}∈[0,1] L (m,α) . (69)\nOnce we have µ̂, m̂ and α̂, we can adaptively switch to the suitable strategy using (64)."
    }, {
      "heading" : "E. Simulation Results",
      "text" : "Now, we present some simulation results to illustrate the performance of our proposed algorithm. First, the theoretical value of the threshold for adaptive switching between the strategies is obtained for different values of m and µ based on (64). We switch to the Expurgation Strategy if the fraction of greedy workers α is greater than the threshold. Otherwise we stick to the Oblivious Strategy. As we can observe from Figure 7, when m decreases and µ increases, which means the quality of the crowd improves, the threshold increases. This implies that the crowdsourcing system employing the Oblivious Strategy can tolerate a higher fraction of greedy workers in the crowd and, therefore, instead of discarding all the answers from the greedy workers and a part from the honest workers who submit full-length answers, it is better to keep them as long as the honest ones can perform well. The effect of greedy workers’ answers can be compensated by the high-quality answers of the honest workers in the crowd.\nNext, we give the estimation results for α̂ in Table I using the proposed MLE method. The crowd quality parameters pw,i and ρw,i are drawn from distributions U(0, 1) and U(0.5, 1) respectively. The number of microtasks N and the number of workers W are set to 3 and 20, respectively.\nIn Fig. 8, the performance of the proposed adaptive scheme is shown. The system parameters are the same as in previous\n11\nf (qn + q−n|m,α) = { ( W−Wα qn+q−n ) AN,n,m qn+q−n(1−AN,n,m)W−Wα−qn−q−n , 0 ≤ n < N (\nW−Wα qN+q−N−Wα ) (1−m)N(qN+q−N−Wα) ( 1− (1−m)N ) , n = N (67)\n0.6 0.8\n1 0.2 0.4 0.6 0.8 1\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\nµm\nT hr\nes ho\nld\nOblivious Strategy\nExpurgation Strategy\nFig. 7. Threshold to switch between strategies.\nsimulations except that the crowd size W is set equal to 15. The crowdsourcing system starts with the estimation of the parameters µ, m, and α. Once it has obtained µ̂ and m̂, the system calculates the threshold value and compares it with α̂, and then decides the strategy to be used. Next, the system allocates weights to the answers for aggregation based on the strategy selected and makes the final classification decision. In Fig. 8, we present the performance of both the strategies and the estimated threshold for switching is also presented. The performance deterioration caused by greedy workers is quite obvious as the probability of correct classification Pc decreases for both strategies with increasing α. The intersection of curves illustrates the need for strategy switching. The estimated Pareto frontier α̂ for switching is 0.3369 in this system setting, which is indicated in the figure by a line segment and is very close to the intersection of the two curves. Therefore, the actual performance curve of the proposed algorithm consists of the curve with squares when α < α̂ and curve with circles when α > α̂."
    }, {
      "heading" : "V. CONCLUSION AND DISCUSSION",
      "text" : "We have studied a novel framework for crowdsourcing of classification tasks that arise in human-based signal processing, where an individual worker has the reject option and can skip a microtask if he/she has no definitive answer. We presented an aggregation approach using a weighted majority voting rule, where each worker’s response is assigned an optimized weight to maximize the crowd’s classification\n0 0.2 0.4 0.6 0.8 1 0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\nα P\nc\nOblivious Strategy Expurgation Strategy\nα̂=0.3369\nFig. 8. Performance of both the strategies with greedy workers\nperformance. We have shown our proposed approach significantly outperforms traditional majority voting and provided asymptotic performance characterization as an upper bound on performance. Further, we considered greedy workers in the crowd. An oblivious and an expurgation strategy were studied to deal with greed, and an algorithm to adaptively switch between the two strategies, based on the estimated fraction of greedy workers in the anonymous crowd, was developed to combat performance degradation.\nWe assumed in this paper that the workers’ qualities are identically distributed. In some cases, it is possible that the workers’ qualities are not identically distributed, which makes estimating the greedy fraction α difficult. The difficulty of microtasks might not be equal, which makes the microtask design quite challenging. Therefore, further research directions include the development of a general model to characterize the crowd quality, design of a robust method to estimate the fraction of greedy workers in the crowd, and binary microtask design with a reject option."
    }, {
      "heading" : "APPENDIX A",
      "text" : "To solve problem (8), we need EC [W] and EO[W]. First, the wth worker can have weight contribution to EC [W] only if all his/her definitive answers are correct. Thus, we have the average weight assigned to the correct element as\nEC [W] = Ep,ρ\n[\nW ∑\nw=1\nN ∑\nn=0\nWwP (n,N − n) ]\n=\nW ∑\nw=1\nEp,ρ\n[\nN ∑\nn=0\nWwP (n,N − n) ] , (70)\n12\nwhere P (n,N − n) represents the probability of N − n bits equal to λ and the rest of the n definitive answers in the N -bit word are correct.\nThen, given a known wth worker, i.e., pw,i is known, we write\nAw(pw,i) = Eρ\n[\nN ∑\nn=0\nWwP (n,N − n) |pw,i ] . (71)\nLet Pλ(n) denote the probability of the wth worker submitting n definitive answers out of N microtasks which only depends on pw,i. Note that ∑N n=0 Pλ(n) = 1, and then (71) is upper-bounded using Cauchy-Schwarz inequality as follows:\nAw(pw,i) =\nN ∑\nn=0\nEρ [Wwρ (n)] √ Pλ(n) √ Pλ(n)\n≤\n√ √ √ √ N ∑\nn=0\nE2ρ [Wwρ (n)]Pλ(n)\n√ √ √ √ N ∑\nn=0\nPλ(n) (72)\n, αw(pw,i), (73)\nwhere ρ(n) is the product of any n out of N variables ρw,i as i = 1, 2, . . . , N , and αw is a positive quantity independent of n, which might be a function of pw,i. Note that equality holds in (72) only if\nEρ [Wwρ (n)] √ Pλ(n) = αw(pw,i) √ Pλ(n), (74)\nwhich results in (73) and\nEρ [Wwρ (n)] = αw(pw,i). (75)\nThen we maximize the crowd’s average weight corresponding to the correct class under the constraint ∫\npw,i Pr(pw,i =\nx)dx = 1, and the maximization problem is written as\nA = Ep[Aw(pw,i)] =\n∫\npw,i\nαw(pw,i) Pr (pw,i = x) dx\n≤ √ √ √\n√\n∫\npw,i\nα2w(pw,i) Pr (pw,i = x) dx\n√ √ √ √ ∫\npw,i\nPr (pw,i = x) dx\n(76)\n, β. (77)\nThe equality (76) holds only if\nαw(pw,i) √ Pr (pw,i = x) = β √ Pr (pw,i = x), (78)\nwith β is a positive constant independent of pw,i, and we conclude that αw is also a positive quantity independent of pw,i. Then from (75), we have\nEρ [Wwρ (n)] = β. (79)\nSince ρ(n) is the product of n variables, its distribution is not known a priori. A possible solution to weight assignment is a deterministic value given by WwE[ρ(n)] = β and, therefore, we can write the weight as\nWw = β\nµn . (80)\nThen, we can express the crowd’s average weight contribution to all the classes defined in (8) as\nEO [W] =\nW ∑\nw=1\nEp,ρ\n[\nN ∑\nn=0\nβµ−n2N−nPλ (n)\n]\n=\nW ∑\nw=1\nN ∑\nn=0\nβµ−n2N−n ( N\nn\n)\n(1−m)nmN−n\n= Wβ\n( 1−m µ + 2m\n)N\n= K. (81)\nThus, β can be obtained from (81) and we can obtain the weight by solving optimization problem (8) to get:\nWw = K\nWµn (\n1−m µ\n+ 2m )N\n. (82)\nNote that the weight derived above has a term that is common for every worker. Since the voting scheme is based on comparison, we can ignore this factor and have the normalized weight as\nWw = µ −n. (83)\nAPPENDIX B\nNote that\nTw ∈ {−µ−N ,−µ−N+1, . . . ,−µ−1, 0, µ−1, . . . , µ−N+1, µ−N}, (84)\nwhich can be written as\nTw = I(−1)t+1µ−n, t ∈ {0, 1}, I ∈ {0, 1}, n ∈ {1, . . . , N}, (85)\nand leads to\nPr ( Tw = I(−1)t+1µ−n|Hs )\n=\n{ Pr ( Tw = (−1)t+1 µn |Hs ) , I = 1\nPr (Tw = 0|Hs) , I = 0 . (86)\nThese two terms can be expressed as\nPr\n(\nTw = (−1)t+1\nµn |Hs\n)\n= Pr (aw(i) = t|Hs) · Pλ (n|aw(i) = t,Hs)\n= ρ 1−|s−t| w,i (1− ρw,i) |s−t| ∑\nC\nN ∏\nj=1 j 6=i\np kj w,j(1− pw,j) 1−kj , (87)\nand\nPr (Tw = 0|Hs) = pw,i. (88)\n13"
    }, {
      "heading" : "APPENDIX C",
      "text" : "Let qn,−N ≤ n ≤ N , represent the number of workers that submit |n| total definitive answers to all the microtasks. Specifically, n < 0 indicates the group of workers that submit “0” for the ith bit while n > 0 indicates “1”. For n = 0, q0 represents the number of workers that submit λ for the ith bit. Since the workers independently complete the microtasks, recalling the results in (14), the probabilities of the crowd’s answer profile for the ith bit {G0, G1, Gλ} can be obtained under H1 and H0 given pw,i and ρw,i are expressed by Fi(Q) and F ′i (Q), respectively. Thus, Pd,i given pw,i and ρw,i can be expressed as\nPd,i = ∑\nS\n(\nW\nQ\n)\nFi(Q) + 1\n2\n∑\nS′\n(\nW\nQ\n)\nFi(Q), (89)\nwhere the first term on the right-hand side corresponds to the case where the aggregation rule gives a result of “1” and the second term indicates the case where “1” is given due to the tie-breaking of the aggregation rule.\nSimilarly, we can obtain Pf given pw,i and ρw,i as\nPf,i = ∑\nS\n(\nW\nQ\n)\nFi ′(Q) +\n1\n2\n∑\nS′\n(\nW\nQ\n)\nFi ′(Q). (90)\nThen, it is straightforward to obtain the desired result."
    }, {
      "heading" : "APPENDIX D",
      "text" : "We can have a correct classification if and only if all the bits are classified correctly. Thus, the expected probability of correct classification is given as\nPc = E\n[\nN ∏\ni=1\nPc,i\n]\n, (91)\nwhich can be expressed, due to the independence of the microtasks, as\nPc =\nN ∏\ni=1\nE [Pc,i] . (92)\nRecall Pc,i from Proposition 4, and we can obtain:\nE [Pc,i] = 1\n2 +\n1\n2\n∑\nS\n(\nW\nQ\n)\n(F (Q)− F ′ (Q))\n+ 1\n4\n∑\nS′\n(\nW\nQ\n)\n(F (Q)− F ′ (Q)) (93)\nwith F (Q) and F ′ (Q) defined in (24) and (25). Thus we have the desired result."
    }, {
      "heading" : "APPENDIX E",
      "text" : "When W goes to infinity, we show that E [Pc,i] =\nQ (\n− M√ V\n)\nand the desired result can be obtained. Based on the Central Limit Theorem [51], the test statistic in (13) is approximately Gaussian if W → ∞ :\nW ∑\nw=1\nTw ∼ { N (M1, V1) , H1 N (M0, V0) , H0 , (94)\nwhere Ms and Vs are the means and variances of the statistic W ∑ w=1 Tw under hypotheses Hs, respectively.\nFor the wth worker, we have the expectation of Tw as\nMH1 =\n1 ∑\nt=0\nN ∑\nn=1\n(−1)t+1µ−n(ρw,i)t(1− ρw,i)1−tϕn(w).\n(95)\nWe define M1 as\nM1 , WE [MH1 ]\n= W\nN ∑\nn=1\nµ−n (2µ− 1) ( N − 1 n− 1 ) (1−m)nmN−n\n= W (2µ− 1) (1−m)\nµ\n(\n1 µ − ( 1 µ − 1 ) m )N−1 . (96)\nLikewise, we define V1 as\nV1 , W ( E [ T 2w ] − E2 [MH1 ] )\n= WE\n[\n1 ∑\nt=0\nN ∑\nn=1\nµ−2n(ρw,i) t (1− ρw,i)1−tϕn(w)\n]\n− M 2 1\nW\n= W (1−m)\nµ2\n(\n1\nµ2 −\n(\n1\nµ2 − 1\n)\nm )N−1 − M 2 1\nW . (97)\nSimilarly, we can derive\nM , M1 = −M0, (98) and\nV , V1 = V0. (99)\nBy looking back at the decision criterion for the ith bit (13), we can obtain the desired result."
    }, {
      "heading" : "APPENDIX F",
      "text" : "Since the workers complete the microtasks independently, recall the results in (14) and we have\nE [Pd,i] = ∑\nS\n(\nW\nQ1\n)\nF (Q1) + 1\n2\n∑\nS′\n(\nW\nQ1\n)\nF (Q1), (100)\nand\nE [Pf,i] = ∑\nS\n(\nW\nQ1\n)\nF ′(Q1) + 1\n2\n∑\nS′\n(\nW\nQ1\n)\nF ′(Q1), (101)\nwith F (Q1) and F ′(Q1) as given above. Then, it is straightforward to obtain the desired result."
    }, {
      "heading" : "APPENDIX G",
      "text" : "Since the workers complete the microtasks independently, recalling the results in (14) we have\nE [Pd,i] = ∑\nS\n(\nW\nQ2\n)\nF (Q2) + 1\n2\n∑\nS′\n(\nW\nQ2\n)\nF (Q2), (102)\nand\nE [Pf,i] = ∑\nS\n(\nW\nQ2\n)\nF ′(Q2) + 1\n2\n∑\nS′\n(\nW\nQ2\n)\nF ′(Q2) (103)\nwith F (Q2) and F ′(Q2) given above. Then, it is straightforward to obtain the desired result.\n14"
    } ],
    "references" : [ {
      "title" : "Introduction to the issue on signal processing for social networks",
      "author" : [ "H.V. Poor", "K.-C. Chen", "V. Krishnamurthy", "D. Shah", "P.J. Wolfe" ],
      "venue" : "IEEE J. Sel. Topics Signal Process., vol. 8, no. 4, pp. 511–513, Aug. 2014.",
      "citeRegEx" : "1",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Wikinomics: How Mass Collaboration Changes Everything",
      "author" : [ "D. Tapscott", "A.D. Williams" ],
      "venue" : "New York: Portfolio Penguin,",
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 2006
    }, {
      "title" : "Crowdsourcing: Why the Power of the Crowd Is Driving the Future of Business",
      "author" : [ "J. Howe" ],
      "venue" : "New York: Crown Business,",
      "citeRegEx" : "3",
      "shortCiteRegEx" : "3",
      "year" : 2008
    }, {
      "title" : "Macrowikinomics: Rebooting Business and the World",
      "author" : [ "D. Tapscott", "A.D. Williams" ],
      "venue" : "New York: Portfolio Penguin,",
      "citeRegEx" : "4",
      "shortCiteRegEx" : "4",
      "year" : 2010
    }, {
      "title" : "A survey of crowdsourcing systems",
      "author" : [ "M.-C. Yuen", "I. King", "K.-S. Leung" ],
      "venue" : "Proc. IEEE 3rd Int. Conf. Social Comput. (SOCIALCOM 2011), 2011, pp. 766–773.",
      "citeRegEx" : "5",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "The Future of Work: What It Means for Individuals, Businesses, Markets and Governments",
      "author" : [ "D. Bollier" ],
      "venue" : "The Aspen Institute,",
      "citeRegEx" : "6",
      "shortCiteRegEx" : "6",
      "year" : 2011
    }, {
      "title" : "Best practices for QoE crowdtesting: QoE assessment with crowdsourcing",
      "author" : [ "T. Hoßfeld", "C. Keimel", "M. Hirth", "B. Gardlo", "J. Habigt", "K. Diepold", "P. Tran-Gia" ],
      "venue" : "IEEE Trans. Multimedia, vol. 16, no. 2, pp. 541–558, Jan. 2014.",
      "citeRegEx" : "7",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "The four pillars of crowdsourcing: A reference model",
      "author" : [ "M. Hosseini", "K. Phalp", "J. Taylor", "R. Ali" ],
      "venue" : "Proc. IEEE 8th Int. Conf. Research Challenges in Inf. Sci. (RCIS 2014), 2014, pp. 1–12.",
      "citeRegEx" : "8",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "The computer is the new sewing machine: Benefits and perils of crowdsourcing",
      "author" : [ "P. Paritosh", "P. Ipeirotis", "M. Cooper", "S. Suri" ],
      "venue" : "Proc. 20th Int. Conf. World Wide Web (WWW’11), Mar.–Apr. 2011, pp. 325– 326.",
      "citeRegEx" : "9",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Combining human and machine intelligence in large-scale crowdsourcing",
      "author" : [ "E. Kamar", "S. Hacker", "E. Horvitz" ],
      "venue" : "Proc. 11th Int. Conf. Autonomous Agents and Multiagent Systems (AAMAS 2012), Jun. 2012, pp. 467–474.",
      "citeRegEx" : "10",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Paraphrase acquisition via crowdsourcing and machine learning",
      "author" : [ "S. Burrows", "M. Potthast", "B. Stein" ],
      "venue" : "ACM Trans. Intell. Syst. Technol., vol. 4, no. 3, p. 43, Jul. 2013.",
      "citeRegEx" : "11",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "CrowdOp: Query optimization for declarative crowdsourcing systems",
      "author" : [ "J. Fan", "M. Zhang", "S. Kok", "M. Lu", "B.C. Ooi" ],
      "venue" : "IEEE Trans. Knowl. Data Eng., vol. 27, no. 8, pp. 2078–2092, Aug. 2015.",
      "citeRegEx" : "12",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Comparing two methods for crowdsourcing speech transcription",
      "author" : [ "R. Sprugnoli", "G. Moretti", "M. Fuoli", "D. Giuliani", "L. Bentivogli", "E. Pianta", "R. Gretter", "F. Brugnara" ],
      "venue" : "Proc. IEEE Int. Conf. Acoust., Speech, Signal Process. (ICASSP 2013), May 2013, pp. 8116–8120.",
      "citeRegEx" : "13",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Survey of web-based crowdsourcing frameworks for subjective quality assessment",
      "author" : [ "T. Hoßfeld", "M. Hirth", "P. Korshunov", "P. Hanhart", "B. Gardlo", "C. Keimel", "C. Timmerer" ],
      "venue" : "Proc. 2014 IEEE 16th Int. Workshop Multimedia Signal Process. (MMSP), Sep. 2014, pp. 1–6.",
      "citeRegEx" : "14",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Crowdsourcing subjective image quality evaluation",
      "author" : [ "F. Ribeiro", "D. Florencio", "V. Nascimento" ],
      "venue" : "Proc. 2011 18th IEEE Int. Conf. Image Process. (ICIP), Sep. 2011, pp. 3097–3100.",
      "citeRegEx" : "15",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "CROWDMOS: An approach for crowdsourcing mean opinion score studies",
      "author" : [ "F. Ribeiro", "D. Florencio", "C. Zhang", "M. Seltzer" ],
      "venue" : "Proc. IEEE Int. Conf. Acoust., Speech, Signal Process. (ICASSP 2011), May 2011, pp. 2416–2419.",
      "citeRegEx" : "16",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Quality management on Amazon Mechanical Turk",
      "author" : [ "P.G. Ipeirotis", "F. Provost", "J. Wang" ],
      "venue" : "Proc. ACM SIGKDD Workshop Human Comput. (HCOMP’10), Jul. 2010, pp. 64–67.",
      "citeRegEx" : "17",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "Quality control in crowdsourcing systems: Issues and directions",
      "author" : [ "M. Allahbakhsh", "B. Benatallah", "A. Ignjatovic", "H.R. Motahari-Nezhad", "E. Bertino", "S. Dustdar" ],
      "venue" : "IEEE Internet Comput., no. 2, pp. 76–81, Mar. 2013.",
      "citeRegEx" : "18",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Cross-task crowdsourcing",
      "author" : [ "K. Mo", "E. Zhong", "Q. Yang" ],
      "venue" : "Proc. ACM Int. Conf. Knowl Discovery Data Mining, Aug. 2013, pp. 677–685.",
      "citeRegEx" : "19",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Participation in crowd systems",
      "author" : [ "L.R. Varshney" ],
      "venue" : "Proc. 50th Annu. Allerton Conf. Commun. Control Comput., Oct. 2012, pp. 996–1001.",
      "citeRegEx" : "20",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Analyzing costs and accuracy of validation mechanisms for crowdsourcing platforms",
      "author" : [ "M. Hirth", "T. Hoßfeld", "P. Tran-Gia" ],
      "venue" : "Math. Comput. Model., vol. 57, no. 11, pp. 2918–2932, Jul. 2013.",
      "citeRegEx" : "21",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Reliable crowdsourcing for multi-class labeling using coding theory",
      "author" : [ "A. Vempaty", "L.R. Varshney", "P.K. Varshney" ],
      "venue" : "IEEE J. Sel. Topics Signal Process., vol. 8, no. 4, pp. 667–679, Aug. 2014.",
      "citeRegEx" : "22",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Iterative learning for reliable crowdsourcing systems",
      "author" : [ "D.R. Karger", "S. Oh", "D. Shah" ],
      "venue" : "Advances in Neural Information Processing Systems (NIPS) 24. Cambridge, MA: MIT Press, Dec. 2011, pp. 1953– 1961.",
      "citeRegEx" : "23",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Models of dataset size, question design, and cross-language speech perception for speech crowdsourcing applications",
      "author" : [ "M. Hasegawa-Johnson", "J. Cole", "P. Jyothi", "L.R. Varshney" ],
      "venue" : "Laboratory Phonology, vol. 6, no. 3-4, pp. 381–431, Oct. 2015.",
      "citeRegEx" : "24",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Acquiring speech transcriptions using mismatched crowdsourcing",
      "author" : [ "P. Jyothi", "M. Hasegawa-Johnson" ],
      "venue" : "Proc. 29th AAAI Conf. Artificial Intelligence (AAAI’15), Nov. 2015.",
      "citeRegEx" : "25",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Language coverage for mismatched crowdsourcing",
      "author" : [ "L.R. Varshney", "P. Jyothi", "M. Hasegawa-Johnson" ],
      "venue" : "Proc. 2016 Inf. Theory Appl. Workshop, Feb. 2016.",
      "citeRegEx" : "26",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "Adapting ASR for underresourced languages using mismatched transcriptions",
      "author" : [ "C. Liu", "P. Jyothi", "H. Tang", "V. Manohar", "R. Sloan", "T. Kekona", "M. Hasegawa-Johnson", "S. Khudanpur" ],
      "venue" : "Proc. IEEE Int. Conf. Acoust., Speech, Signal Process. (ICASSP 2016), Mar. 2016.",
      "citeRegEx" : "27",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "Transcribing continuous speech using mismatched crowdsourcing",
      "author" : [ "P. Jyothi", "M. Hasegawa-Johnson" ],
      "venue" : "Proc. Int. Conf. Spok. Lang. Process. (INTERSPEECH 2015), Sep. 2015.",
      "citeRegEx" : "28",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Mismatched crowdsourcing based language perception for under-resourced languages",
      "author" : [ "W. Chen", "M. Hasegawa-Johnson", "N.F. Chen" ],
      "venue" : "Procedia Computer Science, vol. 81, pp. 23–29, 2016.",
      "citeRegEx" : "29",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "Performance improvement of probabilistic transcriptions with language-specific constraints",
      "author" : [ "X. Kong", "P. Jyothi", "M. Hasegawa-Johnson" ],
      "venue" : "Procedia Computer Science, vol. 81, pp. 30–36, 2016.",
      "citeRegEx" : "30",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "Consumer preference for a no-choice option",
      "author" : [ "R. Dhar" ],
      "venue" : "J. Consumer Research, vol. 24, no. 2, pp. 215–231, Sep. 1997.",
      "citeRegEx" : "31",
      "shortCiteRegEx" : null,
      "year" : 1997
    }, {
      "title" : "Predicting next label quality: A time-series model of crowdwork",
      "author" : [ "H.J. Jung", "Y. Park", "M. Lease" ],
      "venue" : "Proc. 2nd AAAI Conf. Hum. Compt. Crowdsourcing (HCOMP’14), Nov. 2014, pp. 87–95.",
      "citeRegEx" : "32",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "On optimum recognition error and reject tradeoff",
      "author" : [ "C. Chow" ],
      "venue" : "IEEE Trans. Inf. Theory, vol. IT-16, no. 1, pp. 41–46, Jan. 1970.",
      "citeRegEx" : "33",
      "shortCiteRegEx" : null,
      "year" : 1970
    }, {
      "title" : "Classification with a reject option using a hinge loss",
      "author" : [ "P.L. Bartlett", "M.H. Wegkamp" ],
      "venue" : "J. Mach. Learn. Res., vol. 9, pp. 1823–1840, Jun. 2008.",
      "citeRegEx" : "34",
      "shortCiteRegEx" : null,
      "year" : 1823
    }, {
      "title" : "Aggregating probabilistic forecasts from incoherent and abstaining experts",
      "author" : [ "J.B. Predd", "D.N. Osherson", "S.R. Kulkarni", "H.V. Poor" ],
      "venue" : "Decision Analysis, vol. 5, no. 4, pp. 177–189, Jul. 2008.",
      "citeRegEx" : "35",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "A risk bound for ensemble classification with a reject option",
      "author" : [ "K.R. Varshney" ],
      "venue" : "Proc. IEEE Workshop Stat. Signal Process. (SSP 2011), Jun. 2011, pp. 769–772.",
      "citeRegEx" : "36",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "A weighted aggregation rule in crowdsourcing systems for high result accuracy",
      "author" : [ "D. Yue", "G. Yu", "D. Shen", "X. Yu" ],
      "venue" : "Proc. IEEE 12th Int. Conf. Depend., Auton. Secure Comput. (DASC), Aug. 2014, pp. 265–270.",
      "citeRegEx" : "37",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Budget-optimal crowdsourcing using low-rank matrix approximations",
      "author" : [ "D.R. Karger", "S. Oh", "D. Shah" ],
      "venue" : "Proc. 49th Annu. Allerton Conf. Commun. Control Comput., Sep. 2011, pp. 284–291.",
      "citeRegEx" : "38",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Worker ranking determination in crowdsourcing platforms using aggregation functions",
      "author" : [ "D. Sanchez-Charles", "J. Nin", "M. Sole", "V. Muntes-Mulero" ],
      "venue" : "Proc. IEEE Int. Conf. Fuzzy Syst. (FUZZ 2014), Jul. 2014, pp. 1801–1808.",
      "citeRegEx" : "39",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Human computation: a survey and taxonomy of a growing field",
      "author" : [ "A.J. Quinn", "B.B. Bederson" ],
      "venue" : "Proc. 2011 Annu. Conf. Hum. Factors Comput. Syst. (CHI 2011), May 2011, pp. 1403–1412.",
      "citeRegEx" : "40",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Reputation-based incentive protocols in crowdsourcing applications",
      "author" : [ "Y. Zhang", "M. van der Schaar" ],
      "venue" : "Proc. 31st IEEE Conf. Computer Commun. (INFOCOM 2012), Mar. 2012, pp. 2140–2148.",
      "citeRegEx" : "41",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Classifier selection for majority voting",
      "author" : [ "D. Ruta", "B. Gabrys" ],
      "venue" : "Inform. Fusion, vol. 6, no. 1, pp. 63–81, Mar. 2005.",
      "citeRegEx" : "42",
      "shortCiteRegEx" : null,
      "year" : 2005
    }, {
      "title" : "Classification with reject option",
      "author" : [ "R. Herbei", "M.H. Wegkamp" ],
      "venue" : "Canadian J. Stat., vol. 34, no. 4, pp. 709–721, Dec. 2006.",
      "citeRegEx" : "43",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Classification with reject option using contextual information",
      "author" : [ "F. Condessa", "J. Bioucas-Dias", "C.A. Castro", "J.A. Ozolek", "J. Kovacevic" ],
      "venue" : "2013 IEEE 10th Int. Symp. Biomedical Imag., Apr. 2013, pp. 1340–1343.",
      "citeRegEx" : "44",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "A classification approach with a reject option for multi-label problems",
      "author" : [ "I. Pillai", "G. Fumera", "F. Roli" ],
      "venue" : "Proc. 2011 16th Int. Conf. Image Anal. Process. (ICIAP), Sep. 2011, pp. 98–107.",
      "citeRegEx" : "45",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Paperbased dichotomous key to computer based application for biological indentification",
      "author" : [ "J. Rocker", "C.M. Yauch", "S. Yenduri", "L. Perkins", "F. Zand" ],
      "venue" : "J. Comput. Sci. Coll., vol. 22, no. 5, pp. 30–38, May 2007.",
      "citeRegEx" : "46",
      "shortCiteRegEx" : null,
      "year" : 2007
    }, {
      "title" : "Optimal data fusion in multiple sensor detection systems",
      "author" : [ "Z. Chair", "P.K. Varshney" ],
      "venue" : "IEEE Trans. Aerosp. Electron. Syst., vol. AES-22, no. 1, pp. 98–101, Jan. 1986.",
      "citeRegEx" : "47",
      "shortCiteRegEx" : null,
      "year" : 1986
    }, {
      "title" : "Modeling temporal crowd work quality with limited supervision",
      "author" : [ "H.J. Jung", "M. Lease" ],
      "venue" : "Proc. AAAI Workshop Human Comput. (HCOMP’15), Nov. 2015, pp. 83–91.",
      "citeRegEx" : "49",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Financial incentives and the “performance of crowds",
      "author" : [ "W. Mason", "D.J. Watts" ],
      "venue" : "Proc. ACM SIGKDD Workshop Human Comput. (HCOMP’09), Jun. 2009, pp. 77–85.",
      "citeRegEx" : "50",
      "shortCiteRegEx" : null,
      "year" : 2009
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "Advances in signal processing theory and methods to optimize these novel human-oriented approaches to signal acquisition and processing are needed [1].",
      "startOffset" : 147,
      "endOffset" : 150
    }, {
      "referenceID" : 1,
      "context" : "Crowdsourcing has particularly attracted intense interest [2]–[8] as a new paradigm for signal processing tasks such as handwriting recognition, paraphrase acquisition, speech transcription, image quality assessment, and photo tagging [9]– [16], that essentially all boil down to the classical statistical This work was supported in part by ARO under Grant W911NF-14-1-0339 and by NSF under Grant IIS-1550145.",
      "startOffset" : 58,
      "endOffset" : 61
    }, {
      "referenceID" : 7,
      "context" : "Crowdsourcing has particularly attracted intense interest [2]–[8] as a new paradigm for signal processing tasks such as handwriting recognition, paraphrase acquisition, speech transcription, image quality assessment, and photo tagging [9]– [16], that essentially all boil down to the classical statistical This work was supported in part by ARO under Grant W911NF-14-1-0339 and by NSF under Grant IIS-1550145.",
      "startOffset" : 62,
      "endOffset" : 65
    }, {
      "referenceID" : 8,
      "context" : "Crowdsourcing has particularly attracted intense interest [2]–[8] as a new paradigm for signal processing tasks such as handwriting recognition, paraphrase acquisition, speech transcription, image quality assessment, and photo tagging [9]– [16], that essentially all boil down to the classical statistical This work was supported in part by ARO under Grant W911NF-14-1-0339 and by NSF under Grant IIS-1550145.",
      "startOffset" : 235,
      "endOffset" : 238
    }, {
      "referenceID" : 15,
      "context" : "Crowdsourcing has particularly attracted intense interest [2]–[8] as a new paradigm for signal processing tasks such as handwriting recognition, paraphrase acquisition, speech transcription, image quality assessment, and photo tagging [9]– [16], that essentially all boil down to the classical statistical This work was supported in part by ARO under Grant W911NF-14-1-0339 and by NSF under Grant IIS-1550145.",
      "startOffset" : 240,
      "endOffset" : 244
    }, {
      "referenceID" : 16,
      "context" : "Unfortunately, the low quality of crowdsourced output remains a key challenge [17]–[19].",
      "startOffset" : 78,
      "endOffset" : 82
    }, {
      "referenceID" : 18,
      "context" : "Unfortunately, the low quality of crowdsourced output remains a key challenge [17]–[19].",
      "startOffset" : 83,
      "endOffset" : 87
    }, {
      "referenceID" : 19,
      "context" : "Low-quality work may arise not only because workers are insufficiently motivated to perform well [20], [21], but also because workers may lack the skills to perform the task that is posed to them [22].",
      "startOffset" : 97,
      "endOffset" : 101
    }, {
      "referenceID" : 20,
      "context" : "Low-quality work may arise not only because workers are insufficiently motivated to perform well [20], [21], but also because workers may lack the skills to perform the task that is posed to them [22].",
      "startOffset" : 103,
      "endOffset" : 107
    }, {
      "referenceID" : 21,
      "context" : "Low-quality work may arise not only because workers are insufficiently motivated to perform well [20], [21], but also because workers may lack the skills to perform the task that is posed to them [22].",
      "startOffset" : 196,
      "endOffset" : 200
    }, {
      "referenceID" : 21,
      "context" : "Decomposing larger tasks into smaller subtasks for later aggregation allows workers lacking certain skills to contribute useful information [22], [23], by polarizing the lack of skill into a subset of subtasks.",
      "startOffset" : 140,
      "endOffset" : 144
    }, {
      "referenceID" : 22,
      "context" : "Decomposing larger tasks into smaller subtasks for later aggregation allows workers lacking certain skills to contribute useful information [22], [23], by polarizing the lack of skill into a subset of subtasks.",
      "startOffset" : 146,
      "endOffset" : 150
    }, {
      "referenceID" : 23,
      "context" : "As an illustrative example of lack of skill, consider the problem of mismatched crowdsourcing for speech transcription, which has garnered interest in the signal processing community [24]–[30].",
      "startOffset" : 183,
      "endOffset" : 187
    }, {
      "referenceID" : 29,
      "context" : "As an illustrative example of lack of skill, consider the problem of mismatched crowdsourcing for speech transcription, which has garnered interest in the signal processing community [24]–[30].",
      "startOffset" : 188,
      "endOffset" : 192
    }, {
      "referenceID" : 25,
      "context" : "There are certain phonological dimensions, such as aspiration or voicing, that are used to differentiate phonemes in one language but not another [26].",
      "startOffset" : 146,
      "endOffset" : 150
    }, {
      "referenceID" : 30,
      "context" : "Research in psychology suggests a greater tendency to select the reject option when the choice set offers several attractive alternatives but none that can be easily justified as the best, resulting in less arbitrary decisions [31].",
      "startOffset" : 227,
      "endOffset" : 231
    }, {
      "referenceID" : 31,
      "context" : "The reject option has previously been considered in the machine learning and signal processing literatures [32]–[36], but we specifically consider worker behavior and aggregation rules for crowdsourcing with a reject option.",
      "startOffset" : 107,
      "endOffset" : 111
    }, {
      "referenceID" : 35,
      "context" : "The reject option has previously been considered in the machine learning and signal processing literatures [32]–[36], but we specifically consider worker behavior and aggregation rules for crowdsourcing with a reject option.",
      "startOffset" : 112,
      "endOffset" : 116
    }, {
      "referenceID" : 20,
      "context" : "Several methods have been proposed to deal with noisy crowd work when crowd workers are required to provide a definitive yes/no response [21]–[23], [37]–[41], rather than allowing a reject option.",
      "startOffset" : 137,
      "endOffset" : 141
    }, {
      "referenceID" : 22,
      "context" : "Several methods have been proposed to deal with noisy crowd work when crowd workers are required to provide a definitive yes/no response [21]–[23], [37]–[41], rather than allowing a reject option.",
      "startOffset" : 142,
      "endOffset" : 146
    }, {
      "referenceID" : 36,
      "context" : "Several methods have been proposed to deal with noisy crowd work when crowd workers are required to provide a definitive yes/no response [21]–[23], [37]–[41], rather than allowing a reject option.",
      "startOffset" : 148,
      "endOffset" : 152
    }, {
      "referenceID" : 40,
      "context" : "Several methods have been proposed to deal with noisy crowd work when crowd workers are required to provide a definitive yes/no response [21]–[23], [37]–[41], rather than allowing a reject option.",
      "startOffset" : 153,
      "endOffset" : 157
    }, {
      "referenceID" : 36,
      "context" : "Without the reject option, noisy responses to tasks cannot be tagged before aggregation so appropriate weights cannot be assigned [37].",
      "startOffset" : 130,
      "endOffset" : 134
    }, {
      "referenceID" : 41,
      "context" : "For instance, the popular majority voting rule weights all answers equally [42], though new weighted aggregation rules have also been developed [37], [39].",
      "startOffset" : 75,
      "endOffset" : 79
    }, {
      "referenceID" : 36,
      "context" : "For instance, the popular majority voting rule weights all answers equally [42], though new weighted aggregation rules have also been developed [37], [39].",
      "startOffset" : 144,
      "endOffset" : 148
    }, {
      "referenceID" : 38,
      "context" : "For instance, the popular majority voting rule weights all answers equally [42], though new weighted aggregation rules have also been developed [37], [39].",
      "startOffset" : 150,
      "endOffset" : 154
    }, {
      "referenceID" : 21,
      "context" : "We employed error-control codes and decoding algorithms to design reliable crowdsourcing systems with unreliable workers [22].",
      "startOffset" : 121,
      "endOffset" : 125
    }, {
      "referenceID" : 39,
      "context" : "A group control mechanism where worker reputation is used to partition the crowd into groups is presented in [40], [41]; comparing group control to majority voting indicates majority voting is more cost-effective on less complex tasks [21].",
      "startOffset" : 109,
      "endOffset" : 113
    }, {
      "referenceID" : 40,
      "context" : "A group control mechanism where worker reputation is used to partition the crowd into groups is presented in [40], [41]; comparing group control to majority voting indicates majority voting is more cost-effective on less complex tasks [21].",
      "startOffset" : 115,
      "endOffset" : 119
    }, {
      "referenceID" : 20,
      "context" : "A group control mechanism where worker reputation is used to partition the crowd into groups is presented in [40], [41]; comparing group control to majority voting indicates majority voting is more cost-effective on less complex tasks [21].",
      "startOffset" : 235,
      "endOffset" : 239
    }, {
      "referenceID" : 42,
      "context" : "This is known as classification with a reject option [43] and has been focus of several recent studies in signal processing research including pattern recognition, image and speech classification [33], [34], [36], [44], [45].",
      "startOffset" : 53,
      "endOffset" : 57
    }, {
      "referenceID" : 32,
      "context" : "This is known as classification with a reject option [43] and has been focus of several recent studies in signal processing research including pattern recognition, image and speech classification [33], [34], [36], [44], [45].",
      "startOffset" : 196,
      "endOffset" : 200
    }, {
      "referenceID" : 33,
      "context" : "This is known as classification with a reject option [43] and has been focus of several recent studies in signal processing research including pattern recognition, image and speech classification [33], [34], [36], [44], [45].",
      "startOffset" : 202,
      "endOffset" : 206
    }, {
      "referenceID" : 35,
      "context" : "This is known as classification with a reject option [43] and has been focus of several recent studies in signal processing research including pattern recognition, image and speech classification [33], [34], [36], [44], [45].",
      "startOffset" : 208,
      "endOffset" : 212
    }, {
      "referenceID" : 43,
      "context" : "This is known as classification with a reject option [43] and has been focus of several recent studies in signal processing research including pattern recognition, image and speech classification [33], [34], [36], [44], [45].",
      "startOffset" : 214,
      "endOffset" : 218
    }, {
      "referenceID" : 44,
      "context" : "This is known as classification with a reject option [43] and has been focus of several recent studies in signal processing research including pattern recognition, image and speech classification [33], [34], [36], [44], [45].",
      "startOffset" : 220,
      "endOffset" : 224
    }, {
      "referenceID" : 21,
      "context" : "A worker’s answer to a single microtask is represented by either “1” (Yes) or “0” (No) [22], [46] and so the wth worker’s ordered answers aw(i), i ∈ {1, 2, .",
      "startOffset" : 87,
      "endOffset" : 91
    }, {
      "referenceID" : 45,
      "context" : "A worker’s answer to a single microtask is represented by either “1” (Yes) or “0” (No) [22], [46] and so the wth worker’s ordered answers aw(i), i ∈ {1, 2, .",
      "startOffset" : 93,
      "endOffset" : 97
    }, {
      "referenceID" : 46,
      "context" : "(6) Note that the optimal Bayesian criterion can also be viewed as the general weighted majority voting rule in (3) with weight Ww = log ρw,i 1−ρw,i , which is also called the Chair-Varshney rule [47].",
      "startOffset" : 196,
      "endOffset" : 200
    }, {
      "referenceID" : 41,
      "context" : "The difficulty in obtaining prior information makes the simple majority voting scheme very effective and therefore widely used [42].",
      "startOffset" : 127,
      "endOffset" : 131
    }, {
      "referenceID" : 47,
      "context" : "The answers to such “gold standard” questions are of course known to the manager [48], [49].",
      "startOffset" : 87,
      "endOffset" : 91
    }, {
      "referenceID" : 48,
      "context" : "the quantity of work performed, but not necessarily the quality [50].",
      "startOffset" : 64,
      "endOffset" : 68
    }, {
      "referenceID" : 47,
      "context" : "Besides, this is not effective in practice since one of the fundamental reasons for crowdsourcing is to collect classified labels that we do not have [49].",
      "startOffset" : 150,
      "endOffset" : 154
    }, {
      "referenceID" : 17,
      "context" : "Several works have studied the estimation of α in crowdsourcing systems [18], [21], [41], which can be divided into two categories: one studies the behavior of the workers in comparison to the honest control group [21]; the other one learns worker’s reputation profile [18], [41], which is stored and updated over time to identify the greedy ones from the crowd.",
      "startOffset" : 72,
      "endOffset" : 76
    }, {
      "referenceID" : 20,
      "context" : "Several works have studied the estimation of α in crowdsourcing systems [18], [21], [41], which can be divided into two categories: one studies the behavior of the workers in comparison to the honest control group [21]; the other one learns worker’s reputation profile [18], [41], which is stored and updated over time to identify the greedy ones from the crowd.",
      "startOffset" : 78,
      "endOffset" : 82
    }, {
      "referenceID" : 40,
      "context" : "Several works have studied the estimation of α in crowdsourcing systems [18], [21], [41], which can be divided into two categories: one studies the behavior of the workers in comparison to the honest control group [21]; the other one learns worker’s reputation profile [18], [41], which is stored and updated over time to identify the greedy ones from the crowd.",
      "startOffset" : 84,
      "endOffset" : 88
    }, {
      "referenceID" : 20,
      "context" : "Several works have studied the estimation of α in crowdsourcing systems [18], [21], [41], which can be divided into two categories: one studies the behavior of the workers in comparison to the honest control group [21]; the other one learns worker’s reputation profile [18], [41], which is stored and updated over time to identify the greedy ones from the crowd.",
      "startOffset" : 214,
      "endOffset" : 218
    }, {
      "referenceID" : 17,
      "context" : "Several works have studied the estimation of α in crowdsourcing systems [18], [21], [41], which can be divided into two categories: one studies the behavior of the workers in comparison to the honest control group [21]; the other one learns worker’s reputation profile [18], [41], which is stored and updated over time to identify the greedy ones from the crowd.",
      "startOffset" : 269,
      "endOffset" : 273
    }, {
      "referenceID" : 40,
      "context" : "Several works have studied the estimation of α in crowdsourcing systems [18], [21], [41], which can be divided into two categories: one studies the behavior of the workers in comparison to the honest control group [21]; the other one learns worker’s reputation profile [18], [41], which is stored and updated over time to identify the greedy ones from the crowd.",
      "startOffset" : 275,
      "endOffset" : 279
    }, {
      "referenceID" : 0,
      "context" : "(68) Therefore, the ML estimates of m and α, which are denoted by m̂ and α̂, can be obtained as {m̂, α̂} = arg max {m,α}∈[0,1] L (m,α) .",
      "startOffset" : 121,
      "endOffset" : 126
    } ],
    "year" : 2016,
    "abstractText" : "Consider designing an effective crowdsourcing system for an M -ary classification task. Crowd workers complete simple binary microtasks whose results are aggregated to give the final result. We consider the novel scenario where workers have a reject option so they may skip microtasks when they are unable or choose not to respond. For example, in mismatched speech transcription, workers who do not know the language may not be able to respond to microtasks focused on phonological dimensions outside their categorical perception. We present an aggregation approach using a weighted majority voting rule, where each worker’s response is assigned an optimized weight to maximize the crowd’s classification performance. We evaluate system performance in both exact and asymptotic forms. Further, we consider the setting where there may be a set of greedy workers that complete microtasks even when they are unable to perform it reliably. We consider an oblivious and an expurgation strategy to deal with greedy workers, developing an algorithm to adaptively switch between the two based on the estimated fraction of greedy workers in the anonymous crowd. Simulation results show improved performance compared with conventional majority voting.",
    "creator" : "LaTeX with hyperref package"
  }
}