{
  "name" : "1602.06967.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Blind score normalization method for PLDA based speaker recognition",
    "authors" : [ "Danila Doroshin", "Nikolay Lubimov", "Marina Nastasenko", "Mikhail Kotov" ],
    "emails" : [ "kotov}@stel.ru" ],
    "sections" : [ {
      "heading" : null,
      "text" : "ar X\niv :1\n60 2.\n06 96\n7v 1\n[ cs\n.C L\n] 2\n2 Fe\nb 20\n16"
    }, {
      "heading" : "1. Introduction",
      "text" : "One trial of automatic speaker verification process consists of estimating probability whether two utterances belong to the same speaker. Typically one utterance is taken from enrollment set of target speakers, another one is unknown test utterance. The decision is taken by the comparison of the verification score with a threshold. The combination of i-vector and Probabilistic Linear Discriminant Analysis (PLDA) approaches is a state-of-the-art speaker recognition method allowing to obtain this score. The i-vector approach is based on the total variability model [1] representing speaker data in the low-dimensional space. PLDA [2] handles the influence of the channel variability in the i-vector space [3] and also enables to compute the Log-Likelihood Ratio (LLR) score between target and nontarget hypothesis. There are two concurrent hypothesis forming this LLR score based on dependency of random latent variables which make probabilistic inference of visible data.\nThere are various strategies for PLDA score obtaining depending on the enrollment data size [4]. The approach with multiple enrollment utterances shows the best results among other strategies in the text-dependent verification [5]. However in real applications it often happens that the available data is limited and varied from one speaker to another. Using classical PLDA modeling approach in this case, system performance may be unstable depending on the enrollment size. In this paper, we introduce new PLDA scoring normalization technique that deals with this variation by minimizing detection cost function. Unlike traditional ZT-norm that is used to handle the effect of new environment [6], the introduced method handles the effect of different quality of speaker models and does not require extra development data. Speaker dependent score distributions for target and non-target hypothesis are considered to pose the problem.\nThe paper is organized as follows. In section 2, the proposed PLDA scores normalization technique is presented. In\nsection 3, the process of estimation of speaker dependent distribution parameters is presented. In section 4 the train and test data sets are described. The results for NIST SRE 2014 data set are given. In section 5, conclusions and future work directions are discussed."
    }, {
      "heading" : "2. Score normalization for normal distributed scores",
      "text" : "Consider speaker dependent Gaussian distributions for PLDA LLR scores and corresponding Cumulative Distribution Functions (CDF) in the cases of target H1 and non-target hypothesis H2\nPr(s|H1) = N (s, µ1, σ 2 1), ΦS(t|H1) = Pr(S < t|H1) (1) Pr(s|H2) = N (s, µ2, σ 2 2), ΦS(t|H2) = Pr(S < t|H2) (2)\nwhere r is an index of the speaker, µ1, σ1, µ2, σ2 – speaker dependent parameters, s is a PLDA LLR score. The choice of Gaussian distribution for scores will be discussed in section 3. We use minDCF as a measure of the system performance: minDCF = mint(FR(t) + βFA(t)), where FA and FR denote the false acceptance and the false rejection rates, β is a fixed constant, and t the varying threshold.\nIt is expected that the value of the speaker specific threshold depends on the quality of the speaker model. This quality depends on the speaker’s enrollment size, to what extent this enrollment represents speakers speech and also depends on the environment during enrollment recording.\nThe process of deriving the optimal threshold that is individual for each speaker is considered below. Rewrite minDCF in terms of CDF\nminDCF = min t ΦS(t|H1) + β(1− ΦS(t|H2)) (3)\nThis is unconstrained optimization problem, that can be solved by setting derivative w.r.t t to zero, Thus the following equation can be obtained\nN (t, µ1, σ 2 1) N (t, µ2, σ22) = β\nThis equation reduces to the quadratic equation by taking a logarithm. In the case σ1 6= σ2, the solution is\nt1,2 = σ21µ2 − σ 2 2µ1\nσ21 − σ 2 2\n± σ1σ2\n√\n(µ1 − µ2)2 +∆(σ21 − σ 2 2)\nσ21 − σ 2 2\n(4) where ∆ = 2 log (βσ1/σ2). When σ1 > σ2, the right root gives the minimum and when σ1 < σ2, the left root is the solution of the problem (3). In the case of σ1 = σ2 = σ and µ1 > µ2 the solution is\nt = µ1 + µ2\n2 +\nσ2∆\n2(µ1 − µ2) (5)\nThe case when µ1 < µ2 is unusual for speaker verification task. For speaker dependent PLDA scores, parameters µ1, σ1, µ2, σ2 depend on the speaker’s enrolment, on the number of utterances in the enrolment. If these parameters for the specific speaker are known, then the value of the optimal threshold t is determined using (4), (5). The score normalization expression that we suggest shifts minDCF point to the zero and is is following\nsnorm = 1 √\nσ21 + σ 2 2\n(s− t)\nHere the empirical normalization by the total variance is applied. While shifting by speaker dependent t aligns minDCF threshold for all speakers, presented scale normalization aligns scores in the vicinity of a minDCF point. Also this technique showed good results in our experiments on NIST SRE 2014 database."
    }, {
      "heading" : "3. Speaker dependent distribution of PLDA scores",
      "text" : "In this section we derive speaker specific parameters µ, σ for score distributions of target and non-target hypotheses. First, standard PLDA model will be described and then score in multiple enrollment case will be presented. We approximate score distribution using Gaussian distribution and examine two cases: when test vector correlates with speaker’s enrollment set, i.e. target hypothesis H1, and when there is no correlation, i.e. nontarget hypothesis H2.\nGiven a speaker and a set of i-vectors i1, ..., iL , PLDA assumes [2] that the i-vectors are distributed according to\nin = m+ Fx+Gyn + en\nx ∼ N (x, 0, If ), yn ∼ N (yn, 0, Ig)\nen ∼ N (en, 0,Σ)\nwhere m is the mean vector, x ∈ Rf is a speaker factor that supposed to be the same for all i-vectors of the speaker, yn ∈ R\ng is a channel factor, en is a residual, I is an identity matrix of respectable dimension, and Σ is a diagonal covariance matrix. Further, for simplicity of calculations we assume that the mean vector m is equal to zero. This can be achieved by preliminary subtracting it from the data.\nConsider the trial containing the speaker’s enrolment set i1, ..., iL and the test i-vector it. PLDA LLR verification score s for this trial can be written [5, 4] as\ns = 1\n2\n[\n(i+ it) TKL+1(i+ it)− i TKLi− i T t K1it\n]\n+α(L)\n(6) where i = ∑L\nn=1 in - the sum of the speaker’s i-vectors and\nKL, α(L) are defined as follows\nKL = ŪFM −1 L F T Ū\nα(L) = log det (ML+1)\n−1\ndet (ML) −1 · det (M1) −1\nwhere U = GGT +Σ, Ū = U−1, ML = L ·F T ŪF +If . Further, to derive speaker dependent distribution we assume that the speaker’s enrollment is known and it is random variable. To deduce this distribution, the expression for the score (6) is rewritten as a quadratic form in the variable it\ns = 1\n2 (it − d)\nTA(it − d) T + c−\n1 2 bTA−1b (7)\nusing following notations\nA = KL+1 −K1, b = KL+1i\nc = 1\n2 iT (KL+1 −KL)i+ α(L), d = −A −1b\nParameters of the quadratic form depend on the enrollment size L and the sum of enrollment i-vectors i. Here should be considered distribution of the quadratic form with normal distributed vector it. There has been some works on computing such distributions [7], [8], [9], [10], [11]. Quadratic form can be rewritten as a linear combination of independent non-central chi-squared distributed variables by using the transition to the new variables associated with the principal components of the matrix A. The convolution of this distributions leads to the complex distribution for which the solution of the problem (3) seems difficult. In the i-vector case (7), this sum consists of 400 to 600 elements since it is the typical dimension of i-vector space. In this work, we approximate this distribution by using Gaussian distribution and reserve the case of non-Gaussian distribution for possible further research.\nConsider quadratic form z = qTΛq, where q is the random vector with the expected value µq and covariance matrix Σq . Then, the expectation and variance of z are defined as follows\nµz = tr (ΛΣq) + µ T q Λµq (8)\nσ2z = 2 tr (ΛΣqΛΣq) + 4µ T q ΛΣqΛµq (9)\nConsider first case of the non-target hypotheses H2 when the test i-vector has zero expectation and covariance matrix R = V + U , where V = FF T . Parameters of the distribution (2) are obtained by applying (8), (9) to the quadratic form (7)\nµ2 = 1\n2 tr (AR) + c\nσ22 = 1\n2 tr (ARAR) + bTRb\nIn the case of the target hypotheses H1, test i-vector is correlated with speaker’s enrolment and has more complex distribution. Combined vector [it, i1, . . . , iN ]T has zero expectation and covariance matrix\nC =\n\n    U + V V . . . V V U + V . . . V ... ... . . .\n... V V . . . U + V\n\n   \nIt can be shown [4] that conditional probability distribution of it given i1, . . . , iN has the following expectation and covariance\nµ̂ = ( V Ū + L · V Q ) i\nR̂ = R− L · ( V Ū + L · V Q ) V\nwhere Q = −(L · V +U)−1V Ū . Now, using (8) and (9), final expressions for µ1 and σ21 from (1) are derived\nµ1 = 1\n2 tr(AR̂)− µ̂TAd+\n1 2 µ̂TAµ̂+ c\nσ21 = 1 2 tr ( AR̂AR̂ ) + (d− µ̂)TAR̂A(d− µ̂)\nAs a result, it is clear that the parameters of speaker dependent score distributions µ1, σ1, µ2, σ2 depend on the speaker’s enrollment size L and on the sum of enrollment i-vectors."
    }, {
      "heading" : "4. Experimental results",
      "text" : ""
    }, {
      "heading" : "4.1. Data set and PLDA parameters estimation",
      "text" : "NIST i-vector Machine Learning Challenge 2014 data set has been chosen to test the efficiency of the proposed model. The data set consists of a labeled development set (devset), a labeled model set (modelset) with 5 i-vectors per model and an unlabeled test set (testset). Since labels for the devset were not available during the challenge, the best results were obtained from methods that allowed to cluster the devset and then to apply PLDA [12, 13]. The original devset labels have been used in the presented experiments.\nIn our experiments the datasets have been initially preprocessed. Preliminary all i-vectors with duration less then 10 seconds have been removed [12, 13]. We construct a new labeled trainset, modelset, testset, modelsetCV, testsetCV. Speakers from devset with 3 to 10 i-vectors combined with the initial modelset are assigned to the trainset, with 11 to 15 i-vectors are assigned to the new modelset and testset, remaining speakers with more then 15 i-vectors form cross validation set (modelsetCV, testsetCV). First 5 i-vectors from each speaker set are used as enrollment in the modelset and the remaining as the testset. The same is done for the cross validation set. Eventually the trainset contains 3281 speakers and total 18759 i-vectors, 717 speakers with 3585 i-vectors and 5400 i-vectors in the modelset and the testset respectively.We used minDCF with β = 100 as a measure of the system performance.\nThe whitening process is applied to the trainset [14]. Whitened trainset is used for the PLDA model parameter estimation. The parameters of whitening are computed on the trainset too. Whitened trainset was projected on the unit sphere [14]. This transform is used further for all trials. Best speaker and channel factor dimensions for PLDA are equal to 590 and 10 respectively. Optimal parameters were found on cross validation set - modelsetCV, testsetCV."
    }, {
      "heading" : "4.2. Results",
      "text" : "The experiments were performed with various enrollment size conditions. modelset contains speakers with 5 i-vectors per speaker. We compare general PLDA scoring with suggested normalized scoring (2) on the following enrollment sets. Fist, 5 sets with L = {1, 2, 3, 4, 5} i-vectors per speaker are configured using modelset. For example, the set with L = 3 is composed using first 3 i-vectors of each speaker from modelset. In addition, the set with the mixed enrollment conditions is configured. This set is composed from modelset speakers with the reduced enrollment and contain 94 speakers with 1 i-vector per speaker, 93 speakers with 2 i-vectors per speaker, 194 speakers with 3 i-vectors per speaker, 189 speakers with 4 i-vectors per speaker, 113 speakers with 5 i-vectors per speaker.\nFigure 1. demonstrates the histograms of the speaker dependent thresholds for models with various enrollment sizes L. These thresholds are found to be optimal in terms of minDCF (3) with β = 100. As could be seen, the means of threshold distribution differ based on size of enrollment set, and variances indicates uncertainties of different speaker scores. Table 1 demonstrates results for all sets. In the case of the uniform enrollment conditions L = {1, 2, 3, 4, 5}, the suggested normalization technique shows almost the same performance as the standard PLDA scoring. Much better results are achieved on the set with mixed enrollment conditions. As it is expected, using constant threshold gives worse results than by using proposed normalization. At the same time it doesn’t bring extra com-\nputational costs since parameter estimation is made in a blind manner. This experiments shows that the performance really degrades with unfixed enrollment size and could be enhanced with this cheap procedure. In the current challenge normalized scoring decreases minDCF by 30% comparing with general PLDA scoring."
    }, {
      "heading" : "5. Conclusions and Further Work",
      "text" : "This paper presents a novel normalization technique for ivector PLDA speaker verification in the mixed enrollment number condition. The main contribution to existed normalization methods is that this technique does not require extra development data and based only on the properties of the PLDA model. This provide more stable verification scores almost without additional computational costs. The experiments conducted on NIST SRE 2014 database demonstrate that minDCF decrease in the mixed enrollment number condition.\nIn further work, the problem of non-Gaussian distribution for PLDA scores can be considered. This can lead to a more accurate estimate of the speaker specific threshold."
    }, {
      "heading" : "6. Acknowledgement",
      "text" : "Research is conducted by Stel - Computer systems ltd. with support of the Ministry of Education and Science of the Russian Federation (Contract 14.579.21.0058) Unique ID for Applied Scientific Research (project) RFMEFI57914X0058. The data presented, the statements made, and the views expressed are solely the responsibility of the authors."
    }, {
      "heading" : "7. References",
      "text" : "[1] N. Dehak, P. Kenny, R. Dehak, P. Dumouchel, and P. Ouel-\nlet, “Front-end factor analysis for speaker verification,” Audio, Speech, and Language Processing, IEEE Transactions on, vol. 19, no. 4, pp. 788–798, 2011.\n[2] S. J. Prince and J. H. Elder, “Probabilistic linear discriminant analysis for inferences about identity,” in Computer Vision, 2007. ICCV 2007. IEEE 11th International Conference on. IEEE, 2007, pp. 1–8.\n[3] P. Kenny, P. Ouellet, N. Dehak, V. Gupta, and P. Dumouchel, “A study of interspeaker variability in speaker verification,” Audio, Speech, and Language Processing, IEEE Transactions on, vol. 16, no. 5, pp. 980–988, 2008.\n[4] P. Rajan, A. Afanasyev, V. Hautamäki, and T. Kinnunen, “From single to multiple enrollment i-vectors: Practical plda scoring variants for speaker verification,” Digital Signal Processing, vol. 31, pp. 93–101, 2014.\n[5] A. Larcher, K. A. Lee, B. Ma, and H. Li, “Phoneticallyconstrained plda modeling for text-dependent speaker verification with multiple short utterances,” in Acoustics, Speech and Signal Processing (ICASSP), 2013 IEEE International Conference on. IEEE, 2013, pp. 7673–7677.\n[6] C. Barras and J.-L. Gauvain, “Feature and score normalization for speaker verification of cellular data,” in Acoustics, Speech, and Signal Processing, 2003. Proceedings.(ICASSP’03). 2003 IEEE International Conference on, vol. 2. IEEE, 2003, pp. II–49.\n[7] A. Castaño-Martı́nez and F. López-Blázquez, “Distribution of a sum of weighted noncentral chi-square variables,” Test, vol. 14, no. 2, pp. 397–415, 2005.\n[8] H. Liu, Y. Tang, and H. H. Zhang, “A new chi-square approximation to the distribution of non-negative definite quadratic forms in non-central normal variables,” Computational Statistics & Data Analysis, vol. 53, no. 4, pp. 853–856, 2009.\n[9] J. Bausch, “On the efficient calculation of a linear combination of chi-square random variables with an application in counting string vacua,” Journal of Physics A: Mathematical and Theoretical, vol. 46, no. 50, p. 505202, 2013.\n[10] D. Kuonen, “Miscellanea. saddlepoint approximations for distributions of quadratic forms in normal variables,” Biometrika, vol. 86, no. 4, pp. 929–935, 1999.\n[11] J. Sheil and I. O’Muircheartaigh, “Algorithm as 106: The distribution of non-negative quadratic forms in normal variables,” Applied Statistics, pp. 92–98, 1977.\n[12] E. Khoury, L. El Shafey, M. Ferras, and S. Marcel, “Hierarchical speaker clustering methods for the nist i-vector challenge,” in Odyssey: The Speaker and Language Recognition Workshop, no. EPFL-CONF-198439, 2014.\n[13] S. Novoselov, T. Pekhovsky, and K. Simonchik, “Stc speaker recognition system for the nist i-vector challenge,” in Odyssey: The Speaker and Language Recognition Workshop, 2014, pp. 231–240.\n[14] D. Garcia-Romero and C. Y. Espy-Wilson, “Analysis of i-vector length normalization in speaker recognition systems.” in Interspeech, 2011, pp. 249–252."
    } ],
    "references" : [ {
      "title" : "Front-end factor analysis for speaker verification",
      "author" : [ "N. Dehak", "P. Kenny", "R. Dehak", "P. Dumouchel", "P. Ouellet" ],
      "venue" : "Audio, Speech, and Language Processing, IEEE Transactions on, vol. 19, no. 4, pp. 788–798, 2011.",
      "citeRegEx" : "1",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Probabilistic linear discriminant analysis for inferences about identity",
      "author" : [ "S.J. Prince", "J.H. Elder" ],
      "venue" : "Computer Vision, 2007. ICCV 2007. IEEE 11th International Conference on. IEEE, 2007, pp. 1–8.",
      "citeRegEx" : "2",
      "shortCiteRegEx" : null,
      "year" : 2007
    }, {
      "title" : "A study of interspeaker variability in speaker verification",
      "author" : [ "P. Kenny", "P. Ouellet", "N. Dehak", "V. Gupta", "P. Dumouchel" ],
      "venue" : "Audio, Speech, and Language Processing, IEEE Transactions on, vol. 16, no. 5, pp. 980–988, 2008.",
      "citeRegEx" : "3",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "From single to multiple enrollment i-vectors: Practical plda scoring variants for speaker verification",
      "author" : [ "P. Rajan", "A. Afanasyev", "V. Hautamäki", "T. Kinnunen" ],
      "venue" : "Digital Signal Processing, vol. 31, pp. 93–101, 2014.",
      "citeRegEx" : "4",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Phoneticallyconstrained plda modeling for text-dependent speaker verification with multiple short utterances",
      "author" : [ "A. Larcher", "K.A. Lee", "B. Ma", "H. Li" ],
      "venue" : "Acoustics, Speech and Signal Processing (ICASSP), 2013 IEEE International Conference on. IEEE, 2013, pp. 7673–7677.",
      "citeRegEx" : "5",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Feature and score normalization for speaker verification of cellular data",
      "author" : [ "C. Barras", "J.-L. Gauvain" ],
      "venue" : "Acoustics, Speech, and Signal Processing, 2003. Proceedings.(ICASSP’03). 2003 IEEE International Conference on, vol. 2. IEEE, 2003, pp. II–49.",
      "citeRegEx" : "6",
      "shortCiteRegEx" : null,
      "year" : 2003
    }, {
      "title" : "Distribution of a sum of weighted noncentral chi-square variables",
      "author" : [ "A. Castaño-Martı́nez", "F. López-Blázquez" ],
      "venue" : "Test, vol. 14, no. 2, pp. 397–415, 2005.",
      "citeRegEx" : "7",
      "shortCiteRegEx" : null,
      "year" : 2005
    }, {
      "title" : "A new chi-square approximation to the distribution of non-negative definite quadratic forms in non-central normal variables",
      "author" : [ "H. Liu", "Y. Tang", "H.H. Zhang" ],
      "venue" : "Computational Statistics & Data Analysis, vol. 53, no. 4, pp. 853–856, 2009.",
      "citeRegEx" : "8",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "On the efficient calculation of a linear combination of chi-square random variables with an application in counting string vacua",
      "author" : [ "J. Bausch" ],
      "venue" : "Journal of Physics A: Mathematical and Theoretical, vol. 46, no. 50, p. 505202, 2013.",
      "citeRegEx" : "9",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Miscellanea. saddlepoint approximations for distributions of quadratic forms in normal variables",
      "author" : [ "D. Kuonen" ],
      "venue" : "Biometrika, vol. 86, no. 4, pp. 929–935, 1999.",
      "citeRegEx" : "10",
      "shortCiteRegEx" : null,
      "year" : 1999
    }, {
      "title" : "Algorithm as 106: The distribution of non-negative quadratic forms in normal variables",
      "author" : [ "J. Sheil", "I. O’Muircheartaigh" ],
      "venue" : "Applied Statistics, pp. 92–98, 1977.",
      "citeRegEx" : "11",
      "shortCiteRegEx" : null,
      "year" : 1977
    }, {
      "title" : "Hierarchical speaker clustering methods for the nist i-vector challenge",
      "author" : [ "E. Khoury", "L. El Shafey", "M. Ferras", "S. Marcel" ],
      "venue" : "Odyssey: The Speaker and Language Recognition Workshop, no. EPFL-CONF-198439, 2014.",
      "citeRegEx" : "12",
      "shortCiteRegEx" : null,
      "year" : 1984
    }, {
      "title" : "Stc speaker recognition system for the nist i-vector challenge",
      "author" : [ "S. Novoselov", "T. Pekhovsky", "K. Simonchik" ],
      "venue" : "Odyssey: The Speaker and Language Recognition Workshop, 2014, pp. 231–240.",
      "citeRegEx" : "13",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Analysis of i-vector length normalization in speaker recognition systems.",
      "author" : [ "D. Garcia-Romero", "C.Y. Espy-Wilson" ],
      "venue" : "in Interspeech,",
      "citeRegEx" : "14",
      "shortCiteRegEx" : "14",
      "year" : 2011
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "The i-vector approach is based on the total variability model [1] representing speaker data in the low-dimensional space.",
      "startOffset" : 62,
      "endOffset" : 65
    }, {
      "referenceID" : 1,
      "context" : "PLDA [2] handles the influence of the channel variability in the i-vector space [3] and also enables to compute the Log-Likelihood Ratio (LLR) score between target and nontarget hypothesis.",
      "startOffset" : 5,
      "endOffset" : 8
    }, {
      "referenceID" : 2,
      "context" : "PLDA [2] handles the influence of the channel variability in the i-vector space [3] and also enables to compute the Log-Likelihood Ratio (LLR) score between target and nontarget hypothesis.",
      "startOffset" : 80,
      "endOffset" : 83
    }, {
      "referenceID" : 3,
      "context" : "There are various strategies for PLDA score obtaining depending on the enrollment data size [4].",
      "startOffset" : 92,
      "endOffset" : 95
    }, {
      "referenceID" : 4,
      "context" : "The approach with multiple enrollment utterances shows the best results among other strategies in the text-dependent verification [5].",
      "startOffset" : 130,
      "endOffset" : 133
    }, {
      "referenceID" : 5,
      "context" : "Unlike traditional ZT-norm that is used to handle the effect of new environment [6], the introduced method handles the effect of different quality of speaker models and does not require extra development data.",
      "startOffset" : 80,
      "endOffset" : 83
    }, {
      "referenceID" : 1,
      "context" : ", iL , PLDA assumes [2] that the i-vectors are distributed according to",
      "startOffset" : 20,
      "endOffset" : 23
    }, {
      "referenceID" : 4,
      "context" : "PLDA LLR verification score s for this trial can be written [5, 4] as",
      "startOffset" : 60,
      "endOffset" : 66
    }, {
      "referenceID" : 3,
      "context" : "PLDA LLR verification score s for this trial can be written [5, 4] as",
      "startOffset" : 60,
      "endOffset" : 66
    }, {
      "referenceID" : 6,
      "context" : "There has been some works on computing such distributions [7], [8], [9], [10], [11].",
      "startOffset" : 58,
      "endOffset" : 61
    }, {
      "referenceID" : 7,
      "context" : "There has been some works on computing such distributions [7], [8], [9], [10], [11].",
      "startOffset" : 63,
      "endOffset" : 66
    }, {
      "referenceID" : 8,
      "context" : "There has been some works on computing such distributions [7], [8], [9], [10], [11].",
      "startOffset" : 68,
      "endOffset" : 71
    }, {
      "referenceID" : 9,
      "context" : "There has been some works on computing such distributions [7], [8], [9], [10], [11].",
      "startOffset" : 73,
      "endOffset" : 77
    }, {
      "referenceID" : 10,
      "context" : "There has been some works on computing such distributions [7], [8], [9], [10], [11].",
      "startOffset" : 79,
      "endOffset" : 83
    }, {
      "referenceID" : 3,
      "context" : "It can be shown [4] that conditional probability distribution of it given i1, .",
      "startOffset" : 16,
      "endOffset" : 19
    }, {
      "referenceID" : 11,
      "context" : "Since labels for the devset were not available during the challenge, the best results were obtained from methods that allowed to cluster the devset and then to apply PLDA [12, 13].",
      "startOffset" : 171,
      "endOffset" : 179
    }, {
      "referenceID" : 12,
      "context" : "Since labels for the devset were not available during the challenge, the best results were obtained from methods that allowed to cluster the devset and then to apply PLDA [12, 13].",
      "startOffset" : 171,
      "endOffset" : 179
    }, {
      "referenceID" : 11,
      "context" : "Preliminary all i-vectors with duration less then 10 seconds have been removed [12, 13].",
      "startOffset" : 79,
      "endOffset" : 87
    }, {
      "referenceID" : 12,
      "context" : "Preliminary all i-vectors with duration less then 10 seconds have been removed [12, 13].",
      "startOffset" : 79,
      "endOffset" : 87
    }, {
      "referenceID" : 13,
      "context" : "The whitening process is applied to the trainset [14].",
      "startOffset" : 49,
      "endOffset" : 53
    }, {
      "referenceID" : 13,
      "context" : "Whitened trainset was projected on the unit sphere [14].",
      "startOffset" : 51,
      "endOffset" : 55
    } ],
    "year" : 2016,
    "abstractText" : "Probabilistic Linear Discriminant Analysis (PLDA) has become state-of-the-art method for modeling i-vector space in speaker recognition task. However the performance degradation is observed if enrollment data size differs from one speaker to another. This paper presents a solution to such problem by introducing new PLDA scoring normalization technique. Normalization parameters are derived in a blind way, so that, unlike traditional ZT-norm, no extra development data is required. Moreover, proposed method has shown to be optimal in terms of detection cost function. The experiments conducted on NIST SRE 2014 database demonstrate an improved accuracy in a mixed enrollment number condition.",
    "creator" : "LaTeX with hyperref package"
  }
}