{
  "name" : "1604.08608.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "A movie genre prediction based on Multivariate Bernoulli model and genre correlations",
    "authors" : [ "Eric Makita", "Artem Lenskiy" ],
    "emails" : [ "ericmakita@koreatech.ac.kr,", "lensky@koreatech.ac.kr" ],
    "sections" : [ {
      "heading" : null,
      "text" : "PR EP\nRI NT\nIndex Terms—Genre prediction, movie recommender, multiviraiate Bernoulli model, Naive Bayes classifier.\nI. INTRODUCTION Nowadays, web users are no longer simply considered as consumers of information but also as active sources that generate large volume of data online. Consequently, the amount and the diversity of information on the Internet increase exponentially. The whole body of information that confronts the users online can cost them more time and effort without any guarantee of finding what they are looking for. Aiming to solve these problems, researchers in the academe and/or industries have suggested the use of recommender systems [1] that overcome the information overload by facilitating search and access to information by providing users with relevant items in the shortest time possible. In this context, items can be of any kind, namely a movie to watch, a soundtrack to listen to, a webpage to visit, or\nelse. Among the widely proposed recommendation techniques, content-based filtering [2] [3] and collaborative filtering [4] [5] have been the most famous one in the literature [6]. Content-based filtering is done under the assumption that users future preferences are similar to those they liked in the past, while collaborative filtering is done under the assumption that if two users have similar preferences in the past, they will have similar preferences in the future. Between them, collaborative filtering is more widely used and therefore attracts more interest from researchers [7][8]. Collaborative filtering techniques are rating-oriented and involve the participation of a high number of users who provide fewer ratings than the items they consume. Taking that into consideration, questions such as how to alleviate the data sparsity while increasing the recommendation accuracy are the main concerns in the related works.\nRecently, some approaches considering factors outside users ratings have been proposed in the literature [9]. Since recommender systems can naturally be applied in various fields where items are categorized, their associated datasets provide not only users ratings but also items categories. Based on this information, many recommender system extensions have been made.\nIn this paper, we propose a movie genre prediction model based on users ratings. We apply multi-variate Bernoulli model to estimate likelihoods that are used in Nave Bayes rule to predict movie genres. We also calculated the genre correlations to check if incorrectly predicted genre is correlated with the correctly predicted one. In general, a recommender predicting an items category is important in sense that it can complement the items categories assigned by a human expert, therefore increasing the user satisfaction by providing surprising recommendations.\nThe proposed approach has the following combination of contributions in order to expand traditional recommender systems :\n(1) We propose a new approach that expands the traditional recommender systems by predicting the category of an item under evaluation.\nar X\niv :1\n60 4.\n08 60\n8v 1\n[ cs\n.I R\n] 2\n5 M\nar 2\n01 6\nPR EP\nRI NT\n(2) The multi-variate Bernoulli event model is used to learn a movie’s likelihood of belonging to a particular genre.\n(3) The Bayesian probabilistic reasoning is applied to predict genres. To the best of our knowledge, an items category-predicting recommendation is a new attempt.\n(4) We provide an experimental study of our technique using the MovieLens dataset. Experimental results showed the correctness of our proposed approach.\nIn the remainder of this paper, we present the details of our model with the following organization. Section 2 presents various item genre-oriented recommendations. In section 3, we describe the data model and the mechanism of our proposed technique. Section 4 contains the performance studies. Finally, in section 5, we summarize our work."
    }, {
      "heading" : "II. RELATED WORK",
      "text" : "A large body of research about genres or categories of recommended items has been done in the past.\nOne study proposed a movie recommender system that enhances the accuracy and overcomes the traditional recommendation by factorizing the user-genre matrix instead of the user-item matrix [10]. The factorized user-genre matrix model was used to discover latent factors from genres in order to enrich user profiles. In [11] content-based filtering utilizing user categorybased filtering was proposed to overcome one of the major issues of recommender systems termed as item cold start. Item cold start refers to new items that have not received enough feedback from users, thus could decrease the accuracy of the recommendation. Another example of category-based recommendation is proposed in [12], where authors presented a framework called SEP for overcoming recommender system problems such as cold start and sparsity. The authors in [13] proposed a recommender system approach that uses genre information to address not only the coverage of the recommender system algorithms but also the redundancy. Most of the related works focus on designing a new approach to identify similarities between users, while the prediction of movie genres remains understudied to the best of our knowledge. However, it could play an important role in recommending novel items to a user"
    }, {
      "heading" : "III. PROPOSED METHOD",
      "text" : "The proposed method applies the well-known Bernoulli model for calculating the conditional probability of movie being of a particular genre. To describe our idea clearly, we initially give some definitions used in this paper: users set: U , movie set: M , genre set: G, rating set : R.\nA movie m ∈M is characterized by a binary feature vector, which components set to 1 if the corresponding\nuser u rated the movie m as r otherwise zero. That is to say:\nvm,u(r) = { 1 if u ratedmovie m as r, 0 otherwise.\n(1)\nAssuming that the ratings of one user do not depend on ratings of other users, the conditional probability of a movie, m given genre g, is computed according to multi-variate Bernoulli model as follows:\nP (m | g, r) = ∏ u∈U [vm,u(r)P (u | g, r)\n+ (1− vm,u(r))(1− P (u | g, r))] (2)\nwhere vm,u(r) is either 0 or 1 indicating whether the user u rated the movie of genre g as r or not. A movie can be seen as a collection of multiple independent Bernoulli experiments, one for each user in the user set U with the probabilities for each of these rating events defined by each component P (u | g, r). The probability P (u | g, r) defines the probability of user u given a rating r to a movie labeled as g :\nP (u | g, r) = 1 +\n∑ m∈M vm,uP (m | g, r)\n|U |+ ∑ m∈M P (m | g, r) (3)\nThe probability P (u | g, r) can be thought as a users preference model towards movie genres. In other words, knowing the genre and the rating, the eq. 3 describes the probability that user u match a hypothetical user that would rate a movie of genre g as r. The probability P (g | m, r) is 1 is m is marked only as genre g otherwise 0. If m simultaneously belong to N genres, the probability 1/N is assigned. To avoid the zero probability that can occur in case when a user u did not rate a movie m, we added a 1 to the numerator and the total number of users |U | to the denominator according to the Laplaces law of succession.\nThe posterior probability of a genre, given a movie and the rating is calculated as follows:\nP (g | m, r) = P (m | g, r) · P (g | r) P (m)\n(4)\nGiven the posterior probability 4, for each rating we predict a movie m as genre g according to the highest posterior probability as follows:\ngmax = argmax g∈G\nP (g | m, r) (5)\nPR EP\nRI\nNT"
    }, {
      "heading" : "IV. EXPERIMENTAL EVALUATION",
      "text" : ""
    }, {
      "heading" : "A. Dataset",
      "text" : "We begin with the description of the MovieLens dataset and parameters used in our experiments.\nWe performed our experiments on the MovieLens 100K dataset [14], which contains 1,682 movies, 943 users, and 100,000 ratings that range from range of 1 to 5. In this dataset, each user has rated at least 20 movies. 18 movies’ genres were selected here and each movie is assigned to at least one genre. We carried out the experiment by dividing the dataset into two, a training set and a test set. During the training phase rows of the genre matrix and columns in the rating matrix that correspond to the testing set were removed. Thus, the users preference models were built only using a portion of the available rated items with known genres selected for testing."
    }, {
      "heading" : "B. Evaluation",
      "text" : "In this section, we demonstrate the correctness of our proposed method.\nMovies were selected randomly in both of our training and testing approaches. To test the prediction power of the proposed model the following portion of training size were chose: : 1%, 5%,10%,...,75%, 80%. As for the testing set we always used 20% of the whole set. None of items of testing set were included in the training.\nThe first step in our algorithm is to estimate P (u | g, r) based on the user ratings, that is described by eq. 3. Figure 1, depicts the probability of the user u rating a movie of category g as rating r = 1 i.e. user preference models. Figure 2, illustrates the probability P (m | g, r) that is obtained based on the Bernoulli event model (2) and plays a role of a likelihood in the Bayesian eq. 4. The probability of a failure or absence of the event vm,u(r) is given by (1 − vm,u(r))(1 − P (u | g, r)). When the prediction is incorrect, the genre correlation matrix (fig. 3) is used to check whether the incorrectly predicted genre is correlated with the true movies genre. If it is correlated (cor > 0.1), we accept this prediction as a prediction of a similar genre.\nTo measure the accuracy of the proposed approach on movie genre recommendations, we plot the predictions based on every rating from one to five. For every training size we repeated the process of randomly selecting training samples 20 times.\nFigures 4 to 7 show the prediction rate of our approach with and without including correlated genres. These plots indicate that our movie category prediction based on the Bayesian model presented in Section 3.0 is effective for predicting genres based on all\n900 800\n7000\n600 2\n500\nusers\n4 6 400\n8\ngenres\n30010 20012\n14 100 16\n18\n0.01 P (u\njg )\n0.02\nFig. 1. Preference models for rating 1.\n0\nP (m\njg )\n-1000\n2 200\n4 4006\n6008 80010\ngenres movies\n100012 120014\n140016\n18 1600\n-2000\nFig. 2. Probability for a movie m being rated as r = 1.\nFig. 3. Movie correlation matrix.\nrating. As the size of the training dataset increases, the prediction accuracy increases as well. Table 1 present the prediction results when 80% of the whole set was\nPR EP\nRI\nNT\nTABLE I PREDICTION RATE WHEN 80% OF THE SET USED FOR TRAINING\nr = 1 r = 2 r = 3 r = 4 r = 5 exact 51.2± 2.2 51.6± 2.5 58.8± 2.6 56.7± 2.4 52.9± 2.8 exact w/ similar 53.6± 2.2 55.9± 2.8 69.2± 2.9 66.6± 2.4 61.0± 3.2\n1 5 10 15 20 25 30 35 40 45 50 55 60 65 70 75 80 Precentage of the total data used for training\n0.3\n0.35\n0.4\n0.45\n0.5\n0.55\nC or\nre ct\np re\ndi ct\nio n\nPrediction rate Prediction rate including correlated genres\nFig. 4. Prediction accuracy based on rating r = 1.\n1 5 10 15 20 25 30 35 40 45 50 55 60 65 70 75 80 Precentage of the total data used for training\nPrediction rate Prediction rate including correlated genres\nused for the training.\nIt is interesting to note that only 10% of data used to training is enough to achieve 50% prediction accuracy. This results shows that Bernoulli multivariate event models can be employed in genre prediction together with Bayesian rule."
    }, {
      "heading" : "V. CONCLUSION",
      "text" : "Over the last decade, recommender systems have been successfully applied in various domains such as social networking, online movie viewing website, or ecommerce, etc. Until now, most of the recommender systems that have been proposed and reported in the literature are item rating prediction-oriented. In this paper, we proposed an approach that expands the traditional recommender system algorithms by predicting the category of an item under evaluation rather than predicting its rating. Predicting the category of an item can help increase the accuracy of the recommended items\n1 5 10 15 20 25 30 35 40 45 50 55 60 65 70 75 80 Precentage of the total data used for training\n0.35\n0.4\n0.45\n0.5\n0.55\n0.6\n0.65\n0.7\nC or\nre ct\np re\ndi ct\nio n\nPrediction rate Prediction rate including correlated genres\nFig. 6. Prediction accuracy based on rating r = 3.\n1 5 10 15 20 25 30 35 40 45 50 55 60 65 70 75 80 Precentage of the total data used for training\n0.3\n0.35\n0.4\n0.45\n0.5\n0.55\n0.6\n0.65\n0.7\nC or\nre ct\np re\ndi ct\nio n\nPrediction rate Prediction rate including correlated genres\nFig. 7. Prediction accuracy based on rating r = 4.\n1 5 10 15 20 25 30 35 40 45 50 55 60 65 70 75 80 Precentage of the total data used for training\n0.3\n0.35\n0.4\n0.45\n0.5\n0.55\n0.6\n0.65\nC or\nre ct\np re\ndi ct\nio n\nPrediction rate Prediction rate including correlated genres\nFig. 8. Prediction accuracy based on rating r = 5.\ngenerated by complementing the categories assigned by an expert.\nTo show the correctness of our approach, we conducted an experimental study using MovieLens dataset. The experimental results showed that predicting the category of an item under evaluation can achieve 50% accuracy rate based on 10% training set of users rating 3. This finding is deemed valuable in many applications in practice. For instance, it can complement the genres given by experts. It could significantly increase the accuracy and usefulness of recommendations.\nWe also showed in our experimental analysis that predictions based on high ratings do not follow the behavior\nPR EP\nRI NT\nof predictions based on low ratings. This situation can be seen as an interesting open issue for our future work to tackle, by which we can focus on improving the prediction based on high ratings. Related study may lead to designing new attempts in the field of recommender system."
    } ],
    "references" : [ {
      "title" : "Collaborative and contentbased filtering for item recommendation on social bookmarking websites",
      "author" : [ "T. Bogers", "A Van den Bosch" ],
      "venue" : "Submitted to CIKM,",
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 2009
    }, {
      "title" : "Unifying collaborative and contentbased filtering",
      "author" : [ "J. Basilico", "T Hofmann" ],
      "venue" : "In Proceedings of the twenty-first international conference on Machine learning,",
      "citeRegEx" : "3",
      "shortCiteRegEx" : "3",
      "year" : 2004
    }, {
      "title" : "Review Article A Survey of Collaborative Filtering Techniques",
      "author" : [ "X. Su", "Khoshgoftaar", "T. M" ],
      "venue" : "Advances in Artificial Intelligence,",
      "citeRegEx" : "4",
      "shortCiteRegEx" : "4",
      "year" : 2009
    }, {
      "title" : "Transforming collaborative filtering into supervised learning",
      "author" : [ "F. Braida", "C.E. Mello", "M.B. Pasinato", "G Zimbro" ],
      "venue" : "Expert Systems with Applications,",
      "citeRegEx" : "5",
      "shortCiteRegEx" : "5",
      "year" : 2015
    }, {
      "title" : "A literature review and classification of recommender systems research”,Expert",
      "author" : [ "D.H. Park", "H.K. Kim", "I.Y. Choi", "Kim", "J. K" ],
      "venue" : "Systems with Applications,",
      "citeRegEx" : "6",
      "shortCiteRegEx" : "6",
      "year" : 2012
    }, {
      "title" : "Enhancing collaborative filtering by user interest expansion via personalized ranking”, Systems, Man, and Cybernetics, Part B: Cybernetics",
      "author" : [ "Q. Liu", "E. Chen", "H. Xiong", "C.H. Ding", "J Chen" ],
      "venue" : "IEEE Transactions on,",
      "citeRegEx" : "7",
      "shortCiteRegEx" : "7",
      "year" : 2012
    }, {
      "title" : "Coverage, redundancy and size-awareness in genre diversity for recommender systems",
      "author" : [ "S. Vargas", "L. Baltrunas", "A. Karatzoglou", "P Castells" ],
      "venue" : "In Proceedings of the 8th ACM Conference on Recommender systems (pp",
      "citeRegEx" : "8",
      "shortCiteRegEx" : "8",
      "year" : 2014
    }, {
      "title" : "Applying associative retrieval techniques to alleviate the sparsity problem in collaborative filtering",
      "author" : [ "Z. Huang", "H. Chen", "D Zeng" ],
      "venue" : "ACM Transactions on Information Systems (TOIS),",
      "citeRegEx" : "9",
      "shortCiteRegEx" : "9",
      "year" : 2004
    }, {
      "title" : "Discovering latent factors from movies genres for enhanced recommendation",
      "author" : [ "Manzato", "M. G" ],
      "venue" : "In Proceedings of the sixth ACM conference on Recommender systems (pp",
      "citeRegEx" : "10",
      "shortCiteRegEx" : "10",
      "year" : 2012
    }, {
      "title" : "Category-based filtering and user stereotype cases to reduce the latency problem in recommender systems”, In Advances in Case-Based Reasoning (pp. 395-405)",
      "author" : [ "M. Sollenborn", "P Funk" ],
      "venue" : null,
      "citeRegEx" : "11",
      "shortCiteRegEx" : "11",
      "year" : 2002
    }, {
      "title" : "Implementation of category based recommendation module of SEP architecture using PBTA",
      "author" : [ "Tilwani", "Tiwari" ],
      "venue" : "International Journal of Advanced Research in Computer Science and Software Engineering,",
      "citeRegEx" : "12",
      "shortCiteRegEx" : "12",
      "year" : 2013
    }, {
      "title" : "A movie recommendation algorithm based on genre correlations",
      "author" : [ "S.M. Choi", "S.K. Ko", "Han", "Y. S" ],
      "venue" : "Expert Systems with Applications,",
      "citeRegEx" : "13",
      "shortCiteRegEx" : "13",
      "year" : 2012
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "Among the widely proposed recommendation techniques, content-based filtering [2] [3] and collaborative filtering [4] [5] have been the most famous one in the literature [6].",
      "startOffset" : 77,
      "endOffset" : 80
    }, {
      "referenceID" : 1,
      "context" : "Among the widely proposed recommendation techniques, content-based filtering [2] [3] and collaborative filtering [4] [5] have been the most famous one in the literature [6].",
      "startOffset" : 81,
      "endOffset" : 84
    }, {
      "referenceID" : 2,
      "context" : "Among the widely proposed recommendation techniques, content-based filtering [2] [3] and collaborative filtering [4] [5] have been the most famous one in the literature [6].",
      "startOffset" : 113,
      "endOffset" : 116
    }, {
      "referenceID" : 3,
      "context" : "Among the widely proposed recommendation techniques, content-based filtering [2] [3] and collaborative filtering [4] [5] have been the most famous one in the literature [6].",
      "startOffset" : 117,
      "endOffset" : 120
    }, {
      "referenceID" : 4,
      "context" : "Among the widely proposed recommendation techniques, content-based filtering [2] [3] and collaborative filtering [4] [5] have been the most famous one in the literature [6].",
      "startOffset" : 169,
      "endOffset" : 172
    }, {
      "referenceID" : 5,
      "context" : "Between them, collaborative filtering is more widely used and therefore attracts more interest from researchers [7][8].",
      "startOffset" : 112,
      "endOffset" : 115
    }, {
      "referenceID" : 6,
      "context" : "Between them, collaborative filtering is more widely used and therefore attracts more interest from researchers [7][8].",
      "startOffset" : 115,
      "endOffset" : 118
    }, {
      "referenceID" : 7,
      "context" : "Recently, some approaches considering factors outside users ratings have been proposed in the literature [9].",
      "startOffset" : 105,
      "endOffset" : 108
    }, {
      "referenceID" : 8,
      "context" : "One study proposed a movie recommender system that enhances the accuracy and overcomes the traditional recommendation by factorizing the user-genre matrix instead of the user-item matrix [10].",
      "startOffset" : 187,
      "endOffset" : 191
    }, {
      "referenceID" : 9,
      "context" : "In [11] content-based filtering utilizing user categorybased filtering was proposed to overcome one of the major issues of recommender systems termed as item cold start.",
      "startOffset" : 3,
      "endOffset" : 7
    }, {
      "referenceID" : 10,
      "context" : "Another example of category-based recommendation is proposed in [12], where authors presented a framework called SEP for overcoming recommender system problems such as cold start and sparsity.",
      "startOffset" : 64,
      "endOffset" : 68
    }, {
      "referenceID" : 11,
      "context" : "The authors in [13] proposed a recommender system approach that uses genre information to address not only the coverage of the recommender system algorithms but also the redundancy.",
      "startOffset" : 15,
      "endOffset" : 19
    } ],
    "year" : 2016,
    "abstractText" : "Movie ratings play an important role both in determining the likelihood of a potential viewer to watch the movie and in reflecting the current viewer satisfaction with the movie. They are available in several sources like the television guide, best-selling reference books, newspaper columns, and television programs. Furthermore, movie ratings are crucial for recommendation engines that track the behavior of all users and utilize the information to suggest items they might like. Movie ratings in most cases, thus, provide information that might be more important than movie feature-based data. It is intuitively appealing that information about the viewing preferences in movie genres is sufficient for predicting a genre of an unlabeled movie. In order to predict movie genres, we treat ratings as a feature vector, apply the Bernoulli event model to estimate the likelihood of a movies given genre, and evaluate the posterior probability of the genre of a given movie using the Bayes rule. The goal of the proposed technique is to efficiently use the movie ratings for the task of predicting movie genres. In our approach we attempted to answer the question: ”Given the set of users who watched a movie, is it possible to predict the genre of a movie based on its ratings?” Our simulation results with MovieLens 100k data demonstrated the efficiency and accuracy of our proposed technique, achieving 59% prediction rate for exact prediction and 69% when including correlated genres.",
    "creator" : "LaTeX with hyperref package"
  }
}