{
  "name" : "1604.03266.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Online Learning of Portfolio Ensembles with Sector Exposure Regularization",
    "authors" : [ "Guy Uziel" ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : null,
      "text" : "ar X\niv :1\n60 4.\n03 26\n6v 1\n[ cs\n.L G"
    }, {
      "heading" : "1 Introduction",
      "text" : "Online portfolio selection [Cover, 1991] has become one of the focal points in online learning research. So far, papers along this line have mainly considered cumulative wealth or return as the primary quantity to be optimized. However, the quality of any investment should rather be quantified using both return and risk, which often is measured by the variance of the return.1 One of the major open challenges in online portfolio selection is the incorporation of effective mechanisms to dynamically control risk [Li and Hoi, 2014]. Within a regret minimization framework, like the one we consider here, this challenge is highlighted by the impossibility of achieving sub-linear regret in the adversarial setting with respect to risk adjusted measures such as the Sharpe Ratio [Even-Dar et al., 2006]. This theoretical limitation is perhaps the main reason for the scarcity of papers studying risk control in the context of online portfolio selection.2\nFollowing Johnson and Banerjee [2015] and motivated by the classic idea of diversifying risk factors and in particular, industry sectors (e.g., Grinold et al. [1989],\n1Many other notions of risk have been considered as well; see, e.g. Harlow [1991]. 2This lack of risk-aware results in online (adversarial) portfolio learning stands in stark contrast to the situation in classic finance where the research into risk is vast within the context of portfolio allocation under distributional assumptions.\nCavaglia et al. [2000]), in this paper we present a portfolio selection ensemble learning procedure that applies any set of portfolio selection algorithms, and controls risk using sector regularization. The procedure invests in the stock market by dynamically allocating capital among the base algorithms, which provide their investment recommendations. These dynamic allocations are online learned using Newton steps, and risk is controlled using an ℓ∞/ℓ1 regularization term that penalizes over-exposed portfolios, where exposure is defined and quantified using a prior grouping of the stocks into “industry sectors.” While this regularization elicits diversification among groups, it also encourages a focus on the best convex combination of base algorithms within groups. The set of base trading algorithms can be arbitrary, but a typical application might be to activate within groups several independent copies of the same base algorithm instantiated with different values of its hyper-parameters, thus solving or alleviating the challenge of hyper-parameter tuning.\nWe prove a logarithmic regret bound for our procedure with respect to the bestin-hindsight ensemble of the base algorithms. We also show preliminary, promising numerical examples over a commonly used and challenging benchmark dataset. These results demonstrate impressive improvements in risk-adjusted return (Sharpe ratio) relative to direct applications of the base algorithms, and compared to a previous attempt to utilize group diversification."
    }, {
      "heading" : "1.1 Online Portfolio Selection",
      "text" : "In Cover’s classic portfolio selection setting [Cover, 1991] (see also Borodin and El-Yaniv [1998], Chapt. 14), one assumes a market of n stocks. We consider an online game played through T days. On each day t the market is represented by a market vector Xt of relative prices, Xt , (xt1, x t 2, ..., x t n), where for each i = 1, . . . , n, x t i ≥ 0 is the relative price of stock i, defined to be the ratio of its closing price on day t relative to its closing price on day t − 1. We denote by X , X1, . . . ,XT the sequence of T market vectors for the entire game. A wealth allocation vector or portfolio for day t is bt , (bt1, b t 2, . . . , b t n), where b t i ≥ 0 is the wealth allocation for stock i. We require that the portfolio satisfy ∑m\ni=1 b t i = 1. Thus, bt specifies the online player’s\nwealth allocation for each of the n stocks on day t, and bti is the fraction of total current wealth invested in stock i on that day. We denote by B , b1, . . . ,bT the sequence of T portfolios for the entire game. At the start of each trading day t, the player chooses a portfolio bt. Thus, by the end of day t, the player’s wealth is multiplied by 〈bt,Xt〉 = ∑n i=1 b t ix t i , and assuming initial wealth of $1, the player’s cumulative wealth by the end of the game is therefore\nRT (B,X) ,\nT ∏\nt=1\n〈bt,Xt〉 . (1)\nIn the setting above, it is common to consider the logarithmic cumulative wealth, logRT (B,X), which can be expressed as a summation of the logarithmic daily wealth increases, log(〈bt,Xt〉).\nThe basic portfolio selection problem as defined above abstracts away various practical considerations, such as commissions, slippage, and more generally, market im-\npact, which are crucial for realistic implementations. While we do ignore these elements here as well, we focus in the present work on risk, and adapt the traditional definition of risk as the variance of return. Let RA be the (annualized) return of an investment algorithm A and let σA be the (annualized) standard deviation of A’s return. Let Rf be the risk-free (annualized) interest rate. Then the (annualized) Sharpe ratio [Sharpe, 1966] of A is\nS = RA −Rf\nσA .\nFor comparative purposes it is common to ignore the risk-free return Rf as we do here. The Sharpe ratio is thus a measure of risk-adjusted return, which captures the expected differential return per unit of risk.\nIn the online (worst-case) approach to portfolio learning the goal is to online generate a sequence {bt} of portfolios that compete with the best-in-hindsight fixed portfolio, denoted b∗. Denoting the round t loss of portfolio b by ft(b) (in our case, ft(b) = − log(〈bt,Xt〉)), we define the regret of sequence {bt} as\nRegret , T ∑\nt=1\n(ft(bt)− ft(b∗)) .\nIn this paper we are mainly concerned with portfolio ensembles, where the allocationbt is over trading algorithms and b∗ represents the optimal-in-hindsight fixed allocation."
    }, {
      "heading" : "1.2 Risk Reduction by Sector Regularization",
      "text" : "Diversification is the process of allocating wealth among investment choices such that exposure to certain “risk factors” is controlled or reduced. Markowitz’s modern portfolio theory (MPT) put diversification on front stage by showing a systematic diversification procedure for static portfolios using correlation analysis [Markowitz, 1952]. Understanding financial risk factors, and their interrelationship with stock returns, has been a longstanding challenge: one of the profound insights has been that risk factors can be manifested in many ways, but not all factors can be diversified [Sharpe, 1964]. Among the well-known diversifiable factors are those which are country specific and industry related [Grinold et al., 1989]. Several decades ago diversification across countries provided greater risk reduction than industry-wise diversification [Solnik, 1995], but with increasing economic globalization, industry sector diversification has been found to be of increasing importance to active portfolio management [Cavaglia et al., 2000].\nThe procedure proposed in this paper can, in principle, handle many types of diversification expressed in terms of predefined groupings of the stocks. While computation of effective groupings with sufficient predictive power is an interesting topic in and of itself, here we treat the grouping itself as available prior knowledge. Thus, for concrete validation of the proposed procedure, we focus on industry sector diversification, and our numerical examples make use of the global industry classification standard (GICS) – an industry taxonomy developed in 1999 by MSCI and Standard & Poor (S&P) for use by the global financial community.3\n3The GICS structure consists of 10 sectors, 24 industry groups, 67 industries and 156 sub-industries."
    }, {
      "heading" : "1.3 Related Work and Contributions",
      "text" : "We focus on online learning of sequential portfolios, and the main contextual anchor of the present work is the line of research pioneered by Cover [Cover, 1991; Cover and Ordentlich, 1996; Ordentlich and Cover, 1996], where the vanilla online portfolio selection problem was introduced and initially studied. Within this line the goal is to devise portfolio selection strategies whose cumulative wealth achieves, under adversarial inputs, sublinear regret (aka “universality”) with respect to an optimal inhindsight “constant rebalanced portfolio” (CRP) strategy. The regret lower bound of Ω(logT ) [Ordentlich and Cover, 1996] for a T -round portfolio game was originally matched by Cover’s celebrated “Universal Portfolios” algorithm [Cover, 1991], and then rematched by various similar, or other “follow the leader” strategies (see, e.g.,Helmbold et al. [1998], Blum and Kalai [1999], Agarwal et al. [2006]).\nOne of the approaches for regret minimization in the online portfolio setting is online convex optimization, where in each round t we consider a loss function, ft(bt) = − log(〈bt,Xt〉), and exploit its convexity to ensure O( √ T ) regret from the best-inhindsight CRP portfolio. Agarwal et al. [2006] showed that by using such a loss function that is exp-concave, it is possible to guarantee an improved regret bound of O(log T ). This result was further extended by Das and Banerjee [2011], who proposed MAons to “ensemble learning,” whereby the portfolio learned is over algorithms rather than the stocks themselves. This resulted in O(log T ) regret from the best-in-hindsight convex combination of algorithms.\nTo the best of our knowledge, there are only a few studies of risk control in the context of online portfolio learning with bounded regret. As mentioned earlier, Even-Dar et al. [2006] considered a more general expert setting and showed that one cannot achieve sub-linear regret with respect to the risk-adjusted return (Sharpe ratio). As a remedy, that paper considered optimizing global return in conjunction with a locally computed Sharpe ratio (defined over a recent historical window). Within a stochastic bandit setting, Shen et al. [2015] considered tracking the best expert with respect to the Sharpe ratio. The closest work to ours is that of Johnson and Banerjee [2015], who introduced the following group norm to encourage diversification. Consider a grouping G = (g1, ..., gm) of the integers [n] , {1, . . . , n}, where gi ⊆ [n], |gi| = ni, and the groups gi may overlap. For a vector X ∈ Rn, define its ℓ∞/ℓ1 group norm\nLG(∞,1)(X) = ||(||X1||1, . . . , ||Xm||1)||∞, (2)\nwhere Xi ∈ Rn equals X, with all coordinates in [n] \\ gi zeroed. This hierarchical group norm, which can be viewed as a kind of inverse to the group norm used in group Lasso [Yuan and Lin, 2006], encourages non-sparsity in its outer norm. Johnson and Banerjee [2015] presented an algorithm, called ORSAD, which uses this norm to encourage diversification in portfolio learning, thus leading to a reduction in several risk parameters, including a variant of the Sharpe ratio. The ORSAD algorithm consists of minimization steps of the form\narg min LG\n(∞,1) (bt)≤K\n−η log(〈bt,Xt〉) + 1\n2 ||bt − bt−1||22,\nwhere K is a hyper-parameter. They also proved that their algorithm can guarantee O( √ T ) regret w.r.t. the best fixed portfolio in hindsight.\nAlthough our procedure relies on the same ℓ∞/ℓ1 group norm to encourage diversification, our algorithm differs from that of Johnson and Banerjee in two ways: first, rather than generating portfolios on the stock themselves, we generate a weighted ensemble over investment algorithms. Second, our learning algorithm exploits the exp-concavity of our loss function, allowing the use of online Newton steps as in [Agarwal et al., 2006] to guarantee O(log T ) regret w.r.t. the best fixed ensemble in hindsight. A direct application of our procedure over the stocks themselves yields exponential improvement in regret relative to the result of Johnson and Banerjee [2015]. Also worth mentioning is that our implementation utilizes a fixed grouping of the stocks given by the standard GICS industry taxonomy, whereas Johnson and Banerjee [2015] employ a correlation-based heuristic to group the stocks on the fly. Our numerical examples in Section 3 include a direct comparison with the method of Johnson and Banerjee [2015], showing an overwhelming advantage to our method (see, e.g., Figure 1).\nAlgorithm 1 Ensemble Procedure (EREP) 1: Input: d trading algorithms,k groups, T, ǫ, η, λ > 0. 2: Initialize:P1, w1 = ( 1kd , . . . , 1 kd ), A0 = ǫIkd\n3: for t = 1 to T do 4: Play wt and suffer loss gt(wt) + λLG(∞,1)(w) 5: Receive portfolios Pt+1 of base algorithms 6: Update: At = At−1 +∇gt(wt)T∇gt(wt) and\nwt+1 = arg min w∈B\n{ 〈∇gt(wt),w −wt〉\n+ λLG(∞,1)(w) + ηDAt(w||wt))}\n7: end for"
    }, {
      "heading" : "2 Exposure Regularized Ensemble Procedure",
      "text" : "We consider a given grouping G = (g1, ..., gk) of the integers [n] , {1, . . . , n}, where gi ⊆ [n], |gi| = ni. Each group gi is called a sector. We assume that the sectors represent a meaningful structure of the n stocks and are not concerned here with how it is computed.\nOur exposure regularized ensemble procedure (henceforth, EREP) is constructed over a set of d base-algorithms A = A1, . . . , Ad. For each 1 ≤ i ≤ d, we create for algorithm Ai, k sub-algorithms Ai,j , j = 1, . . . , k, such that Ai,j operates only over sector j. Therefore, EREP effectively operates over kd sub-algorithms. In each round t, EREP invests its current wealth in the sub-algorithms according to an allocation vector wt, which resides in the probability simplex. The actual allocation of wealth to individual stocks is calculated using wt, by aggregating the proposed portfolios by each of the sub-algorithms in a straightforward manner.\nEREP requires the following definitions and notation. Let A ∈ Rn×n be any positive-definite matrix. For x,w ∈ Rn, the Bregman divergence generated byFA(w) , 1 2w TAw is\nDA(w||x) , 1\n2 ||w − x||2A =\n1 2 (w − x)TA(w − x).\nWe denote by In the unit matrix of order n. For a function f : Rn → R, we denote by ∇f(w) its gradient (if it is differentiable) and by f ′(w) its subgradient.\nWe now explain the pseudo-code of EREP listed in Algorithm 1. In each round t, EREP first plays (rebalances its portfolio) according to already computed allocation vector wt (line 4). In response, the adversary selects a market vector (still line 4), which determines the following loss gt(wt):\ngt(w) , − log(〈Xt,Ptw〉), (3) where Xt is the market vector selected by the adversary for round t. EREP then receives Pt ∈ Rn×kd, the revised portfolios of its sub-algorithms (line 5). In line 6, EREP updates its allocation vector. In order to exploit the exp-concavity of the loss function, EREP utilizes the curvature of the loss function, as embedded in the matrix At, and then uses the Bregman divergence corresponding to At so as to optimize its allocation vector based on second order information (Newton step). The regularization term, LG(∞,1)(w), encourages the simultaneous tracking of the most profitable sub-algorithm combination in each sector as well as diversification over sectors, as discussed in Sections 1.2 and 1.3."
    }, {
      "heading" : "2.1 Regret Analysis",
      "text" : "In this section we analyze EREP and prove a logarithmic regret worst case bound. Let α be a positive real. A convex function f : Rn → R is α-exp-concave over the convex domain B ⊂ Rn if the function exp(-αf(x)) is concave. It is well known that the class of exp-concave functions strictly contains the class of strongly-convex functions. For example, the loss function typically used in online portfolio selection, ft(b) = − log(〈b,Xt〉), is exp-concave but not strongly-convex.\nThe following two (known) basic lemmas concerning exp-concavity will be used in the proofs of Lemma 3 and Theorems 1 that follow.\nLemma 1. [Hazan et al., 2007] Let f be an α-exp-concave over B ⊂ Rn with diameter D, such that ∀x ∈ B , ||∇f(x)||2 ≤ G. Then, for η ≤ 12 min{α, 14GD}, and for every x,y ∈ B,\nf(y) ≥ f(x) + 〈∇f(x),y − x〉 + η\n2 (y − x)T\n( ∇f(x)∇f(x)T ) (y − x).\nLemma 2. [Hazan et al., 2007] Let ft : Rn → R be α-exp-concave, and let At be as in Algorithm 1. Then, for η = 12 min{α, 14GD} and ǫ0 = 1η2D2 ,\nT ∑\nt=1\n||∇ft(wt)||2A−1t ≤ n logT.\nWe consider a standard online convex optimization game [Zinkevich, 2003] where in each round t the online player selects a point wt in a convex set B; then a convex payoff function ft is revealed, and the player suffers loss ft(wt). In an adversarial setting, where ft is selected in the worst possible way, it is impossible to guarantee absolute online performance. Instead, the objective of the online player is to achieve sublinear regret relative to the best choice in hindsight, w∗ , argminw∈B ∑\nt ft(w), where regret is\nRegret , T ∑\nt=1\n(ft(wt)− ft(w∗)) .\nThe mirror descent algorithm [Nemirovsky and Yudin, 1985; Beck and Teboulle, 2003] for online convex optimization was extended by Duchi et al. [2010] as follows. Instead of solving in each round\nwt+1 = arg min w∈K\n{η 〈∇ft(wt),w −wt〉+D(w||wt))},\nwhere D(x||y) is the Bregman divergence generated by some strongly convex function ψ, they proposed to solve\nwt+1 = arg min w∈K\n{η 〈∇ft(wt),w−wt〉+ ηr(w)\n+D(w||wt))},\nwhere r(·) is some convex function which is not necessarily smooth. They proved that their revised method guarantees O( √ T ) regret relative to the best choice in hindsight whenever f is convex. Moreover, a sharper O(log(T )) regret bound was shown for strongly convex f . This extension, called composite objective mirror descent (COMID), opened the door to applications in many fields and, in particular, to the possibility of using an ℓ∞/ℓ1 group norm as we do here. Our analysis of EREP thus boils down to extending the COMID framework for exp-concave functions.\nWe state without proof the following results (Lemma 3 and Theorem 1). Full proofs of these statements will be presented in the long version of this paper.\nLemma 3. Let ft be α-exp-concave over B ⊂ Rn with diameter D, such that ∀w ∈ B , ||∇f(w)||2 ≤ G. If wt is the prediction of Algorithm 1 in round t, then, for η = 1 2 min{α, 14GD} and for any w∗ ∈ B,\n1 η [ft(wt)− ft(w∗) + r(wt+1)− r(w∗)] ≤\nDAt−1(w∗||wt)−DAt(w∗||wt+1) + 1\n2η2 ||∇ft(wt)||2A−1t .\nTheorem 1. Let ft be α-exp-concave over K ⊂ Rn, η = 12 min{α, 14GD} and let ǫ0 = 1 η2D2\n. If (w1,w2, . . . ,wT ) are the predictions of Algorithm 1, then for any fixed point w∗ ∈ B,\nT ∑\nt=1\n(ft(wt) + r(wt) − ft(w∗)− r(w∗)) = O(log T ).\nCorollary 1. For Algorithm 1, for appropriate4 ǫ, η > 0, and every λ ≥ 0, for any fixed point w∗ ∈ B, it holds that\nT ∑\nt=1\ngt(wt) + λL G (∞,1)(w) − gt(w∗)− λLG(∞,1)(w∗)\n= O(log T )."
    }, {
      "heading" : "3 Numerical Examples",
      "text" : "In this section we present a preliminary empirical study examining and analyzing the performance of EREP on the well-known SP500 benchmark dataset [Borodin et al., 2000]. This challenging dataset consists of 25 stocks over a period of 5 years, from 1998 to 2003, which includes the dot-com crash. Qualitatively similar results to those presented here will be presented for other datasets in the extended version of this paper.\nThe stocks in the SP500 dataset were categorized into the following 4 sectors according to the global industry classification standard (see, e.g., Yahoo Finance): Technology, Finance, Healthcare, and Services. Fixing this sector grouping throughout our study we examine, in our first experiment, how well EREP controls and operates sets of base algorithms. We selected the following set of base algorithms, all of which are implemented in the Li et al. OLPS simulation library [Li et al., 2015]:\n• Exponentiated Gradient (EG) [Helmbold et al., 1998]: this classic algorithm is among the early universal algorithms. EG is typically not a strong contender in empirical studies and we include it as a control point, to verify that our strategy avoids using its portfolios.\n• Anticor [Borodin et al., 2004]: one of the first algorithms designed to aggressively exploit mean-reversion via (anti) correlation analysis.\n• Online Moving Average Reversion (OLMAR) [Li and Hoi, 2012]: designed to exploit mean-reversion based on moving average predictions. OLMAR is known to be a strong performer in many benchmark datasets.\nWe examined two different settings for the base algorithms. In the first setting (called “Mixed”), the set of base algorithms consists of the three algorithms: EG , Anticor and OLMAR.5 In the second setting (called “Olmar only”), we took three instances of OLMAR applied with the following values of its window size (a critical hyperparameter): 10, 15, 20.\nThe critical hyper-parameter of EREP is λ, which controls the ℓ∞/ℓ1 regularization intensity. Preliminary empirical measurements of the dynamic range of the average maximal sector weight as a function of λ showed that λ = 0.1 roughly corresponds to the median of this range. Therefore, to obtain a rough impression we initially applied\n4In our applications we used the same parameters that were used in Agarwal et al. [2006]. In general, these parameters can be calibrated according to market variability; see Agarwal et al. [2006].\n5All hyper-parameters of the base algorithms were set to the recommended default parameters in the OLPS simulator. EG (with η = 0.05) , Anticor (with w = 20) and OLMAR (with w = 20, ǫ = 10).\nEREP with this setting. In a more elaborate experiment we optimized λ using a standard walk-forward procedure [Pardo, 1992]; see details below.\nTable 1 summarizes the Sharpe ratio results obtained for these runs of EREP compared to various benchmark algorithms. Consider first the Mixed setting (first row of the table). Here we see that EREP improves the Sharpe ratio of the best algorithm by almost 20%. In the Olmar only setting, the Sharpe ratio improvement relative to the best Olmar instance is by over 40%. Similar improvements can be seen with respect to the MAons ensemble procedure of Das and Banerjee [2011], applied here on the same sets of base algorithms. Turning now to the ORSAD algorithm of Johnson and Banerjee [2015], which uses the same ℓ∞/ℓ1 regularization (but with a different learning algorithm applied over the stocks), we see an improvement of over 100% in the Sharpe ratio. Furthermore, in Figure 1 we see the cumulative return curves of both EREP and ORSAD for the entire 5-year period, showing that the return itself has also improved by hundreds of percents.\nWhile these results clearly provide a compelling proof of concept for the effective-\nness of EREP, we chose λ = 0.1 in hindsight, which affects both the return and the Sharpe ratio of the algorithm. Is it possible to calibrate λ online? To this end we employed a standard walk-forward procedure whereby λ was sequentially optimized over a sliding window of size w periods so as to improve the Sharpe ratio. Although this routine eliminates the need to choose λ, it introduces w as a new hyper-parameter. Figure 2 depicts the sensitivity of the overall Sharpe ratio with respect to the window size w ∈ [10, 300]. It is evident that this procedure is not sensitive to choices of w in this range. EREP’s improvement of the Sharpe ratio for the two base-algorithms settings is shown in Table 1 (under λWF ). The cumulative return of EREP with sequentially calibrated λ appears in Figure 1."
    }, {
      "heading" : "4 Conclusions",
      "text" : "In this paper we show how to effectively use the ℓ∞/ℓ1 regularization to improve riskadjusted return performance. While the original work introducing this norm [Johnson and Banerjee, 2015] considered portfolios on the stocks themselves, we propose to incorporate this structured norm within a Newton style optimization and apply the learning algorithm over trading strategies based on a known partition of the stocks into industry sectors. Along the way, we also online optimize the choice of hyper-parameters and/or the choice of underlying trading algorithms. Our preliminary empirical study indicates that the proposed procedure can achieve a substantial improvement in the Sharpe ratio relative to the base algorithms themselves, relative to their ensemble using the technique of Das and Banerjee [2011]. Moreover, it substantially improves the original method of Johnson and Banerjee [2015]. Further empirical evidence with qualitatively similar\nconclusions has been established and will be reported in the long version of this paper. Johnson and Banerjee [2015] attempted to dynamically compute sector groupings based on correlations. This idea is very attractive in the absence of prior knowledge or in fast changing markets, and can be further extended to explore hierarchical structures in the stock market as discussed, e.g., in Mantegna [1999]. However, the regret guarantee in Johnson and Banerjee [2015] cannot hold in its current form using a dynamically changing grouping of the stocks. It would be very interesting to extend their learning algorithm or ours to capture dynamically changing groupings. While the proposed procedure allows for improved Sharpe-ratios, it is still a “long-only” strategy, which does not utilize short selling. While attractive in certain regulated settings like mutual funds, it cannot achieve market neutrality. It would be very interesting to extend our technique so as to be market neutral. As a final caveat, we must emphasize that we have focused on an idealized “frictionless” setting that excludes various elements such as commissions, slippage and market impact. While this setting is a reasonable starting point for considering risk reduction,these elements must be considered in real-life applications."
    } ],
    "references" : [ {
      "title" : "Algorithms for portfolio management based on the newton method",
      "author" : [ "A. Agarwal", "E. Hazan", "S. Kale", "R.E. Schapire" ],
      "venue" : "Proceedings of the 23rd International Conference on Machine Learning, pages 9–16. ACM",
      "citeRegEx" : "Agarwal et al.. 2006",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Mirror descent and nonlinear projected subgradient methods for convex optimization",
      "author" : [ "A. Beck", "M. Teboulle" ],
      "venue" : "Operations Research Letters, 31(3):167–175",
      "citeRegEx" : "Beck and Teboulle. 2003",
      "shortCiteRegEx" : null,
      "year" : 2003
    }, {
      "title" : "Universal portfolios with and without transaction costs",
      "author" : [ "A. Blum", "A. Kalai" ],
      "venue" : "Machine Learning, 35(3):193–205",
      "citeRegEx" : "Blum and Kalai. 1999",
      "shortCiteRegEx" : null,
      "year" : 1999
    }, {
      "title" : "Online Computation and Competitive Analysis",
      "author" : [ "A. Borodin", "R. El-Yaniv" ],
      "venue" : "Cambridge University Press",
      "citeRegEx" : "Borodin and El.Yaniv. 1998",
      "shortCiteRegEx" : null,
      "year" : 1998
    }, {
      "title" : "In LATIN 2000: Theoretical Informatics",
      "author" : [ "A. Borodin", "R. El-Yaniv", "V. Gogan. On the tompetitive theory", "practice of portfolio selection" ],
      "venue" : "pages 173–196.",
      "citeRegEx" : "Borodin et al.. 2000",
      "shortCiteRegEx" : null,
      "year" : 2000
    }, {
      "title" : "Can we learn to beat the best stock? Journal of Artificial Intelligence Research",
      "author" : [ "A. Borodin", "R. El-Yaniv", "V. Gogan" ],
      "venue" : "pages 579–594",
      "citeRegEx" : "Borodin et al.. 2004",
      "shortCiteRegEx" : null,
      "year" : 2004
    }, {
      "title" : "The increasing importance of industry factors",
      "author" : [ "S. Cavaglia", "C. Brightman", "M. Aked" ],
      "venue" : "Financial Analysts Journal, 56(5):41–54",
      "citeRegEx" : "Cavaglia et al.. 2000",
      "shortCiteRegEx" : null,
      "year" : 2000
    }, {
      "title" : "Universal portfolios with side information",
      "author" : [ "T.M. Cover", "E. Ordentlich" ],
      "venue" : "IEEE Transactions on Information Theory, 42(2):348–363",
      "citeRegEx" : "Cover and Ordentlich. 1996",
      "shortCiteRegEx" : null,
      "year" : 1996
    }, {
      "title" : "Universal portfolios",
      "author" : [ "T.M. Cover" ],
      "venue" : "Mathematical Finance, 1(1):1–29",
      "citeRegEx" : "Cover. 1991",
      "shortCiteRegEx" : null,
      "year" : 1991
    }, {
      "title" : "Meta optimization and its application to portfolio selection",
      "author" : [ "P. Das", "A. Banerjee" ],
      "venue" : "Proceedings of the 17th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, pages 1163–1171. ACM",
      "citeRegEx" : "Das and Banerjee. 2011",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Y",
      "author" : [ "J.C. Duchi", "S. Shalev-Shwartz" ],
      "venue" : "Singer, and A .Tewari. Composite objective mirror descent. In COLT, pages 14–26",
      "citeRegEx" : "Duchi et al.. 2010",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "Risk-sensitive online learning",
      "author" : [ "E. Even-Dar", "M. Kearns", "J. Wortman" ],
      "venue" : "Algorithmic Learning Theory, pages 199–213. Springer",
      "citeRegEx" : "Even.Dar et al.. 2006",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Global factors: fact or fiction? The Journal of Portfolio Management",
      "author" : [ "R.C. Grinold", "A. Rudd", "D. Stefek" ],
      "venue" : "16(1):79–88",
      "citeRegEx" : "Grinold et al.. 1989",
      "shortCiteRegEx" : null,
      "year" : 1989
    }, {
      "title" : "Asset allocation in a downside-risk framework",
      "author" : [ "W.V. Harlow" ],
      "venue" : "Financial Analysts Journal, 47(5):28–40",
      "citeRegEx" : "Harlow. 1991",
      "shortCiteRegEx" : null,
      "year" : 1991
    }, {
      "title" : "Logarithmic regret algorithms for online convex optimization",
      "author" : [ "E. Hazan", "A. Agarwal", "S. Kale" ],
      "venue" : "Machine Learning, 69(2-3):169–192",
      "citeRegEx" : "Hazan et al.. 2007",
      "shortCiteRegEx" : null,
      "year" : 2007
    }, {
      "title" : "On-line portfolio selection using multiplicative updates",
      "author" : [ "D.P. Helmbold", "R.E. Schapire", "Y. Singer", "M.K. Warmuth" ],
      "venue" : "Mathematical Finance, 8(4):325–347",
      "citeRegEx" : "Helmbold et al.. 1998",
      "shortCiteRegEx" : null,
      "year" : 1998
    }, {
      "title" : "Banerjee",
      "author" : [ "A N. Johnson" ],
      "venue" : "Online resource allocation with structured diversification.",
      "citeRegEx" : "Johnson and Banerjee. 2015",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "On-line portfolio selection with moving average reversion",
      "author" : [ "B. Li", "S.C.H. Hoi" ],
      "venue" : "Proceedings of the 29th International Conference on Machine Learning (ICML-12), pages 273–280",
      "citeRegEx" : "Li and Hoi. 2012",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Online portfolio selection: A survey",
      "author" : [ "B. Li", "S.C.H. Hoi" ],
      "venue" : "ACM Computing Surveys (CSUR), 46(3):35",
      "citeRegEx" : "Li and Hoi. 2014",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Olps: A toolbox for online portfolio selection",
      "author" : [ "B. Li", "D. Sahoo", "S.C.H. Hoi" ],
      "venue" : "Journal of Machine Learning Research (JMLR)",
      "citeRegEx" : "Li et al.. 2015",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Hierarchical structure in financial markets",
      "author" : [ "R.N. Mantegna" ],
      "venue" : "The European Physical Journal B-Condensed Matter and Complex Systems, 11(1):193– 197",
      "citeRegEx" : "Mantegna. 1999",
      "shortCiteRegEx" : null,
      "year" : 1999
    }, {
      "title" : "Portfolio selection",
      "author" : [ "H. Markowitz" ],
      "venue" : "The journal of finance, 7(1):77–91",
      "citeRegEx" : "Markowitz. 1952",
      "shortCiteRegEx" : null,
      "year" : 1952
    }, {
      "title" : "Problem complexity and method efficiency in optimization",
      "author" : [ "A.S. Nemirovsky", "D.B. Yudin" ],
      "venue" : "SIAM Review, 27(2):264–265",
      "citeRegEx" : "Nemirovsky and Yudin. 1985",
      "shortCiteRegEx" : null,
      "year" : 1985
    }, {
      "title" : "On-line portfolio selection",
      "author" : [ "E. Ordentlich", "T.M. Cover" ],
      "venue" : "Proceedings of the 9th Annual Conference on Computational Learning Theory, COLT, pages 310–313",
      "citeRegEx" : "Ordentlich and Cover. 1996",
      "shortCiteRegEx" : null,
      "year" : 1996
    }, {
      "title" : "Design",
      "author" : [ "R. Pardo" ],
      "venue" : "testing, and optimization of trading systems. John Wiley & Sons",
      "citeRegEx" : "Pardo. 1992",
      "shortCiteRegEx" : null,
      "year" : 1992
    }, {
      "title" : "Capital asset prices: A theory of market equilibrium under conditions of risk",
      "author" : [ "W.F. Sharpe" ],
      "venue" : "The Journal of Finance, 19(3):425–442",
      "citeRegEx" : "Sharpe. 1964",
      "shortCiteRegEx" : null,
      "year" : 1964
    }, {
      "title" : "Mutual fund performance",
      "author" : [ "W.F. Sharpe" ],
      "venue" : "Journal of business, pages 119–138",
      "citeRegEx" : "Sharpe. 1966",
      "shortCiteRegEx" : null,
      "year" : 1966
    }, {
      "title" : "Portfolio choices with orthogonal bandit learning",
      "author" : [ "W. Shen", "J. Wang", "Y.G. Jiang", "H. Zha" ],
      "venue" : "Proceedings of the 24th International Conference on Artificial Intelligence, pages 974–980. AAAI Press",
      "citeRegEx" : "Shen et al.. 2015",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Why not diversify internationally rather than domestically? Financial Analysts Journal",
      "author" : [ "B.H. Solnik" ],
      "venue" : "51(1):89–94",
      "citeRegEx" : "Solnik. 1995",
      "shortCiteRegEx" : null,
      "year" : 1995
    }, {
      "title" : "Model selection and estimation in regression with grouped variables",
      "author" : [ "M. Yuan", "Y. Lin" ],
      "venue" : "Journal of the Royal Statistical Society: Series B (Statistical Methodology), 68(1):49–67",
      "citeRegEx" : "Yuan and Lin. 2006",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Online convex programming and generalized infinitesimal gradient ascent",
      "author" : [ "M. Zinkevich" ],
      "venue" : "Machine Learning, Proceedings of the 20th International Conference (ICML), pages 928–936",
      "citeRegEx" : "Zinkevich. 2003",
      "shortCiteRegEx" : null,
      "year" : 2003
    } ],
    "referenceMentions" : [ {
      "referenceID" : 8,
      "context" : "Online portfolio selection [Cover, 1991] has become one of the focal points in online learning research.",
      "startOffset" : 27,
      "endOffset" : 40
    }, {
      "referenceID" : 18,
      "context" : "1 One of the major open challenges in online portfolio selection is the incorporation of effective mechanisms to dynamically control risk [Li and Hoi, 2014].",
      "startOffset" : 138,
      "endOffset" : 156
    }, {
      "referenceID" : 11,
      "context" : "Within a regret minimization framework, like the one we consider here, this challenge is highlighted by the impossibility of achieving sub-linear regret in the adversarial setting with respect to risk adjusted measures such as the Sharpe Ratio [Even-Dar et al., 2006].",
      "startOffset" : 244,
      "endOffset" : 267
    }, {
      "referenceID" : 8,
      "context" : "1 Online Portfolio Selection In Cover’s classic portfolio selection setting [Cover, 1991] (see also Borodin and El-Yaniv [1998], Chapt.",
      "startOffset" : 76,
      "endOffset" : 89
    }, {
      "referenceID" : 26,
      "context" : "Then the (annualized) Sharpe ratio [Sharpe, 1966] of A is S = RA −Rf σA .",
      "startOffset" : 35,
      "endOffset" : 49
    }, {
      "referenceID" : 21,
      "context" : "Markowitz’s modern portfolio theory (MPT) put diversification on front stage by showing a systematic diversification procedure for static portfolios using correlation analysis [Markowitz, 1952].",
      "startOffset" : 176,
      "endOffset" : 193
    }, {
      "referenceID" : 25,
      "context" : "Understanding financial risk factors, and their interrelationship with stock returns, has been a longstanding challenge: one of the profound insights has been that risk factors can be manifested in many ways, but not all factors can be diversified [Sharpe, 1964].",
      "startOffset" : 248,
      "endOffset" : 262
    }, {
      "referenceID" : 12,
      "context" : "Among the well-known diversifiable factors are those which are country specific and industry related [Grinold et al., 1989].",
      "startOffset" : 101,
      "endOffset" : 123
    }, {
      "referenceID" : 28,
      "context" : "Several decades ago diversification across countries provided greater risk reduction than industry-wise diversification [Solnik, 1995], but with increasing economic globalization, industry sector diversification has been found to be of increasing importance to active portfolio management [Cavaglia et al.",
      "startOffset" : 120,
      "endOffset" : 134
    }, {
      "referenceID" : 6,
      "context" : "Several decades ago diversification across countries provided greater risk reduction than industry-wise diversification [Solnik, 1995], but with increasing economic globalization, industry sector diversification has been found to be of increasing importance to active portfolio management [Cavaglia et al., 2000].",
      "startOffset" : 289,
      "endOffset" : 312
    }, {
      "referenceID" : 8,
      "context" : "We focus on online learning of sequential portfolios, and the main contextual anchor of the present work is the line of research pioneered by Cover [Cover, 1991; Cover and Ordentlich, 1996; Ordentlich and Cover, 1996], where the vanilla online portfolio selection problem was introduced and initially studied.",
      "startOffset" : 148,
      "endOffset" : 217
    }, {
      "referenceID" : 7,
      "context" : "We focus on online learning of sequential portfolios, and the main contextual anchor of the present work is the line of research pioneered by Cover [Cover, 1991; Cover and Ordentlich, 1996; Ordentlich and Cover, 1996], where the vanilla online portfolio selection problem was introduced and initially studied.",
      "startOffset" : 148,
      "endOffset" : 217
    }, {
      "referenceID" : 23,
      "context" : "We focus on online learning of sequential portfolios, and the main contextual anchor of the present work is the line of research pioneered by Cover [Cover, 1991; Cover and Ordentlich, 1996; Ordentlich and Cover, 1996], where the vanilla online portfolio selection problem was introduced and initially studied.",
      "startOffset" : 148,
      "endOffset" : 217
    }, {
      "referenceID" : 23,
      "context" : "The regret lower bound of Ω(logT ) [Ordentlich and Cover, 1996] for a T -round portfolio game was originally matched by Cover’s celebrated “Universal Portfolios” algorithm [Cover, 1991], and then rematched by various similar, or other “follow the leader” strategies (see, e.",
      "startOffset" : 35,
      "endOffset" : 63
    }, {
      "referenceID" : 8,
      "context" : "The regret lower bound of Ω(logT ) [Ordentlich and Cover, 1996] for a T -round portfolio game was originally matched by Cover’s celebrated “Universal Portfolios” algorithm [Cover, 1991], and then rematched by various similar, or other “follow the leader” strategies (see, e.",
      "startOffset" : 172,
      "endOffset" : 185
    }, {
      "referenceID" : 29,
      "context" : "This hierarchical group norm, which can be viewed as a kind of inverse to the group norm used in group Lasso [Yuan and Lin, 2006], encourages non-sparsity in its outer norm.",
      "startOffset" : 109,
      "endOffset" : 129
    }, {
      "referenceID" : 0,
      "context" : "Second, our learning algorithm exploits the exp-concavity of our loss function, allowing the use of online Newton steps as in [Agarwal et al., 2006] to guarantee O(log T ) regret w.",
      "startOffset" : 126,
      "endOffset" : 148
    }, {
      "referenceID" : 14,
      "context" : "[Hazan et al., 2007] Let f be an α-exp-concave over B ⊂ R with diameter D, such that ∀x ∈ B , ||∇f(x)||2 ≤ G.",
      "startOffset" : 0,
      "endOffset" : 20
    }, {
      "referenceID" : 14,
      "context" : "[Hazan et al., 2007] Let ft : R → R be α-exp-concave, and let At be as in Algorithm 1.",
      "startOffset" : 0,
      "endOffset" : 20
    }, {
      "referenceID" : 30,
      "context" : "We consider a standard online convex optimization game [Zinkevich, 2003] where in each round t the online player selects a point wt in a convex set B; then a convex payoff function ft is revealed, and the player suffers loss ft(wt).",
      "startOffset" : 55,
      "endOffset" : 72
    }, {
      "referenceID" : 22,
      "context" : "The mirror descent algorithm [Nemirovsky and Yudin, 1985; Beck and Teboulle, 2003] for online convex optimization was extended by Duchi et al.",
      "startOffset" : 29,
      "endOffset" : 82
    }, {
      "referenceID" : 1,
      "context" : "The mirror descent algorithm [Nemirovsky and Yudin, 1985; Beck and Teboulle, 2003] for online convex optimization was extended by Duchi et al.",
      "startOffset" : 29,
      "endOffset" : 82
    }, {
      "referenceID" : 4,
      "context" : "In this section we present a preliminary empirical study examining and analyzing the performance of EREP on the well-known SP500 benchmark dataset [Borodin et al., 2000].",
      "startOffset" : 147,
      "endOffset" : 169
    }, {
      "referenceID" : 19,
      "context" : "OLPS simulation library [Li et al., 2015]: • Exponentiated Gradient (EG) [Helmbold et al.",
      "startOffset" : 24,
      "endOffset" : 41
    }, {
      "referenceID" : 15,
      "context" : ", 2015]: • Exponentiated Gradient (EG) [Helmbold et al., 1998]: this classic algorithm is among the early universal algorithms.",
      "startOffset" : 39,
      "endOffset" : 62
    }, {
      "referenceID" : 5,
      "context" : "• Anticor [Borodin et al., 2004]: one of the first algorithms designed to aggressively exploit mean-reversion via (anti) correlation analysis.",
      "startOffset" : 10,
      "endOffset" : 32
    }, {
      "referenceID" : 17,
      "context" : "• Online Moving Average Reversion (OLMAR) [Li and Hoi, 2012]: designed to exploit mean-reversion based on moving average predictions.",
      "startOffset" : 42,
      "endOffset" : 60
    }, {
      "referenceID" : 24,
      "context" : "In a more elaborate experiment we optimized λ using a standard walk-forward procedure [Pardo, 1992]; see details below.",
      "startOffset" : 86,
      "endOffset" : 99
    }, {
      "referenceID" : 16,
      "context" : "While the original work introducing this norm [Johnson and Banerjee, 2015] considered portfolios on the stocks themselves, we propose to incorporate this structured norm within a Newton style optimization and apply the learning algorithm over trading strategies based on a known partition of the stocks into industry sectors.",
      "startOffset" : 46,
      "endOffset" : 74
    } ],
    "year" : 2016,
    "abstractText" : "We consider online learning of ensembles of portfolio selection algorithms and aim to regularize risk by encouraging diversification with respect to a predefined risk-driven grouping of stocks. Our procedure uses online convex optimization to control capital allocation to underlying investment algorithms while encouraging non-sparsity over the given grouping. We prove a logarithmic regret for this procedure with respect to the best-in-hindsight ensemble. We applied the procedure with known mean-reversion portfolio selection algorithms using the standard GICS industry sector grouping. Empirical Experimental results showed an impressive percentage increase of risk-adjusted return (Sharpe ratio).",
    "creator" : "LaTeX with hyperref package"
  }
}