{
  "name" : "1605.04638.pdf",
  "metadata" : {
    "source" : "META",
    "title" : "Tracking Slowly Moving Clairvoyant: Optimal Dynamic Regret of Online Learning with True and Noisy Gradient",
    "authors" : [ "Tianbao Yang", "Lijun Zhang", "Rong Jin" ],
    "emails" : [ "TIANBAO-YANG@UIOWA.EDU", "ZLJZJU@GMAIL.COM", "JINRONG.JR@ALIBABA-INC.COM", "JINFENGY@US.IBM.COM" ],
    "sections" : [ {
      "heading" : null,
      "text" : "ar X\niv :1\n60 5.\n04 63\n8v 1\n[ cs\n.L G\nProceedings of the 33 rd International Conference on Machine Learning, New York, NY, USA, 2016. JMLR: W&CP volume 48. Copyright 2016 by the author(s)."
    }, {
      "heading" : "1. Introduction",
      "text" : "Online convex optimization (OCO) can be deemed as a repeated game between an online player and an adversary, in which an online player iteratively chooses a decision and then her decisions incur (possibly different) losses by the loss functions chosen by the adversary. These loss functions are unknown to the decision maker ahead of time, and can be adversarial or even depend on the action taken by the decision maker. To formulate the problem mathematically, let Ω ⊆ Rd denote a convex decision set (i.e., the feasible set of the decision vector), wt ∈ Ω denote the decision vector and ft(·) : Rd → R denote the loss function at the t-th step, respectively. The goal of the online learner is to minimize her cumulative loss ∑T t=1 ft(wt). The traditional performance metric - the regret of the decision maker, is defined as the difference between the total cost she has incurred and that of the best fixed decision in hindsight, i.e.,\nT∑\nt=1\nft(wt)− min w∈Ω\nT∑\nt=1\nft(w). (1)\nRecently, there emerges a surge of interest (Besbes et al., 2013; Hall & Willett, 2013; Jadbabaie et al., 2015) in the dynamic regret that compares the performance of online learning to a sequence of optimal solutions. If we denote by w∗t ∈ Ω an optimal solution of ft(w), the dynamic regret is defined as\nT∑\nt=1\n(ft(wt)− ft(w∗t )) = T∑\nt=1\n(ft(wt)− min w∈Ω ft(w)) (2)\ni.e., the performance of the online learner is compared to a clairvoyant who knows the sequence of loss functions in\nadvance, and hence selects the minimizer w∗t at each step. Compared to the traditional regret in (1) (termed as static regret), the dynamic regret is more aggressive since the performance of the clairyomant in the dynamic regret model is always better than that in the static regret model, i.e.,∑T\nt=1 ft(w ∗ t ) ≤ minw∈Ω ∑T t=1 ft(w). It was pointed out that algorithms that achieve performance close to the best fixed decision may perform poorly in terms of dynamic regret (Besbes et al., 2013).\nUnfortunately, it is impossible to achieve a sublinear dynamic regret for any sequences of loss functions (c.f. Proposition 1). In order to achieve a sublinear dynamic regret, one has to impose some regularity constraints on the sequence of loss functions. In this work, we leverage a notion of variation that measures how fast the clairvoyant moves, i.e., how fast the minimizers of the sequence of loss functions change, to which we refer as path variation in order to differentiate with other variation definitions. Formally the path variation is defined as\nV pT , max{w∗t ∈Ω∗t }Tt=1\nT−1∑\nt=1\n‖w∗t −w∗t+1‖2 (3)\nwhere Ω∗t denotes the set of all minimizers of ft(w) to account for the potential non-uniqueness. We aim to develop optimal dynamic regrets when the clairvoyant moves slowly given (noisy) gradient feedback (including bandit feedback) for non-strongly convex loss functions. The main results are summarized in Table 1 and the contributions of this paper are summarized below.\n• We present a general lower bound dependent solely on V pT and show that under true gradient feedback for smooth functions with vanishing gradients in the feasible domain, one can achieve the optimal dynamic regret of O(V pT ) comparable to that with full information feedback.\n• We present a lower bound under a noisy (sub)gradient feedback dependent on V pT and T , and then show that online gradient descent (OGD) with an appropriate step size can achieve the optimal dynamic regret of O( √ V pT T ) under both stochastic gradient feedback\nand two-point bandit feedback.\n• When the loss functions are smooth, we establish an improved dynamic regret under the two-point bandit feedback, which could match the bound achieved with the full information feedback in a certain condition.\nWe note that a regularity metric similar to the path variation (possibly measured in different norms) has been explored in shifting regret analysis (Herbster & Warmuth, 1998) and drifting regret analysis (Cesa-Bianchi et al., 2012; Buchbinder et al., 2012). The regret against the shifting experts was studied in tracking the best expert, where\nthe best sequence of minimizers are assumed to change for a constant number of times. In drifting regret analysis, the constraint is relaxed to that the path variation is small. In fact, a similar dynamic regret bound to √ V pT T has been established for online convex optimization over the simplex (Cesa-Bianchi et al., 2012), where the path variation is measured in ℓ1 norm. The present work focuses on OCO in the Euclidean space and considers noisy gradient feedback. A more general variation is considered in (Hall & Willett, 2013), where a sequence of (or a family of) dynamic models φ1, . . . , φT are revealed by the environment for the learner to predict the decision in the next step. Their variation is defined as V φT = ∑T−1 t=1 ‖w∗t+1 − φt(w∗t )‖ for a sequence of comparators and their dynamic regret scales as V φT √ T , which is worse than our bounds when φt(w) = w.\nThere has been a different notion to measure the point-wise changes in the sequence of loss functions that measure the changes of two consecutive functions at any feasible points. For example, Besbes et al. (2013) considered the functional variation defined as\nV fT = T−1∑\nt=1\nmax w∈Ω\n|ft(w)− ft+1(w)|. (4)\nBesbes et al. considered two feedback structures, i.e., the noisy gradient and the noisy cost, and established sublinear dynamic regret for both feedback structures. For Lipschitz continuous loss functions, their results are presented in Table 1 1. An annoying fact is that even the sequence of Lipschitz loss functions change slowly (namely the functional variation is small), Besbes’ dynamic regret is worse than O( √ T ), the optimal rate for static regret. In comparison, our results match that for static regret when the clairvoyant moves slowly such that the path variation is a constant. Another variation that measures point-wise difference between loss functions is the gradient variation introduced in (Chiang et al., 2012), which is defined as\nV gT ,\nT∑\nt=1\nmax w∈Ω\n‖∇ft(w)−∇ft−1(w)‖22. (5)\nThe gradient variation has been explored for bounding the static regret (Chiang et al., 2012; Rakhlin & Sridharan, 2013; Yang et al., 2014). Recently, Jadbabaie et al. (2015) used the three variations and developed possibly better dynamic regret than using a single variation measure for nonstrongly convex loss functions. They considered the full information feedback (i.e., the whole loss function is revealed to the learner) and a true gradient feedback for a sequence of bounded functions. Their results are also presented in Table 1. In comparison, our results could be potentially better when the clairvoyant moves slowly. Dif-\n1For strongly convex loss functions, better bounds were also established in (Besbes et al., 2013)\nferent from (Jadbabaie et al., 2015), we consider the noisy gradient feedback (including the bandit feedback) and develop both upper bounds and lower bounds."
    }, {
      "heading" : "2. Optimal Dynamic Regret with Noiseless Information",
      "text" : "In this section, we present an optimal dynamic regret bound dependent solely on V pT . We will first present a lower bound and then present optimal upper bounds in two settings: (i) the full information of the loss function is revealed at each step; (ii) only the true gradient at the decision vector is revealed for smooth loss functions that have vanishing gradients in the feasible domain."
    }, {
      "heading" : "2.1. Preliminaries and a Lower Bound",
      "text" : "Since it is impossible to achieve a sublinear dynamic regret for any sequence of loss functions. We consider the following family of functions that admit a path variation constraint:\nVp = {{f1, . . . , fT} : V pT ≤ BT } (6) where BT is the budget. For a (randomized) policy π that generates a sequence of solutions w1, . . . ,wT for a sequence of loss functions f1, . . . , fT under the feedback structure φ, its dynamic regret is defined as\nRπφ({f1, . . . , fT }) = Eπ [ T∑\nt=1\nft(wt)\n] − T∑\nt=1\nft(w ∗ t )\nThe worst dynamic regret of π over f ∈ Vp is Rπφ(Vp, T ) = sup\nf∈Vp Rπφ({f1, . . . , fT })\nNote that the dynamic regret remains the same for different sequences of optimal solutions w∗t , t = 1, . . . , T .\nBelow, we establish a general lower bound of the dynamic\nregret for the following family of policies:\nA = { π : wt = { π1(U), t = 1 πt({φτ (fτ )}t−1τ=1, U), t ≥ 1 } (7)\nwhere φt(ft) ∈ Rk denotes any feedback of ft, and U ∈ U denotes a random variable, π1 : U → Ω, πt : R(t−1)k × U → Ω are measurable functions. Proposition 1. Let C,C1, C2 be positive constants independent of T and V pT , and let π be any policy in A.\n• If BT ≥ C1T , then there exists a positive constant C2 such that\nRπφ(Vp, T ) ≥ C2T.\n• For any γ ∈ (0, 1), there exists a sequence of loss functions f1, . . . , fT and a positive constant C such that V pT ≤ o(T ) and\nRπφ({f1, . . . , ft}) ≥ C(V pT )γ .\nRemark: The first part indicates that it is impossible to achieve a sublinear dynamic regret if there is no constraint on the sequence of loss functions. Therefore, in the sequel, we only consider BT ≤ o(T ). A similar result to the first part using V fT as the regularity measure has been established (Besbes et al., 2013). The second part is novel, which indicates that it is impossible to achieve a better dynamic regret bound of O((V pT )\nα) with α < 1. If otherwise, it then contradicts to the lower bound in the second part of Proposition 1.\nProof. Fix T ≥ 1 and γ ∈ (0, 1). To generate the sequence of loss functions, we create a sequence of random variables ε1, . . . , εT , where each εt is sampled independently from {σ,−σ} with equal probabilities. It is obvious that E[εt] = 0 and E[ε2t ] = σ\n2. For each εt, we define a loss function ft(w) = 1 2 (w − εt)2. Assume σ ∈ (0, 1) whose value will be specified later. Let the feasible domain be Ω = [−1, 1].\nWe have\nE [ Rπφ({f1, . . . , ft}) ] = E\n[ T∑\nt=1\nft(wt)− ft(εt) ]\n=\nT∑\nt=1\nE [ w2t 2 + ε2t 2 − wtεt ] ≥ σ 2 2 T\nwhere E[·] denotes the expectation over the randomness in the sequence of loss functions f1, . . . , ft and the policy π and the last inequality is due to that wt is independent of εt. We also have V p T = ∑T−1 t=1 |εt − εt+1| ≤ 2σT . To prove the first part, we let σ be a constant C1/2, then any sequences of loss functions generated as above constitute a subset V ′p ⊂ Vp. Then Rπφ(Vp, T ) ≥ Rπφ(V ′p, T ) ≥ E [ Rπφ({f1, . . . , ft}) ] ≥ C 2 1\n8 T\nTo prove the second part, we set σ = T−µ with µ = (1−γ)/(2−γ) ∈ (0, 1/2). Then there exits a positive constant C such that E [ Rπφ({f1, . . . , fT })− C(V p T ) γ ] ≥ 0, which implies that there exists a sequence of loss functions f1, . . . , fT such that Rπφ({f1, . . . , fT }) ≥ C(V p T ) γ .\nWe note that if γ = 1, we have µ = 0 and therefore BT = Ω(T ) which reduces to the lower bound in the first part. Therefore, we restrict γ ∈ (0, 1).\nAn interesting question is that whether an O(V pT ) dynamic regret bound is achievable, if not what is the best we can achieve. In particular, we are interested in scenarios when the feedback φt(ft) = φt(wt, ft) only gives a (noisy) gradient of ft(w) at wt.\nBefore delving into the noisy gradient feedback, we first show that an O(V pT ) upper bound is achievable with full information of the loss functions or with full gradient feedback provided that the loss functions are smooth and have vanishing gradients. We make the following assumptions throughout the paper without explicitly mentioning it in the sequel.\nAssumption 1. For {f1, . . . , fT } ∈ Vp, there exists a r > 0 such that sup\nw ∗ t ∈Ω∗t ‖w−w ∗ t ‖2 ≤ r, for any w ∈ Ω and\n1 ≤ t ≤ T ."
    }, {
      "heading" : "2.2. Online Learning with Full Information",
      "text" : "Assume that at each step the full information of the loss function ft(w) is revealed after the decision wt is submitted, and each loss function ft(w) is G-Lipschitz continuous. Then we can update wt+1 by\nwt+1 = min w∈Ω\nft(w), t ≥ 1\nwith w1 be any point in Ω. To analyze the dynamic regret, we denote by w∗0 = w1.\nT∑\nt=1\nft(wt)− T∑\nt=1\nft(w ∗ t ) =\nT∑\nt=1\nft(w ∗ t−1)−\nT∑\nt=1\nft(w ∗ t )\n≤ T∑\nt=1\nG‖w∗t−1 −w∗t ‖2 = G‖w1 −w∗1‖2\n+G\nT−1∑\nt=1\n‖w∗t −w∗t+1‖2 ≤ Gr +GV pT = O(max(V p T , 1)).\nIt is notable that a similar upper bound of O(max(V fT , 1)) with the full information can be achieved (Jadbabaie et al., 2015)."
    }, {
      "heading" : "2.3. Online Learning with Gradient Feedback",
      "text" : "Full information may not be available. In practice, only some partial information of the ft(w) regarding the decision vector wt is available. In this subsection, we assume that only the gradient information ∇ft(wt) is available after the decision wt is submitted. Below, we will first present several examples showing that O(V pT ) is achievable and generalize the analysis to a broad family.\nWe consider two loss functions g1(w) = max(w, 0)2 and g2(w) = (w − α)2 defined in the domain Ω = [−1, 3] and divide all iterations 1, . . . , T into a number m of batches with each batch size of ∆T . Assume the adversary selects g1(·) in odd batches and g2(·) in even batches, and at each step the full gradient feedback is available, i.e., φt(wt, ft) = f ′ t(wt). The example is similar to that presented in (Besbes et al., 2013) except that g1(w) is not strongly convex. Below, we consider two instances of the above example with different ∆T and α. For the updates, we adopt the OGD, i.e.,\nwt+1 = ΠΩ[wt − ηf ′t(wt)], t = 1, . . . , T − 1 where ΠΩ[·] denotes the projection into the domain Ω. Instance 1. ∆T = ⌈T/2⌉ and α = 1. Then V pT = 1. Given the value of ∆T , there are two batches. Let Γ1,Γ2 ⊆ T denote the iteration indices in the first and the second batch, respectively, and let Γj [1] denote the first iteration of the j-th batch. We adopt a constant step size η = 1/2 with a starting point w0 = 0. Then wt = 0, t ∈ Γ1. For the first iteration t ∈ Γ2 we have wt = ΠΩ[0 − ηg′1(0)] = 0. And for all remaining iterations t ∈ Γ2, we have wt = ΠΩ[wt−1 − ηg′2(wt−1)] = α. As a result wt = w∗t , t ∈ [T ] except wΓ2[1] = 0 6= w∗Γ2[1], which indicates that the dynamic regret is fΓ2[1](wΓ2[1])−fΓ2[1](w∗Γ2[1]) = g2(0)− g2(1) = 1. Instance 2. θ = C/ √ T , ∆T = ⌊1+1/(2θ)⌋, α = 1+(1− 2θ)∆T , and T > 4C2 (note that θ < 1/2 and 1 ≤ α ≤ 2).\nThen\nV pT =\nm∑\nj=1\nα ≤ 2m = 2T ∆T = 2T ⌊1 + √ T/(2C)⌋\n≤ 4C √ T\nThe example is similar to the above except that the loss functions change more frequently. We consider OGD with a constant step size η = 1/2 and w1 = 1. Similar as before, we use j = 1, . . . ,m to denote the batch index, Γj ⊆ T to denote the indices in the j-th batch, Γj[1] and Γj [2 :] to denote the first iteration and remaining iterations in batch j, respectively. Note that w∗t = 0, t ∈ Γ2j−1 and w∗t = α, t ∈ Γ2j . For t ∈ Γ1[2 :] or t = Γ2[1], by induction we can show that wt = ΠΩ[wt−1 − ηg′1(wt−1)] = 0. Therefore, wt = w∗t , t ∈ Γ1[2:] and wΓ2[1] = 0. For t ∈ Γ2[2:] or t = Γ3[1], following the OGD update wt = ΠΩ[wt−1−ηg′2(wt−1)] = ΠΩ[wt−1 − 2η(wt−1 − α)] = α. Therefore, wt = α, t ∈ Γ2[2:] and t = Γ3[1]. Following the same analysis, we have wt = w ∗ t for t ∈ Γj [2 :], wΓ2j−1 [1] = α and wΓ2j [1] = 0. It means that the difference between the decision vector wt and the optimal solutions w∗t only happens at the first iterations of all batches. As a result, the dynamic regret is m∑\nj=1\nmax(g1(α)− g1(0), g2(0)− g2(α)) = m∑\nj=1\nα2 ≤ 2V pT\nIt is notable the key ingredient to achieve an O(V pT ) dynamic regret is to use a constant step size. Next, we generalize this result to a broad family of loss functions. In particular, we assume the sequence of loss functions satisfy the following assumption.\nAssumption 2. Assume that every loss function ft(·) is defined over Rd and is convex and smooth, i.e., for any w,w′ ∈ Rd, we have\n‖∇ft(w) −∇ft(w′)‖2 ≤ L‖w−w′‖2, where L > 0 is the smoothness constant. In addition, we assume that there exists w∗t ∈ Ω∗t such that ∇ft(w∗t ) = 0.\nThe condition ∇ft(w∗t ) = 0 is referred to as the vanishing gradient condition. The examples considered before indeed satisfy Assumption 2. Consider the policy of OGD:\nπ : wt= { w1 ∈ Ω t = 1 ΠΩ[wt−1 − η∇ft−1(wt−1)] t > 1 (8)\nThe following theorem states the dynamic regret bound of OGD with a constant step size.\nTheorem 3. (upper bound) Suppose Assumption 2 hold. By the policy π in (8) with η = 1/(2L), for any {f1, . . . , fT } ∈ Vp we have\nT∑\nt=1\nft(wt)− ft(w∗t ) ≤ 2L ( r2 + 2rBT ) .\nTo prove the theorem, we first give the following lemma\nwhose proof is deferred to Appendix.\nLemma 4. Let wt = ΠΩ[wt−1 − ηgt−1], t > 1. Then\ng⊤t (wt −w∗t ) ≤ η\n2 ‖gt‖22 + r‖w∗t −w∗t+1‖2 η\n+ ‖wt −w∗t ‖22 − ‖wt+1 −w∗t ‖22 − ‖w∗t −w∗t+1‖22\n2η\nProof of Theorem 3. Following Lemma 4 and the convexity of ft(w), we have\nft(wt)− ft(w∗t ) ≤ η\n2 ‖∇ft(wt)‖22 + r‖w∗t −w∗t+1‖2 η\n(9)\n+ ‖wt −w∗t ‖22 − ‖wt+1 −w∗t+1‖22 − ‖w∗t+1 −w∗t ‖22\n2η\nBy the smoothness of f(w), for any w ∈ Rd\nft(w) − ft(wt) ≤ 〈∇ft(wt),w −wt〉+ L\n2 ‖w−wt‖22\nLet w = w′t = wt − 1L∇ft(wt) in the above inequality, we have ft(w′t) − ft(wt) ≤ − ‖∇ft(wt)‖22 2L . By convexity of ft(w),\nft(w ′ t) ≥ ft(w∗t ) +∇ft(w∗t )⊤(w′t −w∗t ) = ft(w∗t )\nwhere the equality follows the vanishing gradient condition. Then\nft(w ∗ t )− ft(wt) ≤ ft(w′t)− ft(wt) ≤ − ‖∇ft(wt)‖22 2L\nCombing the inequality above with (9), we have\nft(wt)− ft(w∗t ) ≤ ηL(ft(wt)− ft(w∗t ))\n+ ‖wt −w∗t ‖22 − ‖wt+1 −w∗t+1‖22\n2η + r‖w∗t −w∗t+1‖2 η\nBy summing over t = 1, . . . , T , we have\nT∑\nt=1\n(ft(wt)− ft(w∗t )) ≤ 1\n1− ηL\n( r2\n2η +\nr η V pT\n)\nWe complete the proof by choosing η = 1/[2L].\nRemark: From Theorem 3, we can see that OGD can achieve an O(max(V pT , 1)) dynamic regret for a sequence of loss functions in Vp that satisfy Assumption 2 with only the gradient feedback, which is comparable to that achieved in the full information feedback. The instance 1 and 2 in Section 2 has V pT = O(1) and V p T ≈ 4C √ T , respectively. Therefore, using OGD with η = C we can obtain an O(1) and O( √ T ) dynamic regret.\nFinally, it is worth mentioning that the OGD with restarting proposed in Besbes et al.’ work achieves an O(T 1/3) dynamic regret for instance 1 and an O(T 5/6) dynamic regret for instance 2 due to that the functional variation for the\nfirst instance is bounded by a constant and for the second instance is bounded by O( √ T )."
    }, {
      "heading" : "3. Optimal Dynamic Regret with Noisy Gradient",
      "text" : "In this section, we focus on noisy gradient feedback, i.e., φt(wt, ft) is only a noisy (sub)gradient of ft(w) at wt."
    }, {
      "heading" : "3.1. A Lower Bound with Noisy Gradient Feedback",
      "text" : "Before presenting the upper bounds of the dynamic regret with noisy gradient feedback, we will first present a lower bound. For establishing the lower bound, we consider the following class of policies\nπ : wt = { π1(U), t = 1 πt({φτ (wτ , fτ )}t−1τ=1, U), t ≥ 1\n(10)\nwhere U, π1, πt are defined similarly as before, and φt(wt, ft) is a noisy subgradient of ft at wt. In particular, we assume the noisy gradient is given by φt(wt, ft) ∈ ∂ft(wt) + ǫt with ǫt satisfying the following condition.\nAssumption 5. ǫt ∈ Rd, t ≥ 1 are iid random vectors with zero mean and covariance matrix Σ with bounded entries such that tr(Σ) ≤ λ2. Let P (·) denote the cumulative function of ǫt. There exists a constant C̃ such that for any a ∈ Rd, ∫ log ( dP (y)\ndP (y+a)\n) dP (y) ≤ C̃‖a‖22.\nWhen the noise vectors are independent Gaussian random vectors with zero mean and covariance matrices with entries uniformly bounded by σ2, the above assumption is satisfied with C̃ = 1/(2σ2) and λ2 = dσ2 (Besbes et al., 2013).\nTheorem 6. (lower bound) For any 1 ≤ BT ≤ T and κ ∈ (1/2, 1), there exist V ′p ⊂ Vp and C(κ) > 0 independent of T and BT such that for any policy π in (10) under the noisy gradient feedback that satisfies Assumption 5, we have\nRπφ(V ′p, T ) ≥ C(κ)BκTT 1−κ.\nRemark: Note that from the proof presented below when κ → 1/2, C(κ) → 0. However, the above lower bound can be used to argue that it is impossible to achieve a better dynamic regret than O(B1/2T T\n1/2) with the noisy gradient feedback for any sequence of loss functions. We prove this by contradiction. In particular, assume there exists an algorithm under the noisy gradient feedback achieves better bound than O(B1/2T T\n1/2) for any sequence of loss functions. We can consider two lower orders O(BαTT\n1−α) with 1 > α > 1/2 and O(BαTT\nβ) with α ≤ 1/2, β ≤ 1/2 and α + β < 1. First, we assume O(BαTT\n1−α) is achievable. By Theorem 6 we know that there exists α < κ < 1 (e.g., κ = α+12 ) and V ′p such that Rπφ(V ′p, T ) ≥ Ω(BκTT 1−κ) ≥ Ω(BαTT 1−α), which yields a contradic-\ntion. To show that the second lower bound is unachievable, we can construct a BT such that BκTT\n1−κ ≥ Ω(BαTT β), i.e., BT ≥ Ω(T β+κ−1 κ−α ), where β + κ− 1 < κ− α.\nProof. We construct two functions over the domain Ω = [−1/2,+1/2]. They are\nf(x) =    1 1+γ δ 1+γ − δγx x ∈ [−1/2, 0] 1\n1+γ |x− δ|1+γ x ∈ [0, 2δ] − 1+2γ1+γ δ1+γ + δγx x ∈ [2δ, 1/2] , (11)\ng(x) =    − 1+2γ1+γ δ1+γ − δγx x ∈ [−1/2,−2δ] 1 1+γ |x+ δ|1+γ x ∈ [−2δ, 0] 1\n1+γ δ 1+γ + δγx x ∈ [0, 1/2]\n(12)\nwhere 0 < δ < 1/2 and γ > 0 will be determined later. It is easy to verify that both f(·) and g(·) are convex but not strongly convex. It is also easy to see that the optimal solutions for f(·) and g(·) are x∗f = δ and x∗g = −δ, respectively. Hence |x∗f − x∗g| = 2δ. For a given budget BT , we will construct a subset of Vp by only considering the sequence of these two loss functions. For some ∆T ∈ {1, . . . , T } that, we divide the entire sequence T into m = ⌈T/∆T ⌉ batches, denoted by T1, . . . , Tm, each with size of ∆T (except perhaps Tm), i.e. Tj = {(j − 1)∆T + 1, . . . ,min(j∆t, T )}, j = 1, . . . ,m. To generate the sequence of loss functions f1, . . . , fT , at the beginning of each batch Tj , we randomly choose between the two functions f(·) and g(·) and the same loss function will be used throughout the batch. We denote by V ′p = {{ft(·), t = 1, . . . , T }} the set of a sequence of randomly sampled loss functions, and by X1, . . . , XT the sequence of solutions generated by any policy in (10). Let δ = BT∆T /2T . For any f ∈ V ′p, we have\nV pT =\nm∑\nj=2\n|x∗j − x∗j−1| ≤ (⌈T/∆T ⌉ − 1) 2δ ≤ T 2δ\n∆T = BT\nTherefore, V ′p ⊂ Vp. We denote by Pπf the probability measure under policy π when f is the sequence of the loss functions, and by Eπf the associated expectation operator. Set\n∆T = max { ( 4 γ\n4C̃ )1/(2γ+1)( TBT )\n2γ/(2γ+1), 1 } . Then\nC̃Eπf\n  ∑\nt∈Tj (∇f(Xt)−∇g(Xt))2\n  ≤ C̃ ∑\nt∈Tj 4δ2γ\n≤ 4C̃∆T δ2γ ≤ 4C̃ B2γT ∆ 2γ+1\n22γT 2γ ≤ max(1, 4C̃B\n2γ T\nT 2γ4γ )\n≤ max(1, 4C̃ 4γ ) ≤ max(1, 4C̃) , β\nwhere we use the condition that BT ≤ T . Using Lemma A-1 and A-2 from (Besbes et al., 2013), we have\nmax { P π f {Xt > 0},Pπg{Xt ≤ 0} } ≥ 1\n4eβ , ∀t\nUsing the above result, we have\nRπφ(V ′p, T ) ≥ E\n  m∑\nj=1\n∑ t∈Tj ft(Xt)− ft(x∗j )\n \n= 1\n2\nm∑\nj=1\nEπf\n  ∑\nt∈Tj f(Xt)− f(x∗f )\n \n+ 1\n2\nm∑\nj=1\nEπg\n  ∑\nt∈Tj g(Xt)− g(x∗g)\n \n≥ 1 2\nm∑\nj=1\n∑ t∈Tj P{Xt ≤ 0} ( f(0)− f(x∗f ) )\n+ 1\n2\nm∑\nj=1\n∑ t∈Tj P{Xt > 0} ( g(0)− g(x∗g) )\n= δ1+γ\n2(1 + γ)\nm∑\nj=1\n∑ t∈Tj (P{Xt ≤ 0}+ P{Xt > 0})\n≥ δ 1+γT\n8(1 + γ)eβ .\nIn the above derivations, the first expectation is taking over all randomness in π and f1, . . . , fT , the second inequality holds because\nE[f(Xt)] = E[f(Xt)|Xt > 0] Pr(Xt > 0) + E[f(Xt)|Xt ≤ 0] Pr(Xt ≤ 0) ≥ f(0) Pr(Xt ≤ 0) E[g(Xt)] = E[g(Xt)|Xt > 0] Pr(Xt > 0) + E[g(Xt)|Xt ≤ 0] Pr(Xt ≤ 0) ≥ g(0) Pr(Xt > 0)\nwhere the inequalities are due to f(x) ≥ 0, g(x) ≥ 0 and f(x) ≥ f(0) when x ≤ 0 and g(x) ≥ g(0) when x ≥ 0. To proceed, we plug in the value of δ into the lower bound of Rπφ(V ′p, T )\nRπφ(V ′p, T ) ≥ T\n8eβ(1 + γ)\nB1+γT ∆ 1+γ T\n21+γT 1+γ\n≥ 4 γ(1+γ)/(1+2γ) 8eβ(1 + γ)21+γ(4C̃)(1+γ)/(1+2γ) B\n1+γ−(1+γ) 2γ 1+2γ T\nT γ−(1+γ) 2γ 1+2γ\n= 4γ(1+γ)/(1+2γ)\n8eβ(1 + γ)21+γ(4C̃)(1+γ)/(1+2γ) B\n1+γ 1+2γ\nT T 1− 1+γ 1+2γ\nLet γ = (1−κ)/(2κ−1), i.e., κ = (1+γ)/(1+2γ). Then\nRπφ(V ′p, T ) ≥ (4γ)κ (1 + γ)2γ 1 16eβ(4C̃)κ BκTT 1−κ.\nIn the next two subsections, we consider two types of noisy gradient feedback, namely a stochastic subgradient feedback that is an unbiased estimation of the true subgradient and a bandit feedback that gives an unbiased estimation of\nthe subgradient of a smoothed function instead of the original function. We show that under the two noisy gradient feedback, we are able to achieve an optimal dynamic regret of O( √ V pT T ). Furthermore, for smooth loss functions under the two-point bandit feedback, we establish an even better upper bound by leveraging the gradient variation in the form of O(max( √ V pT V g T , V p T )), which when the gradient variation is small matches the lower bound presented in Proposition 1."
    }, {
      "heading" : "3.2. Online Learning with Bounded Stochastic Gradient Feedback",
      "text" : "We adopt the policy defined by OGD using the noisy gradient feedback, i.e.,\nπ : wt = { w1 ∈ Ω t = 1 ΠΩ[wt−1 − ηφt−1(wt−1, ft−1)] t > 1\n(13) where φt(wt, ft) ∈ ∂ft(wt) + ǫt is a noisy subgradient with ǫt satisfying Assumption 5. The upper bound of the dynamic regret of OGD with an appropriate step size is presented below.\nTheorem 7. (upper bound) Suppose Assumption 5 hold. Assume ‖∂ft(w)‖2 ≤ G, for any w ∈ Ω and 1 ≤ t ≤ T . By the policy π in (13) with η = √ r2+2rBT T (G2+λ2) , we have\nRπφ(Vp, T ) ≤ √ (r2 + 2rBT )(G2 + λ2)T .\nProof. Let Et[·] denote the expectation over the randomness in φt given the randomness before t. We abuse the notation w∗T+1 = w ∗ T . Note that\nEt [ ‖φt(wt, ft)‖22 ] ≤ (G2 + λ2).\nFollowing Lemma 4 and the convexity of ft(w), we have\nEt [ft(wt)− ft(w∗t )] ≤ Et [〈φt(wt, ft),wt −w∗t 〉]\n≤ ‖wt −w ∗ t ‖22 2η − ‖wt+1 −w ∗ t+1‖22 2η − ‖w ∗ t −w∗t+1‖22 2η + η\n2 (G2 + λ2) +\nr η ‖w∗t −w∗t+1‖2\nHence, by summing the above inequalities over t = 1, . . . , T we have\nE\n[ T∑\nt=1\nft(wt)− ft(w∗t ) ] ≤ 1\n2η\n( r2 + 2rV pT ) + η\n2 G2λT\nwhere G2λ = G 2+λ2. Since the above inequality holds for any w∗t ∈ Ω∗t , we thus conclude\nE\n[ T∑\nt=1\nft(wt)− ft(w∗t ) ] ≤ 1\n2η (r2 + 2rBT ) +\nη 2 G2λT\nWe complete the proof by choosing η = √\nr2+2rBT T (G2+λ2) .\nRemark: From Theorem 7, we can see that OGD can achieve an O( √ max(V pT , 1)T ) dynamic regret with a\nstep size η = C √\nmax(V pT , 1)/T . Compared to OGD with restarting proposed in (Besbes et al., 2013), our result could be better when √ V pT T ≤ O((V f T )\n1/3T 2/3), i.e., V pT ≤ O((V f T ) 2/3T 1/3)."
    }, {
      "heading" : "3.3. Online Learning with Bandit Feedback",
      "text" : "In this subsection, we analyze the dynamic regret with bandit feedback by building on previous work. Bandit feedback has been analyzed before for the static regret. In particular, using one-point bandit feedback Flaxman et al. (2005) showed an O(T 3/4) static regret bound, while Agarwal et al. (2010) established an optimal static regret bound of O( √ T ) using two-point bandit feedback. Recently, Chiang et al. (2013) derived a variational static regret bound in the two-point bandit setting that depends on√ V gT where V g T is the gradient variation defined in Section 1. In order to have optimal dynamic regret bounds, we also consider two-point bandit setting and show that the previous algorithms in (Agarwal et al., 2010; Chiang et al., 2013) by adjusting the step size can achieve an O( √ V pT T ) dynamic regret for general Lipschitz continuous loss functions and an O(max( √ V gT V p T , V p T )) dynamic regret for smooth loss functions. Below, we present more details. The omitted proof can be found in Appendix.\nSimilar to previous work, we assume that ft(w) is GLipschitz continuous and R1B ⊆ Ω ⊆ R2B where B = {w ∈ Rd : ‖w‖2 ≤ 1} is the unit ball centered at 0. Let ut ∈ Rd be a random unit vector, ei ∈ Rd be the i-th canonical vector, w1 = 0. For Lipschitz continuous loss functions, the update is given by\nwt+1 = Π(1−ξ)Ω[wt − ĝt] (14) where ξ ∈ (0, 1) and ĝt is computed from two-point bandit feedback\nĝt = d\n2δ [ft(wt + δut)− ft(wt − δut)]ut\nwith δ = ξR1. For any wt ∈ (1− ξ)Ω and any unit vector u, wt + δu ∈ Ω (Flaxman et al., 2005). It can be shown that ĝt is an unbiased stochastic gradient of the function f̂t(w) = Eu[ft(w + δu)]. Importantly, ‖ĝt‖2 ≤ Gd. The following theorem states the dynamic regret bound for the policy in (14).\nTheorem 8. Assume ft(w) is G-Lipschitz continuous. By the policy in (14) with ξ = 1T , δ = ξR1, and η =√\nr2+2rBT TG2d2 , we have\nE\n[ T∑\nt=1\n1 2 (ft(ŵ 1 t ) + f(ŵ 2 t ))\n] − T∑\nt=1\nft(w ∗ t )\n≤ √ (r2 + 2rBT )G2d2T +G(3R1 +R2).\nAlgorithm 1 META algorithm 1: Initialize solution w1 = ŵ1 = 0 and ĝ0 = 0 2: for t = 1, . . . , T do 3: Choose it uniformly from [d] 4: Submit ŵ1t = ŵt + δeit and ŵ 2 t = ŵt − δeit\n5: Receive the feedback ft(ŵ1t ) and ft(ŵ 2 t ) and let\nvt,it = 1 2δ (ft(ŵ 1 t )− f(ŵ2t ))\n6: Compute\ngt = d(vt,it − ĝt−1,it)eit , and ĝt = d(vt,it − ĝt−1,it)eit + ĝt−1\n7: Update\nwt+1 = Π(1−ξ)Ω[wt − ηgt] ŵt+1 = Π(1−ξ)Ω[wt+1 − ηĝt]\n8: end for\nwhere ŵ1t = wt + δut, ŵ 2 t = wt − δut.\nRemark: The dynamic regret averaged over two decisions with two-point bandit feedback is in the same order of√ max(V pT , 1)T to that in Theorem 7 with stochastic gradient feedback.\nFinally, we present an upper bound for smooth loss functions by leveraging the gradient variation, which leads to an improved dynamic regret bound compared to Lipschitz continuous loss functions. The updates are based on the META algorithm proposed in (Chiang et al., 2013), which is presented in Algorithm 1. It was proved to achieve a better static regret of O( √ V gT ) than O( √ T ). Below, we show that the same policy but with a different step size can achieve an improved dynamic regret, i.e., O(max( √ V gT max(V p T , 1), V p T )) for a sequence of smooth loss functions from the following set\nVp,g = {{f1, . . . , fT} : V pT ≤ BT , V g T ≤ ST }\nThe theorem below states the result.\nTheorem 9. Assume {f1, . . . , fT } ∈ Vp,g and ft(w) is Lsmooth for any t ≥ 1. By the policy in Algorithm 1 with ξ = 1 T , δ = ξR1 and η = min (√ (2rBT+r2) 8ST d4 , 1 4Ld3/2 √ lnT ) ,\nwe have\nE\n[ T∑\nt=1\n1 2 (ft(ŵ 1 t ) + f(ŵ 2 t ))\n] − T∑\nt=1\nft(w ∗ t )\n≤ O ( max { d2 √ ST max(BT , 1), d 3/2 max(BT , 1) }) .\nwhere ŵ1t = wt + δut, ŵ 2 t = wt − δut.\nRemark: When the gradient variation is small such that\nthe upper bound is dominated by O(V pT ), it matches the lower bound established in Proposition 1. Finally, we note that a similar upper bound can be achieved for linear loss functions by extending the static regret analysis in (Chiang et al., 2013) to the dynamic regret similarly to the proof of Theorem 9."
    }, {
      "heading" : "4. Conclusions",
      "text" : "In this paper, we have considered dynamic regret for online learning under true and noisy gradient feedback. We have developed several lower and upper bounds of the dynamic regret based on the path variation that measures the temporal changes in the optimal solutions. In light of the presented lower bounds, the achieved upper bounds are optimal for non-strongly convex loss functions when the clairvoyant moves slowly. An interesting question that remains open is that what is the optimal dynamic regret bound for strongly convex loss functions in terms of the path variation."
    }, {
      "heading" : "Acknowledgements",
      "text" : "The authors would like to thank the anonymous reviewers for their helpful comments. T. Yang was supported in part by NSF (1463988, 1545995)."
    }, {
      "heading" : "A. Proof of Lemma 4",
      "text" : "Let w′t = wt − ηgt. Thus wt+1 = ΠΩ[w′t]. 1 2 ‖wt+1 −w∗t ‖22 ≤ 1 2 ‖w′t −w∗t ‖22 = 1 2 ‖wt − ηgt −w∗t ‖22\n= 1 2 ‖wt −w∗t ‖22 − ηg⊤t (wt −w∗t ) + 1 2 η2‖gt‖22\nThen\ng⊤t (wt −w∗t ) ≤ 1 2 ‖wt −w∗t ‖22 − 1 2 ‖wt+1 −w∗t ‖22\n+ 1\n2 η2‖gt‖22\n= 1\n2η ‖wt −w∗t ‖22 −\n1\n2η ‖wt+1 −w∗t+1 +w∗t+1 −w∗t ‖22\n+ 1\n2 η‖gt‖22\n= 1 2η ‖wt −w∗t ‖22 − 1 2η ‖wt+1 −w∗t+1‖22\n− 1 2η ‖w∗t+1 −w∗t ‖22 + 1 η (w∗t+1 −wt+1)⊤(w∗t −w∗t+1)\n+ 1\n2 η‖gt‖22\n≤ 1 2η ‖wt −w∗t ‖22 − 1 2η ‖wt+1 −w∗t+1‖22\n− 1 2η ‖w∗t+1 −w∗t ‖22 + 1 η r‖w∗t −w∗t+1‖2 + 1 2 η‖gt‖22"
    }, {
      "heading" : "B. Proof of Theorem 8",
      "text" : "Define f̂t(w) as\nf̂t(w) = Eu[ft(w + δu)]\nwhere u is a random unit vector. We first give the following lemma.\nLemma 10. Let ŵ∗t = (1− ξ)w∗t . T∑\nt=1\n1 2 (ft(ŵ 1 t ) + ft(ŵ 2 t ))−\nT∑\nt=1\nft(w ∗ t )\n≤ T∑\nt=1\nf̂t(wt)− T∑\nt=1\nf̂t(ŵ ∗ t ) + 3TGδ + TGR2ξ\nNote that the updating rule is OGD with a noisy gradient applied to a sequence of functions f̂t(w), t = 1, . . . , T . Following (Agarwal et al., 2010), ĝt is bounded by ‖ĝt‖2 ≤ Gd. Then following the proof of Theorem 6, we have,\nT∑\nt=1\nf̂t(wt)− T∑\nt=1\nf̂t(ŵ ∗ t ) ≤ ‖w1 − ŵ∗1‖22 2η\n+\nT∑\nt=1\n1 η ‖wt+1 − ŵ∗t+1‖2‖ŵ∗t − ŵ∗t+1‖2 + η 2 G2d2T\nSince wt, ŵ∗t ∈ (1− ξ)Ω, we have ‖wt − ŵ∗t ‖2 ≤ r\ndue to Assumption 1. In addition,\n‖ŵ∗t − ŵ∗t+1‖2 = ‖(1− ξ)w∗t − (1− ξ)w∗t+1‖2 ≤ (1− ξ)‖w∗t −w∗t+1‖2 ≤ ‖w∗t −w∗t+1‖2\nThen T∑\nt=1\nf̂t(wt)− T∑\nt=1\nf̂t(ŵ ∗ t ) ≤\n1\n2η (r2 + 2rV pT ) +\nη 2 G2d2T\n≤ 1 2η (r2 + 2rBT ) + η 2 G2d2T\nBy plugging the value of η, we have\nT∑\nt=1\nf̂t(wt)− T∑\nt=1\nf̂t(ŵ ∗ t ) ≤ √ (r2 + 2rBT )G2d2T\nThen combining the above inequality with Lemma 13, we have\nT∑\nt=1\n1 2 (ft(ŵ 1 t ) + ft(ŵ 2 t ))−\nT∑\nt=1\nft(w ∗ t )\n≤ √ (r2 + 2rBT )G2d2T + 3TGδ + TGR2ξ ≤ √ (r2 + 2rBT )G2d2T +G(3R1 +R2).\nB.1. Proof of Lemma 10\nThe proof is almost identical to that of Lemma 2 in (Agarwal et al., 2010). By the Lipschitz property of ft(w), we have\nft(ŵ 1 t ) = ft(wt + δut) ≤ ft(wt) +Gδ‖ut‖2 ft(ŵ 2 t ) = ft(wt − δut) ≤ ft(wt) +Gδ‖ut‖2\nSince ‖ut‖2 = 1, thus 1\n2 (ft(ŵ\n1 t ) + ft(ŵ 2 t )) ≤ ft(wt) +Gδ\nBy the Lipschitz property and Ω ⊂ R2B, we have for any w ∈ Ω ft((1 − ξ)w) ≤ ft(w) +GR2ξ Further for any w ∈ (1− ξ)Ω,\n|ft(w) − f̂t(w)| = |ft(w)− Etft(w + δu)| ≤ Et|ft(w)− ft(w + δu)| ≤ Gδ\nThen\nft(wt) ≤ f̂t(wt)+Gδ, and f̂t((1−ξ)w∗t ) ≤ ft((1−ξ)w∗t )+Gδ Combining the above inequalities, we get\n1 2 (ft(ŵ 1 t ) + ft(ŵ 2 t )) + f̂t((1 − ξ)w∗t ) ≤ ft(wt) +Gδ + ft((1 − ξ)w∗t ) +Gδ ≤ ft(wt) + ft(w∗t ) +GR2ξ + 2Gδ ≤ f̂t(wt) + ft(w∗t ) +GR2ξ + 3Gδ\nAs a result, T∑\nt=1\n1 2 (ft(ŵ 1 t ) + ft(ŵ 2 t ))−\nT∑\nt=1\nft(w ∗ t )\n≤ T∑\nt=1\nf̂t(wt)− T∑\nt=1\nf̂t((1− ξ)w∗t ) + 3TGδ + TGR2ξ"
    }, {
      "heading" : "C. Proof of Theorem 9",
      "text" : "The proof follows similarly to the analysis in (Chiang et al., 2013). We present a series of Lemmas with some of the Lemmas’ proof omitted due to that they are identical to that in (Chiang et al., 2013). To simply the presentation, we denote by O(1) any constant independent of T .\nLemma 11. T∑\ni=1\n1 2 (ft(ŵ 1 t ) + ft(ŵ 2 t ))−\nT∑\nt=1\nft(w ∗ t )\n≤ T∑\nt=1\nft(wt)− T∑\nt=1\nft((1 − ξ)w∗t ) +O(1)\nThe proof of this lemma is presented later.\nLemma 12. Let ŵ∗t = (1− ξ)w∗t . T∑\nt=1\nft(wt)− T∑\nt=1\nft(ŵ ∗ t ) ≤\nT∑\nt=1\n∇ft(wt)⊤(wt − ŵ∗t )\nThe lemma above follows the convexity of ft(w). Lemma 13. Let ŵ∗t = (1− ξ)w∗t .\nE\n[ T∑\nt=1\n∇ft(wt)⊤(wt − ŵ∗t ) ]\n≤ E [ T∑\nt=1\ng⊤t (wt − ŵ∗t ) ] +O(1)\nThe proof of the above lemma follows the same to the proof of Lemma 5 in (Chiang et al., 2013).\nLemma 14. Define\nSt = ηt‖gt − gt−1‖22 At = 1\n2η ‖wt − ŵ∗t ‖22 −\n1\n2η ‖wt+1 − ŵ∗t ‖22\nCt = 1\n2 ‖wt+1 − ŵt‖22 +\n1\n2η ‖wt − ŵt‖22\nThen T∑\nt=1\ng⊤t (wt − ŵ∗t ) ≤ T∑\nt=1\nSt +\nT∑\nt=1\nAt − T∑\nt=1\nCt\nThe above lemma is a result of the Lemma 4 in (Chiang et al., 2013). Combining the above lemmas, we\nhave\nTheorem 15.\nE\n[ T∑\ni=1\n1 2 (ft(ŵ 1 t ) + ft(ŵ 2 t ))−\nT∑\nt=1\nft(w ∗ t )\n]\n≤ E [ T∑\nt=1\nSt +\nT∑\nt=1\nAt − T∑\nt=1\nCt\n] +O(1)\nTo proceed we bound the three summation terms in the R.H.S..\nLemma 16. T∑\nt=1\nCt ≥ 1\n4η E\n[ T∑\nt=1\n‖ŵt − ŵt+1‖22\n] −O(1)\nThis is the same to the Lemma 11 in (Chiang et al., 2013).\nLemma 17. T∑\nt=1\nAt ≤ ‖w1 − ŵ∗1‖22\n2η\n+ 1\nη\nT∑\nt=1\n‖wt+1 − ŵ∗t+1‖2‖ŵ∗t − ŵ∗t+1‖2\n≤ 1 2η (r2 + 2rV pT )\nThe proof follows similarly to that of Lemma 1.\nLemma 18. T∑\nt=1\nSt ≤ 4ηd4V gT +4ηd3L2 lnTE [ T∑\nt=1\n‖ŵt − ŵt+1‖22\n] +O(1)\nwhere L is the smoothness parameter.\nThe lemma follows the Lemma 12 in (Chiang et al., 2013). Combining Lemma 16, 17 and Lemma 18, we have\nE\n[ T∑\nt=1\nSt +\nT∑\nt=1\nAt − T∑\nt=1\nCt ] ≤ 4ηd4V gT + 1\n2η (r2 + 2rV pT )\n+ 4ηd3L2 lnTE\n[ T∑\nt=1\n‖ŵt − ŵt+1‖22\n]\n− 1 4η E\n[ T∑\nt=1\n‖ŵt − ŵt+1‖22\n] +O(1)\nSince η ≤ 1 4d3/2L √ lnT , then\nE\n[ T∑\nt=1\nSt +\nT∑\nt=1\nAt − T∑\nt=1\nCt\n]\n≤ 4ηd4V gT + 1\n2η (r2 + 2rV pT ) +O(1)\n≤ 4ηd4ST + 1\n2η (r2 + 2rBT ) +O(1)\nThen by the value of η, we have\nE\n[ T∑\nt=1\nSt +\nT∑\nt=1\nAt − T∑\nt=1\nCt\n]\n≤ 4ηd4ST + 1\n2η (r2 + 2rBT ) +O(1)\n≤ max { 2 √ 2 √ d4ST (r2 + 2rBT ), 4d 3/2L √ lnT (r2 + 2rBT ) }\n+O(1)\nTherefore,\nE\n[ T∑\ni=1\n1 2 (ft(ŵ 1 t ) + ft(ŵ t 1))−\nT∑\nt=1\nft(w ∗ t )\n]\n≤ O ( max(d2 √ ST max(1, BT ), d 3/2 max(1, BT )) )\nC.1. Proof of Lemma 11\nFrom the Lipschitz property,\nft(ŵ 1 t )− ft(wt) ≤ G‖ŵ1t −wt‖2 ≤ Gδ ft(ŵ 2 t )− ft(wt) ≤ G‖ŵ2t −wt‖2 ≤ Gδ\nThen T∑\ni=1\n1 2 (ft(ŵ 1 t ) + ft(ŵ t 1))−\nT∑\nt=1\nft(wt) ≤ GδT\nTo proceed,\nft((1 − ξ)w∗t ) ≤ ξft(0) + (1− ξ)ft(w∗t ) = ft(w ∗ t ) + ξ(ft(0)− ft(w∗t )) ≤ ft(w∗t ) + ξG‖w∗t ‖2\n= ft(w ∗ t ) + ξGR2\nThen T∑\nt=1\nft((1 − ξ)w∗t )− T∑\nt=1\nft(w ∗ t ) ≤ ξGR2T\nThus T∑\ni=1\n1 2 (ft(ŵ 1 t ) + ft(ŵ t 1))−\nT∑\nt=1\nft(w ∗ t )\n≤ T∑\nt=1\nft(wt)− T∑\nt=1\nft((1− ξ)w∗t ) +GδT + ξGR2T\n≤ T∑\nt=1\nft(wt)− T∑\nt=1\nft((1− ξ)w∗t ) +O(1)"
    } ],
    "references" : [ {
      "title" : "Optimal algorithms for online convex optimization with multi-point bandit feedback",
      "author" : [ "Agarwal", "Alekh", "Dekel", "Ofer", "Xiao", "Lin" ],
      "venue" : "In Proceedings of the 23rd Conference on Learning Theory (COLT),",
      "citeRegEx" : "Agarwal et al\\.,? \\Q2010\\E",
      "shortCiteRegEx" : "Agarwal et al\\.",
      "year" : 2010
    }, {
      "title" : "Unified algorithms for online learning and competitive analysis",
      "author" : [ "Buchbinder", "Niv", "Chen", "Shahar", "Naor", "Joseph", "Shamir", "Ohad" ],
      "venue" : "In Proceedings of the 25th Annual Conference on Learning Theory (COLT),",
      "citeRegEx" : "Buchbinder et al\\.,? \\Q2012\\E",
      "shortCiteRegEx" : "Buchbinder et al\\.",
      "year" : 2012
    }, {
      "title" : "A new look at shifting",
      "author" : [ "Cesa-Bianchi", "Nicol", "Gaillard", "Pierre", "Lugosi", "Gbor", "Stoltz", "Gilles" ],
      "venue" : "regret. CoRR,",
      "citeRegEx" : "Cesa.Bianchi et al\\.,? \\Q2012\\E",
      "shortCiteRegEx" : "Cesa.Bianchi et al\\.",
      "year" : 2012
    }, {
      "title" : "Online optimization with gradual variations",
      "author" : [ "Chiang", "Chao-Kai", "Yang", "Tianbao", "Lee", "Chia-Jung", "Mahdavi", "Mehrdad", "Lu", "Chi-Jen", "Jin", "Rong", "Zhu", "Shenghuo" ],
      "venue" : "In Proceedings of the 25th Annual Conference on Learning Theory (COLT),",
      "citeRegEx" : "Chiang et al\\.,? \\Q2012\\E",
      "shortCiteRegEx" : "Chiang et al\\.",
      "year" : 2012
    }, {
      "title" : "Online convex optimization in the bandit setting: gradient descent without a gradient",
      "author" : [ "Flaxman", "Abraham", "Kalai", "Adam Tauman", "McMahan", "H. Brendan" ],
      "venue" : "In Proceedings of the Sixteenth Annual ACM-SIAM Symposium on Discrete Algorithms (SODA),",
      "citeRegEx" : "Flaxman et al\\.,? \\Q2005\\E",
      "shortCiteRegEx" : "Flaxman et al\\.",
      "year" : 2005
    }, {
      "title" : "Online optimization in dynamic environments",
      "author" : [ "Hall", "Eric C", "Willett", "Rebecca M" ],
      "venue" : "CoRR, abs/1307.5944,",
      "citeRegEx" : "Hall et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Hall et al\\.",
      "year" : 2013
    }, {
      "title" : "Tracking the best expert",
      "author" : [ "Herbster", "Mark", "Warmuth", "Manfred K" ],
      "venue" : "Machine Learning,",
      "citeRegEx" : "Herbster et al\\.,? \\Q1998\\E",
      "shortCiteRegEx" : "Herbster et al\\.",
      "year" : 1998
    }, {
      "title" : "Online optimization : Competing with dynamic comparators",
      "author" : [ "Jadbabaie", "Ali", "Rakhlin", "Alexander", "Shahrampour", "Shahin", "Sridharan", "Karthik" ],
      "venue" : "In Proceedings of the Eighteenth International Conference on Artificial Intelligence and Statistics (AISTATS),",
      "citeRegEx" : "Jadbabaie et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Jadbabaie et al\\.",
      "year" : 2015
    }, {
      "title" : "Regret bounded by gradual variation for online convex optimization",
      "author" : [ "Yang", "Tianbao", "Mahdavi", "Mehrdad", "Jin", "Rong", "Zhu", "Shenghuo" ],
      "venue" : "Machine Learning,",
      "citeRegEx" : "Yang et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Yang et al\\.",
      "year" : 2014
    } ],
    "referenceMentions" : [ {
      "referenceID" : 7,
      "context" : "Recently, there emerges a surge of interest (Besbes et al., 2013; Hall & Willett, 2013; Jadbabaie et al., 2015) in the dynamic regret that compares the performance of online learning to a sequence of optimal solutions.",
      "startOffset" : 44,
      "endOffset" : 111
    }, {
      "referenceID" : 2,
      "context" : "We note that a regularity metric similar to the path variation (possibly measured in different norms) has been explored in shifting regret analysis (Herbster & Warmuth, 1998) and drifting regret analysis (Cesa-Bianchi et al., 2012; Buchbinder et al., 2012).",
      "startOffset" : 204,
      "endOffset" : 256
    }, {
      "referenceID" : 1,
      "context" : "We note that a regularity metric similar to the path variation (possibly measured in different norms) has been explored in shifting regret analysis (Herbster & Warmuth, 1998) and drifting regret analysis (Cesa-Bianchi et al., 2012; Buchbinder et al., 2012).",
      "startOffset" : 204,
      "endOffset" : 256
    }, {
      "referenceID" : 2,
      "context" : "In fact, a similar dynamic regret bound to √ V p T T has been established for online convex optimization over the simplex (Cesa-Bianchi et al., 2012), where the path variation is measured in l1 norm.",
      "startOffset" : 122,
      "endOffset" : 149
    }, {
      "referenceID" : 1,
      "context" : ", 2012; Buchbinder et al., 2012). The regret against the shifting experts was studied in tracking the best expert, where the best sequence of minimizers are assumed to change for a constant number of times. In drifting regret analysis, the constraint is relaxed to that the path variation is small. In fact, a similar dynamic regret bound to √ V p T T has been established for online convex optimization over the simplex (Cesa-Bianchi et al., 2012), where the path variation is measured in l1 norm. The present work focuses on OCO in the Euclidean space and considers noisy gradient feedback. A more general variation is considered in (Hall & Willett, 2013), where a sequence of (or a family of) dynamic models φ1, . . . , φT are revealed by the environment for the learner to predict the decision in the next step. Their variation is defined as V φ T = ∑T−1 t=1 ‖w∗ t+1 − φt(w∗ t )‖ for a sequence of comparators and their dynamic regret scales as V φ T √ T , which is worse than our bounds when φt(w) = w. There has been a different notion to measure the point-wise changes in the sequence of loss functions that measure the changes of two consecutive functions at any feasible points. For example, Besbes et al. (2013) considered the functional variation defined as",
      "startOffset" : 8,
      "endOffset" : 1222
    }, {
      "referenceID" : 3,
      "context" : "Another variation that measures point-wise difference between loss functions is the gradient variation introduced in (Chiang et al., 2012), which is defined as",
      "startOffset" : 117,
      "endOffset" : 138
    }, {
      "referenceID" : 3,
      "context" : "(5) The gradient variation has been explored for bounding the static regret (Chiang et al., 2012; Rakhlin & Sridharan, 2013; Yang et al., 2014).",
      "startOffset" : 76,
      "endOffset" : 143
    }, {
      "referenceID" : 8,
      "context" : "(5) The gradient variation has been explored for bounding the static regret (Chiang et al., 2012; Rakhlin & Sridharan, 2013; Yang et al., 2014).",
      "startOffset" : 76,
      "endOffset" : 143
    }, {
      "referenceID" : 3,
      "context" : "(5) The gradient variation has been explored for bounding the static regret (Chiang et al., 2012; Rakhlin & Sridharan, 2013; Yang et al., 2014). Recently, Jadbabaie et al. (2015) used the three variations and developed possibly better dynamic regret than using a single variation measure for nonstrongly convex loss functions.",
      "startOffset" : 77,
      "endOffset" : 179
    }, {
      "referenceID" : 7,
      "context" : ", 2013) (Jadbabaie et al., 2015) Loss function Feedback path variation functional variation three variations Lipschitz Full Information O(V p T ) O(V f T ) O(min( √ V p T V g T , (V g T ) T (V f T ) )) Lipschitz True Gradient N.",
      "startOffset" : 8,
      "endOffset" : 32
    }, {
      "referenceID" : 7,
      "context" : "ferent from (Jadbabaie et al., 2015), we consider the noisy gradient feedback (including the bandit feedback) and develop both upper bounds and lower bounds.",
      "startOffset" : 12,
      "endOffset" : 36
    }, {
      "referenceID" : 7,
      "context" : "It is notable that a similar upper bound of O(max(V f T , 1)) with the full information can be achieved (Jadbabaie et al., 2015).",
      "startOffset" : 104,
      "endOffset" : 128
    }, {
      "referenceID" : 0,
      "context" : "In order to have optimal dynamic regret bounds, we also consider two-point bandit setting and show that the previous algorithms in (Agarwal et al., 2010; Chiang et al., 2013) by adjusting the step size can achieve an O( √ V p T T ) dynamic regret for general Lipschitz continuous loss functions and an O(max( √ V g T V p T , V p T )) dynamic regret for smooth loss functions.",
      "startOffset" : 131,
      "endOffset" : 174
    }, {
      "referenceID" : 4,
      "context" : "For any wt ∈ (1− ξ)Ω and any unit vector u, wt + δu ∈ Ω (Flaxman et al., 2005).",
      "startOffset" : 56,
      "endOffset" : 78
    }, {
      "referenceID" : 2,
      "context" : "In particular, using one-point bandit feedback Flaxman et al. (2005) showed an O(T ) static regret bound, while Agarwal et al.",
      "startOffset" : 47,
      "endOffset" : 69
    }, {
      "referenceID" : 0,
      "context" : "(2005) showed an O(T ) static regret bound, while Agarwal et al. (2010) established an optimal static regret bound of O( √ T ) using two-point bandit feedback.",
      "startOffset" : 50,
      "endOffset" : 72
    }, {
      "referenceID" : 0,
      "context" : "(2005) showed an O(T ) static regret bound, while Agarwal et al. (2010) established an optimal static regret bound of O( √ T ) using two-point bandit feedback. Recently, Chiang et al. (2013) derived a variational static regret bound in the two-point bandit setting that depends on √ V g T where V g T is the gradient variation defined in Section 1.",
      "startOffset" : 50,
      "endOffset" : 191
    } ],
    "year" : 2016,
    "abstractText" : "This work focuses on dynamic regret of online convex optimization that compares the performance of online learning to a clairvoyant who knows the sequence of loss functions in advance and hence selects the minimizer of the loss function at each step. By assuming that the clairvoyant moves slowly (i.e., the minimizers change slowly), we present several improved variationbased upper bounds of the dynamic regret under the true and noisy gradient feedback, which are optimal in light of the presented lower bounds. The key to our analysis is to explore a regularity metric that measures the temporal changes in the clairvoyant’s minimizers, to which we refer as path variation. Firstly, we present a general lower bound in terms of the path variation, and then show that under full information or gradient feedback we are able to achieve an optimal dynamic regret. Secondly, we present a lower bound with noisy gradient feedback and then show that we can achieve optimal dynamic regrets under a stochastic gradient feedback and two-point bandit feedback. Moreover, for a sequence of smooth loss functions that admit a small variation in the gradients, our dynamic regret under the two-point bandit feedback matches what is achieved with full information. Proceedings of the 33 rd International Conference on Machine Learning, New York, NY, USA, 2016. JMLR: W&CP volume 48. Copyright 2016 by the author(s).",
    "creator" : "LaTeX with hyperref package"
  }
}