{
  "name" : "1605.07252.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Interaction Screening: Efficient and Sample-Optimal Learning of Ising Models",
    "authors" : [ "Marc Vuffray", "Sidhant Misra", "Andrey Lokhov", "Michael Chertkov" ],
    "emails" : [ "chertkov}@lanl.gov" ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "A Graphical Model (GM) describes a probability distribution over a set of random variables which factorizes over the edges of a graph. It is of interest to recover the structure of GMs from random samples. The graphical structure contains valuable information on the dependencies between the random variables. In fact, the neighborhood of a random variable is the minimal set that provides us maximum information about this variable. Unsurprisingly, GM reconstruction plays an important role in various fields such as the study of gene expression [1], protein interactions [2], neuroscience [3], image processing [4], sociology [5] and even grid science [6, 7].\nThe origin of the GM reconstruction problem is traced back to the seminal 1968 paper by Chow and Liu [8], where the problem was posed and resolved for the special case of tree-structured GMs. In this special tree case the maximum likelihood estimator is tractable and is tantamount to finding a maximum weighted spanning-tree. However, it is also known that in the case of general graphs with cycles, maximum likelihood estimators are intractable as they require computation of the partition function of the underlying GM, with notable exceptions of the Gaussian GM, see for instance [9], and some other special cases, like planar Ising models without magnetic field [10].\nA lot of efforts in this field has focused on learning Ising models, which are the most general GMs over binary variables with pairwise interaction/factorization. Early attempts to learn the\nar X\niv :1\n60 5.\n07 25\n2v 1\n[ cs\n.L G\n] 2\nIsing model structure efficiently were heuristic, based on various mean-field approximations, e.g. utilizing empirical correlation matrices [11, 12, 13, 14]. These methods were satisfactory in cases when correlations decrease with graph distance. However it was also noticed that the mean-field methods perform poorly for the Ising models with long-range correlations. This observation is not surprising in light of recent results stating that learning the structure of Ising models using only their correlation matrix is, in general, computationally intractable [15, 16].\nAmong methods that do not rely solely on correlation matrices but take advantage of higherorder correlations that can be estimated from samples, we mention the so-called regularized pseudolikelihood estimator [17]. This estimator, like the one we propose in this paper, is from the class of M-estimators i.e. estimators that are the minimum of a sum of functions over the sampled data. The regularized pseudo-likelihood estimator can be interpreted as a surrogate for the intractable likelihood estimator with an additive `1-norm penalty to encourage sparsity of the reconstructed graph. The estimator offers guarantees for the structure reconstruction, but the result only applies to GMs that satisfy a certain condition that is rather restrictive and hard to verify. It was also proven that this estimator fails to reconstruct the structure of graphs with long-range correlations, even for simple test cases [18].\nPrincipal tractability of structure reconstruction of an arbitrary Ising model from samples was proven only very recently. Bresler, Mossel and Sly in [19] suggested an algorithm which reconstructs the graph without errors in polynomial time. They showed that the algorithm requires number of samples that is logarithmic in the number of variables. Although this algorithm is of a polynomial complexity, it relies on an exhaustive neighborhood search, and the degree of the polynomial is equal to the maximal node degree.\nPrior to the work reported in this manuscript the best known procedure for perfect reconstruction of an Ising model was through a greedy algorithm proposed by Bresler in [20]. Bresler’s algorithm is based on the observation that the mutual information between neighboring nodes in an Ising model is lower bounded. This observation allows to reconstruct the Ising graph perfectly with only a logarithmic number of samples and in time quasi-quadratic in the number of variables. On the other hand, Bresler’s algorithm suffers from two major practical limitations. First, the number of samples, hence the running time as well, scales double exponentially with respect to the largest node degree and with respect to the largest coupling intensity between pairs of variables. This scaling is rather far from the information-theoretic lower-bound reported in [21] predicting instead a single exponential dependency on the two aforementioned quantities. Second, Bresler’s algorithm requires prior information on the maximum and minimum coupling intensities as well as on the maximum node degree, guarantees which, in reality, are not necessarily available.\nIn this paper we propose a novel estimator for the graph structure of an arbitrary Ising model which achieves perfect reconstruction in quasi-quartic time (although we believe it can be reduced to quasi-quadratic time) and with a number of samples logarithmic in the system size. The algorithm is near-optimal in the sense that the number of samples required to achieve perfect reconstruction, and the run time, scale exponentially with respect to the maximum node-degree and the maximum coupling intensity, thus matching parametrically the information-theoretic lower bound of [21]. Our statistical estimator has the structure of a consistent M-estimator [22] and is implemented via convex optimization. Moreover it allows intuitive interpretation in terms of what we coin the “interaction screening”. We show that with a proper `1-regularization our estimator reconstructs couplings of an Ising model from a number of samples that is near-optimal (in the sense of comparison with the information-theoretic bound). In addition, our estimator does not rely on prior information on the model characteristics, such as maximum coupling intensity and maximum degree.\nThe rest of the paper is organized as follows. In Section 2 we give a precise definition of the structure estimation problem for the Ising models and we describe in detail our method for structure reconstruction within the family of Ising models. The main results related to the reconstruction guarantees are provided by Theorem 1 and Theorem 2. In Section 3 we explain the strategy and the sequence of steps that we use to prove our main theorems. Proofs of Theorem 1 and Theorem 2 are summarized at the end of this Section. Section 4 illustrates performance of our reconstruction algorithm via simulations. Here we show on a number of test cases that the sample complexity of the suggested method scales logarithmically with the number of variables and exponentially with the maximum coupling intensity. In Section 5 we discuss possible generalizations of the algorithm and future work."
    }, {
      "heading" : "2 Main Results",
      "text" : "Consider a graph G = (V,E) with p vertexes where V = {1, . . . , p} is the vertex set and E ⊂ V ×V is the undirected edge set. Vertexes i ∈ V are associated with binary random variables σi ∈ {−1,+1} that are called spins. Edges (i, j) ∈ E are associated with non-zero real parameters θ∗ij 6= 0 that are called couplings. An Ising model is a probability distribution µ over spin configurations σ = {σ1, . . . , σp} that reads as follows:\nµ (σ) = 1\nZ exp  ∑ (i,j)∈E θ∗ijσiσj  , (1) where Z is a normalization factor called the partition function.\nZ = ∑ σ exp  ∑ (i,j)∈E θ∗ijσiσj  . (2) Notice that even though the main innovation of this paper – the efficient “interaction screening\" estimator – can be constructed for the most general Ising models, we restrict our attention in this paper to the special case of the Ising models with zero magnetic field. This simplification is not necessary and is done solely to simplify (generally rather bulky) algebra. Later in the text we will thus refer to the zero magnetic field model (2) simply as the Ising model."
    }, {
      "heading" : "2.1 Structure-Learning of Ising Models",
      "text" : "Suppose that n sequences/samples of p spins { σ(k) } k=1,...,n are observed. Let us assume that each\nobserved spin configuration σ(k) = { σ (k) 1 , . . . , σ (k) p } is i.i.d. from (1). Based on these measure-\nments/samples we aim to construct an estimator Ê of the edge set that reconstructs the structure exactly with high probability, i.e. P [ Ê = E ] = 1− , (3)\nwhere ∈ ( 0, 12 ) is a prescribed reconstruction error.\nWe are interested to learn structures of Ising models in the high-dimensional regime where the number of observations/samples is of the order n = O (ln p). A necessary condition on the number\nof samples is given in [21, Thm. 1]. This condition depends explicitly on the smallest and largest coupling intensity\nα := min (i,j)∈E\n|θ ∗ |, β := max\n(i,j)∈E |θ\n∗ |, (4)\nand on the maximal node degree d := max\ni∈V |∂i| , (5)\nwhere the set of neighbors of a node i ∈ V is denoted by ∂i := {j | (i, j) ∈ E}. According to [21], in order to reconstruct the structure of the Ising model with minimum coupling intensity α, maximum coupling intensity β, and maximum degree d, the required number of samples should be at least\nn ≥ max\neβd ln ( pd 4 − 1 ) 4dαeα , ln p 2α tanhα  . (6) We see from Eq. (6) that the exponential dependence on the degree and the maximum coupling intensity are both unavoidable. Moreover, when the minimal coupling is small, the number of samples should scale at least as α−2.\nIt remains unknown if the inequality (6) is achievable. It is shown in [21, Thm. 3] that there exists a reconstruction algorithm with error probability ∈ ( 0, 12 ) if the number of samples is greater than\nn ≥\n( βd ( 3e2βd + 1 ) sinh2 (α/4) )2 (16 log p+ 4 ln (2/ )) . (7)\nUnfortunately, the existence proof presented in [21] is non-constructive and thus it does not guarantee actual existence of an algorithm with low computational complexity. Notice also that the number of samples in (7) scales as exp (4βd) when d and β are asymptotically large and as α−4 when α is asymptotically small."
    }, {
      "heading" : "2.2 Regulrized Interaction Screening Estimator",
      "text" : "The main contribution of this paper consists in presenting explicitly a structure-learning algorithm that is of low complexity and which is near-optimal with respect to bounds (6) and (7). Our algorithm reconstructs the structure of the Ising model exactly, as stated in Eq. (3), with an error probability ∈ ( 0, 12 ) , and with a number of samples which is proportional to exp (6βd) and α−2. (See Theorem 1 and Theorem 2 below for mathematically accurate statements.) Our algorithm consists of two steps. First, we estimate couplings in the vicinity of every node. Then, on the second step, we threshold the estimated couplings that are sufficiently small to zero. Resulting zero coupling means that the corresponding edge is not present.\nDenote the set of couplings around node u ∈ V by the vector θ∗u ∈ Rp−1. In this, slightly abusive notation, we use the convention that if a coupling is equal to zero it reads as absence of the edge, i.e. θ∗ui = 0 if and only if (u, i) /∈ E. Note that if the node degree is bounded by d, it implies that the vector of couplings θ∗u is non-zero in at most d entries.\nOur estimator for couplings around node u ∈ V is based on the following loss function coined the Interaction Screening Objective (ISO):\nSn (θu) = 1\nn n∑ k=1 exp − ∑ i∈V \\u θuiσ (k) u σ (k) i  . (8)\nThe objective of the ISO is inversely proportional to the corresponding factor in the distribution (1). As a result, the effect of the objective is to reweight the distribution in a way that the spin σu becomes independent of the rest; i.e., the dependencies of σu on the rest of the spins are completely “screened\", which explains our choice for the name of the loss function. This remarkable “screening\" feature of the ISO suggests the following choice of the Regularized Interaction Screening Estimator (RISE) for the interaction vector around node u:\nθ̂u (λ) = argmin θu∈Rp−1 Sn (θu) + λ ‖θu‖1 , (9)\nwhere λ > 0 is a tunable parameter promoting sparsity through the additive `1-penalty. Notice that the ISO is the empirical average of an exponential function of θu which implies it is convex. Moreover, addition of the `1-penalty preserves the convexity of the minimization objective in Eq. (9).\nAs expected, the performance of RISE does depend on the choice of the penalty parameter λ. If λ is too small θ̂u (λ) is too sensitive to statistical fluctuations. On the other hand, if λ is too large θ̂u (λ) has too much of a bias towards zero. In general, the optimal value of λ is hard to guess. Luckily, the following theorem provides strong guarantees on the square error for the case when λ is chosen to be sufficiently large.\nTheorem 1 (Square Error of RISE). Let { σ(k) } k=1,...,n\nbe n realizations of p spins drawn i.i.d. from an Ising model with maximum degree d and maximum coupling intensity β. Then for any node u ∈ V and for any 1 > 0, the square error of the Regularized Interaction Screening Estimator (9) with penalty parameter λ ≥ 4 √ ln(3p/ 1)\nn is bounded with probability at least 1− 1 by\n∥∥∥θ̂u (λ)− θ∗u∥∥∥ 2 ≤ 48d (1 + d) e3βd √ ln 3p 1 n , (10)\nwhenever n ≥ (9d)5 e6βd ln 3p 1 .\nOur structure estimator (for the second step of the algorithm), Structure-RISE, takes RISE output and thresholds couplings whose absolute value is less than α/2 to zero:\nÊ (λ, α) = { (i, j) ∈ V × V | θ̂ij (λ) + θ̂ji (λ) ≥ α } . (11)\nPerformance of the Structure-RISE is fully quantified by the following Theorem. Theorem 2 (Structure Learning of Ising Models). Let { σ(k) } k=1,...,n\nbe n realizations of p spins drawn i.i.d. from an Ising model with maximum degree d, maximum coupling intensity β and minimal coupling intensity α. Then for any 2 > 0, Structure-RISE with penalty parameter λ ≥ 4 √\nln(3p2/ 2) n reconstructs the edge-set perfectly with probability\nP ( Ê (λ, α) = E ) ≥ 1− 2, (12)\nwhenever n ≥ max ( 1, α−2 ) (9d) 5 e6βd ln 3p 2\n2 .\nProofs of Theorem 1 and Theorem 2 are given in Subsection 3.3. Theorem 1 states that RISE recovers not only the structure but also the correct value of the couplings up to an error based on the available samples. It is possible to improve the square-error bound (10) even further by first, running the Structure-RISE to recover edges, and then re-running RISE with λ = 0 for the remaining non-zero couplings.\nThe computational complexity of RISE is tantamount to minimizing the convex objective function and, as such, it scales at most as O ( np3 ) . Therefore, computational complexity of the\nStructure-RISE scales at most as O ( np4 ) simply because one has to call RISE at every node. We believe that this running time estimate can actually be reduced to a quasi-quadratic one by using first-order minimization techniques, in the spirit of [23].\nNotice that in order to implement RISE there is no need for prior knowledge on the graph parameters. This is a considerable advantage in practical applications where the maximum degree or bounds on couplings is often unknown."
    }, {
      "heading" : "3 Analysis",
      "text" : "The Regularized Interaction Screening Estimator (9) is from the class of the so-called regularized M-estimators. Naghaband et al. proposed in [22] a framework to analyze the square error of such estimators. As per [22], enforcing only two conditions on the loss function is sufficient to get a handle on the square error of an `1-regularized M-estimator.\nThe first condition links the choice of the penalty parameter to the gradient of the objective function.\nCondition 1. The `1-penalty parameter strongly enforces regularization if it is greater than any partial derivatives of the objective function at θu = θ∗u, i.e.\nλ ≥ 2 ‖∇Sn (θ∗u)‖∞ . (13)\nCondition 1 guarantees that if the vector of couplings θ∗u has at most d non-zero entries, then the estimation difference θ̂u (λ)− θ ∗ u lies within the set\nK := { ∆ ∈ Rp−1 | ‖∆‖1 ≤ 4 √ d ‖∆‖2 } . (14)\nThe second condition ensure that the objective function is strongly convex in a restricted subset of Rp−1. Denote the reminder of the first-order Taylor expansion of the objective function by\nδSn (∆u, θ∗u) := Sn (θ∗u + ∆u)− Sn (θ∗u)− 〈∇Sn (θ∗u) ,∆u〉 , (15)\nwhere ∆u ∈ Rp−1 is an arbitrary vector. Then the second condition reads as follows.\nCondition 2. The objective function is strongly convex at θu = θ∗u restricted to K on a neighborhood of radius R, if for all ∆u ∈ K such that ‖∆u‖2 ≤ R, there exists a constant κ > 0 such that\nδSn (∆u, θ∗u) ≥ κ ‖∆u‖ 2 2 . (16)\nStrong regularization and restricted strong convexity enables us to control that the minimizer θ̂u of the full objective (9) lies in the vicinity of the sparse vector of parameters θ∗u. The precise formulation is given in the proposition following from [22, Thm. 1].\nProposition 1. If the `1-regularized M-estimator of the form (9) satisfies Condition 1 and Condition 2 with R > 3dλκ then the square-error is bounded by∥∥∥θ̂u − θ∗u∥∥∥\n2 ≤ 3dλ κ . (17)"
    }, {
      "heading" : "3.1 Gradient Concentration",
      "text" : "Like the ISO (8), its gradient in any component l ∈ V \\ u is an empirical average\n∂\n∂θul Sn (θu) =\n1\nn n∑ k=1 X (k) ul (θu) , (18)\nwhere the random variables X(k)ul (θu) are i.i.d and they are related to the spin configurations according to\nXul (θu) = −σuσl exp − ∑ i∈V \\u θuiσuσi  . (19) In order to prove that the ISO gradient concentrates we have to state few properties of the support, the mean and the variance of the random variables (19), expressed in the following three Lemmas.\nThe first of the Lemmas states that at θu = θ ∗ u, the random variable Xul (θ ∗ u) has zero mean.\nLemma 1. For any Ising model with p spins and for all l 6= u ∈ V\nE [Xul (θ∗u)] = 0. (20)\nProof. By direct computation, we find that\nE [Xul (θ∗u)] = E [ −σuσl exp ( − ∑ i∈∂u θ∗uiσuσi )]\n= −1 Z ∑ σ σuσl exp  ∑ (i,j)∈E θ∗ijσiσj − ∑ i∈∂u θ∗uiσuσi  = 0, (21) where in the last line we use the fact that the exponential terms involving σu cancel, implying that the sum over σu ∈ {−1,+1} is zero.\nAs a direct corollary of the Lemma 1, θu = θ ∗ u is always a minimum of the averaged ISO (8). The second Lemma proves that at θu = θ ∗ u, the random variable Xul (θ ∗ u) has a variance equal\nto one.\nLemma 2. For any Ising model with p spins and for all l 6= u ∈ V\nE [ Xul (θ ∗ u) 2 ] = 1. (22)\nProof. As a result of direct evaluation one derives\nE [ Xul (θ ∗ u) 2 ] = E [ exp ( −2 ∑ i∈∂u θ∗uiσuσi )]\n= 1\nZ ∑ σ exp  ∑ (i,j)∈E,i,j 6=u θ∗ijσiσj − ∑ i∈∂u θ∗uiσuσi  = 1\nZ ∑ σ exp  ∑ (i,j)∈E,i,j 6=u θ∗ijσiσj + ∑ i∈∂u θ∗uiσuσi  = 1. (23)\nNotice that in the second line the first sum over edges (under the exponential) does not depend on σu. Furthermore, the first sum is invariant under the change of variables, σu → −σu, while the second sum changes sign. This transformation results in appearance of the partition function in the numerator.\nThe next lemma states that at θu = θ ∗ u, the random variable Xul (θ ∗ u) has a bounded support.\nLemma 3. For any Ising model with p spins, with maximum degree d and maximum coupling intensity β, we guarantee that for all l 6= u ∈ V\n|Xul (θ∗u)| ≤ exp (βd) . (24)\nProof. Observe that components of θ∗u are smaller than β and at most d of them are non-zero. Recall that spins are binary, {−1,+1}, which results in the following estimate\n|Xul (θ∗u)| = ∣∣∣∣∣−σuσi exp ( − ∑ i∈∂u θ∗uiσuσi )∣∣∣∣∣ ≤ exp\n( − ∑ i∈∂u θ∗uiσuσi ) ≤ exp (βd) . (25)\nWith Lemma 1, 2 and 3, and using Berstein’s inequality we are now in position to prove that every partial derivative of the ISO concentrates uniformly around zero as the number of samples grows.\nLemma 4. For any Ising model with p spins, with maximum degree d and maximum coupling intensity β. For any 3 > 0, if the number of observation satisfies n ≥ exp (2βd) ln 2p 3 , then the following bound holds with probability at least 1− 3:\n‖∇Sn (θ∗u)‖∞ ≤ 2 √ ln 2p 3 n . (26)\nProof. Let us first show that every term is individually bounded by the RHS of (26) with highprobability. We further use the union bound to prove that all components are uniformly bounded with high-probability. Utilizing Lemma 1, Lemma 2 and Lemma 3 we apply the Bernstein’s Inequality\nP [∣∣∣∣ ∂∂θulSn (θ∗u) ∣∣∣∣ > t] ≤ 2 exp(− 12 t2n1 + 13 exp (βd) t ) . (27)\nInverting the following relation\ns = 1 2 t 2n\n1 + 13 exp (βd) t , (28)\nand substituting the result in the Eq. (27) one derives\nP [∣∣∣∣ ∂∂θulSn (θ∗u) ∣∣∣∣ > 13 ( u+ √ 18 exp (βd) u+ u2 )] ≤ 2 exp (−s) , (29)\nwhere u = sn exp (βd) . When n ≥ s exp (2βd) Eq. (29) can be simplified to become independent of β and d\nP [∣∣∣∣ ∂∂θulSn (θ∗u) ∣∣∣∣ > 2√ sn ] ≤ 2 exp (−s) . (30)\nUsing s = ln 2p 3 and the union bound on every component of the gradient leads to the desired result."
    }, {
      "heading" : "3.2 Restricted Strong-Convexity",
      "text" : "The remainder of the first-order Taylor-expansion of the ISO, defined in Eq. (15) reads\nδSn (∆u, θ∗) = 1\nn n∑ k=1 exp ( − ∑ i∈∂u θ∗uiσ (k) u σ (k) i )( exp ( −Y (k)u (∆u) ) − 1 + Y (k)u (∆u) ) , (31)\nwhere the random variables Y (k)u (∆u) are i.i.d and are related to the spin configurations according to\nYu (∆u) = ∑ i∈V \\u ∆uiσuσi. (32)\nIn order to prove that the reminder of Eq. (31) is lower bounded by a quadratic form we show a few properties of the relevant random variables in (32). The following Lemma provides a lower bound on the second moment of (32).\nLemma 5. Consider an Ising model with p spins, with maximum degree d and maximum coupling intensity β. For all ∆u ∈ Rp−1 the following bound holds\nE [ Yu (∆u) 2 ] ≥ e −2βd\nd+ 1 ‖∆u‖22 . (33)\nProof. Our proof strategy here follows [16, Cor. 3.1]. Notice that the probability measure of the Ising model is symmetric with respect to the sign flip, i.e. µ (σ1, . . . , σp) = µ (−σ1, . . . ,−σp). Thus any spin has zero mean, which implies that for every ∆u ∈ Rp−1\nE  ∑ i∈V \\u ∆uiσi  = 0. (34) This allows to reinterpret (33) as a variance, using that σ2u = 1,\nE [ Yu (∆u) 2 ] = E   ∑ i∈V \\u ∆uiσi 2 \n= Var  ∑ i∈V \\u ∆uiσi  . (35) Construct a subset A ⊂ V recursively as follows: (i) let i0 = argmaxj∈V \\u ∆2uj and define A0 = {i0}, (ii) given At = {i0, . . . , it}, let it+1 = argmaxj∈Act∩V \\u ∆ 2 uj and set At+1 = At ∪ {it+1} and, (iii) terminate when V \\ u ∪Act = ∅ and declare A = At. The set A possesses the following two main properties. First, every node i ∈ A does not have any neighbors in A and, second, ∑ i∈A ∆2ui ≥ (d+ 1) ∑ i∈V \\u ∆2ui. (36)\nWe apply the law of total variance to (35) by conditioning on the set of spins σAc whose indexes are from the complementary set Ac.\nVar  ∑ i∈V \\u ∆uiσi  ≥ E Var  ∑ i∈V \\u ∆uiσi | σAc  =\n∑ i∈A ∆2uiE [Var [σi | σAc ]] , (37)\nwhere in the last line one uses that the spins in A are conditionally independent given their neighbors σAc . One concludes the proof by using relation (36) and the fact that the conditional variance of a spin given its neighbors are bounded from below:\nVar [σi | σAc ] ≥ 1− tanh 2 ∑ j∈∂i θ∗ijσj  ≥ exp (−2βd) . (38)\nThe following lemma proves a concentration property for the remainder of the Taylor expansion.\nLemma 6. Consider an Ising model with p spins, with maximum degree d and maximum coupling intensity β. For all ∆u ∈ Rp−1 and for all 4 > 0, the remainder of the Taylor expansion (31) satisfies with probability at least 1− 4, the following inequality\nδSn (∆u, θ∗u) ≥ e−3βd\n2 (d+ 1) ‖∆u‖22 − √ ln 1 4 n ( 1 + 1 3 ‖∆u‖1 ) ‖∆u‖21 , (39)\nwhenever n ≥ exp (2βd) ln 1 4 .\nProof. This concentration property is based on the Bernstein’s inequality. First of all, observe that for all z ∈ R, the following bound holds\ne−z + 1 + z ≥ 1 2 z2 − 1 6 z3. (40)\nThis implies that the remainder of the Taylor expansion (31) is lower-bounded\nδSn (∆u, θ∗u) ≥ 1\nn n∑ k=1 exp ( − ∑ i∈∂u θ∗uiσuσi )( 1 2 Y (k)u (∆u) 2 − 1 6 Y (k)u (∆u) 3 ) . (41)\nUsing similar arguments than in Lemma 1 it is easy to show that for all ∆ ∈ Rp−1\nE [ exp ( − ∑ i∈∂u θ∗uiσuσi ) Yu (∆u) 3 ] = 0. (42)\nThen extending the technique of the type used in Lemma 2, one shows that for every integer l ∈ N\nE [ exp ( − ∑ i∈∂u θ∗uiσuσi ) Yu (∆u) l ] ≤ |Yu (∆u)|l . (43)\nNotice also that the support of Yu (∆u) is trivially upper bounded for all ∆u ∈ Rp−1\n|Yu (∆u)| ≤ ‖∆u‖1 . (44)\nTo finish the proof we apply the Bernstein’s inequality to the right-hand side of (41), thus combining relations (42), (43), (44) and Lemma 5. Moreover when n ≥ e2βd ln 1 4 further simplifications can be made in the way similar the one used in Lemma 4.\nWe are now in the position to prove that the ISO satisfies the the restricted strong convexity condition.\nLemma 7. Consider an Ising model with p spins, with maximum degree d and maximum coupling intensity β. For all 4 > 0, when n ≥ (9d)5 e6βd ln 1 4 the ISO (8) satisfies, with probability at least 1− 4, the restricted strong convexity condition\nδSn (∆u, θ∗u) ≥ e−3βd\n4 (d+ 1) ‖∆u‖22 , (45)\nfor all ∆u ∈ Rp−1 such that ‖∆u‖1 ≤ 4 √ d ‖∆u‖2 and ‖∆u‖2 ≤ 1. Proof. We prove it applying Lemma 6 directly to ‖∆u‖1 ≤ 4 √ d ‖∆u‖2 and ‖∆u‖2 ≤ 1 when n ≥ (9d)5 e6βd ln 1 4 ."
    }, {
      "heading" : "3.3 Proof of the main Theorems",
      "text" : "Proof of Theorem 1 (Square Error of RISE). We seek to apply Proposition 1 to the Regularized\nInteraction Screening Estimator (9). Using 3 = 2 13 in Lemma 4 and letting λ ≥ 4 √ ln 3p/ 1 n , it follows that Condition 1 is satisfied with probability greater than 1 − 2 1/3, whenever n ≥ (9d)\n5 e6βd ln 3p 1 . Using 4 = 1/3 in Lemma 7, and observing that 3dλ ( e−3βd\n4(d+1)\n)−1 ≤ 1,\nfor n ≥ (9d)5 e6βd ln p 1 , we conclude that condition 2 is satisfied with probability greater than 1− 13 . Theorem 1 then follows by using a union bound and then applying Proposition 1.\nThe proof of Theorem 2 becomes an immediate application of Theorem 1.\nProof of Theorem 2 (Structure Learning of Ising Models). According to Theorem 1, one observes that, with probability 1 − 1, the minimal amount of samples required to achieve an error of α/2 on every couplings around a single node is\nn ≥ max ( 1, α−2 ) (9d) 5 e6βd ln 3p\n1 .\nLet us choose 2 = 1/p and use the union-bound to ensure that the couplings at every node (thresholded by α/2) is simultaneously recovered with probability greater than 1− 2."
    }, {
      "heading" : "4 Numerical Results",
      "text" : "We test performance of the Struct-RISE, with the strength of the l1-regularization parametrized\nby λ = 4 √\nln(3p2/ ) n , on Ising models over two-dimensional grid with periodic boundary conditions\n(thus degree of every node in the graph is 4). We are interested to find the minimal number of samples, nmin, such that the graph is perfectly reconstructed with probability 1 − ≥ 0.95. In our numerical experiments, we recover the value of nmin as the minimal n for which Struct-RISE outputs the perfect structure 45 times from 45 different trials with n samples, thus guaranteeing that the probability of perfect reconstruction is greater than 0.95 with a statistical confidence of ≈ 90%.\nWe first verify the logarithmic scaling of nmin with respect to the number of spins p. The couplings are chosen uniform and positive θ∗ij = 0.7. This choice ensures that samples generated by Glauber dynamics are i.i.d. according to (1). Values of nmin for p ∈ {9, 16, 25, 36, 49, 64} are shown on the left in Figure 1. Empirical scaling is, ≈ 1.1 × 105 ln p, which is orders of magnitude better than the rather conservative prediction of the theory, 4.9× 1015 ln p.\nWe also test the exponential scaling of nmin with respect to the maximum coupling intensity β. The test is conducted over two different settings both with p = 16 spins: the ferromagnetic case where all couplings are uniform and positive, and the spin glass case where the sign of couplings is assigned uniformly at random. In both cases the absolute value of the couplings,\n∣∣θ∗ij∣∣, is uniform and equal to β. To ensure that the samples are i.i.d, we sample directly from the exhaustive weighted list of the 216 possible spin configurations.\nExperimental values of nmin for different values of the maximum coupling intensity, β, are shown on the right in Fig. 1. Empirically observed exponential dependence on β is matched best by,\nexp (12.8β), in the ferromagnetic case and by, exp (5.6β), in the case of the spin glass. Theoretical bound for d = 4 predicts exp (24β). We observe that the difference in sample complexity depends significantly on the type of interaction. An interesting observation one can make based on these experiments is that the case which is harder from the sample-generating perspective is easier for learning and vice verse."
    }, {
      "heading" : "5 Conclusions and Path Forward",
      "text" : "In this paper we construct and analyze the Regularized Interaction Screening Estimator (9). We show that the estimator is computationally efficient and needs an optimal number of samples for learning Ising models. The RISE estimator does not require any prior knowledge about the model parameters for implementation and it is based on the minimization of the loss function (8), that we call the Interaction Screening Objective. The ISO is an empirical average (over samples) of an objective designed to screen an individual spin/variable from its factor-graph neighbors.\nEven though we focus in this paper solely on learning pair-wise binary models, the “interaction screening” approach we introduce here is generic. The approach extends to learning other Graphical Models, including those over higher (discrete, continuous or mixed) alphabets and involving highorder (beyond pair-wise) interactions. These generalizations are built around the same basic idea pioneered in this paper – the interaction screening objective is (a) minimized over candidate GM parameters at the actual values of the parameters we aim to learn; and (b) it is an empirical average over samples. In the future, we plan to explore further theoretical and experimental power, characteristics and performance of the generalized screening estimator."
    }, {
      "heading" : "Acknowledgment",
      "text" : "We are thankful to Guy Bresler and Andrea Montanari for valuable discussions, comments and insights. This work was carried out under the auspices of the National Nuclear Security Administration of the U.S. Department of Energy at Los Alamos National Laboratory under Contract No. DE-AC52-06NA25396, and was partially supported by DTRA Basic Research Project #10027- 13399 and by the Advanced Grid Modeling Program in the U.S. Department of Energy Office of Electricity."
    } ],
    "references" : [ {
      "title" : "Wisdom of crowds for robust gene network inference",
      "author" : [ "D. Marbach", "J.C. Costello", "R. Kuffner", "N.M. Vega", "R.J. Prill", "D.M. Camacho", "K.R. Allison", "M. Kellis", "J.J. Collins", "G. Stolovitzky" ],
      "venue" : "Nat Meth, vol. 9, pp. 796–804, Aug 2012.",
      "citeRegEx" : "1",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Direct-coupling analysis of residue coevolution captures native contacts across many protein families",
      "author" : [ "F. Morcos", "A. Pagnani", "B. Lunt", "A. Bertolino", "D.S. Marks", "C. Sander", "R. Zecchina", "J.N. Onuchic", "T. Hwa", "M. Weigt" ],
      "venue" : "Proceedings of the National Academy of Sciences, vol. 108, no. 49, pp. E1293–E1301, 2011.",
      "citeRegEx" : "2",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Weak pairwise correlations imply strongly correlated network states in a neural population",
      "author" : [ "E. Schneidman", "M.J. Berry", "R. Segev", "W. Bialek" ],
      "venue" : "Nature, vol. 440, pp. 1007–1012, Apr 2006.",
      "citeRegEx" : "3",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Fields of experts: a framework for learning image priors",
      "author" : [ "S. Roth", "M.J. Black" ],
      "venue" : "Computer Vision and Pattern Recognition, 2005. CVPR 2005. IEEE Computer Society Conference on, vol. 2, pp. 860–867 vol. 2, June 2005.",
      "citeRegEx" : "4",
      "shortCiteRegEx" : null,
      "year" : 2005
    }, {
      "title" : "Inferring friendship network structure by using mobile phone data",
      "author" : [ "N. Eagle", "A.S. Pentland", "D. Lazer" ],
      "venue" : "Proceedings of the National Academy of Sciences, vol. 106, no. 36, pp. 15274– 15278, 2009.",
      "citeRegEx" : "5",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "A dependency graph approach for fault detection and localization towards secure smart grid",
      "author" : [ "M. He", "J. Zhang" ],
      "venue" : "IEEE Transactions on Smart Grid, vol. 2, pp. 342–351, June 2011.",
      "citeRegEx" : "6",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Structure learning and statistical estimation in distribution networks",
      "author" : [ "D. Deka", "S. Backhaus", "M. Chertkov" ],
      "venue" : "submitted to IEEE Control of Networks; arXiv:1501.04131; arXiv:1502.07820, 2015.",
      "citeRegEx" : "7",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Approximating discrete probability distributions with dependence trees",
      "author" : [ "C. Chow", "C. Liu" ],
      "venue" : "IEEE Transactions on Information Theory, vol. 14, pp. 462–467, May 1968.",
      "citeRegEx" : "8",
      "shortCiteRegEx" : null,
      "year" : 1968
    }, {
      "title" : "First-order methods for sparse covariance selection",
      "author" : [ "A. d’Aspremont", "O. Banerjee", "L.E. Ghaoui" ],
      "venue" : "SIAM Journal on Matrix Analysis and Applications, vol. 30, no. 1, pp. 56–66, 2008.",
      "citeRegEx" : "9",
      "shortCiteRegEx" : null,
      "year" : 2008
    }, {
      "title" : "Learning planar ising models",
      "author" : [ "J. Johnson", "D. Oyen", "P. Netrapalli", "M. Chertkov" ],
      "venue" : "Journal of Machine Learning, in press; arXiv:1502.00916, 2015.",
      "citeRegEx" : "10",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Mean-field theory of Boltzmann machine learning",
      "author" : [ "T. Tanaka" ],
      "venue" : "Phys. Rev. E, vol. 58, pp. 2302– 2310, Aug 1998. 14",
      "citeRegEx" : "11",
      "shortCiteRegEx" : null,
      "year" : 1998
    }, {
      "title" : "Efficient learning in Boltzmann machines using linear response theory",
      "author" : [ "H.J. Kappen", "F. d. B. Rodríguez" ],
      "venue" : "Neural Computation, vol. 10, no. 5, pp. 1137–1156, 1998.",
      "citeRegEx" : "12",
      "shortCiteRegEx" : null,
      "year" : 1998
    }, {
      "title" : "Ising model for neural data: Model quality and approximate methods for extracting functional connectivity",
      "author" : [ "Y. Roudi", "J. Tyrcha", "J. Hertz" ],
      "venue" : "Phys. Rev. E, vol. 79, p. 051915, May 2009.",
      "citeRegEx" : "13",
      "shortCiteRegEx" : null,
      "year" : 1915
    }, {
      "title" : "The Bethe approximation for solving the inverse Ising problem: a comparison with other inference methods",
      "author" : [ "F. Ricci-Tersenghi" ],
      "venue" : "Journal of Statistical Mechanics: Theory and Experiment, vol. 2012, no. 08, p. P08015, 2012.",
      "citeRegEx" : "14",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Hardness of parameter estimation in graphical models",
      "author" : [ "G. Bresler", "D. Gamarnik", "D. Shah" ],
      "venue" : "Advances in Neural Information Processing Systems 27 (Z. Ghahramani, M. Welling, C. Cortes, N. D. Lawrence, and K. Q. Weinberger, eds.), pp. 1062–1070, Curran Associates, Inc., 2014.",
      "citeRegEx" : "15",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Computational implications of reducing data to sufficient statistics",
      "author" : [ "A. Montanari" ],
      "venue" : "Electron. J. Statist., vol. 9, no. 2, pp. 2370–2390, 2015.",
      "citeRegEx" : "16",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "High-dimensional Ising model selection using `1-regularized logistic regression",
      "author" : [ "P. Ravikumar", "M.J. Wainwright", "J.D. Lafferty" ],
      "venue" : "Ann. Statist., vol. 38, pp. 1287–1319, 06 2010.",
      "citeRegEx" : "17",
      "shortCiteRegEx" : null,
      "year" : 2010
    }, {
      "title" : "Which graphical models are difficult to learn",
      "author" : [ "A. Montanari", "J.A. Pereira" ],
      "venue" : "Advances in Neural Information Processing Systems 22 (Y. Bengio, D. Schuurmans, J. D. Lafferty, C. K. I. Williams, and A. Culotta, eds.), pp. 1303–1311, Curran Associates, Inc., 2009.",
      "citeRegEx" : "18",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "Reconstruction of Markov random fields from samples: Some observations and algorithms",
      "author" : [ "G. Bresler", "E. Mossel", "A. Sly" ],
      "venue" : "SIAM Journal on Computing, vol. 42, no. 2, pp. 563–578, 2013.",
      "citeRegEx" : "19",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Efficiently learning Ising models on arbitrary graphs",
      "author" : [ "G. Bresler" ],
      "venue" : "Proceedings of the Forty- Seventh Annual ACM on Symposium on Theory of Computing, pp. 771–782, ACM, 2015.",
      "citeRegEx" : "20",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Information-theoretic limits of selecting binary graphical models in high dimensions",
      "author" : [ "N.P. Santhanam", "M.J. Wainwright" ],
      "venue" : "IEEE Transactions on Information Theory, vol. 58, pp. 4117– 4134, July 2012.",
      "citeRegEx" : "21",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "A unified framework for highdimensional analysis of M -estimators with decomposable regularizers",
      "author" : [ "S.N. Negahban", "P. Ravikumar", "M.J. Wainwright", "B. Yu" ],
      "venue" : "Statist. Sci., vol. 27, pp. 538–557, 11 2012.",
      "citeRegEx" : "22",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Fast global convergence of gradient methods for high-dimensional statistical recovery",
      "author" : [ "A. Agarwal", "S. Negahban", "M.J. Wainwright" ],
      "venue" : "Ann. Statist., vol. 40, pp. 2452–2482, 10 2012. 15",
      "citeRegEx" : "23",
      "shortCiteRegEx" : null,
      "year" : 2012
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "Unsurprisingly, GM reconstruction plays an important role in various fields such as the study of gene expression [1], protein interactions [2], neuroscience [3], image processing [4], sociology [5] and even grid science [6, 7].",
      "startOffset" : 113,
      "endOffset" : 116
    }, {
      "referenceID" : 1,
      "context" : "Unsurprisingly, GM reconstruction plays an important role in various fields such as the study of gene expression [1], protein interactions [2], neuroscience [3], image processing [4], sociology [5] and even grid science [6, 7].",
      "startOffset" : 139,
      "endOffset" : 142
    }, {
      "referenceID" : 2,
      "context" : "Unsurprisingly, GM reconstruction plays an important role in various fields such as the study of gene expression [1], protein interactions [2], neuroscience [3], image processing [4], sociology [5] and even grid science [6, 7].",
      "startOffset" : 157,
      "endOffset" : 160
    }, {
      "referenceID" : 3,
      "context" : "Unsurprisingly, GM reconstruction plays an important role in various fields such as the study of gene expression [1], protein interactions [2], neuroscience [3], image processing [4], sociology [5] and even grid science [6, 7].",
      "startOffset" : 179,
      "endOffset" : 182
    }, {
      "referenceID" : 4,
      "context" : "Unsurprisingly, GM reconstruction plays an important role in various fields such as the study of gene expression [1], protein interactions [2], neuroscience [3], image processing [4], sociology [5] and even grid science [6, 7].",
      "startOffset" : 194,
      "endOffset" : 197
    }, {
      "referenceID" : 5,
      "context" : "Unsurprisingly, GM reconstruction plays an important role in various fields such as the study of gene expression [1], protein interactions [2], neuroscience [3], image processing [4], sociology [5] and even grid science [6, 7].",
      "startOffset" : 220,
      "endOffset" : 226
    }, {
      "referenceID" : 6,
      "context" : "Unsurprisingly, GM reconstruction plays an important role in various fields such as the study of gene expression [1], protein interactions [2], neuroscience [3], image processing [4], sociology [5] and even grid science [6, 7].",
      "startOffset" : 220,
      "endOffset" : 226
    }, {
      "referenceID" : 7,
      "context" : "The origin of the GM reconstruction problem is traced back to the seminal 1968 paper by Chow and Liu [8], where the problem was posed and resolved for the special case of tree-structured GMs.",
      "startOffset" : 101,
      "endOffset" : 104
    }, {
      "referenceID" : 8,
      "context" : "However, it is also known that in the case of general graphs with cycles, maximum likelihood estimators are intractable as they require computation of the partition function of the underlying GM, with notable exceptions of the Gaussian GM, see for instance [9], and some other special cases, like planar Ising models without magnetic field [10].",
      "startOffset" : 257,
      "endOffset" : 260
    }, {
      "referenceID" : 9,
      "context" : "However, it is also known that in the case of general graphs with cycles, maximum likelihood estimators are intractable as they require computation of the partition function of the underlying GM, with notable exceptions of the Gaussian GM, see for instance [9], and some other special cases, like planar Ising models without magnetic field [10].",
      "startOffset" : 340,
      "endOffset" : 344
    }, {
      "referenceID" : 10,
      "context" : "utilizing empirical correlation matrices [11, 12, 13, 14].",
      "startOffset" : 41,
      "endOffset" : 57
    }, {
      "referenceID" : 11,
      "context" : "utilizing empirical correlation matrices [11, 12, 13, 14].",
      "startOffset" : 41,
      "endOffset" : 57
    }, {
      "referenceID" : 12,
      "context" : "utilizing empirical correlation matrices [11, 12, 13, 14].",
      "startOffset" : 41,
      "endOffset" : 57
    }, {
      "referenceID" : 13,
      "context" : "utilizing empirical correlation matrices [11, 12, 13, 14].",
      "startOffset" : 41,
      "endOffset" : 57
    }, {
      "referenceID" : 14,
      "context" : "This observation is not surprising in light of recent results stating that learning the structure of Ising models using only their correlation matrix is, in general, computationally intractable [15, 16].",
      "startOffset" : 194,
      "endOffset" : 202
    }, {
      "referenceID" : 15,
      "context" : "This observation is not surprising in light of recent results stating that learning the structure of Ising models using only their correlation matrix is, in general, computationally intractable [15, 16].",
      "startOffset" : 194,
      "endOffset" : 202
    }, {
      "referenceID" : 16,
      "context" : "Among methods that do not rely solely on correlation matrices but take advantage of higherorder correlations that can be estimated from samples, we mention the so-called regularized pseudolikelihood estimator [17].",
      "startOffset" : 209,
      "endOffset" : 213
    }, {
      "referenceID" : 17,
      "context" : "It was also proven that this estimator fails to reconstruct the structure of graphs with long-range correlations, even for simple test cases [18].",
      "startOffset" : 141,
      "endOffset" : 145
    }, {
      "referenceID" : 18,
      "context" : "Bresler, Mossel and Sly in [19] suggested an algorithm which reconstructs the graph without errors in polynomial time.",
      "startOffset" : 27,
      "endOffset" : 31
    }, {
      "referenceID" : 19,
      "context" : "Prior to the work reported in this manuscript the best known procedure for perfect reconstruction of an Ising model was through a greedy algorithm proposed by Bresler in [20].",
      "startOffset" : 170,
      "endOffset" : 174
    }, {
      "referenceID" : 20,
      "context" : "This scaling is rather far from the information-theoretic lower-bound reported in [21] predicting instead a single exponential dependency on the two aforementioned quantities.",
      "startOffset" : 82,
      "endOffset" : 86
    }, {
      "referenceID" : 20,
      "context" : "The algorithm is near-optimal in the sense that the number of samples required to achieve perfect reconstruction, and the run time, scale exponentially with respect to the maximum node-degree and the maximum coupling intensity, thus matching parametrically the information-theoretic lower bound of [21].",
      "startOffset" : 298,
      "endOffset" : 302
    }, {
      "referenceID" : 21,
      "context" : "Our statistical estimator has the structure of a consistent M-estimator [22] and is implemented via convex optimization.",
      "startOffset" : 72,
      "endOffset" : 76
    }, {
      "referenceID" : 20,
      "context" : "According to [21], in order to reconstruct the structure of the Ising model with minimum coupling intensity α, maximum coupling intensity β, and maximum degree d, the required number of samples should be at least n ≥ max eβd ln ( pd 4 − 1 )",
      "startOffset" : 13,
      "endOffset" : 17
    }, {
      "referenceID" : 20,
      "context" : "Unfortunately, the existence proof presented in [21] is non-constructive and thus it does not guarantee actual existence of an algorithm with low computational complexity.",
      "startOffset" : 48,
      "endOffset" : 52
    }, {
      "referenceID" : 22,
      "context" : "We believe that this running time estimate can actually be reduced to a quasi-quadratic one by using first-order minimization techniques, in the spirit of [23].",
      "startOffset" : 155,
      "endOffset" : 159
    }, {
      "referenceID" : 21,
      "context" : "proposed in [22] a framework to analyze the square error of such estimators.",
      "startOffset" : 12,
      "endOffset" : 16
    }, {
      "referenceID" : 21,
      "context" : "As per [22], enforcing only two conditions on the loss function is sufficient to get a handle on the square error of an `1-regularized M-estimator.",
      "startOffset" : 7,
      "endOffset" : 11
    } ],
    "year" : 2017,
    "abstractText" : "We consider the problem of learning the underlying graph of an unknown Ising model on p spins from a collection of i.i.d. samples generated from the model. We suggest a new estimator that is computationally efficient and requires a number of samples that is near-optimal with respect to previously established information-theoretic lower-bound. Our statistical estimator has a physical interpretation in terms of “interaction screening”. The estimator is consistent and is efficiently implemented using convex optimization. We prove that with appropriate regularization, the estimator recovers the underlying graph using a number of samples that is logarithmic in the system size p and exponential in the maximum coupling-intensity and maximum node-degree.",
    "creator" : "LaTeX with hyperref package"
  }
}