{
  "name" : "1605.07110.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Deep Learning without Poor Local Minima",
    "authors" : [ "Kenji Kawaguchi" ],
    "emails" : [ "kawaguch@mit.edu" ],
    "sections" : [ {
      "heading" : null,
      "text" : "In this paper, we prove a conjecture published in 1989 and also partially address an open problem announced at the Conference on Learning Theory (COLT) 2015. For an expected loss function of a deep nonlinear neural network, we prove the following statements under the independence assumption adopted from recent work: 1) the function is non-convex and non-concave, 2) every local minimum is a global minimum, 3) every critical point that is not a global minimum is a saddle point, and 4) the property of saddle points differs for shallow networks (with three layers) and deeper networks (with more than three layers). Moreover, we prove that the same four statements hold for deep linear neural networks with any depth, any widths and no unrealistic assumptions. As a result, we present an instance, for which we can answer to the following question: how difficult to directly train a deep model in theory? It is more difficult than the classical machine learning models (because of the non-convexity), but not too difficult (because of the nonexistence of poor local minima and the property of the saddle points). We note that even though we have advanced the theoretical foundations of deep learning, there is still a gap between theory and practice."
    }, {
      "heading" : "1 Introduction",
      "text" : "Deep learning has been a great practical success in many fields, including the fields of computer vision, machine learning, and artificial intelligence. In addition to its practical success, theoretical results have shown that deep learning is attractive in terms of its generalization properties (Livni et al., 2014; Mhaskar et al., 2016). That is, deep learning introduces good function classes that may have a low capacity in the VC sense while being able to represent target functions of interest well. However, deep learning requires us to deal with seemingly intractable optimization problems. Typically, training of a deep model is conducted via non-convex optimization. Because finding a global minimum of a general non-convex function is an NP-complete problem (Murty & Kabadi, 1987), a hope is that a function induced by a deep model has some structure that makes the non-convex optimization tractable. Unfortunately, it was shown in 1992 that training a very simple neural network is indeed NP-hard (Blum & Rivest, 1992). In the past, such theoretical concerns in optimization played a major role in shrinking the field of deep learning. That is, many researchers instead favored classical machining learning models (with or without a kernel approach) that require only convex optimization. While the recent great practical successes have revived the field, we do not yet know what makes optimization in deep learning tractable in theory.\nIn this paper, as a step toward establishing the optimization theory for deep learning, we prove a conjecture noted in (Goodfellow et al., 2016) for deep linear networks, and also address an open problem announced in (Choromanska et al., 2015b) for deep nonlinear networks. Moreover, for both the conjecture and the open problem, we prove more general and tighter statements than those previously given.\nar X\niv :1\n60 5.\n07 11\n0v 1\n[ st\nat .M\nL ]\n2 3\nM ay\n2 01"
    }, {
      "heading" : "2 Deep linear neural networks",
      "text" : "Given the absence of a theoretical understanding of deep nonlinear neural networks, Goodfellow et al. (2016) noted that it is beneficial to theoretically analyze the loss functions of simpler models, i.e., linear neural networks. The function class of a linear neural network only contains functions that are linear with respect to inputs. However, their loss functions are non-convex in the weight parameters and thus nontrivial. Saxe et al. (2014) empirically showed that the optimization of deep linear models exhibits similar properties to those of the optimization of deep nonlinear models. Ultimately, for theoretical development, it is natural to start with linear models before working with nonlinear models (Baldi & Lu, 2012), and yet even for linear models, the understanding is scarce when the models become deep."
    }, {
      "heading" : "2.1 Model and notation",
      "text" : "We begin by defining the notation. Let H be the number of hidden layers, and let (X,Y ) be the training data set, with Y ∈ Rdy×m and X ∈ Rdx×m, where m is the number of data points. Here, dy ≥ 1 and dx ≥ 1 are the number of components (or dimensions) of the outputs and inputs, respectively. We denote the model (weight) parameters by W , which consists of parameter matrices corresponding to each layer: WH+1 ∈ Rdy×dH , . . . ,Wk ∈ Rdk×dk−1 , . . . ,W1 ∈ Rd1×dx . Here, dk represents the width of the k-th layer, where the 0-th layer is the input layer and the (H + 1)-th layer is the output layer (i.e., d0 = dx and dH+1 = dy). Let Idk be the dk × dk identity matrix. Let p = min(dH , . . . , d1) be the smallest width of a hidden layer. We denote the (j, i)-th entry of a matrix M by Mj,i. We also denote the j-th row vector of M by Mj,· and the i-th column vector of M by M·,i.\nWe can then write the output of a feedforward deep linear model, Y (W,X) ∈ Rdy×m, as Y (W,X) = WH+1WHWH−1 · · ·W2W1X.\nWe consider one of the most widely used loss functions, squared error loss:\nL̄(W ) = 1 2 m∑ i=1 ‖Y (W,X)·,i − Y·,i‖22 = 1 2 ‖Y (W,X)− Y ‖2F ,\nwhere ‖·‖F is the Frobenius norm. Note that 2m L̄(W ) is the usual mean squared error, for which all of our theorems hold as well, since multiplying L̄(W ) by a constant in W results in an equivalent optimization problem."
    }, {
      "heading" : "2.2 Background",
      "text" : "Recently, Goodfellow et al. (2016) remarked that when Baldi & Hornik (1989) stated and proved Proposition 2.1 for shallow linear networks, they also stated Conjecture 2.2 for deep linear networks.\nProposition 2.1 (Baldi & Hornik, 1989: shallow linear network) Assume that H = 1 (i.e., Y (W,X) = W2W1X), assume that XXT and XY T are invertible, and assume that p < dx, p < dy and dy = dx (e.g., an autoencoder). Then, the loss function L̄(W ) has the following properties:\n(i) It is convex in each matrix W1 (or W2) when the other W2 (or W1) is fixed.\n(ii) Every local minimum is a global minimum.\nConjecture 2.2 (Baldi & Hornik, 1989: deep linear network) Assume the same set of conditions as in Proposition 2.1 except for H = 1. Then, the loss function L̄(W ) has the following properties:\n(i) For any k ∈ {1, . . . ,H + 1}, it is convex in each matrix Wk when for all k′ 6= k, Wk′ is fixed.\n(ii) Every local minimum is a global minimum.\nBaldi & Lu (2012) recently provided a proof for Conjecture 2.2 (i), leaving the proof of Conjecture 2.2 (ii) for future work. They also noted that the case of p ≥ dx = dx is of interest, but requires further analysis, even for a shallow network with H = 1. An informal discussion of Conjecture 2.2 can be found in (Baldi, 1989). In Appendix D in the supplementary material, we provide a more detailed discussion of this subject."
    }, {
      "heading" : "2.3 Results",
      "text" : "We now state our main theoretical results for deep linear networks, which imply Conjecture 2.2 (ii) as well as obtain further information regarding the critical points with more generality.\nTheorem 2.3 (Loss surface of deep linear networks with more generality) Assume that XXT and XY T are full rank. Further, assume that dy ≤ dx. Then, for any depth H ≥ 1 and for any layer widths and any input-output dimensions dy, dH , dH−1, . . . , d1, dx (the widths can arbitrarily differ from each other and from dy and dx), the loss function L̄(W ) has the following properties:\n(i) It is non-convex and non-concave.\n(ii) Every local minimum is a global minimum.\n(iii) Every critical point that is not a global minimum is a saddle point.\n(iv) If rank(WH · · ·W2) = p, then the Hessian at any saddle point has at least one (strictly) negative eigenvalue.1\nCorollary 2.4 (Effect of deepness on the loss surface) Assume the same set of conditions as in Theorem 2.3 and consider the loss function L̄(W ). For three-layer networks (i.e., H = 1), the Hessian at any saddle point has at least one (strictly) negative eigenvalue. In contrast, for networks deeper than three layers (i.e., H ≥ 2), there exist saddle points at which the Hessian does not have any negative eigenvalue.\nThe full rank assumptions on XXT and XY T in Theorem 2.3 are realistic and practically easy to satisfy, as discussed in previous work (e.g., Baldi & Hornik, 1989). In contrast to related previous work (Baldi & Hornik, 1989; Baldi & Lu, 2012), we do not assume the invertibility of XY T , p < dx, p < dy nor dy = dx. In Theorem 2.3, p ≥ dx is allowed, as well as many other relationships among the widths of the layers. Therefore, Theorem 2.3 (ii) implies Conjecture 2.2 (ii) and is more general than Conjecture 2.2 (ii). Moreover, Theorem 2.3 (iv) and Corollary 2.4 provide additional information regarding the important properties of saddle points.\nTheorem 2.3 presents an instance of a deep model that is not too difficult to train with direct greedy optimization, such as gradient-based methods. If there are “bad” local minima with large loss values everywhere, we would have to search the entire space,2 the volume of which increases exponentially with the number of variables. This is a major cause of NP-hardness for non-convex optimization. In contrast, if there are no poor local minima as Theorem 2.3 (ii) states, then saddle points are the remaining concern in terms of tractability.3 Because the Hessian of L̄(W ) is Lipschitz continuous, if the Hessian at a saddle point has a negative eigenvalue, it starts appearing as we approach the saddle point. Thus, Theorem 2.3 and Corollary 2.4 suggest that for 1-hidden layer networks, training can be done in polynomial time with a second order method or even with a modified stochastic gradient decent method, as discussed in (Ge et al., 2015). For deeper networks, Corollary 2.4 states that there exist “bad” saddle points in the sense that the Hessian at the point has no negative eigenvalue. However, from Theorem 2.3 (iv), we know exactly when this can happen, and from the proof of Theorem 2.3, we see that some perturbation is sufficient to escape such bad saddle points."
    }, {
      "heading" : "3 Deep nonlinear neural networks",
      "text" : "Given this understanding of the loss surface of deep linear models, we discuss deep nonlinear models."
    }, {
      "heading" : "3.1 Model",
      "text" : "We use the same notation as for the deep linear models, defined in the beginning of Section 2.1. The output of deep nonlinear neural network, Ŷ (W,X) ∈ Rdy×m, is defined as\nŶ(W,X) = qσH+1(WH+1σH(WHσH−1(WH−1 · · · σ2(W2σ1(W1X)) · ··))),\n1If H = 1, to be succinct, we define WH · · ·W2 = W1 · · ·W2 , Id1 , with a slight abuse of notation. 2Typically, we do this by assuming smoothness in the values of the loss function. 3Other problems such as the ill-conditioning can make it difficult to obtain a fast convergence rate.\nwhere q ∈ R is simply a normalization factor, the value of which is specified later. Here, σk : Rdk×m → Rdk×m is the element-wise rectified linear function:\nσk   b11 . . . b1m... . . . ... bdk1 · · · bdkm   =  σ̄(b11) . . . σ̄(b1m)... . . . ... σ̄(bdk1) · · · σ̄(bdkm)  , where σ̄(bij) = max(0, bij). In practice, we usually set σH+1 to be an identity map in the last layer, in which case all our theoretical results still hold true."
    }, {
      "heading" : "3.2 Background",
      "text" : "Following the work by Dauphin et al. (2014), Choromanska et al. (2015a) investigated the connection between the loss functions of deep nonlinear networks and a function well-studied via random matrix theory (i.e., the Hamiltonian of the spherical spin-glass model). They explained that their theoretical results relied on several unrealistic assumptions. Later, Choromanska et al. (2015b) suggested at the Conference on Learning Theory (COLT) 2015 that discarding these assumptions is an important open problem. The assumptions were labeled A1p, A2p, A3p, A4p, A5u, A6u, and A7p.\nHere, we discuss the most relevant assumptions: A1p, A5u, and A6u. We refer to the part of assumption A1p (resp. A5u) that corresponds only to the model assumption as A1p-m (resp. A5u-m). Note that assumptions A1p-m and A5u-m are explicitly used in the previous work (Choromanska et al., 2015a) and included in A1p and A5u (i.e., we are not making new assumptions here). As the model Ŷ (W,X) ∈ Rdy×m represents a directed acyclic graph, we can express an output from one of the units in the output layer as\nŶ (W,X)j,i = q Ψj∑ p=1 [Xi](j,p)[Zi](j,p) H+1∏ k=1 w (k) (j,p),\nwhere Ψj is the total number of paths from the inputs to the j-th output in the directed acyclic graph. In addition, [Xi](j,p) ∈ R represents the entry of the i-th sample input datum that is used in the p-th path of the j-th output. For each layer k, w(k)(j,p) ∈ R is the entry of Wk that is used in the p-th path of the j-th output. Finally, [Zi](j,p) ∈ {0, 1} represents whether the p-th path of the j-th output is active ([Zi](j,p) = 1) or not ([Zi](j,p) = 0) for each sample i because of the rectified linear activation.\nAssumption A1p-m assumes that the Z’s are Bernoulli random variables with the same probability of success, Pr([Zi](j,p) = 1) = ρ for all i and (j, p). Assumption A5u-m assumes that the Z’s are independent from the input X’s, parameters w’s, and each other (the independence was required, for example, in the first equation of the proof of Theorem 3.3 in (Choromanska et al., 2015a)). With assumptions A1p-m and A5u-m, we can write EZ [Ŷ (W,X)j,i] = q ∑Ψj p=1[Xi](j,p)ρ ∏H k=1 w (k) (j,p).\nThe previous work also assumes the use of “independent random” loss functions. Consider the hinge loss, Lhinge(W )j,i = max(0, 1 − Yj,iŶ (W,X)j,i). By modeling the max operator as a Bernoulli random variable ξ, we can then write Lhinge(W )j,i = ξ−q ∑Ψj p=1 Yj,i[Xi](j,p)ξ[Zi](j,p) ∏H+1 k=1 w (k) (j,p). A1p then assumes that for all i and (j, p), the ξ[Zi](j,p) are Bernoulli random variables with equal probabilities of success. Furthermore, A5u assumes that the independence of ξ[Zi](j,p), Yj,i[Xi](j,p), and w(j,p). Finally, A6u assumes that Yj,i[Xi](j,p) for all (j, p) and i are independent.\nProposition 3.1 (High-level description of a main result in Choromanska et al., 2015a) Assume A1p (including A1p-m), A2p, A3p, A4p, A5u (including A5u-m), A6u, and A7p (Choromanska et al., 2015b). Furthermore, assume that dy = 1. Then, the expected loss of each sample datum, Eξ,Z [Lhinge(W )i,1], has the following property: above a certain loss value, the number of local minima diminishes exponentially as the loss value increases.\nChoromanska et al. (2015b) noted that A6u is unrealistic because it implies that the inputs are not shared among the paths. In addition, A5u is unrealistic because it implies that the activation of any path is independent of the input data."
    }, {
      "heading" : "3.3 Results",
      "text" : "We now state our main theoretical results for deep nonlinear networks, which partially address the aforementioned open problem and lead to more general and tighter results. Unlike the previous work,\nwe do not assume that we can take the expectation over random variable ξ. Moreover, we consider loss functions for all the data points and all possible output dimensionalities (i.e., vectored-valued output). More concretely, we consider the expected squared error loss, EZ [L(W )] = EZ [ 12‖Ŷ (W,X)−Y ‖ 2 F ]. We also consider the squared error loss of the expected model, LEZ [Ŷ ](W ) = 1 2‖E[Ŷ (W,X)]−Y ‖ 2 F .\nTheorem 3.2 (Loss surface of deep nonlinear networks) Assume A1p-m and A5u-m. Further assume that dy ≤ dx and that XXT and XY T are full rank. Let q = ρ−1. Then, for any depth H ≥ 1 and for any layer widths and any input-output dimensions dy, dH , dH−1, . . . , d1, dx (the widths can arbitrarily differ from each other and from dy and dx), both the expected loss function EZ [L(W )] and the loss function of the expected model LEZ [Ŷ ](W ) have the following properties:\n(i) They are non-convex and non-concave.\n(ii) Every local minimum is a global minimum.\n(iii) Every critical point that is not a global minimum is a saddle point.\n(iv) If rank(WH · · ·W2) = p, then the Hessian at any saddle point has at least one (strictly) negative eigenvalue.4\nCorollary 3.3 (Effect of deepness on the loss surface) Assume the same set of conditions as in Theorem 3.2. Consider the loss function EZ [L(W )] or LEZ [Ŷ ](W ) . Then, for three-layer networks (i.e., H = 1), the Hessian at any saddle point has some (strictly) negative eigenvalue. In contrast, for networks deeper than three layers (i.e., H ≥ 2), there exist saddle points at which the Hessian does not have a negative eigenvalue.\nComparing Theorem 3.2 and Proposition 3.1, we can see that we successfully discarded assumptions A2p, A3p, A4p, A6u, and A7p while obtaining a tighter statement in general. Again, note that the full rank assumptions on XXT and XY T in Theorem 3.2 are realistic and practically easy to satisfy, as discussed in previous work (e.g., Baldi & Hornik, 1989). Furthermore, our model Ŷ is strictly more general than the model analyzed in (Choromanska et al., 2015a,b) (i.e., this paper’s model class contains the previous work’s model class but not vice versa)."
    }, {
      "heading" : "4 Important lemmas",
      "text" : "In this section, we provide additional theoretical results as lemmas that lead to further insights. The proofs of the lemmas are in the appendix in the supplementary material.\nLet M ⊗M ′ be the Kronecker product of M and M ′. Let Dvec(WTk )f(·) = ∂f(·)\n∂ vec(WT\nk )\nbe the partial\nderivative of f with respect to vec(WTk ) in the numerator layout. That is, if f : Rdin → Rdout , we have Dvec(WTk )f(·) ∈ R\ndout×(dkdk−1). Let R(M) be the range (or the column space) of a matrix M . Let M− be any generalized inverse of M . When we write a generalized inverse in a condition or statement, we mean it for any generalized inverse (i.e., we omit the universal quantifier over generalized inverses, as this is clear). Let r = (Y (W,X)− Y )T ∈ Rm×dy be an error matrix. Let C = WH+1 · · ·W2 ∈ Rdy×d1 . When we write Wk · · ·W ′k, we generally intend that k > k′ and the expression denotes a product over Wj for integer k ≥ j ≥ k′. For notational compactness, two additional cases can arise: when k = k′, the expression denotes simply Wk, and when k < k′, it denotes Idk . For example, in the statement of Lemma 4.1, if we set k := H + 1, we have that WH+1WH · · ·WH+2 , Idy . In Lemma 4.6 and the proofs of Theorems 2.3 and 3.2, we use the following additional notation. Let Σ = Y XT (XXT )−1XY T and its eigendecomposition be UΛUT = Σ, where the entries of the eigenvalues are ordered as Λ1,1 ≥ . . . ≥ Λdy,dy with corresponding orthogonal eigenvector matrix U = [u1, . . . , udy ]. For each k ∈ {1, . . . dy}, uk ∈ Rdy×1 is a column eigenvector. As Σ is real symmetric, we can always make U orthogonal. Let p̄ = rank(C) ∈ {1, . . . ,min(dy, p)}. We define a matrix containing the subset of the p̄ largest eigenvectors as Up̄ = [u1, . . . , up̄]. Given any ordered set Ip̄ = {i1, . . . , ip̄ | 1 ≤ i1 < · · · < ip̄ ≤ min(dy, p)}, we define a matrix containing the subset of the corresponding eigenvectors as UIp̄ = [ui1 , . . . , uip̄ ]. Note the difference between Up̄ and UIp̄ .\n4If H = 1, to be succinct, we define WH · · ·W2 = W1 · · ·W2 , Id1 , with a slight abuse of notation.\nLemma 4.1 (Critical point necessary and sufficient condition) W is a critical point of L̄(W ) if and only if for all k ∈ {1, ...,H + 1},(\nDvec(WTk )L̄(W ) )T = ( WH+1WH · · ·Wk+1 ⊗ (Wk−1 · · ·W2W1X)T )T vec(r) = 0.\nLemma 4.2 (Representation at critical point) If W is a critical point of L̄(W ), then\nWH+1WH · · ·W2W1 = C(CTC)−CTY XT (XXT )−1.\nLemma 4.3 (Block Hessian with Kronecker product) Write the entries of ∇2L̄(W ) in a block form as\n∇2L̄(W ) =  Dvec(WTH+1) ( Dvec(WTH+1)L̄(W ) )T · · · Dvec(WT1 ) ( Dvec(WTH+1)L̄(W ) )T ... . . . ...\nDvec(WTH+1) ( Dvec(WT1 )L̄(W ) )T · · · Dvec(WT1 ) ( Dvec(WT1 )L̄(W )\n)T  .\nThen, for any k ∈ {1, ...,H + 1}, Dvec(WTk ) ( Dvec(WTk )L̄(W ) )T = ( (WH+1 · · ·Wk+1)T (WH+1 · · ·Wk+1)⊗ (Wk−1 · · ·W1X)(Wk−1 · · ·W1X)T ) ,\nand, for any k ∈ {2, ...,H + 1}, Dvec(WTk ) ( Dvec(WT1 )L̄(W ) )T = ( CT (WH+1 · · ·Wk+1)⊗X(Wk−1 · · ·W1X)T ) +\n[(Wk−1 · · ·W2)T ⊗X] [Idk−1 ⊗ (rWH+1 · · ·Wk+1)·,1 . . . Idk−1 ⊗ (rWH+1 · · ·Wk+1)·,dk ] .\nLemma 4.4 (Hessian semidefinite necessary condition) If ∇2L̄(W ) is positive semidefinite or negative semidefinite at a critical point, then for any k ∈ {2, ...,H + 1},\nR((Wk−1 · · ·W3W2)T ) ⊆ R(CTC) or XrWH+1WH · · ·Wk+1 = 0.\nCorollary 4.5 If∇2L̄(W ) is positive semidefinite or negative semidefinite at a critical point, then for any k ∈ {2, ...,H + 1},\nrank(WH+1WH · · ·Wk) ≥ rank(Wk−1 · · ·W3W2) or XrWH+1WH · · ·Wk+1 = 0.\nLemma 4.6 (Hessian positive semidefinite necessary condition) If∇2L̄(W ) is positive semidefinite at a critical point, then\nC(CTC)−CT = Up̄U T p̄ or Xr = 0."
    }, {
      "heading" : "5 Proof sketches of theorems",
      "text" : "We now provide overviews of the proofs of Theorems 2.3 and 3.2. We complete the proofs of the theorems in the appendix in the supplementary material.\nOur proof approach largely differs from those in previous work (Baldi & Hornik, 1989; Baldi & Lu, 2012; Choromanska et al., 2015a,b). In contrast to (Baldi & Hornik, 1989; Baldi & Lu, 2012), we need a different approach to deal with the “bad” saddle points that start appearing when the model becomes deeper (see Section 2.3), as well as to obtain more comprehensive properties of the critical points with more generality. While the previous proofs heavily rely on the first-order information, the main parts of our proofs take advantage of the second order information. In contrast, Choromanska et al. (2015a,b) used the seven assumptions to relate the loss functions of deep models to a function previously analyzed with a tool of random matrix theory (i.e., Gaussian orthogonal ensemble). With no reshaping assumptions (A3p, A4p, and A6u), we cannot relate our loss function to such a function. Moreover, with no distributional assumptions (A2p and A6u) (except the activation), our Hessian\nis deterministic, and therefore, even random matrix theory itself is insufficient for our purpose. Furthermore, with no spherical constraint assumption (A7p), the number of local minima in our loss function can be uncountable.\nOne natural strategy to proceed toward Theorems 2.3 and 3.2 would be to use the first order and the second order necessary conditions of local minima (e.g., the gradient is zero and the Hessian is positive semidefinite).5 However, are the first-order and second-order conditions sufficient to prove Theorems 2.3 and 3.2? Corollaries 2.4 and 3.3 show that the answer is negative for deep models with H ≥ 2, while it is affirmative for shallow models with H = 1. Thus, for deep models, a simple use of the first-order and second-order information is insufficient to characterize the properties of each critical point. In addition to the complexity of the Hessian of the deep models, this suggests that we must strategically extract the second order information. Accordingly, we obtained an organized representation of the Hessian in Lemma 4.3 and strategically extracted the information in Lemmas 4.4 and 4.6, with which we are ready to prove Theorems 2.3 and 3.2.\n5.1 Proof sketch of Theorem 2.3 (ii)\nBy case analysis, we show that any point that satisfies the necessary conditions and the definition of a local minimum is a global minimum.\nCase I: rank(WH · · ·W2) = p and dy ≤ p: Assume that rank(WH · · ·W2) = p. If dy < p, Corollary 4.5 with k = H + 1 implies the necessary condition that Xr = 0. If dy = p, Lemma 4.6 with k = H + 1 and k = 2, combined with the fact thatR(C) ⊆ R(Y XT ), implies the necessary condition that Xr = 0. Therefore, we have the necessary condition, Xr = 0 . Interpreting condition Xr = 0, we conclude that W achieving Xr = 0 is indeed a global minimum.\nCase II: rank(WH · · ·W2) = p and dy > p: From Lemma 4.6, we have the necessary condition that C(CTC)−CT = Up̄U T p̄ or Xr = 0. If Xr = 0, using the exact same proof as in Case I, it is a global minimum. Suppose then thatC(CTC)−CT = Up̄Up̄. From Lemma 4.4 with k = H+1, we conclude that p̄ , rank(C) = p. Then, from Lemma 4.2, we write WH+1 · · ·W1 = UpUpY XT (XXT )−1, which is the orthogonal projection onto the subspace spanned by the p eigenvectors corresponding to the p largest eigenvalues following the ordinary least square regression matrix. This is indeed the expression of a global minimum.\nCase III: rank(WH · · ·W2) < p: Suppose that rank(WH · · ·W2) < p. From Lemma 4.4, we have the following necessary condition for the Hessian to be (positive or negative) semidefinite at a critical point: for any k ∈ {2, . . . ,H + 1},\nR((Wk−1 · · ·W2)T ) ⊆ R(CTC) or XrWH+1 · · ·Wk+1 = 0,\nwhere the first condition is shown to imply rank(WH+1 · · ·Wk) ≥ rank(Wk−1 · · ·W2) in Corollary 4.5. We repeatedly apply these conditions for k = 2, . . . ,H+1 to claim that with arbitrarily small > 0, we can perturb each parameter (i.e., each entry of WH , . . . ,W2) such that rank(WH+1 · · ·W2) ≥ min(p, dx) without changing the value of L̄(W ). We prove this by induction on k, using Lemmas 4.2, 4.4, and 4.6.\nWe consider the base case, k = 2. From the condition with k = 2 of Lemma 4.4, we have that rank(WH+1 · · ·W2) ≥ d1 ≥ p or XrWH+1 · · ·W3 = 0 (note that d1 ≥ p ≥ p̄ by their definitions). The former condition is false since rank(WH+1 · · ·W2) ≤ rank(WH · · ·W2) < p. From the latter condition, for an arbitrary L2, with A2 = WH+1 · · ·W3,\n0 = XrWH+1 · · ·W3 ⇔W2W1 = ( AT2 A2 )− AT2 Y X\nT (XXT )−1 + (I − (AT2 A2)−AT2 A2)L2 ⇔WH+1 · · ·W1 = A2 ( AT2 A2 )− AT2 Y X T (XXT )−1\n= C(CTC)−CTY XT (XXT )−1 = Up̄U T p̄ Y X T (XXT )−1,\n5For a non-convex and non-differentiable function, we can still have a first-order and second-order necessary condition (e.g., Rockafellar & Wets, 2009, theorem 13.24, p. 606).\nwhere the last two equalities follow Lemmas 4.2 and 4.6 (since if Xr = 0, we immediately obtain the desired result). Since XY T is full rank with dy ≤ dx (i.e., rank(XY T ) = dy),\nA2 ( AT2 A2 )− A2 = Up̄U T p̄ = Up̄(U T p̄ Up̄) −1UTp̄ .\nFrom this, with extra steps, we can deduce that we can have rank(W2) ≥ min(p, dx) with arbitrarily small perturbation of each entry of W2 while retaining the loss value.\nThus, we conclude the proof for the base case with k = 2. For the inductive step with k ∈ {3, . . . ,H + 1}, we essentially use the same proof procedure but with the inductive hypothesis that we can have rank(Wk−1 · · ·W2) ≥ min(p, dx) with arbitrarily small perturbation of each entry of Wk−1, . . . ,W2 without changing the loss value. We need the inductive hypothesis to conclude that the first condition in (R((Wk−1 · · ·W2)T ) ⊆ R(CTC) or XrWH+1 · · ·Wk+1 = 0) is false, and thus the second condition must be satisfied at a candidate point of a local minima.\nWe then conclude the induction, proving that we can have rank(WH · · ·W2) ≥ rank(WH+1 · · ·W2) ≥ min(p, dx) with arbitrarily small perturbation of each parameter without changing the value of L̄(W ). If p ≤ dx, this means that upon such a perturbation, we have the case of rank(WH · · ·W2) = p. Thus, such a critical point is not a local minimum unless it is a global minimum. If p > dx, upon such a perturbation, we have rank(WH+1 · · ·W2) ≥ dx. Thus, WH+1 · · ·W1 = Up̄UTp̄ Y XT (XXT )−1 = UUTY XT (XXT )−1, which is a global minimum. Summarizing the above, any point that satisfies the definition (and necessary conditions) of a local minimum is indeed a global minimum. Therefore, we conclude the proof sketch of Theorem 2.3 (ii).\n5.2 Proof sketch of Theorem 2.3 (i), (iii) and (iv)\nWe can prove the non-convexity and non-concavity of this function simply from its Hessian (Theorem 2.3 (i)). That is, we can show that in the domain of the function, there exist points at which the Hessian becomes indefinite. Indeed, The domain contains uncountably many points at which the Hessian is indefinite.\nWe now consider Theorem 2.3 (iii): every critical point that is not a global minimum is a saddle point. Combined with Theorem 2.3 (ii), which is proven independently, this is equivalent to the statement that there are no local maxima. We first show that if WH · · ·W1 6= 0, the loss function is strictly convex in one of the coordinates. This means that there is always an increasing direction and hence no local maximum. If WH · · ·W1 = 0, we show that at a critical point, if the Hessian is negative semidefinite, we can have WH · · ·W1 6= 0 with arbitrarily small perturbation without changing the loss value. We can prove this by induction on k = 1, . . . ,H , similar to the induction in the proof of Theorem 2.3 (ii).\nTheorem 2.3 (iv) follows Theorem 2.3 (ii)-(iii) and the fact that when rank(WH · · ·W2) = p, if ∇2L̄(W ) 0 at a critical point, W is a global minimum (this is the statement obtained in the proof of Theorem 2.3 (ii) for the case, rank(WH · · ·W2) = p)."
    }, {
      "heading" : "5.3 Proof sketch of Theorem 3.2",
      "text" : "Similarly to the previous work (Choromanska et al., 2015a,b), we relate our loss function to another function under the adopted assumptions. More concretely, we show that all the theoretical results developed so far for the loss function of the deep linear models, L̄(W ), hold true for the loss functions of the deep nonlinear models, EZ [L(W )] and LEZ [Ŷ ](W )."
    }, {
      "heading" : "6 Conclusion",
      "text" : "In this paper, we addressed some open problems, pushing forward the theoretical foundations of deep learning and non-convex optimization. For deep linear neural networks, we proved the aforementioned conjecture and more detailed statements with more generality. For deep nonlinear neural networks with rectified linear activation, when compared with the previous work, we proved a tighter statement with more generality (dy can vary) and with strictly weaker model assumptions (only two assumptions out of seven). However, our theory does not yet directly apply to the practical situation. To fill the gap between theory and practice, future work would further discard the remaining two out of the seven assumptions made in previous work."
    }, {
      "heading" : "Acknowledgments",
      "text" : "The author would like to thank Prof. Leslie Kaelbling for her thoughtful comments on the paper. We gratefully acknowledge support from NSF grant 1420927, from ONR grant N00014-14-1-0486, and from ARO grant W911NF1410433. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of our sponsors."
    }, {
      "heading" : "A Proofs of lemmas and corollary in Section 4",
      "text" : "We complete the proofs of the lemmas and corollary in Section 4.\nA.1 Proof of Lemma 4.1\nProof Since L̄(W ) = 12‖Y (W,X)− Y ‖ 2 F= 1 2 vec(r) T vec(r), Dvec(WTk )L̄(W ) = ( Dvec(r)L̄(W ) ) ( Dvec(WTk ) vec(r) ) = vec(r)T ( Dvec(WTk ) vec(X T IdxW T 1 · · ·WTH+1Idy )−Dvec(WTk ) vec(Y T ) )\n= vec(r)T ( Dvec(WTk )(WH+1 · · ·Wk+1 ⊗ (Wk−1 · · ·W1X) T ) vec(WTk ) )\n= vec(r)T ( WH+1 · · ·Wk+1 ⊗ (Wk−1 · · ·W1X)T ) .\nBy setting ( Dvec(WTk )L̄(W ) )T = 0 for all k ∈ {1, ...,H + 1}, we obtain the statement of Lemma 4.1. For the boundary conditions (i.e., k = H + 1 or k = 1), it can be seen from the second to the third lines that we obtain the desired results with the definition, Wk · · ·Wk+1 , Idk (i.e., WH+1 · · ·WH+2 , Idy and W0 · · ·W1 , Idx ).\nA.2 Proof of Lemma 4.2\nProof From the critical point condition with respect to W1 (Lemma 4.1), 0 = ( Dvec(WTk )L̄(W ) )T = ( WH+1 · · ·W2 ⊗XT )T vec(r) = vec(XrWH+1 · · ·W2),\nwhich is true if and only if XrWH+1 · · ·W2 = 0. By expanding r, 0 = XXTWT1 CTC −XY TC. By solving for W1,\nW1 = (C TC)−CTY XT (XXT )−1 + (I − (CTC)−CTC)L,\nfor an arbitrary matrix L. Due to the property of any generalized inverse (Zhang, 2006, p. 41), we have that C(CTC)−CTC = C. Thus,\nCW1 = C(C TC)−CTY XT (XXT )−1 + (C − C(CTC)−CTC)L = C(CTC)−CTY XT (XXT )−1.\nA.3 Proof of Lemma 4.3\nProof For the diagonal blocks: the entries of diagonal blocks are obtained simply using the result of Lemma 4.1 as\nDvec(WTk ) ( Dvec(WTk )L̄(W ) )T = ( WH+1 · · ·Wk+1 ⊗ (Wk−1 · · ·W1X)T )T Dvec(WTk ) vec(r). Using the formula of Dvec(WTk ) vec(r) computed in the proof of of Lemma 4.1 yields the desired result.\nFor the off-diagonal blocks with k = 2, ...,H:\nDvec(WTk )[Dvec(WT1 )L̄(W )] T\n= ( WH+1 · · ·W2 ⊗X)T )T Dvec(WTk ) vec(r) + (Dvec(WTk )WH+1 · · ·Wk+1 ⊗XT)T vec(r)\nThe first term above is reduced to the first term of the statement in the same way as the diagonal blocks. For the second term,(\nDvec(WTk )WH+1 · · ·W2 ⊗X T )T vec(r)\n= m∑ i=1 dy∑ j=1 (( Dvec(WTk )WH+1,jWH · · ·W2 ) ⊗XTi )T ri,j\n= m∑ i=1 dy∑ j=1 ( (Ak)j,· ⊗BTk ⊗XTi )T ri,j\n= m∑ i=1 dy∑ j=1 [ (Ak)j,1 ( BTk ⊗Xi ) . . . (Ak)j,dk ( BTk ⊗Xi )] ri,j\n= [( BTk ⊗ ∑m i=1 ∑dy j=1 ri,j(Ak)j,1Xi ) . . . ( BTk ⊗ ∑m i=1 ∑dy j=1 ri,j(Ak)j,dkXi )] .\nwhere Ak = WH+1 · · ·Wk+1 and Bk = Wk−1 · · ·W2. The third line follows the fact that (WH+1,jWH · · ·W2)T = vec(WT2 · · ·WTHWTH+1,j) = (WH+1,j · · ·Wk+1 ⊗ WT2 · · ·WTk−1) vec(WTk ). In the last line, we have the desired result by rewriting∑m i=1 ∑dy j=1 ri,j(Ak)j,tXi = X(rWH+1 · · ·Wk+1)·,t.\nFor the off-diagonal blocks with k = H + 1: The first term in the statement is obtained in the same way as above (for the off-diagonal blocks with k = 2, ...,H). For the second term, notice that vec(WTH+1) = [ (WH+1) T 1,· . . . (WH+1) T dy,· ]T\nwhere (WH+1)j,· is the j-th row vector of WH+1 or the vector corresponding to the j-th output component. That is, it is conveniently organized as the blocks, each of which corresponds to each output component (or rather we chose vec(WTk ) instead of vec(Wk) for this reason, among others). Also,( Dvec(WTH+1)WH+1 · · ·W2 ⊗X T )T vec(r) =\n= [∑m i=1 (( D(WH+1)T1,·C1,· ) ⊗XTi )T ri,1 . . . ∑m i=1 (( D(WH+1)Tdy,·Cdy,· ) ⊗XTi )T ri,dy ] ,\nwhere we also used the fact that m∑ i=1 dy∑ j=1 (( Dvec((WH+1)Tt,·)Cj,· ) ⊗XTi )T ri,j = m∑ i=1 (( Dvec((WH+1)Tt,·)Ct,· ) ⊗XTi )T ri,t.\nFor each block entry t = 1, . . . , dy in the above, similarly to the case of k = 2, ...,H , m∑ i=1 (( Dvec((WH+1)Tt,·)Cj,· ) ⊗XTi )T ri,t = ( BTH+1 ⊗ m∑ i=1 ri,t(AH+1)j,tXi ) .\nHere, we have the desired result by rewriting ∑m i=1 ri,t(AH+1)j,1Xi = X(rIdy )·,t = Xr·,t.\nA.4 Proof of Lemma 4.4\nProof Note that a similarity transformation preserves the eigenvalues of a matrix. For each k ∈ {2, . . . ,H+1}, we take a similarity transform of∇2L̄(W ) (whose entries are organized as in Lemma 4.3) as\nP−1k ∇ 2L̄(W )Pk =  Dvec(WT1 ) ( Dvec(WT1 )L̄(W ) )T Dvec(WTk ) ( Dvec(WT1 )L̄(W ) )T · · · Dvec(WT1 ) ( Dvec(WTk )L̄(W ) )T Dvec(WTk ) ( Dvec(WTk )L̄(W ) )T · · ·\n... ...\n. . .  Here, Pk = [ eH+1 ek P̃k ] is the permutation matrix where ei is the i-th element of the standard\nbasis (i.e., a column vector with 1 in the i-th entry and 0 in every other entries), and P̃k is any\narbitrarily matrix that makes Pk to be a permutation matrix. Let Mk be the principal submatrix of P−1k ∇2L̄(W )Pk that consists of the first four blocks appearing in the above equation. Then,\n∇2L̄(W ) 0 ⇒ ∀k ∈ {2, . . . ,H + 1},Mk 0 ⇒ ∀k ∈ {2, . . . ,H + 1},R(Dvec(WTk )(Dvec(WT1 )L̄(W )) T ) ⊆ R(Dvec(WT1 )(Dvec(WT1 )L̄(W )) T ),\nHere, the first implication follows the necessary condition with any principal submatrix and the second implication follows the necessary condition with the Schur complement (Zhang, 2006, theorem 1.20, p. 44).\nNote that R(M ′) ⊆ R(M) ⇔ (I −MM−)M ′ = 0 (Zhang, 2006, p. 41). Thus, by plugging in the formulas of Dvec(WTk )(Dvec(WT1 )L̄(W )) T and Dvec(WT1 )(Dvec(WT1 )L̄(W )) T that are derived in Lemma 4.3, ∇2L̄(W ) 0⇒ ∀k ∈ {2, . . . ,H + 1}, 0 = ( I − (CTC ⊗ (XXT ))(CTC ⊗ (XXT ))− ) (CTAk ⊗BkW1X)\n+ ( I − (CTC ⊗ (XXT ))(CTC ⊗ (XXT ))− ) [BTk ⊗X] [ Idk−1 ⊗ (rAk)·,1 . . . Idk−1 ⊗ (rAk)·,dk ] where Ak = WH+1 · · ·Wk+1 and Bk = Wk−1 · · ·W2. Here, we can replace (CTC⊗ (XXT ))− by ((CTC)− ⊗ (XXT )−1) (see Appendix A.7). Thus, I − (CTC ⊗ (XXT ))(CTC ⊗ (XXT ))−can be replaced by (Id1 ⊗ Idy )− (CTC(CTC)− ⊗ Idy ) = (Id1 − CTC(CTC)−)⊗ Idy . Accordingly, the first term is reduced to zero as(\n(Id1 − C TC(CTC)−)⊗ Idy )( CTAk ⊗BkW1X ) = ((Id1 − C TC(CTC)−)CTAk)⊗BkW1X = 0,\nsince CTC(CTC)−CT = CT (Zhang, 2006, p. 41). Thus, with the second term remained, the condition is reduced to\n∀k ∈ {2, . . . ,H + 1},∀t ∈ {1, . . . , dy}, (BTk − CTC(CTC)−BTk )⊗X(rAk)·,t = 0. This implies ∀k ∈ {2, . . . ,H + 1}, (R(BTk ) ⊆ R(CTC) or XrAk = 0), which concludes the proof for the positive semidefinite case. For the necessary condition of the negative semidefinite, we obtain the same condition since\n∇2L̄(W ) 0 ⇒ ∀k ∈ {2, . . . , H + 1},Mk 0\n⇒ ∀k ∈ {2, . . . , H + 1},R(−Dvec(WT k )(Dvec(WT1 )L̄(W )) T ) ⊆ R(−Dvec(WT1 )(Dvec(WT1 )L̄(W )) T )\n⇒ ∀k ∈ {2, . . . , H + 1},R(Dvec(WT k )(Dvec(WT1 )L̄(W )) T ) ⊆ R(Dvec(WT1 )(Dvec(WT1 )L̄(W )) T ).\nA.5 Proof of Corollary 4.5\nProof From the first condition in the statement of Lemma 4.4, R(WT2 · · ·WTk−1) ⊆ R(WT2 · · ·WTH+1WH+1 · · ·W2) ⇒ rank(WTk · · ·WTH+1) ≥ rank(WT2 · · ·WTk−1)⇒ rank(WH+1 · · ·Wk) ≥ rank(Wk−1 · · ·W2).\nThe first implication follows the fact that the rank of a product of matrices is at most the minimum of the ranks of the matrices, and the fact that the column space of WT2 · · ·WTH+1 is subspace of the column space of WT2 · · ·WTk−1.\nA.6 Proof of Lemma 4.6\nProof For the (Xr = 0) condition: Let MH+1 be the principal submatrix as defined in the proof of Lemma 4.4 (the principal submatrix of P−1H+1∇2L̄(W )PH+1 that consists of the first four blocks of it). Let Bk = Wk−1 · · ·W2. Let F = BH+1W1XXTWT1 BTH+1. Using Lemma 4.3 for the blocks corresponding to W1 and WH+1,\nMH+1 =\n[ CTC ⊗XXT (CT ⊗XXT (BH+1W1)T ) + E\n(C ⊗BH+1W1XXT ) + ET Idy ⊗ F\n]\nwhere E = [ BTH+1 ⊗Xr·,1 . . . BTH+1 ⊗Xr·,dy ] . Then, by the necessary condition with the Schur complement (Zhang, 2006, theorem 1.20, p. 44), MH+1 0 implies\n0 = ((Idy ⊗ IdH )− (Idy ⊗ F )(Idy ⊗ F )−)((C ⊗BH+1W1XXT ) + ET ) ⇒ 0 = (Idy ⊗ IdH − FF−)(C ⊗BH+1W1XXT ) + (Idy ⊗ IdH − FF−)ET\n= (Idy ⊗ IdH − FF−)ET\n= IdH − FF − ⊗ I1 0\n. . . 0 IdH − FF− ⊗ I1\n BH+1 ⊗ (Xr·,1) T\n... BH+1 ⊗ (Xr·,dy )T  =  (IdH − FF −)BH+1 ⊗ (Xr·,1)T\n... (IdH − FF−)BH+1 ⊗ (Xr·,dy )T  where the second line follows the fact that (Idy ⊗F )− can be replaced by (Idy ⊗F−) (see Appendix A.7). The third line follows the fact that (I − FF−)BH+1W1X = 0 because R(BH+1W1X) = R(BH+1W1XXTWT1 BTH+1) = R(F ). In the fourth line, we expanded E and used the definition of the Kronecker product. It implies\nFF−BH+1 = BH+1 or Xr = 0.\nHere, if Xr = 0, we obtained the statement of the lemma. Thus, from now on, we focus on the case where FF−BH+1 = BH+1 and Xr 6= 0 to obtain the other condition, C(CTC)−CT = Up̄Up̄.\nFor the (C(CTC)−CT = Up̄Up̄) condition: By using another necessary condition of a matrix being positive semidefinite with the Schur complement (Zhang, 2006, theorem 1.20, p. 44), MH+1 0 implies that\n(Idy ⊗ F )− ( C ⊗BH+1W1XXT + ET ) (CTC ⊗XXT )− ( CT ⊗XXT (BH+1W1)T + E ) 0 (1)\nSince we can replace (CTC ⊗XXT )− by (CTC)− ⊗ (XXT )−1 (see Appendix A.7), the second term in the left hand side is simplified as(\nC ⊗BH+1W1XXT + ET ) (CTC ⊗XXT )− ( CT ⊗XXT (BH+1W1)T + E ) = (( C(CTC)− ⊗BH+1W1 ) + ET ( (CTC)− ⊗ (XXT )−1 ))(( CT ⊗XXT (BH+1W1)T ) + E\n) = ( C(CTC)−CT ⊗ F ) + ET ( (CTC)− ⊗ (XXT )−1 ) E\n= ( C(CTC)−CT ⊗ F ) + ( rTXT (XXT )−1Xr ⊗BH+1(CTC)−BH+1 ) (2)\nIn the third line, the crossed terms – ( C(CTC)− ⊗BH+1W1 ) E and its transpose – are vanished\nto 0 because of the following. From Lemma 4.1, ( Idy ⊗ (WH · · ·W1X)T )T vec(r) = 0 ⇔\nWH · · ·W1Xr = BH+1W1Xr = 0 at any critical point. Thus, ( C(CTC)− ⊗BH+1W1 ) E =[\nC(CTC)−BTH+1 ⊗BH+1W1Xr·,1 . . . C(CTC)−BTH+1 ⊗BH+1W1Xr·,dy ]\n= 0.The forth line follows\nE T ( (C T C) − ⊗ (XXT )−1 ) E = BH+1(C TC)−BTH+1 ⊗ (r·,1) TXT (XXT )−1Xr·,1 · · · BH+1(CTC)−BTH+1 ⊗ (r·,1) TXT (XXT )−1Xr·,dy ... . . .\n... BH+1(C TC)−BTH+1 ⊗ (r·,dy ) TXT (XXT )−1Xr·,1 · · ·BH+1(CTC)−BTH+1 ⊗ (r·,dy ) TXT (XXT )−1Xr·,dy  = r T X T (XX T ) −1 Xr ⊗ BH+1(CTC)−BH+1,\nwhere the last line is due to the fact that ∀t, (r·,t)TXT (XXT )−1Xr·,t is a scaler and the fact that\nfor any matrix L, rTLr =  (r·,1) TLr·,1 · · · (r·,1)TLr·,dy . . . . . . . . .\n(r·,dy ) TLr·,1· · ·(r·,dy ) TLr·,dy\n.\nFrom equations 1 and 2, MH+1 0⇒\n((Idy − C(CTC)−CT )⊗ F )− ( rTXT (XXT )−1Xr ⊗BH+1(CTC)−BH+1 ) 0. (3)\nIn the following, we simplify equation 3 by first showing thatR(C) ⊆ R(Σ) and then simplifying C(CTC)−CT , rTXT (XXT )−1Xr, F and BH+1(CTC)−BH+1.\nShowing thatR(C) ⊆ R(Σ): Again, using Lemma 4.1 with k = H + 1,\n0 = BH+1W1Xr ⇔ FWTH+1 = BH+1W1XY T ⇔WTH+1 = F−BH+1W1XY T +(I−F−F )L,\nfor any arbitrary matrix L. Then,\nC = WH+1BH+1\n= Y XTWT1 B T H+1F −BH+1 + L T (I − FF−)BH+1\n= Y XTWT1 B T H+1F −BH+1,\nwhere the second equality follows the fact that we are conducting the case analysis with the case of FF−BH+1 = BH+1 here. Using Lemma 4.1 with k = 1,\n0 = XrWH+1 · · ·W2 ⇔W1 = (CTC)−CTY XT (XXT )−1 + (I − (CTC)−CTC)L,\nfor any arbitrary matrix L. Pugging this formula of W1 into the above,\nC = Y XT ((CTC)−CTY XT (XXT )−1 + (I − (CTC)−CTC)L)TBTH+1F−BH+1 = ΣC(CTC)−BTH+1F −BH+1\nwhere the second line follows Lemma 4.4 with k = H + 1 (i.e., CTC(CTC)−BTH+1 = B T H+1). Thus, we have the desired result,R(C) ⊆ R(Σ). SimplifyingC(CTC)−CT : Remember that p̄ is the rank ofC. To simplify the notation, we rearrange the entries of D and U such that the eigenvalues and eigenvectors selected by the index set Ip̄ comes\nfirst. That is, U = [UIp̄ U−Ip̄ ] and Λ = [ ΛIp̄ 0\n0 Λ−Ip̄\n] where U−Ip̄ consists of all the eigenvectors\nthat are not contained in UIp̄ , and accordingly ΛIp̄ (resp. Λ−Ip̄) consists of all the eigenvalues that correspond (resp. do not correspond) to the index set Ip̄. SinceR(C) ⊆ R(Σ), we can write C in the following form: for some index set Ip̄, C = [UIp̄ ,0]G1, where 0 ∈ Rdy×(d1−p̄) and G1 ∈ GLd1(R) (a d1 × d1 invertible matrix) (notice that d1 ≥ p ≥ p̄ by their definitions). Then,\n(CTC)− = (GT1 [UIp̄ ,0] T [UIp̄ ,0]G1) − = ( GT1 [ Ip̄ 0 0 0 ] G1 )− .\nNote that the set of all generalized inverse of CTC = GT1 [ Ip̄ 0 0 0 ] G1 is as follows (Zhang, 2006, p. 41): { G−11 [ Ip̄ L1 L2 L3 ] G−T1 | L1, L2, L3 arbitrary } .\nThus, for any arbitrary L1, L2 and L3,\nC(CTC)−CT = CG−11 [ Ip̄ L1 L2 L3 ] G−T1 C T = [UIp̄ 0] [ Ip̄ L1 L2 L3 ] [ UTIp̄ 0 ] = UIp̄U T Ip̄ .\nSimplifying rTXT (XXT )−1Xr:\nrTXT (XXT )−1Xr = (CW1X − Y )XT (XXT )−1X(XT (CW1)T − Y T ) = CW1XX T (CW1) T − CW1XY T − Y XT (CW1)T + Σ\n= PCΣPC − PCΣ− ΣPC + Σ = Σ− Up̄ΛIp̄UTp̄\nwhere PC = C(CTC)−CT = UIp̄U T Ip̄ and the last line follows the facts:\nPCΣPC = UIp̄U T Ip̄UΛU TUIp̄U T Ip̄ = UIp̄ [Ip̄ 0]\n[ ΛIp̄ 0\n0 Λ−Ip̄\n] [ Ip̄ 0 ] UTIp̄ = UIp̄ΛIp̄U T Ip̄ ,\nPCΣ = UIp̄U T Ip̄UΛU T = UIp̄ [Ip̄ 0]\n[ ΛIp̄ 0\n0 Λ−Ip̄ ] [ UTIp̄ U−Ip̄ ] = UTIp̄ΛIp̄UIp̄ ,\nand similarly, ΣPC = UTIp̄ΛIp̄UIp̄ .\nSimplifying F : In the proof of Lemma 4.2, by using Lemma 4.1 with k = 1, we obtained that W1 = (C\nTC)−CTY XT (XXT )−1 + (I − (CTC)−CTC)L. Also, from Lemma 4.4, we have that Xr = 0 or BH+1(CTC)−CTC = (CTC(CTC)−BTH+1)\nT = BH+1. If Xr = 0, we got the statement of the lemma, and so we consider the case of BH+1(CTC)−CTC = BH+1. Therefore,\nBH+1W1 = BH+1(C TC)−CTY XT (XXT )−1.\nSince F = BH+1W1XXTWT1 B T H+1,\nF = BH+1(C TC)−CTΣC(CTC)−BTH+1.\nFrom Lemma 4.4 with k = H + 1, R(BTH+1) ⊆ R(CTC) = R(BTH+1WTH+1WH+1BH+1) ⊆ R(BTH+1), which implies that R(BTH+1) = R(CTC). Therefore, R(C(CTC)−BTH+1) = R(C(CTC)−) = R(C) ⊆ R(Σ). Accordingly, we can write it in the form, C(CTC)−BTH+1 = [UIp̄ ,0]G2, where 0 ∈ Rdy×(d1−p̄) and G2 ∈ GLd1(R) (we can write it in the form of [UIp̄′ ,0]G2 for some Ip̄′ because of the inclusion ⊆ R(Σ) and Ip̄′ = Ip̄ because of the equality = R(C)). Thus,\nF = GT2 [ UTIp̄ 0 ] UΛUT [UIp̄ ,0]G2 = G T 2 [ Ip̄ 0 0 0 ] Λ [ Ip̄ 0 0 0 ] G2 = G T 2 [ ΛIp̄ 0 0 0 ] G2.\nSimplifying BH+1(CTC)−BH+1: From Lemma 4.4, CTC(CTC)−BH+1 = BH+1 (again since we are done if Xr = 0). Thus, BH+1(CTC)−BH+1 = BH+1(CTC)−CTC(CTC)−BTH+1. As discussed above, we write C(CTC)−BTH+1 = [UIp̄ ,0]G2. Thus,\nBH+1(C TC)−BH+1 = G T 2 [ UTIp̄ 0 ] [UIp̄ ,0]G2 = G T 2 [ Ip̄ 0 0 0 ] G2.\nPutting results together: We use the simplified formulas of C(CTC)−CT , rTXT (XXT )−1Xr, F and BH+1(CTC)−BH+1 in equation 3, obtaining\n((Idy − UIp̄UTIp̄)⊗G T 2 [ ΛIp̄ 0 0 0 ] G2)− ( (Σ− Up̄ΛIp̄UTp̄ )⊗GT2 [ Ip̄ 0 0 0 ] G2 ) 0.\nDue to the Sylvester’s law of inertia (Zhang, 2006, theorem 1.5, p. 27), with a nonsingular matrix U ⊗G−12 (it is nonsingular because each of U and G −1 2 is nonsingular), the necessary condition is reduced to( U ⊗G−12 )T (( (Idy − UIp̄U T Ip̄ ) ⊗G T 2 [ ΛIp̄ 0\n0 0\n] G2 ) − ( (Σ − Up̄ΛIp̄U T p̄ ) ⊗GT2 [ Ip̄0\n0 0\n] G2 ))( U ⊗G−12 ) = (( Idy − [ Ip̄ 0\n0 0\n]) ⊗ [ ΛIp̄ 0\n0 0\n]) − (( Λ − [ ΛĪ‘p 0\n0 0\n]) ⊗ [ Ip̄ 0\n0 0\n])\n=\n([ 0 0\n0 I(dy−p̄)\n] ⊗ [ ΛIp̄ 0\n0 0\n]) − ([ 0 0\n0 Λ−Ip̄\n] ⊗ [ Ip̄ 0\n0 0\n])\n=  0 0 0 ΛIp̄ − (Λ−Ip̄ )1,1Ip̄ 0\n. . . 0 ΛIp̄ − (Λ−Ip̄ )(dy−p̄),(dy−p̄)Ip̄  0, which implies that for all (i, j) ∈ {(i, j) | i ∈ {1, . . . , p̄}, j ∈ {1, . . . , (dy − p̄)}}, (ΛIp̄)i,i ≥ (Λ−Ip̄)j,j . In other words, the index set Ip̄ must select the largest p̄ eigenvalues whatever p̄ is. Since C(CTC)−CT = UIp̄U T Ip̄ (which is obtained above), we have that C(C\nTC)−CT = Up̄Up̄ in this case.\nSummarizing the above case analysis, if∇2L̄(W ) 0 at a critical point, C(CTC)−CT = Up̄Up̄ or Xr = 0.\nA.7 Generalized inverse of Kronecker product\n(A− ⊗B−) is a generalized inverse of A⊗B.\nProof For a matrix M , the definition of a generalized inverse, M−, is MM−M = M . Setting M := A ⊗ B, we check if (A− ⊗ B−) satisfies the definition: (A ⊗ B)(A− ⊗ B−)(A ⊗ B) = (AA−A⊗BB−B) = (A⊗B) as desired.\nWe avoid discussing the other direction as it is unnecessary in this paper (i.e., we avoid discussing if (A− ⊗ B−) is the only generalized inverse of A ⊗ B). Notice that the necessary condition that we have in our proof (where we need a generalized inverse of A ⊗ B) is for any generalized inverse of A⊗B. Thus, replacing it by one of any generalized inverse suffices to obtain a necessary condition. Indeed, choosing Moore−Penrose pseudoinverse suffices here, with which we know (A⊗B)† = (A† ⊗B†). But, to give a simpler argument later, we keep more generality by choosing (A− ⊗B−) as a generalized inverse of A⊗B."
    }, {
      "heading" : "B Proof of Theorems 2.3 and 3.2",
      "text" : "We complete the proofs of Theorems 2.3 and 3.2.\nB.1 Proof of Theorem 2.3 (ii)\nProof By case analysis, we show that any point that satisfies the necessary conditions and the definition of a local minimum is a global minimum. When we write a statement in the proof, we often mean that a necessary condition of local minima implies the statement as it should be clear (i.e., we are not claiming that the statement must hold true unless the point is the candidate of local minima.).\nThe case where rank(WH · · ·W2) = p and dy ≤ p: Assume that rank(WH · · ·W2) = p. We first obtain a necessary condition of the Hessian being positive semidefinite at a critical point,Xr = 0, and then interpret the condition. If dy < p, Corollary 4.5 with k = H + 1 implies the necessary condition that Xr = 0. This is because the other condition p > rank(WH+1) ≥ rank(WH · · ·W2) = p is false.\nIf dy = p, Lemma 4.6 with k = H + 1 implies the necessary condition that Xr = 0 or R(WH · · ·W2) ⊆ R(CTC). Suppose that R(WH · · ·W2) ⊆ R(CTC). Then, we have that p = rank(WH · · ·W2) ≤ rank(CTC) = rank(C). That is, rank(C) ≥ p. From Corollary 4.5 with k = 2 implies the necessary condition that\nrank(C) ≥ rank(Id1) or XrWH+1 · · ·W3 = 0.\nSuppose the latter: XrWH+1 · · ·W3 = 0. Since rank(WH+1 · · ·W3) ≥ rank(C) ≥ p and dH+1 = dy = p, the left null space of WH+1 · · ·W3 contains only zero. Thus,\nXrWH+1 · · ·W3 = 0⇒ Xr = 0.\nSuppose the former: rank(C) ≥ rank(Id1). Because dy = p ≤ d1, rank(C) ≥ p, and R(C) ⊆ R(Y XT ) as shown in the proof of Lemma 4.6, we have thatR(C) = R(Y XT ).\nrank(C) ≥ rank(Id1)⇒ CTC is full rank ⇒ Xr = XY TC(CTC)−1CT −XY T = 0,\nwhere the last equality follows the fact that (Xr)T = C(CTC)−1CTY XT − Y XT = 0 since R(C) = R(Y XT ) and thereby the projection of Y XT onto the range of C is Y XT . Therefore, we have the condition, Xr = 0 when dy ≤ p. To interpret the condition Xr = 0, consider a loss function with a linear model without any hidden layer, f(W ′) = ‖W ′X − Y ‖2F where W ′ ∈ Rdy×dx . Then, any point satisfying Xr′ = 0 is a global minimum of f , where r′ = (W ′X − Y )T is an error matrix.6 For any values of WH+1 · · ·W1, there exists W ′ such that W ′ = WH+1 · · ·W1 (the opposite is also true when dy ≤ p although\n6Proof: Any point satisfying Xr′ = 0 is a critical point of f , which directly follows the proof of Lemma 4.1. Also, f is convex since its Hessian is positive semidefinite for all input WH+1, and thus any critical point of f is a global minimum. Combining the pervious two statements results in the desired claim.\nwe don’t need it in our proof). That is, R(L̄) ⊆ R(f) and R(r) ⊆ R(r′) (as functions of W and W ′ respectively) (the equality is also true when dy ≤ p although we don’t need it in our proof). Summarizing the above, whenever Xr = 0, there exists W ′ = WH+1 · · ·W1 such that Xr = Xr′ = 0, which achieves the global minimum value of f , f∗ and f∗ ≤ L̄∗ (i.e., the global minimum value of f is at most the global minimum value of L̄ since R(L̄) ⊆ R(f)). In other words, WH+1 · · ·W1 achieving Xr = 0 attains a global minimum value of f that is at most the global minimum value of L̄. This means that WH+1 · · ·W1 achieving Xr = 0 is a global minimum. Thus, we have proved that when rank(WH · · ·W2) = p and dy ≤ p, if ∇2L̄(W ) 0 at a critical point, it is a global minimum.\nThe case where rank(WH · · ·W2) = p and dy > p: We first obtain a necessary condition of the Hessian being positive semidefinite at a critical point and then interpret the condition. From Lemma 4.6, we have that C(CTC)−CT = Up̄UTp̄ or Xr = 0. If Xr = 0, with the exact same proof as in the case of dy ≤ p, it is a global minimum. Suppose that C(CTC)−CT = Up̄Up̄. Combined with Lemma 4.2, we have a necessary condition:\nWH+1 · · ·W1 = C(CTC)−CTY XT (XXT )−1 = Up̄Up̄Y XT (XXT )−1.\nFrom Lemma 4.4 with k = H + 1, R(WT2 · · ·WTH) ⊆ R(CTC) = R(CT ), which implies that p̄ , rank(C) = p (since rank(WH · · ·W2) = p). Thus, we can rewrite the above equation as WH+1 · · ·W1 = UpUpY XT (XXT )−1, which is the orthogonal projection on to subspace spanned by the p eigenvectors corresponding to the p largest eigenvalues following the ordinary least square regression matrix. This is indeed the expression of a global minimum (Baldi & Hornik, 1989; Baldi & Lu, 2012).\nThus, we have proved that when rank(WH · · ·W2) = p, if ∇2L̄(W ) 0 at a critical point, it is a global minimum.\nThe case where rank(WH · · ·W2) < p: Suppose that rank(WH · · ·W2) < p. From Lemma 4.4, we have a following necessary condition for the Hessian to be (positive or negative) semidefinite at a critical point: for any k ∈ {2, . . . ,H + 1},\nR((Wk−1 · · ·W2)T ) ⊆ R(CTC) or XrWH+1 · · ·Wk+1 = 0,\nwhere the first condition is shown to imply rank(WH+1 · · ·Wk) ≥ rank(Wk−1 · · ·W2) in Corollary 4.5. We repeatedly apply these conditions for k = 2, . . . ,H+1 to claim that with arbitrarily small > 0, we can perturb each parameter (i.e., each entry of WH , . . . ,W2) such that rank(WH+1 · · ·W2) ≥ min(p, dx) without changing the value of L̄(W ). Let Ak = WH+1 · · ·Wk+1. From Corollary 4.5 with k = 2, we have that rank(WH+1 · · ·W2) ≥ d1 ≥ p or XrWH+1 · · ·W3 = 0 (note that d1 ≥ p ≥ p̄ by their definitions). The former condition is false since rank(WH+1 · · ·W2) ≤ rank(WH · · ·W2) < p. From the latter condition, for an arbitrary L2,\n0 = XrWH+1 · · ·W3 ⇔W2W1 = ( AT2 A2 )− AT2 Y X T (XXT )−1 + (I − (AT2 A2)−AT2 A2)L2 (4)\n⇔WH+1 · · ·W1 = A2 ( AT2 A2 )− AT2 Y X T (XXT )−1\n= C(CTC)−CTY XT (XXT )−1 = Up̄U T p̄ Y X T (XXT )−1,\nwhere the last two equalities follow Lemmas 4.2 and 4.6 (since if Xr = 0, we immediately obtain the desired result as discussed above). Taking transpose,\n(XXT )−1XY TA2 ( AT2 A2 )− AT2 = (XX T )−1XY TUp̄U T p̄ ,\nwhich implies that XY TA2 ( AT2 A2 )− A2 = XY TUp̄Up̄.\nSince XY T is full rank with dy ≤ dx (i.e., rank(XY T ) = dy), there exists a left inverse and the solution of the above linear system is unique as ((XY T )TXY T )−1(XY T )TXY T = I , yielding,\nA2 ( AT2 A2 )− A2 = Up̄U T p̄ (= Up̄(U T p̄ Up̄) −1UTp̄ ).\nIn other words,R(A2) = R(C) = R(Up̄).\nSuppose that (AT2 A2) ∈ Rd2×d2 is nonsingular. Then, since R(A2) = R(C), we have that rank(WH · · ·W2) ≥ rank(C) = rank(A2) = d2 ≥ p, which is false in the case being analyzed (the case of rank(WH · · ·W2) < p). Thus, AT2 A2 is singular. If AT2 A2 is singular, from equation 4, it is inferred that we can perturb W2 to have rank(W2W1) ≥ min(p, dx). To see this in a concrete algebraic way, first note that since R(A2) = R(Up̄), we can write A2 = [Up̄ 0]G2 for some G2 ∈ GLd2(R) where 0 ∈ Rdy×(d2−p̄). Thus,\nAT2 A2 = G T 2 [ Ip̄ 0 0 0 ] G2.\nAgain, note that the set of all generalized inverse of GT2 [ Ip̄ 0 0 0 ] G2 is as follows (Zhang, 2006, p. 41): { G−12 [ Ip̄ L ′ 1\nL′2 L ′ 3\n] G−T2 | L′1, L′2, L′3 arbitrary } .\nSince equation 4 must hold for any generalized inverse, we choose a generalized inverse with L′1 = L ′ 2 = L ′ 3 = 0 for simplicity. That is,\n(AT2 A2) − := G−12 [ Ip̄ 0 0 0 ] G−T2 .\nThen, plugging this into equation 4, for an arbitrary L2,\nW2W1 = G −1 2 [ UTp̄ 0 ] Y XT (XXT )−1 + (Id2 −G−12 [ Ip̄ 0 0 0 ] G2)L2\n= G−12\n[ UTp̄ Y X T (XXT )−1\n0\n] +G−12 [ 0 0 0 I(d2−p̄) ] G2L2\n= G−12\n[ UTp̄ Y X T (XXT )−1\n[0 I(d2−p̄)]G2L2\n] .\nHere, [0 I(d2−p̄)]G2L2 ∈ R(d2−p̄)×dx is the last (d2 − p̄) rows of G2L2. Since rank(Y XT (XXT )−1) = dy (because the multiplication with the invertible matrix preserves the rank), the first p̄ rows in the above have rank p̄. Thus, W2W1 has rank at least p̄, and the possible rank deficiency comes from the last (d2− p̄) rows, [0 I(d2−p̄)]G2L2. Since WH+1 · · ·W1 = A2W2W1 = [Up̄ 0]G2W2W1,\nWH+1 · · ·W1 = [Up̄ 0] [ UTp̄ Y X T (XXT )−1\n[0 I(d2−p̄)]G2L2\n] = Up̄U T p̄ Y X T (XXT )−1.\nThis means that changing the values of the last (d2 − p̄) rows of G2L2 (i.e., [0 I(d2−p̄)]G2L2) does not change the value of L̄(W ). Therefore, the original necessary condition implies a necessary condition that without changing the loss value, we can make W2W1 to have full rank with arbitrarily small perturbation of the last (d2− p̄) rows as [0 I(d2−p̄)]G2L2 + Mptb where Mptb is a perturbation matrix with arbitrarily small > 0.7\n7We have only proved that the submatrix of the first p̄ rows has rank p̄ and that changing the value of the last d2 − p̄ rows does not change the loss value. That is, we have not proven the exitance of Mptb that makes W2W1 full rank. Although this is trivial since the set of full matrices is dense, we show a proof in\nthe following to be complete. Let p̄′ ≥ p̄ be the rank of W2W1. That is, in [ UTp̄ Y X T (XXT )−1\n[0 I(d2−p̄)]G2L2\n] , there\nexist p̄′ linearly independent row vectors including the first p̄ row vectors, denoted by b1, . . . , bp̄′ ∈ R1×dx . Then, we denote the rest of row vectors by v1, v2, . . . , vd2−p̄′ ∈ R\n1×dx . Let c = min(d2 − p̄′, dx − p̄′). There exist linearly independent vectors v̄1, v̄2, . . . , v̄c such that the set, {b1, . . . , bp̄′ , v̄1, v̄2, . . . , v̄c}, is linearly independent. Setting vi := vi + v̄i for all i ∈ {1, . . . , c} makes W2W1 full rank since v̄i cannot be expressed as a linear combination of other vectors. Thus, a desired perturbation matrix Mptb can be obtained by setting Mptb to consists of v̄1, v̄2, . . . , v̄c row vectors for the corresponding rows and 0 row vectors for other rows.\nNow, we show that such a perturbation can be done via a perturbation of the entries of W2. From the above equation for W2W1, all the possible solutions of W2 can be written as: for an arbitrary L0 and L2,\nW2 = G −1 2\n[ UTp̄ Y X T (XXT )−1\n[0 I(d2−p̄)]G2L2\n] W †1 + L T 0 (I −W1W † 1 ),\nwhere M† is the the Moore—Penrose pseudoinverse of M . Thus, we perturb W2 as\nW2 := W2 + G −1 2\n[ 0\nMptb\n] W †1 = G −1 [ UTp̄ Y X T (XXT )−1\n[0 I(d2−p̄)]G2L2 + Mptb\n] W †1 + L T 0 (I −W1W † 1 ).\nNote that upon such a perturbation, equation 4 may not hold anymore; i.e.,\nG−12\n[ UTp̄ Y X T (XXT )−1\n[0 I(d2−p̄)]GL2 + Mptb\n] W †1W1 6= G −1 2 [ UTp̄ Y X T (XXT )−1\n[0 I(d2−p̄)]GL2 + Mptb\n] .\nThis means that the original necessary condition that implies equation 4 no longer holds. In this case, we immediately conclude that the Hessian is no longer positive semidefinite and thus the point is a saddle point. We thereby consider the remaining case: equation 4 still holds. Then, with the perturbation on the entries of W1,\nW2W1 = G −1 2\n[ UTp̄ Y X T (XXT )−1\n[0 I(d2−p̄)]G2L2 + Mptb\n] ,\nas desired.\nThus, we showed that we can have rank(W2) ≥ rank(W2W1) ≥ min(p, dx), with arbitrarily small perturbation of each entry of W2 with the loss value being remained. To prove the corresponding results for Wk · · ·W2 for any k = 2, ...,H + 1, we conduct induction on k = 2, . . . ,H + 1 with the same proof procedure. The proposition P (k) to be proven is as follows: the necessary conditions with j ≤ k imply that we can have rank(Wk · · ·W2) ≥ min(p, dx) with arbitrarily small perturbation of each entry of Wk, . . .W2 without changing the loss value. For the base case k = 2, we have already proved the proposition in the above.\nFor the inductive step with k ∈ {3, . . . ,H + 1}, we have the inductive hypothesis that we can have rank(Wk−1 · · ·W2) ≥ min(p, dx) with arbitrarily small perturbation of each entry of Wk−1, . . .W2 without changing the loss value. Accordingly, suppose that rank(Wk−1 · · ·W1) ≥ min(p, dx). Again, from Lemma 4.4, for any k ∈ {3, . . . ,H + 1},\nR((Wk−1 · · ·W2)T ) ⊆ R(CTC) or XrWH+1 · · ·Wk+1 = 0. If the former is true, rank(WH · · ·W2) ≥ rank(C) ≥ rank(Wk−1 · · ·W2) ≥ min(p, dx), which is the desired statement (it immediately implies the proposition P (k) for any k). If the latter is true, for an arbitrary Lk,\n0 = XrWH+1 · · ·Wk+1 ⇔Wk · · ·W1 = ( ATkAk )− ATk Y X T (XXT )−1 + (I − (ATkAk)−ATkAk)Lk (5)\n⇔WH+1 · · ·W1 = Ak ( ATkAk )− ATk Y X T (XXT )−1\n= C(CTC)−CTY XT (XXT )−1 = Up̄U T p̄ Y X T (XXT )−1,\nwhere the last two equalities follow Lemmas 4.2 and 4.6. Taking transpose, (XXT )−1XY TAk ( ATkAk )− ATk = (XX T )−1XY TUp̄U T p̄ ,\nwhich implies that XY TAk ( ATkAk )− Ak = XY\nTUp̄Up̄. Since XY T is full rank with dy ≤ dx (i.e., rank(XY T ) = dy), there exists a left inverse and the solution of the above linear system is unique as ((XY T )TXY T )−1(XY T )TXY T = I , yielding,\nAk ( ATkAk )− Ak = Up̄U T p̄ (= Up̄(U T p̄ Up̄) −1UTp̄ ).\nIn other words,R(Ak) = R(C) = R(Up̄).\nSuppose that (ATkAk) ∈ Rdk×dk is nonsingular. Then, sinceR(Ak) = R(C), rank(WH · · ·W2) ≥ rank(C) = rank(Ak) = dk ≥ p, which is false in the case being analyzed (the case of\nrank(WH · · ·W2) < p). Thus, ATkAk is singular. Notice that for the boundary case with k = H + 1, ATkAk = Idy , which is always nonsingular and thus the proof ends here (i.e., For the case with k = H + 1, since the latter condition, XrWH+1 · · ·Wk+1 = 0, implies a false statement, the former condition, rank(WH · · ·W2) ≥ rank(C) ≥ min(p, dx), which is the desired statement, must be true).\nIf ATkAk is singular, from equation 5, it is inferred that we can perturb Wk to have rank(Wk · · ·W1) ≥ min(p, dx). To see this in a concrete algebraic way, first note that since R(Ak) = R(Up̄), we can write Ak = [Up̄ 0]Gk for some Gk ∈ GLdk(R) where 0 ∈ Rdy×(dk−p̄). Then, similarly to the base case with k = 2, plugging this into the condition in equation 5: for an arbitrary Lk,\nWk · · ·W1 = G−1k\n[ UTp̄ Y X T (XXT )−1\n[0 I(dk−p̄)]GkLk\n] .\nSince rank(Y XT (XXT )−1) = dy, the first p̄ rows in the above have rank p̄. Thus, Wk · · ·W1 has rank at least p̄. On the other hand, since WH+1 · · ·W1 = AkWk · · ·W1 = [Up̄ 0]GWk · · ·W1,\nWH+1 · · ·W1 = [Up̄ 0] [ UTp̄ Y X T (XXT )−1\n[0 I(dk−p̄)]GkLk\n] = Up̄U T p̄ Y X T (XXT )−1,\nwhich means that changing the values of the last (dk − p̄) rows of Wk · · ·W1 does not change the value of L̄(W ). Therefore, the original necessary condition implies a necessary condition that without changing the loss value, we can make Wk · · ·W1 to have full rank with arbitrarily small perturbation on the last (dk − p̄) rows as [0 I(dk−p̄)]GkLk + Mptb where Mptb is a perturbation matrix with arbitrarily small > 0 (a proof of the existence of a corresponding perturbation matrix is exactly the same as the proof in the base case with k = 2, which is in footnote 7).\nSimilarly to the base case with k = 2, we can conclude that this perturbation can be down via a perturbation on each entry of Wk. From the above equation for Wk · · ·W1, all the possible solutions of Wk can be written as: for an arbitrary L0 and Lk,\nWk = G −1 k\n[ UTp̄ Y X T (XXT )−1\n[0 I(dk−p̄)]GkLk\n] (Wk−1 · · ·W1)† + LT0 (I − (Wk−1 · · ·W1)(Wk−1 · · ·W1)†).\nThus, we perturb Wk as\nWk := Wk + G −1 k\n[ 0\nMptb\n] (Wk−1 · · ·W1)†\n= G−1k\n[ UTp̄ Y X T (XXT )−1\n[0 I(dk−p̄)]GkLk + Mptb\n] (Wk−1 · · ·W1)† + LT0 (I − (Wk−1 · · ·W1)(Wk−1 · · ·W1)†).\nNote that upon such a perturbation, equation 5 may not hold anymore; i.e.,\nG−1k\n[ UTp̄ Y X T (XXT )−1\n[0 I(dk−p̄)]GkLk + Mptb\n] (Wk−1 · · ·W1)†(Wk−1 · · ·W1) 6= G−1 [ UTp̄ Y X T (XXT )−1\n[0 I(dk−p̄)]GL2 + Mptb\n] .\nThis means that the original necessary condition that implies equation 5 no longer holds. In this case, we immediately conclude that the Hessian is no longer positive semidefinite and thus the point is a saddle point. We thereby consider the remaining case: equation 5 still holds. Then, with the perturbation on the entries of Wk,\nWH+1 · · ·W1 = G−1k\n[ UTp̄ Y X T (XXT )−1\n[0 I(dk−p̄)]GkLk + Mptb\n] ,\nas desired. Therefore, we have that rank(Wk · · ·W2) ≥ rank(Wk · · ·W1) ≥ min(p, dx) upon such a perturbation.\nThus, we conclude the induction, proving that we can have rank(WH · · ·W2) ≥ rank(WH+1 · · ·W2) ≥ min(p, dx) with arbitrarily small perturbation of each parameter without changing the value of L̄(W ). If p ≤ dx, this means that upon such a perturbation, we have the case of rank(WH · · ·W2) = p (since we have that p ≥ rank(WH · · ·W2) ≥ p where the first inequality follows the definition of p), with which we have already proved the existence of some negative eigenvalue of the Hessian unless it is a global minimum. Thus, such\na critical point is not a local minimum unless it is a global minimum. On the other hand, if p > dx, upon such a perturbation, we have p̄ , rank(WH+1 · · ·W2) ≥ dx ≥ dy. Thus, WH+1 · · ·W1 = Up̄UTp̄ Y XT (XXT )−1 = UUTY XT (XXT )−1, which is a global minimum. We can see this in various ways. For example, Xr = XY TUUT −XY T = 0, which means that it is a global minimum as discussed above.\nSummarizing the above, any point that satisfies the definition (and necessary conditions) of a local minimum is a global minimum, concluding the proof of Theorem 2.3 (ii).\nB.2 Proof of Theorem 2.3 (i)\nProof We can prove the non-convexity and non-concavity from its Hessian (Theorem 2.3 (i)). First, consider L̄(W ). For example, from Corollary 4.5 with k = H + 1, it is necessary for the Hessian to be positive or negative semidefinite at a critical point that rank(WH+1) ≥ rank(WH · · ·W2) or Xr = 0. The instances of W unsatisfying this condition at critical points form some uncountable set. For example, consider a uncountable set that consists of the points with WH+1 = W1 = 0 and with any WH , . . . ,W2. Then, every point in the set defines a critical point from Lemma 4.1. Also, Xr = XY T 6= 0 as rank(XY T ) ≥ 1. So, it does not satisfies the first semidefinite condition. On the other hand, with any instance of WH · · ·W2 such that rank(WH · · ·W2) ≥ 1, we have that 0 = rank(WH+1) rank(WH · · ·W2). So, it does not satisfy the second semidefinite condition as well. Thus, we have proved that in the domain of the loss function, there exist points, at which the Hessian becomes indefinite. This implies Theorem 2.3 (i): the functions are non-convex and non-concave.\nB.3 Proof of Theorem 2.3 (iii)\nProof We now prove Theorem 2.3 (iii): every critical point that is not a global minimum is a saddle point. Here, we want to show that if the Hessian is negative semidefinite at a critical point, then there is a increasing direction so that there is no local maximum. Since L̄(W ) = 1 2 ∑m i=1 ∑dy j=1((WH+1)j,· · · ·W1X·,i − Yj,i)2,\nD(WH+1)1,t L̄(W ) = 1\n2 m∑ i=1 D(WH+1)1,t((WH+1)1,· · · ·W1X·,i − Y1,i) 2\n= m∑ i=1 ((WH+1)1,· · · ·W1X·,i − Y1,i) ( D(WH+1)1,t dH∑ l=1 (WH+1)1,l(WH)l,· · · ·W1X·,i )\n= m∑ i=1 ((WH+1)1,· · · ·W1X·,i − Y1,i) ((WH)t,· · · ·W1X·,i) .\nSimilarly,\nD(WH+1)1,tD(WH+1)1,tL̄(W ) = m∑ i=1 ((WH)t,· · · ·W1X·,i)2 ∈ R.\nTherefore, with other variables being fixed, L̄ is strictly convex in (WH+1)t,1 ∈ R coordinate for some t unless (WH)t,· · · ·W1X·,i = 0 for all i = 1, . . . ,m and for all t = 1, . . . dH . Since rank(X) = dx, in order to have (WH)t,· · · ·W1X·,i = 0 for all i = 1, . . . ,m, the dimension of the null space of (WH)t,· · · ·W1 must be at least dx for each t. Since (WH)t,· · · ·W1 ∈ R1×dx for each each t, this means that (WH)t,· · · ·W1 = 0 for all t. Therefore, with other variables being fixed, L̄ is strictly convex in (WH+1)1,t ∈ R coordinate for some t if WH · · ·W1 6= 0. If WH · · ·W1 = 0, we claim that at a critical point, if the Hessian is negative semidefinite, we can make WH · · ·W1 6= 0 with arbitrarily small perturbation of each parameter without changing the loss value. We can prove this by using the similar proof procedure to that used for Theorem 2.3 (ii) in the case of rank(WH · · ·W2) < p. Suppose that WH · · ·W1 = 0 and thus rank(WH · · ·W1) = 0. From Lemma 4.4, we have a following necessary condition for the Hessian to be (positive or negative) semidefinite at a critical point: for any k ∈ {2, . . . ,H + 1},\nR((Wk−1 · · ·W2)T ) ⊆ R(CTC) or XrWH+1 · · ·Wk+1 = 0,\nwhere the first condition is shown to imply rank(WH+1 · · ·Wk) ≥ rank(Wk−1 · · ·W2) in Corollary 4.5.\nLet Ak = WH+1 · · ·Wk+1. From the condition with k = 2, we have that rank(WH+1 · · ·W2) ≥ d1 ≥ 1 or XrWH+1 · · ·W3 = 0. The former condition is false since rank(WH · · ·W2) < 1. From the latter condition, for an arbitrary L2,\n0 = XrWH+1 · · ·W3 ⇔W2W1 = ( AT2 A2 )− AT2 Y X T (XXT )−1 + (I − (AT2 A2)−AT2 A2)L2 (6)\n⇔WH+1 · · ·W1 = A2 ( AT2 A2 )− AT2 Y X T (XXT )−1\n= C(CTC)−CTY XT (XXT )−1\nwhere the last follow the critical point condition (Lemma 4.2). Then, similarly to the proof of Theorem 2.3 (ii),\nA2 ( AT2 A2 )− A2 = C(C TC)−CT .\nIn other words,R(A2) = R(C). Suppose that rank(AT2 A2) ≥ 1. Then, since R(A2) = R(C), we have that rank(WH · · ·W2) ≥ rank(C) ≥ 1, which is false (or else the desired statement). Thus, rank(AT2 A2) = 0, which implies that A2 = 0. Then, since WH+1 · · ·W1 = A2W2W1 with A2 = 0, we can have W2W1 6= 0 without changing the loss value with arbitrarily small perturbation of W2 and W1.\nThus, we showed that we can have W2W1 6= 0, with arbitrarily small perturbation of each parameter with the loss value being unchanged. To prove the corresponding results for Wk · · ·W2 for any k = 2, ...,H , we conduct induction on k = 2, . . . ,H with the same proof procedure. The proposition P (k) to be proven is as follows: the necessary conditions with j ≤ k implies that we can have Wk · · ·W2 6= 0 with arbitrarily small perturbation of each parameter without changing the loss value. For the base case k = 2, we have already proved the proposition in the above.\nFor the inductive step with k ≥ 3, we have the inductive hypothesis that we can have Wk−1 · · ·W2 6= 0 with arbitrarily small perturbation of each parameter without changing the loss value. Accordingly, suppose that Wk−1 · · ·W1 6= 0. Again, from Lemma 4.4, for any k ∈ {2, . . . ,H + 1},\nR((Wk−1 · · ·W2)T ) ⊆ R(CTC) or XrWH+1 · · ·Wk+1 = 0. If the former is true, rank(WH · · ·W2) ≥ rank(C) ≥ rank(Wk−1 · · ·W2) ≥ rank(Wk−1 · · ·W2W1) ≥ 1, which is false (or the desired statement). If the latter is true, for an arbitrary L1,\n0 = XrWH+1 · · ·Wk+1 ⇔Wk · · ·W1 = ( ATkAk )− ATk Y X\nT (XXT )−1 + (I − (ATkAk)−ATkAk)L1 ⇔WH+1 · · ·W1 = Ak ( ATkAk )− ATk Y X T (XXT )−1\n= C(CTC)−CTY XT (XXT )−1 = Up̄U T p̄ Y X T (XXT )−1,\nwhere the last follow the critical point condition (Lemma 4.2). Then, similarly to the above, Ak ( ATkAk )− Ak = C(C TC)−CT .\nIn other words,R(Ak) = R(C). Suppose that rank(ATkAk) ≥ 1. Then, since R(Ak) = R(C), we have that rank(WH · · ·W2) ≥ rank(C) = rank(Ak) ≥ 1, which is false (or the desired statement). Thus, rank(ATkAk) = 0, which implies that Ak = 0. Then, since WH+1 · · ·W1 = AkWk · · ·W1 with Ak = 0, we can have Wk · · ·W1 6= 0 without changing the loss value with arbitrarily small perturbation of each parameter. Thus, we conclude the induction, proving that if WH · · ·W1 = 0, with arbitrarily small perturbation of each parameter without changing the value of L̄(W ), we can have WH · · ·W2 6= 0. Thus, upon such a perturbation at any critical point with the negative semidefinite Hessian, the loss function is strictly convex in (WH+1)1,t ∈ R coordinate for some t. That is, at any candidate point for a local maximum, there exists a strictly increasing direction in an arbitrarily small neighbourhood. This means that there is no local maximum. Thus, we obtained the statement of Theorem 2.3 (i).\nB.4 Proof of Theorem 2.3 (iv)\nProof In the proof of Theorem 2.3 (ii), the case analysis with the case, rank(WH · · ·W2) = p, revealed that when rank(WH · · ·W2) = p, if ∇2L̄(W ) 0 at a critical point, W is a global minimum. Thus, when rank(WH · · ·W2) = p, if W is not a global minimum at a critical point, its Hessian is not positive semidefinite, containing some negative eigenvalue. From Theorem 2.3 (ii), if it is not a global minimum, it is not a local minimum. From Theorem 2.3 (iii), it is a saddle point. Thus, if rank(WH · · ·W2) = p, the Hessian at any saddle point has some negative eigenvalue, which is the statement of Theorem 2.3 (iv).\nB.5 Proof of Theorem 3.2 and discussion of the assumptions\nProof\nEZ [L(W )] = EZ 1 2 m∑ i=1 dy∑ j=1 (Ŷ (W,X)j,i − Yj,i)2 \n= 1\n2 m∑ i=1 dy∑ j=1 EZ [Ŷ (W,X)2j,i]− 2Yj,iEZ [Ŷ (W,X)j,i] + Y 2j,i\n= 1\n2 m∑ i=1 dy∑ j=1 ρ2q2  Ψj∑ p=1 [Xi](j,p) H∏ k=1 w(j,p) 2 − 2ρqYj,i  Ψj∑ p=1 [Xi](j,p) H∏ k=1 w(j,p) + Y 2j,i The first line follows the definition of the Frobenius norm. In the second line, we used the linearity of the expectation. The third line follows the independence assumption (A1p-m and A5u-m in (Choromanska et al., 2015b,a)). That is, we have that EZ [Ŷ (W,X)j,i] = ρq ∑Ψj p=1[Xi](j,p) ∏H k=1 w(j,p).\nAlso, since ( ∑k p=1 ap) 2 = ∑k p=1 a 2 p + 2 ∑ p<p′ apap′ for any a and k, by denoting ai,j,p =\n[Xi](j,p) ∏H k=1 w(j,p),\nEZ [Ŷ (W,X)2j,i] = EZ   Ψj∑ p=1 ai,j,p[Zi](j,p) 2 \n= Ψj∑ p=1 a2i,j,pEZ [[Zi]2(j,p)] + 2 ∑ p<p′ ai,j,pai,j,p′EZ [[Zi](j,p)[Zi](j,p′)] = ρ2 Ψj∑ p=1 a2i,j,p + 2ρ 2 ∑ p<p′ ai,j,pai,j,p′\n= ρ2  Ψj∑ p=1 [Xi](j,p) H∏ k=1 w(j,p) 2\nAll the assumptions used above are subset of assumptions that were used, for example, in the first equation of the proof of theorem 3.3 in (Choromanska et al., 2015a). Finally, since q = ρ−1 and∑Ψj p=1[Xi](j,p) ∏H k=1 w(j,p) = (WH+1WHWH−1 · · ·W2W1X)j,i = Y j,i, the last line of the above equation for EZ [L(W )] is equal to 12‖Y − Y ‖ 2 F= L̄(W ). Also, LEZ [Ŷ ](W ) = 1 2‖E[Ŷ (W,X)] − Y ‖2F= 12‖E[Ŷ (W,X)]− Y ‖ 2 F= 1 2‖Y − Y ‖ 2 F= L̄(W ).\nTherefore, what we have proved to be true for L̄(W ) is also true for EZ [L(W )] and LEZ [Ŷ ](W ). We conclude the proof of Theorem 3.2.\nNote that we could reduce the loss functions EZ [L(W )] and LEZ [Ŷ ](W ) to L̄(W ) only with a strict subset of the assumptions used in the previous work. Accordingly, a question might arise as to how much we can reshape the loss function with all the assumptions used in the previous work. To answer this question, we note that Choromanska et al. (2015b,a) reduced their loss functions of nonlinear neural networks to:\nEξ,Z [Lhinge(W )1,1] = 1\nΛ(H−1)/2 Λ∑ i1,i2,...,iH=1 Xi1,i2,...,iH w̃i1w̃i2 . . . w̃iH s.t. 1 Λ Λ∑ i=1 w̃2i = 1,\nwhere Λ ∈ R is some constant related to the size of the network (i.e., not the matrix containing the eigenvalues). While we refer to (Choromanska et al., 2015b,a) for the detailed definitions of the symbols, X and w are defined in the same way as ours are, and w̃ is a modified version due to other assumptions that we did not adopt. Here, we observe that not only the model but also the loss function is linear in the inputs (the nonlinear activation function has disappeared—The inputs are simply multiplied by some coefficients and then summed). Moreover, the target function Y has disappeared (i.e., the loss value does not depend on the target function). That is, whatever the data points of Y are, their loss values are the same. Thus, we see that the loss functions can be reduced to much different functions with all the assumptions used in the previous work (i.e, A1p, A2p, A3p, A4p, A5u, A6u, and A7p). We adopted a strict subset of the assumptions, with which we reduced our loss function to a more realistic loss function of a deep neural network."
    }, {
      "heading" : "C Proofs of Corollaries 2.4 and 3.3",
      "text" : "We complete the proofs of Corollaries 2.4 and 3.3.\nProof If H = 1, the condition in Theorem 2.3 (iv) reads \"if rank(W1 · · ·W2) = rank(Id1) = d1 = p\", which is always true. This is because p is the smallest width of hidden layers and there is only one hidden layer, the width of which is d1. Thus, Theorem 2.3 (iv) immediately implies the statement of Corollary 2.4. For the statement of Corollary 2.4 with H ≥ 2, it is suffice to show the existence of a simple set containing saddle points with the Hessian having no negative eigenvalue. Suppose that WH = WH−1 = · · · = W2 = W1 = 0. Then, from Lemma 4.1, it defines a uncountable set of critical points, in which WH+1 can vary in Rdy×dH . Since r = Y T 6= 0 due to rank(Y ) ≥ 1, it is not a global minimum. To see this, we write\nL̄(W ) = 1 2 ‖Y (W,X)− Y ‖2F= 1 2 tr(rT r)\n= 1 2 tr(Y Y T )− 1 2 tr(WH+1 · · ·W1XY T )− 1 2 tr((WH+1 · · ·W1XY T )T )\n+ 1\n2 tr(WH+1 · · ·W1XXT (WH+1 · · ·W1)T ).\nFor example, with WH+1 · · ·W1 = ± UpUTp Y XT (XX)−1,\nL̄(W ) = 1 2\n( tr(Y Y T )− tr(UpUTp Σ)− tr(ΣUpUTp ) + tr(UpUTp ΣUpUTp ) ) = 1\n2\n( tr(Y Y T )− tr(UpΛ1:pUTp ) ) = 1\n2\n( tr(Y Y T )±\np∑ k=1 Λk,k\n) ,\nwhere we can see that there exists a strictly lower value of L̄(W ) than the loss value with r = Y T , which is 12 tr(Y Y\nT ) (since X 6= 0 and rank(Σ) 6= 0). Thus, these are not global minima, and thereby these are saddle points by Theorem 2.3 (ii) and (iii). On the other hand, from the proof of Lemma 4.3, every diagonal and off-diagonal element of the Hessian is zero if WH = WH−1 = · · · = W2 = W1 = 0. Thus, the Hessian is simply a zero matrix, which has no negative eigenvalue. Using the argument in the proof of Theorem 3.2, we can deduce that the same results hold for EZ [L(W )] and LEZ [Ŷ ](W )."
    }, {
      "heading" : "D Discussion of the 1989 conjecture",
      "text" : "The 1989 conjecture is based on the result for a 1-hidden layer network with p < dy = dx (e.g., an autoencoder). That is, the previous work considered Y = W2W1 with the same loss function as ours with the additional assumption p < dy = dx. The previous work denotes A ,W2 and B ,W1.\nThe conjecture was expressed by Baldi & Hornik (1989) as\nOur results, and in particular the main features of the landscape of E, hold true in the case of linear networks with several hidden layers.\nHere, the “main features of the landscape of E” refers to the following features, among other minor technical facts: 1) the function is convex in each matrix A (or B) when fixing other B (or A), and 2) every local minimum is a global minimum. No proof was provided in this work for this conjecture.\nIn 2012, the proof for the conjecture corresponding to the first feature (convexity in each matrix A (or B) when fixing other B (or A)) was provided in (Baldi & Lu, 2012) for both real-valued and complex-valued cases, while the proof for the conjecture for the second feature (every local minimum being a global minimum) was left for future work.\nIn (Baldi, 1989), there is an informal discussion regarding the conjecture. Let i ∈ {1, · · · , H} be an index of a layer with the smallest width p. That is, di = p. We write\nA := WH+1 · · ·Wi+1\nB := Wi · · ·W1. Then, what A and B can represent is the same as what the original A := W2 and B := W1, respectively, can represent in the 1-hidden layer case, assuming that p < dy = dx (i.e., any element in Rdy×p and any element in Rp×dx). Thus, we would conclude that all the local minima in the deeper models always correspond to the local minima of the collapsed 1-hidden layer version with A := WH+1 · · ·Wi+1 and B := Wi · · ·W1. However, the above reasoning turns out to be incomplete. Let us prove the incompleteness of the reasoning by contradiction in a way in which we can clearly see what goes wrong. Suppose that the reasoning is complete (i.e., the following statement is true: if we can collapse the model with the same expressiveness with the same rank restriction, then the local minima of the model correspond to the local minima of the collapsed model). Consider f(w) = W3W2W1 = 2w2 + w3, where W1 = [w w w], W2 = [1 1 w]T and W3 = w. Then, let us collapse the model as a := W3W2W1 and g(a) = a. As a result, what f(w) can represent is the same as what g(a) can represent (i.e., any element in R) with the same rank restriction (with a rank of at most one). Thus, with the same reasoning, we can conclude that every local minimum of f(w) corresponds to a local minimum of g(a). However, this is clearly false, as f(w) is a non-convex function with a local minimum at w = 0 that is not a global minimum, while g(a) is linear (convex and concave) without any local minima. The convexity for g(a) is preserved after the composition with any norm. Thus, we have a contradiction, proving the incompleteness of the reasoning. What is missed in the reasoning is that even if what a model can represent is the same, the different parameterization creates different local structure in the loss surface, and thus different properties of the critical points (global minima, local minima, saddle points, and local maxima).\nNow that we have proved the incompleteness of this reasoning, we discuss where the reasoning actually breaks down in a more concrete example. From Lemmas 4.1 and 4.2, if H = 1, we have the following representation at critical points:\nAB = A(ATA)−ATY XT (XXT )−1.\nwhere A := W2 and B := W1. In contrast, from Lemmas 4.1 and 4.2, if H is arbitrary,\nAB = C(CTC)−CTY XT (XXT )−1.\nwhere A := WH+1 · · ·Wi+1 and B := Wi · · ·W1 as discussed above, and C = WH+1 · · ·W2. Note that by using other critical point conditions from Lemmas 4.1, we cannot obtain an expression such that C = A in the above expression unless i = 1. Therefore, even though what A and B can represent is the same, the critical condition becomes different (and similarly, the conditions from\nthe Hessian). Because the proof in the previous work with H = 1 heavily relies on the fact that AB = A(ATA)−ATY XT (XXT )−1, the same proof does not apply for deeper models (we may continue providing more evidence as to why the same proof does not work for deeper models, but one such example suffices for the purpose here).\nIn this respect, we have completed the proof of the conjecture and also provided a complete analytical proof for more general and detailed statements; that is, we did not assume that p < dy = dx, and we also proved saddle point properties with negative eigenvalue information."
    } ],
    "references" : [ {
      "title" : "Linear learning: Landscapes and algorithms",
      "author" : [ "Baldi", "Pierre." ],
      "venue" : "Advances in neural information processing systems. pp. 65–72.",
      "citeRegEx" : "Baldi and Pierre.,? 1989",
      "shortCiteRegEx" : "Baldi and Pierre.",
      "year" : 1989
    }, {
      "title" : "Neural networks and principal component analysis: Learning from examples without local minima",
      "author" : [ "Baldi", "Pierre", "Hornik", "Kurt" ],
      "venue" : "Neural networks,",
      "citeRegEx" : "Baldi et al\\.,? \\Q1989\\E",
      "shortCiteRegEx" : "Baldi et al\\.",
      "year" : 1989
    }, {
      "title" : "Training a 3-node neural network is NP-complete",
      "author" : [ "Blum", "Avrim L", "Rivest", "Ronald L" ],
      "venue" : "Neural Networks,",
      "citeRegEx" : "Blum et al\\.,? \\Q1992\\E",
      "shortCiteRegEx" : "Blum et al\\.",
      "year" : 1992
    }, {
      "title" : "The Loss Surfaces of Multilayer Networks",
      "author" : [ "Choromanska", "Anna", "Henaff", "MIkael", "Mathieu", "Michael", "Ben Arous", "Gerard", "LeCun", "Yann" ],
      "venue" : "In Proceedings of the Eighteenth International Conference on Artificial Intelligence and Statistics",
      "citeRegEx" : "Choromanska et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Choromanska et al\\.",
      "year" : 2015
    }, {
      "title" : "Open Problem: The landscape of the loss surfaces of multilayer networks",
      "author" : [ "Choromanska", "Anna", "LeCun", "Yann", "Arous", "Gérard Ben" ],
      "venue" : "In Proceedings of The 28th Conference on Learning Theory",
      "citeRegEx" : "Choromanska et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Choromanska et al\\.",
      "year" : 2015
    }, {
      "title" : "Identifying and attacking the saddle point problem in high-dimensional non-convex optimization",
      "author" : [ "Dauphin", "Yann N", "Pascanu", "Razvan", "Gulcehre", "Caglar", "Cho", "Kyunghyun", "Ganguli", "Surya", "Bengio", "Yoshua" ],
      "venue" : "In Advances in Neural Information Processing Systems",
      "citeRegEx" : "Dauphin et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Dauphin et al\\.",
      "year" : 2014
    }, {
      "title" : "Escaping From Saddle Points—Online Stochastic Gradient for Tensor Decomposition",
      "author" : [ "Ge", "Rong", "Huang", "Furong", "Jin", "Chi", "Yuan", "Yang" ],
      "venue" : "In Proceedings of The 28th Conference on Learning Theory",
      "citeRegEx" : "Ge et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Ge et al\\.",
      "year" : 2015
    }, {
      "title" : "Deep Learning. Book in preparation for MIT Press. http://www.deeplearningbook.org",
      "author" : [ "Goodfellow", "Ian", "Bengio", "Yoshua", "Courville", "Aaron" ],
      "venue" : null,
      "citeRegEx" : "Goodfellow et al\\.,? \\Q2016\\E",
      "shortCiteRegEx" : "Goodfellow et al\\.",
      "year" : 2016
    }, {
      "title" : "On the computational efficiency of training neural networks",
      "author" : [ "Livni", "Roi", "Shalev-Shwartz", "Shai", "Shamir", "Ohad" ],
      "venue" : "In Advances in Neural Information Processing Systems",
      "citeRegEx" : "Livni et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Livni et al\\.",
      "year" : 2014
    }, {
      "title" : "Learning Real and Boolean Functions: When Is Deep Better Than Shallow",
      "author" : [ "Mhaskar", "Hrushikesh", "Liao", "Qianli", "Poggio", "Tomaso" ],
      "venue" : "Massachusetts Institute of Technology CBMM Memo No",
      "citeRegEx" : "Mhaskar et al\\.,? \\Q2016\\E",
      "shortCiteRegEx" : "Mhaskar et al\\.",
      "year" : 2016
    }, {
      "title" : "Some NP-complete problems in quadratic and nonlinear programming",
      "author" : [ "Murty", "Katta G", "Kabadi", "Santosh N" ],
      "venue" : "Mathematical programming,",
      "citeRegEx" : "Murty et al\\.,? \\Q1987\\E",
      "shortCiteRegEx" : "Murty et al\\.",
      "year" : 1987
    }, {
      "title" : "Exact solutions to the nonlinear dynamics of learning in deep linear neural networks",
      "author" : [ "Saxe", "Andrew M", "McClelland", "James L", "Ganguli", "Surya" ],
      "venue" : "In International Conference on Learning Representations",
      "citeRegEx" : "Saxe et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Saxe et al\\.",
      "year" : 2014
    }, {
      "title" : "The Schur complement and its applications",
      "author" : [ "Zhang", "Fuzhen." ],
      "venue" : "Vol. 4. Springer Science & Business Media.",
      "citeRegEx" : "Zhang and Fuzhen.,? 2006",
      "shortCiteRegEx" : "Zhang and Fuzhen.",
      "year" : 2006
    }, {
      "title" : "By solving for W1, W1 = (C TC)−CTY X (XX )−1 + (I − (CTC)−CTC)L, for an arbitrary matrix L. Due to the property of any generalized inverse (Zhang",
      "author" : [ "C. CC −XY" ],
      "venue" : null,
      "citeRegEx" : "−XY,? \\Q2006\\E",
      "shortCiteRegEx" : "−XY",
      "year" : 2006
    }, {
      "title" : "Here, the first implication follows the necessary condition with any principal submatrix and the second implication follows the necessary condition with the Schur complement (Zhang, 2006, theorem 1.20",
      "author" : [ ],
      "venue" : "(I −MM−)M ′ = 0 (Zhang,",
      "citeRegEx" : "T,? \\Q2006\\E",
      "shortCiteRegEx" : "T",
      "year" : 2006
    }, {
      "title" : "R(CC) = R(C",
      "author" : [ ],
      "venue" : null,
      "citeRegEx" : "⊆,? \\Q1989\\E",
      "shortCiteRegEx" : "⊆",
      "year" : 1989
    } ],
    "referenceMentions" : [ {
      "referenceID" : 8,
      "context" : "In addition to its practical success, theoretical results have shown that deep learning is attractive in terms of its generalization properties (Livni et al., 2014; Mhaskar et al., 2016).",
      "startOffset" : 144,
      "endOffset" : 186
    }, {
      "referenceID" : 9,
      "context" : "In addition to its practical success, theoretical results have shown that deep learning is attractive in terms of its generalization properties (Livni et al., 2014; Mhaskar et al., 2016).",
      "startOffset" : 144,
      "endOffset" : 186
    }, {
      "referenceID" : 7,
      "context" : "In this paper, as a step toward establishing the optimization theory for deep learning, we prove a conjecture noted in (Goodfellow et al., 2016) for deep linear networks, and also address an open problem announced in (Choromanska et al.",
      "startOffset" : 119,
      "endOffset" : 144
    }, {
      "referenceID" : 7,
      "context" : "Given the absence of a theoretical understanding of deep nonlinear neural networks, Goodfellow et al. (2016) noted that it is beneficial to theoretically analyze the loss functions of simpler models, i.",
      "startOffset" : 84,
      "endOffset" : 109
    }, {
      "referenceID" : 7,
      "context" : "Given the absence of a theoretical understanding of deep nonlinear neural networks, Goodfellow et al. (2016) noted that it is beneficial to theoretically analyze the loss functions of simpler models, i.e., linear neural networks. The function class of a linear neural network only contains functions that are linear with respect to inputs. However, their loss functions are non-convex in the weight parameters and thus nontrivial. Saxe et al. (2014) empirically showed that the optimization of deep linear models exhibits similar properties to those of the optimization of deep nonlinear models.",
      "startOffset" : 84,
      "endOffset" : 450
    }, {
      "referenceID" : 7,
      "context" : "Recently, Goodfellow et al. (2016) remarked that when Baldi & Hornik (1989) stated and proved Proposition 2.",
      "startOffset" : 10,
      "endOffset" : 35
    }, {
      "referenceID" : 7,
      "context" : "Recently, Goodfellow et al. (2016) remarked that when Baldi & Hornik (1989) stated and proved Proposition 2.",
      "startOffset" : 10,
      "endOffset" : 76
    }, {
      "referenceID" : 6,
      "context" : "4 suggest that for 1-hidden layer networks, training can be done in polynomial time with a second order method or even with a modified stochastic gradient decent method, as discussed in (Ge et al., 2015).",
      "startOffset" : 186,
      "endOffset" : 203
    }, {
      "referenceID" : 3,
      "context" : "Following the work by Dauphin et al. (2014), Choromanska et al.",
      "startOffset" : 22,
      "endOffset" : 44
    }, {
      "referenceID" : 3,
      "context" : "(2014), Choromanska et al. (2015a) investigated the connection between the loss functions of deep nonlinear networks and a function well-studied via random matrix theory (i.",
      "startOffset" : 8,
      "endOffset" : 35
    }, {
      "referenceID" : 3,
      "context" : "(2014), Choromanska et al. (2015a) investigated the connection between the loss functions of deep nonlinear networks and a function well-studied via random matrix theory (i.e., the Hamiltonian of the spherical spin-glass model). They explained that their theoretical results relied on several unrealistic assumptions. Later, Choromanska et al. (2015b) suggested at the Conference on Learning Theory (COLT) 2015 that discarding these assumptions is an important open problem.",
      "startOffset" : 8,
      "endOffset" : 352
    } ],
    "year" : 2016,
    "abstractText" : "In this paper, we prove a conjecture published in 1989 and also partially address an open problem announced at the Conference on Learning Theory (COLT) 2015. For an expected loss function of a deep nonlinear neural network, we prove the following statements under the independence assumption adopted from recent work: 1) the function is non-convex and non-concave, 2) every local minimum is a global minimum, 3) every critical point that is not a global minimum is a saddle point, and 4) the property of saddle points differs for shallow networks (with three layers) and deeper networks (with more than three layers). Moreover, we prove that the same four statements hold for deep linear neural networks with any depth, any widths and no unrealistic assumptions. As a result, we present an instance, for which we can answer to the following question: how difficult to directly train a deep model in theory? It is more difficult than the classical machine learning models (because of the non-convexity), but not too difficult (because of the nonexistence of poor local minima and the property of the saddle points). We note that even though we have advanced the theoretical foundations of deep learning, there is still a gap between theory and practice.",
    "creator" : "LaTeX with hyperref package"
  }
}