{
  "name" : "1606.06653.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Tracking Time-Vertex Propagation using Dynamic Graph Wavelets",
    "authors" : [ "Francesco Grassi", "Nathanaël Perraudin", "Benjamin Ricaud" ],
    "emails" : [ "francesco.grassi@polito.it", "firstname.lastname@epfl.ch" ],
    "sections" : [ {
      "heading" : null,
      "text" : "ar X\niv :1\n60 6.\n06 65\n3v 1\n[ cs\n.L G\n] 2\n1 Ju\nn 20\n16 1\nIndex Terms—Graph signal processing, time-vertex signal processing, joint Fourier transform, dynamic processes on graphs, wave equation\nI. INTRODUCTION\nComplex signals and high-dimensional datasets collected from a variety of fields of science, such as physics, engineering, genetics, molecular biology and many others, can be naturally modeled as values on the vertices of weighted graphs [1], [2]. Recently, dynamic activity over networks has been the subject of intense research in order to develop new models to understand and analyze epidemic spreading [3], rumor spreading over social networks [4], [5] or activity on sensor networks. The advances in the graph research has led to new tools to process and analyze time-varying graph and/or signal on the graph, such as multilayer graphs and tensor product of graphs [6], [7]. However, there is still a lack of signal processing methods able to retrieve or process information on dynamic phenomena taking place over graphs. For example the wavelets on graphs [8], [9] or the vertexfrequency transform [10] are dedicated to the study of a static signal over a graph.\nMotivated by an increasing amount of applications, we design a new class of wavelet frames named Dynamic Graph Wavelets (DGW) whose time evolution depends on the graph topology and follows a dynamic process. Each atom of the frame is a time-varying function defined on the graph. Combined with sparse recovery methods, such as compressive sensing, this allows for the detection and analysis of timevarying processes on graphs. These processes can be, for example, waves propagating over the nodes of a graph where we need to find the origin and speed of propagation or the existence of multiple sources.\nWe demonstrate the efficiency of the DGW on real data by tracking the origin of earthquake events recorded by a network of sensors."
    }, {
      "heading" : "II. PRELIMINARIES",
      "text" : ""
    }, {
      "heading" : "A. Notation",
      "text" : "Throughout this contribution, we will use bold upper and lower case letters for linear operators (or matrices) M and column vectors v, respectively. Furthermore, x will denote the vectorized version of X . Complex conjugate, transpose and conjugate transpose are denoted as X , X⊺ and X∗, respectively. Lower case letters a will denote scalars and upper case letters A will denote fixed constant. For any symmetric positive definite matrix M with singular value decomposition M = UΛU∗, the matrix function f(M) is defined as f(M) = Uf(Λ)U∗, where the scalar function f has been applied to each diagonal entry of Λ. The Kronecker product between two matrices (or vectors) is denoted as M1 ⊗M2, hence, the cartesian product between matrices (or vectors) is M1 ×M2 =M1 ⊗ I2 + I1 ⊗M2, where In is the identity matrix with size equal to Mn."
    }, {
      "heading" : "B. Graph Signal Processing",
      "text" : "Consider a graph G = (V , E ,W) of N nodes and E edges, where V indicates the set of nodes and E the set of edges. The weight function W : V × V → R reflects to what extent two nodes are related to each other. WG is the weight matrix associated to this function. The combinatorial Laplacian LG =DG −WG associated to the graph G is always symmetric positive semi-definite, therefore, due to the spectral theorem, it is characterized by a complete set of orthonormal eigenvectors [11]. We denote them by UG(n, ℓ) = uℓ(n). The Laplacian matrix can thus be decomposed as LG = UGΛGU∗G, with ΛG(ℓ, ℓ) = λℓ. Let x : V → R be a graph signal defined on the graph nodes, whose n-th component x(n) ∈ R represents the value of signal at the n-th node. The Graph Fourier Transform (GFT) of x is x̃ = U∗Gx and its inverse x = UGx̃."
    }, {
      "heading" : "III. TIME-VERTEX REPRESENTATION",
      "text" : ""
    }, {
      "heading" : "A. Definition",
      "text" : "Let X ∈ RN×T be a set of N temporal signals of length T . The signals are evolving with time over the N vertices of the graph G. We call the cartesian product between time and graph\n2 domain the time-vertex domain and X time-vertex signal. The time-vertex domain can be interpreted as a cartesian product between the generic graph G = (V , E ,W) with Laplacian LG and the ring graph GT (assuming periodic boundary conditions in time) with Laplacian LT . The joint Laplacian is\n(LT ×LG)x = LGX +XLT (1)\nwhere the second term is obtained using the property of the Kronecker product (M1 ⊗M2)x =M2XM⊺1 .\nIn equation (1) the Laplacian LT represents the discrete second order derivative with respect to time:\n[XLT ](n, t) =X(n, t+ 1)− 2X(n, t) +X(n, t− 1).\nIt can be decomposed as LT = UTΩU∗T where UT is the discrete Fourier basis [12] and Ω(k, k) = ωk are the eigenvalues of the classical DFT that are linked to the normalized discrete frequencies k\nT by the following relation:\nωk = 2\n( cos ( π k\nT\n) − 1 ) . (2)"
    }, {
      "heading" : "B. Joint Time-Vertex Fourier Transform",
      "text" : "Since the time-vertex representation is obtained from the cartesian product of the two original domains, the joint timevertex Fourier transform (JFT) is obtained by applying the GFT on the graph dimension and the DFT along the time dimension [13]:\nX̂(ℓ, k) = 1√ T\nN∑\nn=1\nT−1∑\nt=0\nX(n, t)u∗ℓ (n)e −jωk t T\nthat can be conveniently rewritten in matrix form as:\nX̂ = JFT(X) = U∗GXUT . (3)\nThe spectral domain helps in defining the localization of functions on the graph, as in [8]."
    }, {
      "heading" : "IV. DYNAMIC GRAPH WAVELETS",
      "text" : "The DGW differ from classical wavelets as they are not dilated versions of an initial mother wavelet. Indeed, they are propagating functions on the graph that evolve in time, according to a PDE. We will use the joint representation for the signal to characterize spectral relationships between the two domains and solve the PDE in the spectral domain obtaining an useful tool to analyze time-vertex signals that evolve according to this dynamic process. Finally, we will use the kernel to build the set of DGW. Because of the lack of translation invariance of graph, the kernel will always act in graph spectral domain and will be localized on the graph using the localization operator as in [8]. On the contrary the time dependence can be defined either in the spectral or in the time domain. In this contribution, we use for convenience the time domain."
    }, {
      "heading" : "A. Heat diffusion on graph",
      "text" : "Let us first provide a basic example for our model. The diffusion of heat on a graph can be seen as a simple dynamic process over a network. It is described by the following (discretized) differential equation:\nX(n, t)−X(n, t− 1) = −sLGX, (4)\nwith initial distributionX(i, 0) = ψ(i). The closed form solution is given by X = e−stLGψ. Therefore, the heat diffusion spectral kernel is\nK̃(sλℓ, t) = e −sλℓt (5)\nwhere the parameter s is the thermal diffusivity in classic heat diffusion problems and can be interpreted as a scale parameter for multiscale dynamic graph wavelet analysis [9]. This equation models the spreading of a function on the graph over time. However, in the present work we want to focus on a propagating process, moving away from an initial point as time passes. Hence we introduce a second model."
    }, {
      "heading" : "B. The wave equation on graphs",
      "text" : "To model functions evolving on a graph, we will use mainly the PDE associated to the wave equation. Here, the wave equation is defined on the graph, and, as such, differs from the standard one. This partial differential equation relates the second order derivative in time to the spatial Laplacian operator of a function:\n(LT ⊗ IG)x = −α2(IT ⊗LG)x XLT = −α2LGX (6)\nwhere α is the propagation speed parameter. Assuming a vanishing initial velocity, i.e. first derivative in time of the initial distribution equals zero, the solution to this PDE can be written using functional calculus as [14]:\nX( · , t) = K(sLG, t)ψ =Kt,sψ (7)\nwhere ψ(n) =X(n, 0) and Kt,s = K(sLG, t) is the matrix function K applied to the scaled Laplacian sLG and parametrized by the time t. Notice that we use the scale s = α2 to represent the speed parameter of the propagation. Substituting (7) into (6), we obtain\nKt,sψLT = −sLGKt,sψ. (8)\nTo obtain a closed form solution for the kernel Ks we analyze the equation (8) in the graph spectral domain:\nK̃t,sψ̃LT = −sΛGK̃t,sψ̃ (9)\nwhere K̃t,s = K(sΛG, t). Equation (9) requires K(sλℓ, t) to be an eigenvector of LT . From (2) we obtain:\nK̃(sλℓ, t) = cos\n( t arccos ( 1− sλℓ\n2\n)) . (10)\nSince the arccos(x) is defined only for x ∈ [−1, 1], to guarantee filter stability the parameter s must satisfy s < 4/λmax. This result is in agreement with stability analysis of numerical solver for discrete wave equation [15].\n3 The wave equation is a hyperbolic differential equation and several difficulties arise when discretizing it for numerical computation of the solution [14]. Moreover, the graph being an irregular domain, the solution of the above equation is not any more a smooth wave after few iterations. Here we focus on the propagation (away from its origin) of the wave rather than its exact expression."
    }, {
      "heading" : "C. General definition",
      "text" : "In the following, we will generalize the DGW using arbitrary time-vertex kernel. The goal is to design a transform that helps detecting a class of dynamic events on graphs. These events are assumed to start from an initial joint distribution Φm,τ (n, t) = [ψm ⊗φ⊺τ ](n, t) localized around vertex m and time τ . The general expression of the DGW Wm,τ,s at time t and at vertex n can be written as:\nWm,τ,s(n, t) = [Kt,sΦm,τ ] (n, t), ∀ t ≥ 0 (11) where, like earlier, Kt,s = K(sLG, t) is the matrix function K applied to the scaled Laplacian sLG and parametrized by the time t. Depending on the dynamic graph kernel, the DGW can resemble a wave solution of the wave equation, a diffusion process, or a generic dynamic process."
    }, {
      "heading" : "D. Causal Damped Wave Dynamic Graph Kernel",
      "text" : "We define the DGW to be the solutions of Eq. (6), for different α = √ s. In addition, we require two other properties. Firstly, we want the wave to be causal, i.e. to have an initial starting point in time. Secondly, in many applications, the wave propagation is affected by an attenuation over time. We thus introduce a damping term. The DGW defined in the graph spectral domain is thus\nW̃s(λℓ, t) = H(t) e−βt cos ( t arccos ( 1− sλℓ\n2\n)) , (12)\nwhere H(t) is the Heaviside function and e−βt is the damped decaying exponential function in time.\nThe damping term has two remarkable effects. Firstly, it lower the importance of the chosen boundary conditions in time (e.g. periodic or reflective) as the wave vanishes before touching them. Secondly, it favors the construction of a frame of DGW: we will see in the following that β is involved in the lower frame bound of the DGW."
    }, {
      "heading" : "E. Dynamic Graph Frames",
      "text" : "We define SW as the DGW analysis operator. The wavelet coefficients C are given by C(m, τ, s) = {SW (X)} (m, τ, s) = ∑\nn,t\nWm,τ,s(n, t)X(n, t)\n= 1√ T\n∑\nℓ,k\nŴs(λℓ, ωk)X̂(ℓ, k)uℓ(m)e −jωk τ T ,\nand the synthesis operator gives X ′(n, t) = {S⊺W (C)} (n, t) = ∑\nj,τ,s\nWm,τ,s(n, t)C(m, τ, s)\n= 1√ T\n∑\ns\n∑\nℓ,k\nŴs(λℓ, ωk)Ĉ(ℓ, k, s)uℓ(i)e −2πjωk τ T .\nThe following theorem provides conditions to assert that no information will be lost when these operators are applied to a time-vertex signals. This implies that any signal X can be constructed from the synthesis operation: X = S⊺W (C).\nTheorem 1. If the set of time-vertex DGW satisfies:\nA = min l,k\n∑\ns\n|Ŵs(λℓ, ωk)|2 > 0\nB = max l,k\n∑\ns\n|Ŵs(λℓ, ωk)|2 < ∞\nwith 0 < A ≤ B < ∞, then SW is a frame operator in the sense:\nA‖X‖22 ≤ ‖{SW (X)}‖ 2 2 ≤ B‖X‖ 2 2 (13)\nfor any time-vertex signal X with ‖X‖2 > 0. Proof: In the joint spectral domain we can write: ‖{SW (X)}‖22 = ∑\nm,τ,s\n|{SW (X)} (m, τ, s)|2\n= ∑\nm,τ,s\n∣∣∣∣∣∣ ∑\nn,t\nX(n, t) ∑\nℓ,k\nŴs(λℓ, ωk)u ∗ ℓ (n)uℓ(m)e\n−jωk t−τ T ∣∣∣∣∣∣ 2\n= ∑\ns,m,τ\n ∑\nn,t\nX(n, t) ∑\nℓ,k\nŴs(λℓ, ωk)u ∗ ℓ (n)uℓ(m)e\n−jωk t−τ T  \n ∑\nn′,t′\nX(n′, t′) ∑\nℓ′,k′\nŴs(λℓ′ , ωk′)u ∗ ℓ′(n ′)uℓ′(m)e −jωk′\nt′−τ T   ∗\n= ∑\ns,ℓ,k\nŴs(λℓ, ωk)Ŵ ∗ s (λℓ, ωk)X̂(ℓ, k)X̂ ∗(ℓ, k)\n= ∑\ns,ℓ,k\n|Ŵs(λℓ, ωk)|2|X̂(ℓ, k)|2 = ∑\ns\n‖Ŵs · X̂‖22.\nUsing Parseval relation ‖X̂‖2 = ‖X‖2, we find\nA‖X‖22 = A‖X̂‖22 ≤ ‖{SW (X)}‖22 ≤ B‖X̂‖22 = B‖X‖22 where ‖·‖2 is used here for the Froebenius norm, i.e: ‖X‖2 = ‖x‖2.\nIn the following we will use this condition to prove that the DGW given in equation (12) is a frame.\nCorollary 1. The set of DGW defined by Eq.(12) is a frame for all β > 0.\nProof: We define θℓ = arccos(1− sλℓ2 ). The DGW in the joint spectral domain is\n∣∣∣Ŵ (λℓ, ωk) ∣∣∣ 2 = ∣∣∣∣∣ ∑\nt>0\ne−βt cos(t arccos(1 − sλℓ 2 ))e−jωkt ∣∣∣∣∣ 2\n= ∣∣∣∣ 1\n2\n( 1\n1− e−(β+j(ωk+θℓ) + 1 1− e−(β+j(ωk−θℓ) )∣∣∣∣ 2\n= ∣∣∣∣ 1\n2 2− e−β−jωk(e−jθ + ejθ) 1− e−β−jωk(e−jθ + ejθ) + e−2β−2jωk ∣∣∣∣ 2\n= ∣∣∣∣ 1− e−β−jωk cos θℓ\n1− 2e−β−jωk cos θℓ + e−2β−2jωk\n∣∣∣∣ 2 ≥ ∣∣∣∣ 1− e−β\n4\n∣∣∣∣ 2 > 0.\n4 Hence A > 0. To prove that B < ∞ we find the roots of the denominator of the above expression. We call z = e−β−jωk and we obtain the following equation:"
    }, {
      "heading" : "1− 2z cos θℓ + z2 = 0",
      "text" : "whose roots are |ż| = |cos(θℓ) ± j sin(θℓ)| = 1. Since |z| = e−β , |z| 6= |ż| ∀β > 0."
    }, {
      "heading" : "V. SPARSE REPRESENTATION",
      "text" : "Particular processes, such as wave propagation, can be well approximated by only a few elements of the DGW, i.e. the DGW transform of the signal is a sparse representation of the information it contains. In that case, we inspire ourselves from compressive sensing techniques and define the following convex minimization problem\nĊ = argmin C\n‖S⊺W (C)− Y ‖22 + γ‖C‖1. (14)\nHere γ is the parameter controlling the trade-off between the fidelity term ‖S⊺WC−Y ‖22 and the sparsity assumption of the DGW coefficients ‖C‖1 = ∑ m,τ,s|C(m, τ, s)|. The solution Ċ provides useful information about the signal. Firstly, the synthesis S⊺W Ċ is a de-noised version of the original process. Secondly, from the position of the non zero coefficients of Ċ, we can derive the origin on the graph m and in time τ , the speed of propagation s and the amplitude |C(m, τ, s)| of the different waves.\nProblem (14) can be solved using proximal splitting methods [16] and the fast iterative soft thresholding algorithm (FISTA) [17] is particularly well suited. Let us define g(C) = ‖STWC − Y ‖22, the gradient of g is ∇g(C) = 2SW (STWC − Y ). Note that the Lipschitz constant of ∇g is 2D. We define the function h(C) = γ‖C‖1. The proximal operator of h is the ℓ1 soft-thresholding given by the elementwise operations (here ◦ is the Hadamard product)\nprox γ,h\n(C) = C + sgn(C) ◦max(|C| − γ, 0).\nThe FISTA algorithm [17] can now be stated as Algorithm 1, where ν is the step size (we use ν = 12D ), ǫ the stopping tolerance and J the maximum number of iterations. δ is a very small number to avoid a possible division by 0. Our implementation of the frame SW is based on the GSPBox [18] and Problem (14) is solved using the UNLocBoX [19].\nAlgorithm 1 FISTA for Problem (14)\nINPUT: c1 = y, u0 = y, t1 = 1, ǫ > 0 for j = 1, . . . J do\nuj+1 = proxνjh(cj − νj∇g(cj)) tj+1 = 1+ √ 1+4t2 j\n2\ncj+1 = uj + tj−1 tj+1 (uj − uj−1) if ‖cj+1−cj‖ 2 2\n‖cj‖22+δ < ǫ then\nBREAK end if\nend for\nSNR [dB]\nEvent ID 100 20 10 2 0\n2014p139747 28.88 28.92 29.24 31.41 32.35 2015p822263 28.35 28.25 29.13 28.53 29.97 2015p850906 17.80 18.38 15.18 16.60 21.26 2016p235495 37.39 37.41 37.58 37.83 37.83\nTable I: Distance in kilometers between real and estimated epicenter for different seismic events and decreasing SNR."
    }, {
      "heading" : "VI. APPLICATION",
      "text" : ""
    }, {
      "heading" : "A. Earthquake epicenter estimation",
      "text" : "We demonstrate the performance of the DGW on a source localization problem, where a dynamical event evolves according to a specific time-space behavior. We analyze waveforms recorded by seismic stations geographically distributed in New Zealand, connected to the GeoNet Network. The graph is constructed using the coordinates of the available seismic stations and connecting the closest nodes. We consider different seismic events whose epicenters were located in different areas of New Zealand1. Each waveform consists of 300 seconds sampled at 100Hz, starting few seconds before the seismic event. Seismic waveforms can be modeled as oscillating damped waves. This model is valid when the spatial domain where the waves are propagating is a continuous domain or a regular lattice [20]. Here, the domain is the network of sensors and we assume that a damped wave propagating on this network is still a good approximation. Thus we expect the waveforms of the DGW defined in Eq.(12) to be good approximations of the seismic waves recorded by the sensors. We create a frame of DGW, SW , using 10 different values for the propagation velocity parameter s linearly spaced between 0 and 2 (corresponding to physically plausible values). The damping β was fixed and chosen to fit the damping present in the seismic signals.\nTo estimate the epicenter of the seismic event we solved the convex optimization problem (14). The sparse matrix C contains few non-zero coefficients corresponding to the waveforms that constitute the seismic wave. We averaged the coordinates of the vertices corresponding to the sources of the waves with highest energy coefficients. Figure 1 shows the results of the analysis for different seismic events. For each plot, the recorded waveforms are shown superposed using different colors. Real and estimated epicenters are shown respectively with a red square and a black circle on the graph plots.\nFinally, we investigated the performance of the source localization algorithm by adding white Gaussian noise to the signals, decreasing the SNR of the waveforms from 100 to 0 dB, such that the SNR is the same for all the waveforms. Table I shows the distance between the real and estimated epicenter in kilometers in four different events and increasing amounts of noise. The small variations of the results demonstrate the high robustness of the method.\n1The dataset is freely available at http://www.geonet.org.nz/quakes\n5"
    } ],
    "references" : [ {
      "title" : "The emerging field of signal processing on graphs: Extending high-dimensional data analysis to networks and other irregular domains",
      "author" : [ "David I Shuman", "Sunil K Narang", "Pascal Frossard", "Antonio Ortega", "Pierre Vandergheynst" ],
      "venue" : "Signal Processing Magazine, IEEE, vol. 30, no. 3, pp. 83–98, 2013.",
      "citeRegEx" : "1",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Discrete signal processing on graphs",
      "author" : [ "Aliaksei Sandryhaila", "José MF Moura" ],
      "venue" : "Signal Processing, IEEE Transactions on, vol. 61, no. 7, pp. 1644–1656, 2013.",
      "citeRegEx" : "2",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Epidemic processes in complex networks",
      "author" : [ "Romualdo Pastor-Satorras", "Claudio Castellano", "Piet Van Mieghem", "Alessandro Vespignani" ],
      "venue" : "Rev. Mod. Phys., vol. 87, pp. 925–979, Aug 2015.",
      "citeRegEx" : "3",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Information diffusion in online social networks: A survey",
      "author" : [ "Adrien Guille", "Hakim Hacid", "Cécile Favre", "Djamel A Zighed" ],
      "venue" : "ACM SIGMOD Record, vol. 42, no. 2, pp. 17–28, 2013.",
      "citeRegEx" : "4",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "The anatomy of a scientific rumor",
      "author" : [ "Manlio De Domenico", "Antonio Lima", "Paul Mougel", "Mirco Musolesi" ],
      "venue" : "Scientific reports, vol. 3, 2013.",
      "citeRegEx" : "5",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Multilayer networks",
      "author" : [ "Mikko Kivelä", "Alex Arenas", "Marc Barthelemy", "James P Gleeson", "Yamir Moreno", "Mason A Porter" ],
      "venue" : "Journal of Complex Networks, vol. 2, no. 3, pp. 203–271, 2014.",
      "citeRegEx" : "6",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Mathematical formulation of multilayer networks",
      "author" : [ "Manlio De Domenico", "Albert Solé-Ribalta", "Emanuele Cozzo", "Mikko Kivelä", "Yamir Moreno", "Mason A Porter", "Sergio Gómez", "Alex Arenas" ],
      "venue" : "Physical Review X, vol. 3, no. 4, pp. 041022, 2013.",
      "citeRegEx" : "7",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Wavelets on graphs via spectral graph theory",
      "author" : [ "David K Hammond", "Pierre Vandergheynst", "Rémi Gribonval" ],
      "venue" : "Applied and Computational Harmonic Analysis, vol. 30, no. 2, pp. 129–150, 2011.",
      "citeRegEx" : "8",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Diffusion wavelets",
      "author" : [ "Ronald R Coifman", "Mauro Maggioni" ],
      "venue" : "Applied and Computational Harmonic Analysis, vol. 21, no. 1, pp. 53–94, 2006.",
      "citeRegEx" : "9",
      "shortCiteRegEx" : null,
      "year" : 2006
    }, {
      "title" : "Vertexfrequency analysis on graphs",
      "author" : [ "David I Shuman", "Benjamin Ricaud", "Pierre Vandergheynst" ],
      "venue" : "Applied and Computational Harmonic Analysis, vol. 40, no. 2, pp. 260–291, 2016.",
      "citeRegEx" : "10",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "The discrete cosine transform",
      "author" : [ "G. Strang" ],
      "venue" : "SIAM Review, vol. 41, no. 1, pp. 135–147, 1999.",
      "citeRegEx" : "12",
      "shortCiteRegEx" : null,
      "year" : 1999
    }, {
      "title" : "Frequency analysis of temporal graph signals",
      "author" : [ "Andreas Loukas", "Damien Foucard" ],
      "venue" : "arXiv preprint arXiv:1602.04434, 2016.",
      "citeRegEx" : "13",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "Durran, Numerical methods for wave equations in geophysical fluid dynamics, vol",
      "author" : [ "R. Dale" ],
      "venue" : "Science & Business Media,",
      "citeRegEx" : "14",
      "shortCiteRegEx" : "14",
      "year" : 2013
    }, {
      "title" : "Numerical Methods for Wave Propagation: Selected Contributions from the Workshop held in Manchester, U.K., Containing the Harten Memorial Lecture, chapter Difference Approximations of Acoustic and Elastic Wave Equations",
      "author" : [ "Dugald B. Duncan" ],
      "venue" : null,
      "citeRegEx" : "15",
      "shortCiteRegEx" : "15",
      "year" : 1998
    }, {
      "title" : "Proximal splitting methods in signal processing",
      "author" : [ "Patrick L Combettes", "Jean-Christophe Pesquet" ],
      "venue" : "Fixed-point algorithms for inverse problems in science and engineering, pp. 185–212. Springer, 2011.",
      "citeRegEx" : "16",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "A fast iterative shrinkage-thresholding algorithm for linear inverse problems",
      "author" : [ "Amir Beck", "Marc Teboulle" ],
      "venue" : "SIAM journal on imaging sciences, vol. 2, no. 1, pp. 183–202, 2009.",
      "citeRegEx" : "17",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "GSPBOX: A toolbox for signal processing on graphs",
      "author" : [ "Nathanaël Perraudin", "Johan Paratte", "David Shuman", "Lionel Martin", "Vassilis Kalofolias", "Pierre Vandergheynst", "David K. Hammond" ],
      "venue" : "ArXiv e-prints, Aug. 2014.",
      "citeRegEx" : "18",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "UNLocBoX A matlab convex optimization toolbox using proximal splitting methods",
      "author" : [ "N. Perraudin", "D. Shuman", "G. Puy", "P. Vandergheynst" ],
      "venue" : "ArXiv e-prints, Feb. 2014.",
      "citeRegEx" : "19",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Fundamentals of Geophysics, Cambridge University Press, second edition, 2007, Cambridge Books Online",
      "author" : [ "William Lowrie" ],
      "venue" : null,
      "citeRegEx" : "20",
      "shortCiteRegEx" : "20",
      "year" : 2007
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "INTRODUCTION Complex signals and high-dimensional datasets collected from a variety of fields of science, such as physics, engineering, genetics, molecular biology and many others, can be naturally modeled as values on the vertices of weighted graphs [1], [2].",
      "startOffset" : 251,
      "endOffset" : 254
    }, {
      "referenceID" : 1,
      "context" : "INTRODUCTION Complex signals and high-dimensional datasets collected from a variety of fields of science, such as physics, engineering, genetics, molecular biology and many others, can be naturally modeled as values on the vertices of weighted graphs [1], [2].",
      "startOffset" : 256,
      "endOffset" : 259
    }, {
      "referenceID" : 2,
      "context" : "Recently, dynamic activity over networks has been the subject of intense research in order to develop new models to understand and analyze epidemic spreading [3], rumor spreading over social networks [4], [5] or activity on sensor networks.",
      "startOffset" : 158,
      "endOffset" : 161
    }, {
      "referenceID" : 3,
      "context" : "Recently, dynamic activity over networks has been the subject of intense research in order to develop new models to understand and analyze epidemic spreading [3], rumor spreading over social networks [4], [5] or activity on sensor networks.",
      "startOffset" : 200,
      "endOffset" : 203
    }, {
      "referenceID" : 4,
      "context" : "Recently, dynamic activity over networks has been the subject of intense research in order to develop new models to understand and analyze epidemic spreading [3], rumor spreading over social networks [4], [5] or activity on sensor networks.",
      "startOffset" : 205,
      "endOffset" : 208
    }, {
      "referenceID" : 5,
      "context" : "The advances in the graph research has led to new tools to process and analyze time-varying graph and/or signal on the graph, such as multilayer graphs and tensor product of graphs [6], [7].",
      "startOffset" : 181,
      "endOffset" : 184
    }, {
      "referenceID" : 6,
      "context" : "The advances in the graph research has led to new tools to process and analyze time-varying graph and/or signal on the graph, such as multilayer graphs and tensor product of graphs [6], [7].",
      "startOffset" : 186,
      "endOffset" : 189
    }, {
      "referenceID" : 7,
      "context" : "For example the wavelets on graphs [8], [9] or the vertexfrequency transform [10] are dedicated to the study of a static signal over a graph.",
      "startOffset" : 35,
      "endOffset" : 38
    }, {
      "referenceID" : 8,
      "context" : "For example the wavelets on graphs [8], [9] or the vertexfrequency transform [10] are dedicated to the study of a static signal over a graph.",
      "startOffset" : 40,
      "endOffset" : 43
    }, {
      "referenceID" : 9,
      "context" : "For example the wavelets on graphs [8], [9] or the vertexfrequency transform [10] are dedicated to the study of a static signal over a graph.",
      "startOffset" : 77,
      "endOffset" : 81
    }, {
      "referenceID" : 10,
      "context" : "It can be decomposed as LT = UTΩU T where UT is the discrete Fourier basis [12] and Ω(k, k) = ωk are the eigenvalues of the classical DFT that are linked to the normalized discrete frequencies k T by the following relation:",
      "startOffset" : 75,
      "endOffset" : 79
    }, {
      "referenceID" : 11,
      "context" : "Since the time-vertex representation is obtained from the cartesian product of the two original domains, the joint timevertex Fourier transform (JFT) is obtained by applying the GFT on the graph dimension and the DFT along the time dimension [13]:",
      "startOffset" : 242,
      "endOffset" : 246
    }, {
      "referenceID" : 7,
      "context" : "The spectral domain helps in defining the localization of functions on the graph, as in [8].",
      "startOffset" : 88,
      "endOffset" : 91
    }, {
      "referenceID" : 7,
      "context" : "Because of the lack of translation invariance of graph, the kernel will always act in graph spectral domain and will be localized on the graph using the localization operator as in [8].",
      "startOffset" : 181,
      "endOffset" : 184
    }, {
      "referenceID" : 8,
      "context" : "where the parameter s is the thermal diffusivity in classic heat diffusion problems and can be interpreted as a scale parameter for multiscale dynamic graph wavelet analysis [9].",
      "startOffset" : 174,
      "endOffset" : 177
    }, {
      "referenceID" : 12,
      "context" : "first derivative in time of the initial distribution equals zero, the solution to this PDE can be written using functional calculus as [14]:",
      "startOffset" : 135,
      "endOffset" : 139
    }, {
      "referenceID" : 13,
      "context" : "This result is in agreement with stability analysis of numerical solver for discrete wave equation [15].",
      "startOffset" : 99,
      "endOffset" : 103
    }, {
      "referenceID" : 12,
      "context" : "The wave equation is a hyperbolic differential equation and several difficulties arise when discretizing it for numerical computation of the solution [14].",
      "startOffset" : 150,
      "endOffset" : 154
    }, {
      "referenceID" : 14,
      "context" : "Problem (14) can be solved using proximal splitting methods [16] and the fast iterative soft thresholding algorithm (FISTA) [17] is particularly well suited.",
      "startOffset" : 60,
      "endOffset" : 64
    }, {
      "referenceID" : 15,
      "context" : "Problem (14) can be solved using proximal splitting methods [16] and the fast iterative soft thresholding algorithm (FISTA) [17] is particularly well suited.",
      "startOffset" : 124,
      "endOffset" : 128
    }, {
      "referenceID" : 15,
      "context" : "The FISTA algorithm [17] can now be stated as Algorithm 1, where ν is the step size (we use ν = 1 2D ), ǫ the stopping tolerance and J the maximum number of iterations.",
      "startOffset" : 20,
      "endOffset" : 24
    }, {
      "referenceID" : 16,
      "context" : "Our implementation of the frame SW is based on the GSPBox [18] and Problem (14) is solved using the UNLocBoX [19].",
      "startOffset" : 58,
      "endOffset" : 62
    }, {
      "referenceID" : 17,
      "context" : "Our implementation of the frame SW is based on the GSPBox [18] and Problem (14) is solved using the UNLocBoX [19].",
      "startOffset" : 109,
      "endOffset" : 113
    }, {
      "referenceID" : 18,
      "context" : "This model is valid when the spatial domain where the waves are propagating is a continuous domain or a regular lattice [20].",
      "startOffset" : 120,
      "endOffset" : 124
    } ],
    "year" : 2016,
    "abstractText" : "Graph Signal Processing generalizes classical signal processing to signal or data indexed by the vertices of a weighted graph. So far, the research efforts have been focused on static graph signals. However numerous applications involve graph signals evolving in time, such as spreading or propagation of waves on a network. The analysis of this type of data requires a new set of methods that fully takes into account the time and graph dimensions. We propose a novel class of wavelet frames named Dynamic Graph Wavelets, whose time-vertex evolution follows a dynamic process. We demonstrate that this set of functions can be combined with sparsity based approaches such as compressive sensing to reveal information on the dynamic processes occurring on a graph. Experiments on real seismological data show the efficiency of the technique, allowing to estimate the epicenter of earthquake events recorded by a seismic network.",
    "creator" : "dvips(k) 5.991 Copyright 2011 Radical Eye Software"
  }
}