{
  "name" : "1609.09341.pdf",
  "metadata" : {
    "source" : "META",
    "title" : "Machine Learning Techniques for Stackelberg Security Games: a Survey",
    "authors" : [ "Giuseppe De Nittis", "Francesco Trovò" ],
    "emails" : [ "}@polimi.it" ],
    "sections" : [ {
      "heading" : null,
      "text" : "ar X\niv :1\n60 9.\n09 34\n1v 1\nContents"
    }, {
      "heading" : "1 Introduction 3",
      "text" : "1.1 Stackelberg paradigm and SSG . . . . . . . . . . . . . . . . . . . 3 1.2 The poaching setting . . . . . . . . . . . . . . . . . . . . . . . . . 4"
    }, {
      "heading" : "2 Using human behavior models in solving SSGs 5",
      "text" : "2.1 SUQR: modeling a boundedly rational attacker . . . . . . . . . . 5 2.1.1 Learning SUQR parameters . . . . . . . . . . . . . . . . . 6 2.2 From MATCH to SHARP . . . . . . . . . . . . . . . . . . . . . . 7 2.2.1 Adaptive utility model . . . . . . . . . . . . . . . . . . . . 8 2.2.2 SHARP’s utility Computation . . . . . . . . . . . . . . . 9 2.2.3 Generating defender’s strategies against SHARP . . . . . 9 2.3 Learning adversary models from three defender’s strategies . . . 10 2.3.1 Linear utility functions . . . . . . . . . . . . . . . . . . . . 11 2.3.2 Learning the optimal strategy . . . . . . . . . . . . . . . . 12"
    }, {
      "heading" : "3 Determining attacker’s payoffs exploiting regret–based solutions 13",
      "text" : ""
    }, {
      "heading" : "4 Online learning 16",
      "text" : "4.1 Handling exploration–exploitation tradeoffs in Security Games . 16 4.1.1 Problem formulation . . . . . . . . . . . . . . . . . . . . . 17 4.1.2 Learning model from defenders’ previous observations . . 18 4.1.3 Restless multi–armed bandit problems . . . . . . . . . . . 18 4.1.4 Restless bandit formulation . . . . . . . . . . . . . . . . . 19 4.1.5 Sufficient condition for indexability . . . . . . . . . . . . . 20 4.1.6 Numerical evaluation of indexability . . . . . . . . . . . . 21 4.1.7 Computation of Whittle index Policy . . . . . . . . . . . . 21 4.1.8 Special POMDP formulation . . . . . . . . . . . . . . . . 22 4.1.9 Value iteration for the special POMDP . . . . . . . . . . 23 4.1.10 Planning from POMDP view . . . . . . . . . . . . . . . . 24 4.2 Online planning for optimal protector strategies in resource conservation games . . . . . . . . . . . . . . . . . . . . . . . . . . . . 24 4.2.1 Problem formulation . . . . . . . . . . . . . . . . . . . . . 25 4.2.2 GMOP algorithm . . . . . . . . . . . . . . . . . . . . . . . 27 4.2.3 Applying Gibbs sampling in GMOP . . . . . . . . . . . . 28\nReferences 30"
    }, {
      "heading" : "1 Introduction",
      "text" : "The present survey aims at presenting the current main machine learning techniques employed in security games domains. Specifically, we focused on papers and works developed by the Teamcore of University of Southern California, which deepened different directions in this field. Among several works on this topic, e.g., [3, 9, 22, 15, 10, 11], this paper is essentially based on these works [12, 6, 4, 8, 17, 16].\nAfter a brief introduction on Stackelberg Security Games (SSGs) and the poaching setting, the rest of the work is organized according to the different problems that has been dealt with.\n• Section 2 shows how to model a boundedly rational attacker taking into account her human behavior.\n• Section 3 faces the problem of having attacker’s payoffs not defined and how to estimate them studying the regret of the defender.\n• Section 4 presents how online learning techniques have been exploited to learn a model of the attacker."
    }, {
      "heading" : "1.1 Stackelberg paradigm and SSG",
      "text" : "Usually, to represent security scenarios, a specific class of games is adopted, i.e., Stackelberg Games [23]. Here, on one side there is the Defender, which publicly commits to a mixed strategy, i.e., a probability distribution on the actions available to the player, and on the other side there is an Attacker, that observes the commitment of the Defender and acts consequently. Such games are called Stackelberg Security Games (SSG). Specifically, in SSGs, the Defender attempts to protect a set of T targets from an Attacker, by optimally allocating a set of R resources, R < T . Denote by x = {xt} the Defender’s strategy where xt is the coverage probability at target t, the set of feasible strategies is: X = {x : 0 ≤ xt ≤ 1, ∑\nt xt ≤ R}. If the adversary attacks t when the defender is not protecting it, the adversary receives a reward Rat , otherwise the adversary gets a penalty P at . Conversely, the Defender receives a penalty P d t in the former case and a reward Rdt in the latter case. Let (R a,P a) and (Rd,P d) be the payoff vectors. The players’ expected utilities at t is computed as:\nUat (x,R a, P a) = xtP a t + (1− xt)R a t Udt (x,R d, P d) = xtR d t + (1− xt)P d t\nIn general, in such situations, the most appropriate solution concept is the Leader–follower equilibrium. The problem of finding such equilibrium can be\nformulated as:\nargmax xl,x ∗\nf\n∑\nal∈Al\n∑\naf∈Af\n[Ul(al, af)xl(al)x ∗ f (af)]\ns.t. ∑\nal∈Al\nxl(al) = 1\nxl(al) ≥ 0 ∀al ∈ Al x∗f ∈ argmaxxl ∑\nal∈Al\n∑\nal∈Al\n[Uf(af, al)xf(af)xl(al)]\ns.t. ∑\naf∈Af\nxf(af) = 1\nxf(af) ≥ 0 ∀af ∈ Af\nwhere xl(al) (xf (af )) is the probability that the leader (follower) will play action al (af ) and x ∗ f is the best strategy of the follower.\nIn zero–sum games, the Leader–follower equilibrium coincides with the Nash equilibrium [21] and the maxmin/minmax strategies."
    }, {
      "heading" : "1.2 The poaching setting",
      "text" : "Poaching and illegal over–fishing are critical international problems leading to destruction of ecosystems. For example, three out of nine tiger species have gone extinct in the past 100 years and others are now endangered due to poaching [18]. Law enforcement agencies in many countries are hence challenged with applying their limited resources to protecting endangered animals and fish stocks.\nBuilding upon the success of applying SSGs to protect infrastructure including airports [14], ports [19] and trains [27], researchers are now applying game theory to green security domains, e.g., protecting fisheries from over– fishing [1, 5] and protecting wildlife from poaching [25]. There are several key features in green security domains that introduce novel research challenges.\n1. The defender is faced with multiple adversaries who carry out repeated and frequent illegal activities (attacks), yielding a need to go beyond the one–shot SSG model.\n2. In carrying out such frequent attacks, the attackers generally do not conduct extensive surveillance before performing an attack and spend less time and effort in each attack, and thus it becomes more important to model the attackers’ bounded rationality and bounded surveillance.\n3. There is more attack data available in green security domains than in infrastructure security domains, which makes it possible to learn the attackers’ decision making model from data."
    }, {
      "heading" : "2 Using human behavior models in solving SSGs",
      "text" : "In game theory, the adversary is usually represented as a fully rational player. In real–world, people are not fully rational, i.e., their choices are not simply determined by mere calculations. The problem that is addressed here is the representation of a boundedly rational attacker in SSGs. In fact, the fully rationality condition is relaxed to make an important step towards modeling real–world attacker, both to extract useful information about already gathered data, but also to build new models of attackers to enhance the current level of security."
    }, {
      "heading" : "2.1 SUQR: modeling a boundedly rational attacker",
      "text" : "In SSGs, attacker bounded rationality is often modeled via behavior models such as Quantal Response (QR) [7]. The QR model predicts a stochastic distribution of the adversary response: the greater the expected value of a target the more likely the adversary will attack that target. QR’s key parameter λ represents the level of rationality in adversary’s response: as λ increases, the predicted response by the QR model converges to the optimal action of the adversary. Instead of using a human behavior model, MATCH, the best algorithm up to 2013, computes a robust defender strategy by guaranteeing a bound on the defender’s loss in her expected value if the adversary deviates from her optimal choice. More specifically, the defender’s loss is constrained to be no more than a factor of β times the adversary’s loss in his expected value. The key parameter β describes how much the defender is willing to sacrifice when the adversary deviates from the optimal action.\nThe key idea in Subjective Expected Utility (SEU) is that individuals have their own evaluations of each alternative during decision making. Recall that in an SSG, the information presented to the human subject for each choice includes: the marginal coverage on target t(xt); the subject’s reward and penalty (R a t , P a t ); the defender’s reward and penalty (Rdt , P d t ). Inspired by the idea of SEU, it has been proposed [12] a subjective utility function of the adversary for SSG as the following:\nÛat′(x,R a,P a) = w1xt + w2R a t + w3P a t\nIn fact, SUQR is motivated by the lens model which suggested that evaluation of adversaries over targets is based on a linear combination of multiple observable features. One key advantage of these behavioral models is that they can be used to predict attack frequency for multiple attacks by the adversary, where in the attacking probability is a normalization of attack frequency.\nThe novelty of this subjective utility function is the linear combination of the values (rewards/penalty) and coverage probabilities. (Note that the decision– making of the general population is modeled, not of each individual since there are no sufficient data for each specific subject). This model actually leads to higher prediction accuracy than the classic expected value function. Other\nalternatives to this subjective utility function are feasible, e.g., including all the information presented to the subjects:\nÛat (x,R a,P a) = w1xt + w2R a t + w3P a t + w4R d t + w5P d t\nThen, the QR model is modified by replacing the classic expected value function with the SU function, leading to the SUQR model. In the SUQR model, the probability that the adversary chooses target t, qt, is given by:\nqt(x,R a,P a) =\neλÛ a t (x,R a,Pa)\n∑ t′ e λÛa t′ (x,Ra,Pa)\nThe problem of finding the optimal strategy for the defender can therefore be formulated as:\nmaxx\nT ∑\nt=1\neλU a t (x,R a,Pa)\n∑ t′ e λUa t′ (x,Ra,Pa)\n(xtR d t + (1 − xt)P d t )\ns.t.\nT ∑\nt=1\nxt ≤ K, 0 ≤ xt ≤ 1\nHere, the objective is to maximize the defender’s expected value given that the adversary chooses to attack each target with a probability according to the SUQR model."
    }, {
      "heading" : "2.1.1 Learning SUQR parameters",
      "text" : "Without loss of generality, λ = 1. As customarily done in traditional machine learning, Maximum Likelihood Estimation (MLE) to learn the parameters (w1, w2, w3) is employed. Given the defender strategy x and N samples of the players’ choices, the log–likelihood of (w1, w2, w3) is given by:\nlogL(w1, w2, w3|x) = N ∑\nj=1\nlog[qtj(w1, w2, w3|x)]\nwhere tj is the target that is chosen in sample j and qtj (w1, w2, w3|x) is the probability that the adversary chooses the target tj. Let Nt be the number of subjects attacking target t. Then:\nlogL(w1, w2, w3|x) = T ∑\nt=1\nNtlog[qtj(w1, w2, w3|x)]\nIt can be shown that the Hessian matrix of logL[qtj(w1, w2, w3|x)] is negative semi–definite. Thus, this function has an unique local maximum point and hence a convex optimization solver can be used to compute the optimal weights (w1, w2, w3), e.g., fmincon in Matlab."
    }, {
      "heading" : "2.2 From MATCH to SHARP",
      "text" : "Starting from the above results, a new model is now introduced, SHARP [6], which:\n• reasons based on success or failure of the adversary’s past actions on exposed portions of the attack surface to model adversary adaptiveness;\n• reasons about similarity between exposed and unexposed areas of the attack surface, and also incorporates a discounting parameter to mitigate adversary’s lack of exposure to enough of the attack surface;\n• integrates a non–linear probability weighting function to capture the adversary’s true weighting of probability.\nFollowing the approach presented in the previous section, MLE has been applied to learn the weights of the SUQR model based on data collected from our human subject experiments and found that the weights on coverage probability were positive for all the experiments. That is, counter–intuitively humans were modeled as being attracted to regions with high coverage probability, even though they were not attacking targets with very high coverage but they were going after targets with moderate to very low coverage probability.\nTo address this issue, a solution can be the augmentation of the Subjective Utility function with a two–parameter probability weighting function, that can be either inverse S–shaped (concave near probability zero and convex near probability one) or S–shaped.\nf(p) = δpγ\nδpγ + (1− p)γ (1)\nThe SU of an adversary denoted by a can then be computed as:\nSUai (x) = w1f(xi) + w2R a i + w3P a i ,\nwhere f(xi) for coverage probability xi is computed as per Equation (1). The two parameters δ and γ control the elevation and curvature of the function respectively. γ < 1 results in an inverse S-shaped curve while γ > 1 results in an S–shaped curve. This is the PSU (Probability weighted Subjective Utility) function. The curve representing human weights for probability is S–shaped in nature, and not inverse S-shaped as prospect theory suggests. The S–shaped curve indicates that people would overweigh high probabilities and underweigh low to medium probabilities.\nW.r.t. MATCH, SHARP introduces a new feature – distance – that affects the reward and hence the obvious question for us was to investigate the effect of this new feature in predicting adversary behavior. Several variations of PSU with different combinations of features can be considered.\nSUai (x) = w1f(xi) + w2φi + w3P a i (2) SUai (x) = w1f(xi) + w2R a i + w3P a i + w4Di (3) SUai (x) = w1f(xi) + w2φi + w3P a i + w4Di (4)\nwhere φi and Di refer to the animal density at target i and the distance to target i from the poacher’s starting location respectively."
    }, {
      "heading" : "2.2.1 Adaptive utility model",
      "text" : "A second major innovation in SHARP is the adaptive nature of the adversary and addressing the issue of attack surface exposure. The attack surface α is defined as the n–dimensional space of the features used to model adversary behavior.\nFor example, as per the third PSU model in Equation (4), this would mean the space represented by the following four features: coverage probability, animal density, adversary penalty and distance from the starting location.\nA target profile βk ∈ α is defined as a point on the attack surface α and can be associated with a target. Exposing the adversary to a lot of different target profiles would therefore mean exposing the adversary to more of the attack surface and gathering valuable information about their behavior. While a particular target location, defined as a distinct region in the 2–d space, can only be associated with one target profile in a particular round, more than one target may be associated with the same target profile in the same round.\nObservation 1. Adversaries who have succeeded in attacking a target associated with a particular target profile in one round, tend to attack a target with similar target profiles in next round.\nObservation 2. Adversaries who have failed in attacking a target associated with a particular target profile in one round, tend not to attack a target with similar’ target profiles in the next round.\nThe vulnerability associated with a target profile βi, which was shown to the adversary in round r, denoted V rβi , is defined as a function of the total number of successes and failures on the concerned target profile in that round (denoted by successrβi and failure r βi respectively).\nV rβi = successrβi − failure r βi\nsuccessrβi + failure r βi\nTherefore, more successful attacks and few failures on a target profile indicate that it was highly vulnerable in that round. Because multiple targets can be associated with the same target profile and the pure strategy generated based on the mixed strategy x in a particular round may result in a defender\nbeing present at some of these targets while not at others, there may be both successes and failures associated with the same target profile in that round.\nThe attractiveness of a target profile βi at the end of round R, denoted A R βi ,\nis defined as a function of the vulnerabilities for βi from round 1 to round R.\nARβi =\n∑R r=1 V r βi\nR\nTherefore, the attractiveness of a target profile is modeled as the average of the vulnerabilities for that target profile over all the rounds till round R. This is consistent with the notion that a target profile which has led to more successful attacks over several rounds will be perceived as more attractive by the adversary."
    }, {
      "heading" : "2.2.2 SHARP’s utility Computation",
      "text" : "Existing models (such as SUQR) only consider the adversary’s actions from round (r − 1) to predict their actions in round r. However, it is clear that the adversary’s actions in a particular round are dependent on his past successes and failures. Thus, a novel adaptive probability weighted subjective utility function that captures this adaptive nature of the adversary’s behavior by capturing the shifting trends in attractiveness of various target profiles over rounds is proposed.\nASURβi = (1− d ∗A R βi )w1f(xβi) + (1 + d ∗A R βi )w2φβi+\n+ (1 + d ∗ARβi)w3P a βi + (1− d ∗ARβi)w4Dβi\nd is a discounting parameter which is based on a measure of the amount of attack surface exposed. d is low in the initial rounds when the defender does not have enough of the right kind of data, but would gradually increase as more information about the attacker’s preferences about various regions of the attack surface become available.\nNow, let us look at how reasoning about unexposed portions of the attack surface based on the exposed areas. If a target profile βu was not exposed to attacker response in round r, the defender will not be able to compute the vulnerability V rβu . Therefore, it is not possible to estimate the attractiveness for βu and hence the optimal defender strategy. So, in keeping with the analysis on available data and based on the spillover effect introduced earlier, the distance– weighted k–nearest neighbors algorithm is employed to obtain the vulnerability V rβu of an unexposed target profile βu in round r, based on the k most similar target profiles which were exposed to the attacker in round r."
    }, {
      "heading" : "2.2.3 Generating defender’s strategies against SHARP",
      "text" : "While SHARP provides an adversarymodel, the defender strategies against such model must be generated. To that end, first the parameters of SHARP from\navailable data are learned. Then, future round strategies against the boundedly rational adversary are generated, characterized by the learned model parameters by solving the following optimization problem:\nmaxx∈X\n[\n∑\ni∈T\nUdi (x)q R i (w|x)\n]\nwhere qRi (w|x) is the probability that the adversary will attack target i in round R."
    }, {
      "heading" : "2.3 Learning adversary models from three defender’s strategies",
      "text" : "Here, a new approach to learn the parameters of the behavioral model of a bounded rational attacker (thereby pinpointing a near optimal strategy) is developed, by observing how the attacker responds to only three defender strategies.\nNote: even though the setting is the same of the previous sections, since some assumptions changed, e.g., the adaptivity of the attacker, we slightly change the adopted notation to avoid confusion.\nLet the utility function of the attacker for target t ∈ T be denoted by ut : [0, 1] → R. Given a coverage probability vector x ∈ X, the utility of the attacker under strategy x is defined as ut(xt). Upon observing the defender’s strategy x, the attacker computes the utility on each target t, ut(xt), and based on these utilities responds to the defender’s strategy. Here, a non–adaptive attacker is considered. She attacks target t with probability:\nDx(t) = eut(xi) ∑\ni∈T e ui(xi)\nOur model is a generalization of bounded rationality models such as SUQR. Suppose the same mixed strategy x is played for multiple time steps. The empirical distribution of attacks on target t under x is denoted by D̂x(·). Furthermore, it is assumed that for the strategies, and for all t, Dx(t) ≥ ρ, for some ρ = 1\npoly(n) . This assumption is required to estimate the value of D x(t)\nwith polynomially many samples. Our goal is to learn the utility functions, ut(·) for all t ∈ T , by observing attacker’s responses to a choice of coverage probability vectors x ∈ X. This allows to find an approximately optimal defender strategy — the strategy that leads to the best defender utility. ût : [0, 1] → R uniformly approximates or uniformly learns ut(·) within an error of ǫ, if ∀x ∈ [0, 1], |ût(x) − ut(x)| ≤ ǫ. Note that the attacker’s mixed strategy remains the same when the utility functions corresponding to all targets are increased by the same value. Therefore, only a normalized representation of the utility functions can be learned, such that for all t and all x, |ût(x)+c−ut(x)| ≤ ǫ for some c."
    }, {
      "heading" : "2.3.1 Linear utility functions",
      "text" : "Assume that the utility functions are linear and denoted by ut(x) = wtx + ct. Normalizing the utilities, without loss of generality, cn = 0.\nTheorem 1. Suppose the functions u1(·), . . . , un(·) are linear. Consider any 3 strategies x,y, z ∈ X such that for any t < n, |(xt − yt)(xn − zn) − (xn − yn)(xt − zt)| ≥ λ, and for any two different strategies p, q ∈ {x,y, z}, it holds |pt − qt| ≥ ν. If it is possible to access m = Ω ( 1 ρ ( 1 ǫνλ )2 log ( n δ ) ) samples of each of these strategies, then with probability 1− δ, each ut(·) can be uniformly learned within error ǫ.\nν depends on how different the strategies are from each other — a very small value means that they are almost identical on some coordinates. The lower bound of λ would not be very small unless there is a very specific relation between the strategies. As a sanity check, if the three strategies were chosen uniformly at random from the simplex, both values would be at least 1/poly(n). In the quantal best–response model, for each strategy x, the ratio between the attack probabilities of two targets t and n follows the relation:\nut(xt) = ln\n(\nDx(t)\nDx(n)\n)\nTherefore, each strategy induces n − 1 linear equations that can be used to solve for the coefficients of ut. However, only an estimate D̂\nx(t) of the probability that target t is attacked under a strategy x, based on the given samples, can be obtained. So, the inaccuracy in our estimates of ln ( D̂x(t)\nD̂x(n)\n)\nleads to inaccuracy in the estimated polynomial ût. For sufficiently accurate estimates Dx(t), the value of ut differs from the true value by at most ǫ.\nLemma 1. Given x ∈ X, let Dx(t) be the empirical distribution of attacks based on m = Ω (\n1 ρ\n(\n1 ǫνλ\n)2 log (\nn δ\n)\n)\nsamples. With probability 1 − δ, for all\nt ∈ T , 1 ǫ ≤ D̂ x(t) Dx(t) ≤ 1 + ǫ.\nTheorem 2. Suppose the functions u1(·), . . . , un(·) are polynomials of degree at most d. Consider any 2d+1 strategies, y(1), . . . ,y(d),y(d+1) = x(1), . . . ,x(d)x(d+1) such that for all k, k′, k 6= k′, y (k) 1 = y (k′) 1 , p (k) n = p (k′) n , |y (k) n − y (k′) n | ≥ ν and for all t < n, |x (k) t − x (k′) t | ≥ ν. If it is possible to have access to m = Ω (\n1 ρ\n(\n1 ǫνλ\n)2 log (\nn δ\n)\n)\nsamples of each of these strategies, then with probability"
    }, {
      "heading" : "1− δ, each ut(·) can be uniformly learned within error ǫ.",
      "text" : "Now, any utility function that is continuous and L–Lipschitz, i.e., for all t and values x and y, |ut(x) − ut(y)| ≤ L|x− y|, should be learned. Such utility functions can be uniformly learned up to error ǫ, using O (\nL ǫ\n)\nstrategies. For any L–Lipschitz function ut(x), there is a polynomial of degree m = 12L/ǫ that uniformly approximates ut(x) within error of ǫ/2.\nTheorem 3. Suppose the functions u1(·), . . . , un(·) are L-Lipschitz. For d = 12L/ǫ, consider any 2d+1 strategies, y(1), . . . ,y(d),y(d+1) = x(1), . . . ,x(d)x(d+1) such that for all k, k′, k 6= k′, y (k) 1 = y (k′) 1 , p (k) n = p (k′) n , |y (k) n −y (k′) n | ≥ ν and for all t < n, |x (k) t −x (k′) t | ≥ ν. If it is possible to have access to m = Ω ( L2 ρǫ24L/ǫ log ( n δ ) ) samples of each of these strategies, then with probability 1− δ, each ut(·) can be uniformly learned within error ǫ."
    }, {
      "heading" : "2.3.2 Learning the optimal strategy",
      "text" : "So far, the focus has been on the problem of uniformly learning the utility function of the attacker. Now, it is shown that an accurate estimate of this utility function allows to pinpoint an almost optimal strategy for the defender. Let the utility function of the defender on target t ∈ T be denoted by vt : [0, 1] → [−1, 1]. Given a coverage probability vector x ∈ X, the utility the defender receives when target t is attacked i vt(xt). The overall expected utility of the defender is:\nV (x) = ∑\nt∈T\nDx(t)vt(xt)\nLet ût be the learned attacker utility functions, and D̄ x(t) be the predicted attack probability on target t under strategy x, according to the utilities ût, i.e.:\nD̄x(t) = eût(xi) ∑\ni∈T e ûi(xi)\nLet V̄ (x) be the predicted expected utility of the defender based on the learned attacker utilities D̄x(t), i.e., V̄ (x) = ∑\nt∈T D̄ x(t)vt(xt). When the\nattacker utilities are uniformly learned within error ǫ, then V̄ estimates V with error at most 8ǫ. At a high level, this is established by showing that one can predict the attack distribution using the learned attacker utilities. Furthermore, optimizing the defender’s strategy against the approximate attack distributions leads to an approximately optimal strategy for the defender.\nTheorem 4. Assume for all x and any t ∈ T , |ût(xt) − ut(xt)| ≤ ǫ ≤ 1/4. Then, for all x, |V̄ (x) − V (x)| ≤ 4ǫ. Furthermore, let x′ = argmaxx V̄ (x) be the predicted optimal strategy, then maxx V (x)− V (x′) ≤ 8ǫ."
    }, {
      "heading" : "3 Determining attacker’s payoffs exploiting regret–",
      "text" : "based solutions\nThe adversary behavior models (capturing bounded rationality) can be learned from real–world data on where adversaries have attacked, and game payoffs can be determined precisely from data on animal densities.\nOne key approach to modeling payoff uncertainty is to express the adversary’s payoffs as lying within specific intervals: for each target t, it holds:\nRat ∈ [R a min(t), R a max(t)], P a t ∈ [P a min(t), P a max(t)]\nWhile a behavioral model from real–world data can be learned, access to data to precisely compute animal density may be not always possible. For example, given limited numbers of rangers, they may have patrolled and collected wildlife data from only a small portion of a national park, and thus payoffs in other areas of the park may remain uncertain. Also, due to the dynamic changes (e.g., animal migration), players’ payoffs may become uncertain in the next season. Hence, a new MiniMaxRegret (MMR)–based robust algorithm is introduced, ARROW, to handle payoff uncertainty in Green Security Games (a.k.a. GSGs, i.e., Security Games for the protection of wildlife, forest and fisheries), taking into account adversary behavioral models. Here, the main focus is on zero–sum games, as motivated by recent work in green security domains and earlier major SSG applications that use zero–sum games. In addition, a model inspired by SUQR is adopted, where the subjective utility function is:\nÛat (x,R a,P a) = w1xt + w2R a t + w3P a t + w4Φt\nwhere xt is the coverage probability of target t and Φt is another feature of target t, e.g., distance, as seen for SHARP. MMRb with uncertain payoffs is now formulated for both players in zero–sum SSG with a boundedly rational attacker.\nDefinition 1. Given (Ra,P a), the defender’s behavioral regret is the loss in her utility for playing a strategy x instead of the optimal strategy, which is represented as follows:\nRb(x,R a,P a) = maxx′∈XF (x ′,Ra,P a)− F (x,Ra,P a)\nwhere\nF (x,Ra,P a) = ∑\nt\nq̂t(x,R a,P a)Udt (x,R d,P d)\nBehavioral regret measures the distance in terms of utility loss from the defender strategy x to the optimal strategy given the attacker payoffs. Here, F (x,Ra,P a) is the defender’s utility for playing x where the attacker payoffs, whose response follows SUQR, are (Ra,P a). The defender’s payoffs in zerosum games are Rd = −P a and P d = −Ra. When the payoffs are uncertain,\nif the defender plays a strategy x, she receives different behavioral regrets w.r.t to different payoff instances within the uncertainty intervals. Thus, she could receive a behavioral max regret which is defined as follows.\nDefinition 2. Given payoff intervals I, the behavioral max regret for the defender to play a strategy x is the maximum behavioral regret over all payoff instances:\nMRb(x, I) = max(Ra,Pa)∈IRb(x,R a,P a)\nDefinition 3. Given payoff intervals I, the behavioral minimax regret problem attempts to find the defender optimal strategy that minimizes the MRb she receives:\nMMRb(I) = minx∈XMRb(x, I)\nIntuitively, behavorial minimax regret ensures that the defender’s strategy minimizes the loss in the solution quality over the uncertainty of all possible payoff realizations.\nOverall, MMRb can be reformulated as minimizing the max regret r such that r is no less than the behavioral regrets over all payoff instances within the intervals:\nminx∈X,r∈R r s.t. r ≥ F (x′,Ra,P a)− F (x,Ra,P a), ∀(Ra,P a) ∈ I,x′ ∈ X\nThe set of constraints is infinite since X and I are continuous. One practical approach to optimization with large constraint sets is constraint sampling, coupled with constraint generation (a.k.a. row generation). Following this approach, ARROW samples a subset of constraints and gradually expands this set by adding violated constraints to the relaxed problem until convergence to the optimal MMRb solution.\nSpecifically, ARROW begins by sampling pairs (Ra,P a) of the adversary payoffs uniformly from I. The corresponding optimal strategies for the defender given these payoff samples, denoted x′, are then computed using the PASAQ algorithm [26] to obtain a finite set S of sampled constraints. These sampled constraints are then used to solve the corresponding relaxed MMRb program using the R.ARROW algorithm. The optimal solution (lb,x∗) is thus obtained, providing a lower bound (lb) on the true MMRb. Then constraint generation is applied to determine violated constraints (if any). This uses the M.ARROW algorithm which computesMRb(x\n∗, I), the optimal regret of x∗ which is an upper bound (ub) on the true MMRb. If ub > lb, the optimal solution of M.ARROW, {x\n′,∗,Ra,∗,P a,∗} provides the maximally violated constraint, which is added to S. Otherwise, x∗ is the minimax optimal strategy and lb = ub = MMRb(I).\nThe first step of ARROW is to solve the relaxed MMRb problem using R.ARROW. This relaxed MMRb problem is non–convex. Thus, R.ARROW presents two key ideas for efficiency:\n1. binary search (which iteratively searches the defender’s utility space to find the optimal solution) to remove the fractional terms in relaxed MMRb;\n2. it then applies piecewise–linear approximation to linearize the non–convex terms of the resulting decision problem at each binary search step.\nTheorem 5. R.ARROW provides an O ( ǫ+ 1 M )\n–optimal solution of relaxed MMRb where ǫ is the tolerance of binary search and M is the number of piecewise segments.\nGiven the optimal solution x∗ returned by R.ARROW, the second step of ARROW is to compute MRb of x\n∗ using M.ARROW. A local search with multiple starting points is employed since allows to reach different local optima.\nWhile ARROW incorporates an adversary behavioral model, it may not be applicable for green security domains where there may be a further paucity of data in which not only payoffs are uncertain but also parameters of the behavioral model are difficult to learn accurately. Therefore, a novel MMR-based algorithm, ARROW–Perfect, can be introduced to handle uncertainty in both players’ payoffs assuming a perfectly rational attacker. In general, ARROW– Perfect follows the same constraint sampling and constraint generation methodology as ARROW. Yet, by leveraging the property that the attacker’s optimal response is a pure strategy (given a perfectly rational attacker) and the game is zero–sum, the exact optimal solutions for computing both relaxed MMR and max regret in polynomial time are obtained (while we cannot provide such guarantees for a boundedly rational attacker)."
    }, {
      "heading" : "4 Online learning",
      "text" : ""
    }, {
      "heading" : "4.1 Handling exploration–exploitation tradeoffs in Security Games",
      "text" : "Previous research optimizes defenders’ strategies by modeling this problem as a repeated Stackelberg game, capturing the special property in this domain frequent interactions between defenders and attackers. However, this research fails to handle exploration–exploitation tradeoff in this domain caused by the fact that defenders only have knowledge of attack activities at targets they protect. The problem is formulated as a Restless Multi–Armed Bandit (RMAB) model to address this challenge. To use Whittle index policy to plan for patrol strategies in the RMAB, two sufficient conditions for indexability and an algorithm to numerically evaluate indexability are provided. Given indexability, a binary search based algorithm to find Whittle index policy efficiently is proposed.\nIt is assumed that defenders have knowledge of all poaching activities throughout the wildlife protected area. Unfortunately, given vast geographic areas for wildlife protection, defenders do not have knowledge of poaching activities in areas they do not protect. Thus, defenders are faced with the exploration– exploitation tradeoff. The exploration–exploitation tradeoff here is different from that in the non–Bayesian stochastic multi–armed bandit problem. In stochastic multi–armed bandit problems, the rewards of every arm are random variables with a stationary unknown distribution. However, in our problem, patrol affects attack activities, i.e.m, more patrol is likely to decrease attack activities and less patrol is likely to increase attack activities. Thus, the random variable distribution is changing depending on player’s choice — more selection (patrol) leads to lower reward (less attack activities) and less selection (patrol) leads to higher reward (more attack activities). On the other hand, adversarial multi–armed bandit problem is also not an appropriate model for this domain. In adversarial multi–armed bandit problems, the reward can arbitrarily change while the attack activities in our problem are unlikely to change rapidly in a short period.\nPoaching activity is a dynamic process affected by patrol. If patrollers patrol in a certain location frequently, it is very likely that the poachers poaching in this location will switch to other locations for poaching. On the other hand, if a location has not been patrolled for a long time, poachers may gradually notice that and switch to this location for poaching. In the wildlife protection domain, both patrollers and poachers do not have perfect observation of their opponents’ actions. This observation imperfection lies in two aspects: limited observability — patrollers/poachers do not know what happens at locations they do not patrol/poach; partial observability — patrollers/poachers do not have perfect observation even at locations they patrol/poach — the location might be large (e.g., a 2km × 2km area) so that it is possible that patrollers and poachers do not see each other even if they are at the same location. These two properties make it extremely difficult for defenders to optimally plan their patrol strategies."
    }, {
      "heading" : "4.1.1 Problem formulation",
      "text" : "There are n targets that are indexed by N = {1, . . . , n}. Defenders have k patrol resources that can be deployed to these n targets. At every round, defenders choose k targets to protect. After that, defenders will have an observation of the number of attack activities for targets they protect, and no information for targets they do not protect. The objective for defenders is to decide which k targets to protect at every round to catch as many attackers as possible. Due to the partial observability on defenders’ side (defenders’ observation of attack activities is not perfect even for targets they protect), a hidden variable attack intensity is introduced, representing the true degree of attack intensity at a certain target. Clearly, this hidden variable attack intensity cannot directly be observed by defenders. Instead, defenders’ observation is a random variable conditioned on this hidden variable attack intensity, and the larger the attack intensity is, the more likely it is for defenders to observe more attack activities during their patrol. The hidden variable attack intensity is discretized into ns levels, denoted by S = {0, 1, . . . , ns − 1}. Lower i represents lower attack intensity. For a certain target, its attack intensity transitions after every round. If this target is protected, attack intensity transitions according to a ns × ns transition matrix T 1; if this target is not protected, attack intensity transitions according to another ns×ns transition matrix T\n0. The transition matrix represents how patrol affects attack intensity — T 1 tends to reduce attack intensity and T 0 tends to increase attack intensity. Note that different targets may have different transition matrices because some targets may be more attractive to attackers (for example, some locations may have more animal resources in the wildlife protection domain) so that it is more difficult for attack intensity to go down and easier for attack intensity to go up. Also defenders’ observations of attack activities are discretized into no levels, denoted by O = {0, 1, . . . , no−1}. Lower i represents less attack activities defenders observe. Note that defenders will only have observation for targets they protect. A ns × no observation matrix O determines how the observation depends on the hidden variable attack intensity. Generally, the larger the attack intensity is, the more likely it is for defenders to observe more attack activities during their patrol. Similar to transition matrices, different targets may have different observation matrices. While defenders get observations of attack activities during their patrol, they also receive rewards for that — arresting poachers/fareevaders/smugglers bring benefit. Clearly, the reward defenders receive depends on their observation and thus the reward function is defined as R(o), o ∈ O — larger i leads to higher reward R(i). Note that defenders only get rewards for targets they protect. To summarize, for the targets defenders protect, defenders get an observation depending on its current attack intensity, get the reward associated with the observation, and then the attack intensity transitions according to T 1; for the targets defenders do not protect, defenders do not have any observation, get reward 0 and the attack intensity transitions according to T 0."
    }, {
      "heading" : "4.1.2 Learning model from defenders’ previous observations",
      "text" : "Given defenders’ action history {ai} and observation history {oi}, our objective is to learn the transition matrices T 1 and T 0, observation matrix O and initial belief π. Due to the existence of hidden variables {si}, expectation– maximization (EM) algorithm is used for learning. The update steps are the following:\nπ (d+1) i = P (s1 = i|x; θ d)\nT 1(d+1) ij =\n∑T−1 t=1:at=1 P (st = i, st+1 = j|x; θ d)\n∑T−1 t=1:at=1 P (st = i|x; θd)\nT 0(d+1) ij =\n∑T−1 t=1:at=0 P (st = i, st+1 = j|x; θd) ∑T−1\nt=1:at=0 P (st = i|x; θd)\nO (d+1) ij =\n∑T t=1:at=1 P (st = i|x; θd)I(ot = j) ∑T\nt=1:at=1 P (st = i|x; θd)"
    }, {
      "heading" : "4.1.3 Restless multi–armed bandit problems",
      "text" : "In RMABs, each arm represents an independent Markov machine. At every round, the player chooses k out of n arms (k < n) to activate and receives the reward determined by the state of the activated arms. After that, the states of all arms will transition to new states according to certain Markov transition probabilities. The problem is called restless because the states of passive arms will also transition like active arms. The aim of the player is to maximize his cumulative reward by choosing which arms to activate at every round. It is PSPACE–hard to find the optimal strategy to general RMABs [13]. An index policy assigns an index to each state of each arm to measure how rewarding it is to activate an arm at a particular state. At every round, the index policy chooses to pick the k arms whose current states have the highest indices. Since the index of an arm only depends on the properties of this arm, index policy reduces an n–dimensional problem to n 1–dimensional problems so that the complexity is reduced from exponential with n to linear with n. Whittle proposed a heuristic index policy for RMABs by considering the Lagrangian relaxation of the problem [24]. It has been shown that Whittle index policy is asymptotically optimal under certain conditions as k and n tend to infinity with k/n fixed. When k and n are finite, extensive empirical studies have also demonstrated the near–optimal performance of Whittle index policy. Whittle index measures how attractive it is to activate an arm based on the concept of subsidy for passivity. It gives the subsidy m to passive action (not activate) and the smallest m that would make passive action optimal for the current state is defined to be the Whittle index for this arm at this state. Whittle index policy chooses to activate the k arms with the highest Whittle indices. Intuitively, the larger the m is, the larger the gap is between active action (activate) and\npassive action, the more attractive it is for the player to activate this arm. Mathematically, denote Vm(x; a = 0) (Vm(x; a = 1)) to be the maximum cumulative reward the player can achieve until the end if he takes passive (active) action at the first round at the state x with subsidy m. Whittle index I(x) of state x is then defined to be:\nI(x) = infm{m : Vm(x; a = 0) ≥ Vm(x; a = 1)}\nHowever, Whittle index only exists and Whittle index policy can only be used when the problem satisfies a property known as indexability. Define Φ(m) to be the set of states for which passive action is the optimal action given subsidy m:\nΦ(m) = {x : Vm(x; a = 0) ≥ Vm(x; a = 1)}\nDefinition 4. An arm is indexable if Φ(m) monotonically increases from ∅ to the whole state space as m increases from −∞ to +∞. An RMAB is indexable if every arm is indexable."
    }, {
      "heading" : "4.1.4 Restless bandit formulation",
      "text" : "Every target is viewed as an arm and defenders choose k arms to activate (k targets to protect) at every round. Consider a single arm (target), it is associated with ns (hidden) states, no observations, ns×ns transition matrices T\n1 and T 0, ns × no observation matrix O and reward function R(o), o ∈ O. For the arm defenders activate, defenders get an observation, get reward associated with the observation, and the state transitions according to T 1. Note that defenders’ observation is not the state. Instead, it is a random variable conditioned on the state, and reveals some information about the state. For the arms defenders do not activate, defenders do not have any observation, get reward 0 and the state transitions according to T 0. Since defenders can not directly observe the state, defenders maintain a belief b of the states for each target, based on which defenders make decisions. The belief is updated according to the Bayesian rules. The following equation shows the belief update when defenders protect this target (a = 1) and get observation o or defenders do not protect this target (a = 0).\nb′(s′) =\n{\nη ∑ s∈S b(s)OsoT 1 ss′ , a = 1 ∑\ns∈S b(s)OsoT 0 ss′ , a = 0\nwhere η is the normalization factor. When defenders do not protect this target (a = 0), defenders do not have any observation, so their belief is updated according to the state transition rule. When defenders protect this target (a = 1), their belief is firstly updated according to their observation o (bnew(s) = ηb(s)Oso according to Bayes’ rule), and then the new belief is then updated according to the state transition rule:\nb′(s′) = ∑\ns∈S\nbnew(s)T 1 ss′\n= ∑\ns∈S\nηb(s)OsoT 1 ss′\n= η ∑\ns∈S\nb(s)OsoT 1 ss′\nNow the mathematical definition of Whittle index is presented. Denote Vm(b) to be the value function for belief state b with subsidy m. Vm(b; a = 0) to be the value function for belief state b with subsidym and defenders take passive action. Vm(b; a = 1) to be the value function for belief state b with subsidy m and defenders take active action. The following equations show these value functions:\nVm(b; a = 0) = m+ βVm(ba=0) Vm(b; a = 1) = ∑\ns∈S\nb(s) ∑\no∈O\nOsoR(o) + β ∑\no∈O\n∑\ns∈S\nb(s)OsoVm(b o a=1)\nVm(b) = max{Vm(b; a = 0), Vm(b; a = 1)}\nWhen defenders take passive action, they get the immediate reward m and the β–discounted future reward — value function at new belief ba = 0, which is updated from b according to the case a = 0. When defenders take active action, they get the expected immediate reward ∑\ns∈S b(s) ∑\no∈O OsoR(o) and the β–discounted future reward. The value function Vm(b) is the maximum of Vm(b; a = 0) and Vm(b; a = 1). Whittle index I(b) of belief state b is then defined to be:\nI(b) = infm{m : Vm(b; a = 0) ≥ Vm(b; a = 1)}\nThe passive action set Φ(m), which is the set of belief states for which passive action is the optimal action given subsidy m is then defined to be:\nΦ(m) = infm{b : Vm(b; a = 0) ≥ Vm(b; a = 1)}"
    }, {
      "heading" : "4.1.5 Sufficient condition for indexability",
      "text" : "Two sufficient conditions for indexability when no = 2 and ns = 2 are provided. Denote the transition matrices to be T 0 and T 1, observation matrix to be O. Clearly in our problem, O11 > O01, O00 > O10 (higher attack intensity leads to higher probability to see attack activities when patrolling); T 111 > T 1 01, T 1 00 > T 1 10, T 011 > T 0 01, T 0 00 > T 0 10 (positively correlated arms).\nDefine α = max{T 011 −T 1 01, T 0 11 > T 1 01}. Since it is a two–state problem with S = {0, 1}, x represents the belief state: x = b(s = 1), which is the probability of being in state 1.\nDefine Γ1(x) = xT 1 11 + (1 − x)T 1 01 which is the belief for the next round if the belief for the current round is x and the active action is taken. Similarly, Γ0(x) = xT 0 11 + (1 − x)T 0 01, which is the belief for the next round if the belief for the current round is x and the passive action is taken. Below two theorems demonstrating two sufficient conditions for indexability are presented.\nTheorem 6. When α ≤ 0.5, the process is indexable, i.e., for any belief x, if Vm(x; a = 0) ≥ Vm(x; a = 1), then Vm(x; a = 0) ≥ V m(x; a = 1), ∀m ≥ m.\nTheorem 7. When αβ ≤ 0.5 and Γ1(1) ≤ Γ0(0), the process is indexable, i.e., for any belief x, if Vm(x; a = 0) ≥ Vm(x; a = 1), then Vm(x; a = 0) ≥ V m(x; a = 1), ∀m ≥ m."
    }, {
      "heading" : "4.1.6 Numerical evaluation of indexability",
      "text" : "Proposition 1. If m < R(0)βR(no−1)−R(0)1−β ,Φ(m) = ∅; if m > R(no− 1),Φ(m) is the whole belief state space.\nThus, it should be determined whether the set Φ(m) monotonically increases\nfor m ⊆ [ R(0)βR(no−1)−R(0)1−β , R(no − 1) ] . Numerically, this limited m range is discretized and then it is evaluated if Φ(m) monotonically increases with the increase of discretized m. Given the subsidy m, Φ(m) can be determined by solving a special POMDP model whose conditional observation probability is dependent on start state and action. The algorithm returns a set D which contains ns–length vectors d1, d2, . . . , d|D|. Every vector di is associated with an optimal action ei. Given the belief b, the optimal action is determined by aopt = ei, i = argmaxj b Tdj . Thus, Φ(m) = ∪i:ei=0{b : b Tdi ≥ bTdj , ∀j}.\nGiven m0 < m1, our aim is to check whether Φ(m0) ⊆ Φ(m0). A MILP to verify whether such condition holds can be solved."
    }, {
      "heading" : "4.1.7 Computation of Whittle index Policy",
      "text" : "Given the indexability, Whittle index can be found by doing a binary search within the range m ⊆ [\nR(0)βR(no−1)−R(0)1−β , R(no − 1) ] . Given the upper bound\nub and lower bound lb, the problem with middle point lb+ub2 as passive subsidy is sent to the special POMDP solver to find the optimal action for the current belief. If the optimal action is active, then the Whittle index is greater than the middle point so lb ← lb+ub2 or else ub ← lb+ub 2 . This binary search algorithm can find Whittle index with arbitrary precision. Naively, the Whittle index policy can be found by computing the ǫ–precision indices of all arms and then picking the k arms with the highest indices.\nSpecifically, let A be the Whittle index policy to be returned: it is set to be ∅ at the beginning. S is the set of arms that are not known whether belonging to A or not and is set to be the whole set of arms at the beginning. Before it finds top–k arms, it tests all the arms in S about their optimal action with subsidy lb+ub2 . If the optimal action is 1, it means this arm’s index is higher\nthan lb+ub2 and it is added to S1; if the optimal action is 0, it means this arm’s index is lower than lb+ub2 and it is added to S0. At this moment, all arms in S1 have higher indices than all arms in S0. If there is enough space in A to include all arms in S1, S1 is added to A, remove them from S and set the upper bound to be lb+ub2 because S1 belongs to Whittle index policy set and all the rest arms have the index lower than lb+ub2 . If there is not enough space in A, S0 is removed from S and set the lower bound to be lb+ub\n2 because S0 does not belong to Whittle index policy set and all the rest arms have the index higher than lb+ub2 ."
    }, {
      "heading" : "4.1.8 Special POMDP formulation",
      "text" : "Here, the algorithm to compute the passive action set Φ(m) with the subsidy m is discussed. This problem can be viewed as solving a special POMDP model whose conditional observation probability is dependent on start state and action while the conditional observation probability is dependent on end state and action in standard POMDPs.\nThe original state is s, the agent takes action a, and the state transitions to s′ according to P (s′|s, a). However, the observation o the agent gets during this process is dependent on s and a in our special POMDPs; while it depends on s′ and a in standard POMDPs.\nThe special POMDP formulation for our problem is straightforward.\n• The state space is S = {0, 1, . . . , ns − 1}.\n• The action space is A = {0, 1}, where a = 0 represents passive action (do not protect) and a = 1 represents active action (protect).\n• The observation space is O = {−1, 0, 1, . . . , no − 1}. It adds a fake observation o = −1 to represent no observation when taking action a = 0. It’s called fake because defenders have probability 1 to observe o = 1 no matter what the state is when they take action a = 0, so this observation does not provide any information. When defenders take action a = 1, they may observe observations O\\{−1}.\n• The conditional transition probability P (s′|s, a) is defined to be P (s′ = j|s = i, a = 1) = T 1ij and P (s ′ = j|s = i, a = 0) = T 0ij .\n• The conditional observation probability P (o|s, a) is defined to be P (o = −1|s, a = 0) = 1, ∀s ∈ S;P (o = j|s = i, a = 1) = Oij . Note that the conditional observation probability here is dependent on the start state s and action a, while it depends on end state s and action a in standard POMDP models. Intuitively, defenders’ observation of attack activities today depends on the attack intensity today, not the transitioned attack intensity tomorrow.\n• The reward function R is:\nR(s, s′, a, o) =\n{\n0, a = 0\nR(o), a = 1\nWith the transition probability and observation probability, R(s, a) can be computed. Note that this formulation is also slightly different due to the different definition of observation probability.\nR(s, a) = ∑\ns′∈S\nP (s′|s, a) ∑\no∈O\nP (o|s, a)R(s, s′, a, o)"
    }, {
      "heading" : "4.1.9 Value iteration for the special POMDP",
      "text" : "Different from standard POMDP formulation, the belief update in the special POMDP formulation is:\nb′(s′) =\n∑\ns′∈S b(s)P (o|s, a)P (s ′|s, a)\nP (o|b, a)\nwhere\nP (o|b, a) = ∑\ns′∈S\n∑\ns∈S\nb(s)P (o|s, a)P (s′|s, a) = ∑\ns∈S\nb(s)P (o|s, a)\nSimilar to standard POMDP formulation, the value function is:\nV ′(b) = maxa∈A\n(\n∑\ns∈S\nb(s)R(s, a) + β ∑\no∈O\nP (o|b, a)V (boa)\n)\nwhich can be broken up to simpler combinations of other value functions:\nV ′(b) = maxa∈AVa(b) Va(b) = ∑\no∈O\nV oa (b)\nV oa (b) =\n∑\ns∈S b(s)R(s, a)\n|O| + βP (o|b, a)V (boa)\nAll the value functions can be represented as V (b) = maxα∈Dbα since the update process maintains this property, so the set D is updated when updating the value function."
    }, {
      "heading" : "4.1.10 Planning from POMDP view",
      "text" : "Every single target can be modeled as a special POMDP model. Given that, these POMDP models at all targets can be combined to form a special POMDP model that describe the whole problem, and solving this special POMDP model leads to defenders’ exact optimal strategy. Use the superscript i to denote target i. Generally, the POMDP model for the whole problem is the cross product of the single–target POMDP models at all targets with the constraint that only k targets are protected at every round.\n• The state space is S = S1 × S2 × . . .× Sn. Denote s = (s1, s2, . . . , sn).\n• The action space is A = {(a1, a2, . . . , an)|aj ∈ {0, 1}, ∀j ∈ N, ∑ j∈N a j =\nk}, which represents that only k targets can be protected at a round. Denote a = (a1, a2, . . . , an).\n• The observation spaceO = O1×O2×. . .×On. Denote o = (o1, o2, . . . , on).\n• The conditional transition probability is P (s′|s, a) = ∏ j∈N P j(s ′j |sj , aj).\n• The conditional observation probability is P (o|s, a) = ∏ j∈N P j(oj |sj , aj).\n• The reward function is R(s, s′, a, o) = ∏ j∈N R(s j , s ′j,aj ,oj ).\nSilver and Veness [20] have proposed POMCP algorithm, which provides high quality solutions and is scalable to large POMDPs. The POMCP algorithm only requires a simulator of the problem so it also applies to our special POMDPs. At a high level, the POMCP algorithm is composed of two parts: it uses a particle filter to maintain an approximation of the belief state; it draw state samples from the particle filter and then use MCTS to simulate what will happen next to find the best action. It uses a particle filter to approximate the belief state because it is even computationally impossible in many problems to update belief state due to the extreme large size of the state space. However, in our problem, the all–target POMDP model is the cross product of the single–target POMDP models at all targets. The single–state POMDP model is small so that it is computationally inexpensive to maintain its belief state. Thus, the state si at target i can be sampled from its belief state and then compose them together to get the state sample s = (s1, s2, . . . , sn) for the all–target POMDP model."
    }, {
      "heading" : "4.2 Online planning for optimal protector strategies in resource conservation games",
      "text" : "Protectors (law enforcement agencies) try to protect natural resources, while extractors (criminals) seek to exploit them. In many domains, such as illegal fishing, the extractors know more about the distribution and richness of the resources than the protectors, making it extremely difficult for the protectors to optimally allocate their assets for patrol and interdiction. Fortunately, extractors carry out frequent illegal extractions, so protectors can learn about the richness of resources by observing the extractor’s behavior.\nIn resource conservation domains, the protector often does not know the distribution of resources while the extractor may have more information about it, e.g. preventing illegal fishing. Our goal is to provide an optimal asset deployment (e.g., patrol) strategy for the protector, given her lack of knowledge about the distribution of resources."
    }, {
      "heading" : "4.2.1 Problem formulation",
      "text" : "In resource conservation games, the extractor’s frequent illegal extractions provide the protector with the opportunity to learn about the distribution of resources by observing the extractor’s behavior. The aim is the construction of an online policy for the protector to maximize her utility given observations of the extractor. At every round, the protector chooses one site to protect and the extractor simultaneously chooses one site to steal from. Both the extractor and the protector have full knowledge about each other’s previous actions.\nIn our model, the amount of resources at each site will be fixed and the extractor will have full knowledge of this distribution. The protector will have to learn this distribution by observing the extractor’s behavior.\nThere is a finite time horizon t ∈ T . There are n sites indexed by N = {1, 2, . . . , n} that represent the locations of the natural resource in question: the extractor wants to steal resources from these sites and the protector wants to interdict the extractor. The value of the sites to the extractor is represented in terms of their utilities. Each site has a utility u(i) that is only known to the extractor. The utility space is discretized into m levels, u(i) ∈ M = {1, 2, . . . ,m}. Human beings cannot distinguish between tiny differences in utilities in the real world, so discretizing these utilities is justified. For n sites and m utility levels, there are mn possible sets of utilities across all sites. The distribution of resources is then captured by the vector of utilities at each site, and the set of possible resource distributions is:\nU = {(u(1), u(2), . . . , u(n)) : u(i) ∈ M, ∀i ∈ N}\nAssuming that the resource levels u(i), i ∈ N are independent from each other, at the beginning of the game, the protector may have some prior knowledge about the resource levels u(i) at each site i ∈ N . This prior knowledge is represented as a probability density function p(u(i)) over M . If the protector does not know anything about u(i), then a uniform prior for u(i) over M is adopted. At each time t ∈ T , the protector chooses a site at ∈ N to protect and the extractor simultaneously chooses a site ot ∈ N from which to steal. If at = ot, the protector catches the extractor and the extractor is penalized by the amount P (ot) < 0; if at 6= ot, the extractor successfully steals resources from site ot and gets a payoff of u(ot). For clarity, the protector’s interdiction is always successful whenever it visits the same site as the extractor. Additionally, the protector fully observes the moves of the extractor, likewise, the extractor fully observes the moves of the protector. Note that the penalty P (i), i ∈ N is known to both the protector and the extractor. A zero–sum game is adopted,\nso the protector is trying to minimize the extractor’s payoffs. In most resource conservation domains, the extractor pays the same penalty P if he is seized independent of the site he visits. Varying penalties across sites for greater generality are allowed. A fictitious Quantal Response playing (FQR) extractor is assumed. Specifically, a fictitious extractor assumes the protector’s empirical distribution will be his mixed strategy in the next round. In this behavior model, the extractor makes decisions based on the parameters u(i), P (i), i ∈ N , as well as the protector’s actions in previous rounds.\nThe extractor behaves in the following way: in every round, he computes the empirical coverage probability ci for every site i based on the history of the protector’s actions, then computes the expected utility EU(i) = c(i)P (i) + (1− c(i))u(i) for every site and finally attempts to steal from the site i with the probability proportional to eλEU(i) where λ ≥ 0 is the parameter representing the rationality of the player (higher λ represents a more rational player).\nTo implement the above model, two technical questions must be resolved. First, at every round t, based on her current belief about u, how should the protector choose sites to protect in the next round? Second, after each round, how should the protector use the observation of the latest round to update her beliefs about u? Here, decision making and belief updating in a partially observable environment, where the payoffs u are unobservable and the extractor’s actions are observable, are being studied, which is the exact setup for a POMDP. A two– player game is now setup as a POMDP {S,A,O, T,Ω, R} where the extractor follows a quantal response model.\n• The state space of our POMDP is S = U ×Zn, which is the cross product of the utility space and the count space. U is the utility space. Zn is the set of possible counts of the protector’s visits to each site, where Ct ∈ Zn\nis an integer-valued vector where Ct(i), i ∈ N is the number of times that the protector has protected site i at the beginning of round t ∈ T . A particular state s ∈ S is written as s = (u,C), where u is the vector of utility levels for each site and C is the current state count. The initial beliefs are expressed by a distribution over s = (u, 0), induced by the prior distribution on u. ct(i) = Ct(i) t−1 denotes the frequency with which the protector visits site i at the beginning of round t ∈ T . c1 = 0 by convention.\n• The action space A is N , representing the site the protector chooses to protect.\n• The observation space O is N , representing the site the extractor chooses to attempt to steal from.\n• Let ea ∈ Rn denote the unit vector with a 1 in slot a ∈ N and zeros elsewhere. The conditional transition probability T governing the evolution of the state is:\nT (s′ = (u′, C′)|s = (u,C), a) =\n{\n1 u = u′, C′ = C + ea,\n0, otherwise\nSpecifically, the evolution of the state is deterministic. The underlying utilities do not change, and the count for the site visited by the protector increases by one while all others stay the same.\n• EU(u,C) ∈ Rn defines the vector of empirical expected utilities for the extractor for all sites when the actual utility is u and the count is C,\n[EU(u,C)](i) = c(i)P (i) + (1− c(i))u(i), ∀i ∈ N,\nwhen t ≥ 1. [EU(u, 0)](i) = u(i) by convention. Hence, our observation probabilities are explicitly:\nΩ(o|s′ = (u,C), a) = eλ[EU(u,C−ea)](o) ∑\ni∈N e λ[EU(u,C−ea)](i)\nthe probability of observing the extractor takes action o when the protector takes action a and arrives at state s. Note that both a and o are the actions the protector/extractor take at the same round.\n• The reward function R is:\nR(s = (u,C), s′ = (u,C + ea), a, o) =\n{\n−P (o), a = o\n−u(o), a 6= o"
    }, {
      "heading" : "4.2.2 GMOP algorithm",
      "text" : "The size of the utility space U is mn, and the size of the count space is O ( Tn\nn!\n)\n. The computational cost of the latest POMDP solvers soon become unaffordable for us as the problem size grows.\nSilver and Veness [20] have proposed the POMCP algorithm, which provides high quality solutions for large POMDPs. The POMCP algorithm uses a particle filter to approximate the belief state. Then, it uses Monte Carlo tree search (MCTS) for online planning where state samples are drawn from the particle filter and the action with the highest expected utility based on Monte Carlo simulations is chosen. However, the particle filter is only an approximation of the true belief state and is likely to move further away from the actual belief state as the game goes on, especially when most particles get depleted and new particles need to be added. Adding new particles will either make the particle filter a worse approximation of the exact belief state, if the added particles do not follow the distribution of the belief state or be as difficult as drawing samples directly from the belief state, if the added particles do follow the distribution of the belief state.\nOur POMDP has specific structure that can be exploited. The count state in S is known and the utility state does not change, making it possible to draw samples directly from the exact belief state using Gibbs sampling. We propose the GMOP algorithm that draws samples directly from the exact belief state using Gibbs sampling, and then runs MCTS. The samples drawn directly from the belief state better represent the true belief state compared to samples drawn from a particle filter.\nAt a high level, in round t the protector draws samples of state s from its belief state Bt(s) using Gibbs sampling and then it runs MCTS using those samples. Finally, it executes the action with the highest expected utility. MCTS starts with a tree that only contains a root node. Since the count state Ct is already known, the protector only needs to sample the utility state u from Bt. The sampled state s is comprised of the sampled utility u and the count Ct.\nGibbs sampling [2] is a Markov chain Monte Carlo (MCMC) algorithm for sampling from multivariate probability distributions. Let X = (x1, x2, . . . , xn) be a general random vector with n components and with finite support described by the multivariate probability density p(X). Gibbs sampling only requires the conditional probabilities p(xi|xi) to simulate X , where xi = (xj)j 6=i denotes the subset of all components of X except component i. Gibbs sampling is useful when direct sampling from p(X) is difficult. Suppose k samples of X = (x1, x2, . . . , xn) should be obtained.\nGibbs sampling works in general to produce these samples using only the conditional probabilities p(xi|x−i). It constructs a Markov chain whose steadystate distribution is given by p(X), so that the samples also follow the distribution p(X). The states of this Markov chain are the possible realizations of X = (x1, x2, . . . , xn), and a specific state Xi is denoted as Xi = (xi1, xi2, . . . , xin) (there are finitely many such states by our assumption). The transition probabilities of this Markov chain, Pr(Xj |Xi), follow from the conditional probabilities p(xi|x−i). Specifically, Pr(Xj |Xi) = p(xl|x−l) when xjv = xiv for all v not equal to l, and is equal to zero otherwise, i.e. the state transitions only change one component of the vector–valued sample at a time. This Markov chain is reversible (meaning p(Xi)Pr(Xj |Xi) = P (Xj)Pr(Xi|Xj), ∀i, j) so p(X) is its steady–state distribution."
    }, {
      "heading" : "4.2.3 Applying Gibbs sampling in GMOP",
      "text" : "Let Bt be the probability distribution representing the protector’s beliefs about the true utilities at the beginning of round t ≥ 1; B1 represents the protector’s prior beliefs when the game starts. Let Bt(u) denote the probability of the vector of utilities u with respect to the distribution Bt. Let B be the prior belief distribution and B be the posterior belief distribution. Our Bayesian belief update rule to obtain B from B and the observation is explicitly:\nB′(s′ = (u,C)) = ηΩ(o|s′, a) ∑\ns∈S\nT (s′|s, a)B(s)\n= ηΩ(o|s′, a)B(s = (u,C − ea))\nIf at and ot represent the actions that the protector and the extractor choose to take at round t:\nBt(u) = ηBt−1(u)Ω(ot−1|s = (u,Ct), at−1)\n= η′B1(u)\nt−1 ∏\ni=1\nΩ(oi|s = (u,Ci+1), ai)\nIt follows that the posterior belief Bt is proportional to the prior belief B1 multiplied by the observation probabilities over the entire history. Since there are mn possible utilities, it is impossible to store and update Bt when m and n are large, and thus it is impossible to sample directly from Bt. Hence, Gibbs sampling is adopted.\nOnly the conditional probabilities p(ui|u−i), ∀i in Bt are needed:\np(ui|u−i) = ηp(ui, u−i) = ηBt(ui, u−i) =\nη′B1(ui, u−i)\nt−1 ∏\nj=1\nΩ(oj |s = (u = (ui, u−i), Cj+1), aj) =\nη′′B1(ui) t−1 ∏\nj=1\nΩ(oj |s = (u = (ui, u−i), Cj+1), aj)\nThis quantity is easy to compute where B1(ui) is the prior probability that site i has utility ui. Besides the conditional probability, also a valid u with Bt(u) > 0 should be found to initialize Gibbs sampling. Finding such a u is easy in our FQR model because any u with B1(u) > 0 satisfies Bt(u) > 0."
    } ],
    "references" : [ {
      "title" : "Addressing scalability and robustness in security games with multiple boundedly rational adversaries",
      "author" : [ "Matthew Brown", "William B Haskell", "Milind Tambe" ],
      "venue" : "In Decision and Game Theory for Security,",
      "citeRegEx" : "1",
      "shortCiteRegEx" : "1",
      "year" : 2014
    }, {
      "title" : "Explaining the gibbs sampler",
      "author" : [ "George Casella", "Edward I George" ],
      "venue" : "The American Statistician,",
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 1992
    }, {
      "title" : "When security games go green: Designing defender strategies to prevent poaching and illegal fishing",
      "author" : [ "Fei Fang", "Peter Stone", "Milind Tambe" ],
      "venue" : "In International Joint Conference on Artificial Intelligence (IJCAI),",
      "citeRegEx" : "3",
      "shortCiteRegEx" : "3",
      "year" : 2015
    }, {
      "title" : "Robust protection of fisheries with compass",
      "author" : [ "William B Haskell", "Debarun Kar", "Fei Fang", "Milind Tambe", "Sam Cheung", "Elizabeth Denicola" ],
      "venue" : "In AAAI,",
      "citeRegEx" : "5",
      "shortCiteRegEx" : "5",
      "year" : 2014
    }, {
      "title" : "A game of thrones: when human behavior models compete in repeated stackelberg security games",
      "author" : [ "Debarun Kar", "Fei Fang", "Francesco Delle Fave", "Nicole Sintov", "Milind Tambe" ],
      "venue" : "In Proceedings of the 2015 International Conference on Autonomous Agents and Multiagent Systems,",
      "citeRegEx" : "6",
      "shortCiteRegEx" : "6",
      "year" : 2015
    }, {
      "title" : "Quantal response equilibria for normal form games",
      "author" : [ "Richard D McKelvey", "Thomas R Palfrey" ],
      "venue" : "Games and economic behavior,",
      "citeRegEx" : "7",
      "shortCiteRegEx" : "7",
      "year" : 1995
    }, {
      "title" : "Making the most of our regrets: Regret-based solutions to handle payoff uncertainty and elicitation in green security games",
      "author" : [ "Thanh H Nguyen", "Francesco M Delle Fave", "Debarun Kar", "Aravind S Lakshminarayanan", "Amulya Yadav", "Milind Tambe", "Noa Agmon", "Andrew J Plumptre", "Margaret Driciru", "Fred Wanyama" ],
      "venue" : "In Decision and Game Theory for Security,",
      "citeRegEx" : "8",
      "shortCiteRegEx" : "8",
      "year" : 2015
    }, {
      "title" : "Capture: A new predictive anti-poaching tool for wildlife protection",
      "author" : [ "Thanh H Nguyen", "Arunesh Sinha", "Shahrzad Gholami", "Andrew Plumptre", "Lucas Joppa", "Milind Tambe", "Margaret Driciru", "Fred Wanyama", "Aggrey Rwetsiba", "Rob Critchlow" ],
      "venue" : "In Proceedings of the 2016 International Conference on Autonomous Agents & Multiagent Systems,",
      "citeRegEx" : "9",
      "shortCiteRegEx" : "9",
      "year" : 2016
    }, {
      "title" : "Conquering adversary behavioral uncertainty in security games: An efficient modeling robust based algorithm. 2016",
      "author" : [ "Thanh H Nguyen", "Arunesh Sinha", "Milind Tambe" ],
      "venue" : null,
      "citeRegEx" : "11",
      "shortCiteRegEx" : "11",
      "year" : 2016
    }, {
      "title" : "Analyzing the effectiveness of adversary modeling in security games",
      "author" : [ "Thanh Hong Nguyen", "Rong Yang", "Amos Azaria", "Sarit Kraus", "Milind Tambe" ],
      "venue" : "In AAAI,",
      "citeRegEx" : "12",
      "shortCiteRegEx" : "12",
      "year" : 2013
    }, {
      "title" : "The complexity of optimal queuing network control",
      "author" : [ "Christos H Papadimitriou", "John N Tsitsiklis" ],
      "venue" : "Mathematics of Operations Research,",
      "citeRegEx" : "13",
      "shortCiteRegEx" : "13",
      "year" : 1999
    }, {
      "title" : "Deployed armor protection: the application of a game theoretic model for security at the los angeles international airport",
      "author" : [ "James Pita", "Manish Jain", "Janusz Marecki", "Fernando Ordóñez", "Christopher Portway", "Milind Tambe", "Craig Western", "Praveen Paruchuri", "Sarit Kraus" ],
      "venue" : "In Proceedings of the 7th international joint conference on Autonomous agents and multiagent systems: industrial track,",
      "citeRegEx" : "14",
      "shortCiteRegEx" : "14",
      "year" : 2008
    }, {
      "title" : "Online planning for optimal protector strategies in resource conservation games. In Proceedings of the 2014 international conference on Autonomous agents and multi-agent systems, pages 733–740",
      "author" : [ "Yundi Qian", "William B Haskell", "Albert Xin Jiang", "Milind Tambe" ],
      "venue" : "International Foundation for Autonomous Agents and Multiagent Systems,",
      "citeRegEx" : "16",
      "shortCiteRegEx" : "16",
      "year" : 2014
    }, {
      "title" : "Restless poachers: Handling exploration-exploitation tradeoffs in security domains",
      "author" : [ "Yundi Qian", "Chao Zhang", "Bhaskar Krishnamachari", "Milind Tambe" ],
      "venue" : "In Proceedings of the 2016 International Conference on Autonomous Agents & Multiagent Systems,",
      "citeRegEx" : "17",
      "shortCiteRegEx" : "17",
      "year" : 2016
    }, {
      "title" : "Protect: A deployed game theoretic system to protect the ports of the united states",
      "author" : [ "Eric Shieh", "Bo An", "Rong Yang", "Milind Tambe", "Craig Baldwin", "Joseph Di- Renzo", "Ben Maule", "Garrett Meyer" ],
      "venue" : "In Proceedings of the 11th International Conference on Autonomous Agents and Multiagent Systems- Volume",
      "citeRegEx" : "19",
      "shortCiteRegEx" : "19",
      "year" : 2012
    }, {
      "title" : "Monte-carlo planning in large pomdps",
      "author" : [ "David Silver", "Joel Veness" ],
      "venue" : "In Advances in neural information processing systems,",
      "citeRegEx" : "20",
      "shortCiteRegEx" : "20",
      "year" : 2010
    }, {
      "title" : "On the stackelberg strategy in nonzero-sum games",
      "author" : [ "Marwan Simaan", "Jose B Cruz Jr." ],
      "venue" : "Journal of Optimization Theory and Applications,",
      "citeRegEx" : "21",
      "shortCiteRegEx" : "21",
      "year" : 1973
    }, {
      "title" : "Learning adversary behavior in security games: A pac model perspective",
      "author" : [ "Arunesh Sinha", "Debarun Kar", "Milind Tambe" ],
      "venue" : "arXiv preprint arXiv:1511.00043,",
      "citeRegEx" : "22",
      "shortCiteRegEx" : "22",
      "year" : 2015
    }, {
      "title" : "Restless bandits: Activity allocation in a changing world",
      "author" : [ "Peter Whittle" ],
      "venue" : "Journal of applied probability,",
      "citeRegEx" : "24",
      "shortCiteRegEx" : "24",
      "year" : 1988
    }, {
      "title" : "Adaptive resource allocation for wildlife protection against illegal poachers",
      "author" : [ "Rong Yang", "Benjamin Ford", "Milind Tambe", "Andrew Lemieux" ],
      "venue" : "In Proceedings of the 2014 international conference on Autonomous agents and multi-agent systems,",
      "citeRegEx" : "25",
      "shortCiteRegEx" : "25",
      "year" : 2014
    }, {
      "title" : "Computing optimal strategy against quantal response in security games",
      "author" : [ "Rong Yang", "Fernando Ordonez", "Milind Tambe" ],
      "venue" : "In Proceedings of the 11th International Conference on Autonomous Agents and Multiagent Systems-Volume",
      "citeRegEx" : "26",
      "shortCiteRegEx" : "26",
      "year" : 2012
    }, {
      "title" : "Trusts: Scheduling randomized patrols for fare inspection in transit systems using game theory",
      "author" : [ "Zhengyu Yin", "Albert Xin Jiang", "Milind Tambe", "Christopher Kiekintveld", "Kevin Leyton-Brown", "Tuomas Sandholm", "John P Sullivan" ],
      "venue" : "AI Magazine,",
      "citeRegEx" : "27",
      "shortCiteRegEx" : "27",
      "year" : 2012
    } ],
    "referenceMentions" : [ {
      "referenceID" : 2,
      "context" : ", [3, 9, 22, 15, 10, 11], this paper is essentially based on these works [12, 6, 4, 8, 17, 16].",
      "startOffset" : 2,
      "endOffset" : 24
    }, {
      "referenceID" : 7,
      "context" : ", [3, 9, 22, 15, 10, 11], this paper is essentially based on these works [12, 6, 4, 8, 17, 16].",
      "startOffset" : 2,
      "endOffset" : 24
    }, {
      "referenceID" : 17,
      "context" : ", [3, 9, 22, 15, 10, 11], this paper is essentially based on these works [12, 6, 4, 8, 17, 16].",
      "startOffset" : 2,
      "endOffset" : 24
    }, {
      "referenceID" : 8,
      "context" : ", [3, 9, 22, 15, 10, 11], this paper is essentially based on these works [12, 6, 4, 8, 17, 16].",
      "startOffset" : 2,
      "endOffset" : 24
    }, {
      "referenceID" : 9,
      "context" : ", [3, 9, 22, 15, 10, 11], this paper is essentially based on these works [12, 6, 4, 8, 17, 16].",
      "startOffset" : 73,
      "endOffset" : 94
    }, {
      "referenceID" : 4,
      "context" : ", [3, 9, 22, 15, 10, 11], this paper is essentially based on these works [12, 6, 4, 8, 17, 16].",
      "startOffset" : 73,
      "endOffset" : 94
    }, {
      "referenceID" : 6,
      "context" : ", [3, 9, 22, 15, 10, 11], this paper is essentially based on these works [12, 6, 4, 8, 17, 16].",
      "startOffset" : 73,
      "endOffset" : 94
    }, {
      "referenceID" : 13,
      "context" : ", [3, 9, 22, 15, 10, 11], this paper is essentially based on these works [12, 6, 4, 8, 17, 16].",
      "startOffset" : 73,
      "endOffset" : 94
    }, {
      "referenceID" : 12,
      "context" : ", [3, 9, 22, 15, 10, 11], this paper is essentially based on these works [12, 6, 4, 8, 17, 16].",
      "startOffset" : 73,
      "endOffset" : 94
    }, {
      "referenceID" : 16,
      "context" : "In zero–sum games, the Leader–follower equilibrium coincides with the Nash equilibrium [21] and the maxmin/minmax strategies.",
      "startOffset" : 87,
      "endOffset" : 91
    }, {
      "referenceID" : 11,
      "context" : "Building upon the success of applying SSGs to protect infrastructure including airports [14], ports [19] and trains [27], researchers are now applying game theory to green security domains, e.",
      "startOffset" : 88,
      "endOffset" : 92
    }, {
      "referenceID" : 14,
      "context" : "Building upon the success of applying SSGs to protect infrastructure including airports [14], ports [19] and trains [27], researchers are now applying game theory to green security domains, e.",
      "startOffset" : 100,
      "endOffset" : 104
    }, {
      "referenceID" : 21,
      "context" : "Building upon the success of applying SSGs to protect infrastructure including airports [14], ports [19] and trains [27], researchers are now applying game theory to green security domains, e.",
      "startOffset" : 116,
      "endOffset" : 120
    }, {
      "referenceID" : 0,
      "context" : ", protecting fisheries from over– fishing [1, 5] and protecting wildlife from poaching [25].",
      "startOffset" : 42,
      "endOffset" : 48
    }, {
      "referenceID" : 3,
      "context" : ", protecting fisheries from over– fishing [1, 5] and protecting wildlife from poaching [25].",
      "startOffset" : 42,
      "endOffset" : 48
    }, {
      "referenceID" : 19,
      "context" : ", protecting fisheries from over– fishing [1, 5] and protecting wildlife from poaching [25].",
      "startOffset" : 87,
      "endOffset" : 91
    }, {
      "referenceID" : 5,
      "context" : "1 SUQR: modeling a boundedly rational attacker In SSGs, attacker bounded rationality is often modeled via behavior models such as Quantal Response (QR) [7].",
      "startOffset" : 152,
      "endOffset" : 155
    }, {
      "referenceID" : 9,
      "context" : "Inspired by the idea of SEU, it has been proposed [12] a subjective utility function of the adversary for SSG as the following:",
      "startOffset" : 50,
      "endOffset" : 54
    }, {
      "referenceID" : 4,
      "context" : "2 From MATCH to SHARP Starting from the above results, a new model is now introduced, SHARP [6], which:",
      "startOffset" : 92,
      "endOffset" : 95
    }, {
      "referenceID" : 0,
      "context" : "Let the utility function of the attacker for target t ∈ T be denoted by ut : [0, 1] → R.",
      "startOffset" : 77,
      "endOffset" : 83
    }, {
      "referenceID" : 0,
      "context" : "ût : [0, 1] → R uniformly approximates or uniformly learns ut(·) within an error of ǫ, if ∀x ∈ [0, 1], |ût(x) − ut(x)| ≤ ǫ.",
      "startOffset" : 5,
      "endOffset" : 11
    }, {
      "referenceID" : 0,
      "context" : "ût : [0, 1] → R uniformly approximates or uniformly learns ut(·) within an error of ǫ, if ∀x ∈ [0, 1], |ût(x) − ut(x)| ≤ ǫ.",
      "startOffset" : 95,
      "endOffset" : 101
    }, {
      "referenceID" : 0,
      "context" : "Let the utility function of the defender on target t ∈ T be denoted by vt : [0, 1] → [−1, 1].",
      "startOffset" : 76,
      "endOffset" : 82
    }, {
      "referenceID" : 20,
      "context" : "The corresponding optimal strategies for the defender given these payoff samples, denoted x, are then computed using the PASAQ algorithm [26] to obtain a finite set S of sampled constraints.",
      "startOffset" : 137,
      "endOffset" : 141
    }, {
      "referenceID" : 10,
      "context" : "It is PSPACE–hard to find the optimal strategy to general RMABs [13].",
      "startOffset" : 64,
      "endOffset" : 68
    }, {
      "referenceID" : 18,
      "context" : "Whittle proposed a heuristic index policy for RMABs by considering the Lagrangian relaxation of the problem [24].",
      "startOffset" : 108,
      "endOffset" : 112
    }, {
      "referenceID" : 15,
      "context" : "Silver and Veness [20] have proposed POMCP algorithm, which provides high quality solutions and is scalable to large POMDPs.",
      "startOffset" : 18,
      "endOffset" : 22
    }, {
      "referenceID" : 15,
      "context" : "Silver and Veness [20] have proposed the POMCP algorithm, which provides high quality solutions for large POMDPs.",
      "startOffset" : 18,
      "endOffset" : 22
    }, {
      "referenceID" : 1,
      "context" : "Gibbs sampling [2] is a Markov chain Monte Carlo (MCMC) algorithm for sampling from multivariate probability distributions.",
      "startOffset" : 15,
      "endOffset" : 18
    } ],
    "year" : 2016,
    "abstractText" : "The present survey aims at presenting the current machine learning techniques employed in security games domains. Specifically, we focused on papers and works developed by the Teamcore of University of Southern California, which deepened different directions in this field. After a brief introduction on Stackelberg Security Games (SSGs) and the poaching setting, the rest of the work presents how to model a boundedly rational attacker taking into account her human behavior, then describes how to face the problem of having attacker’s payoffs not defined and how to estimate them and, finally, presents how online learning techniques have been exploited to learn a model of the attacker.",
    "creator" : "LaTeX with hyperref package"
  }
}