{
  "name" : "1609.08337.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Multi-task Recurrent Model for True Multilingual Speech Recognition",
    "authors" : [ "Zhiyuan Tang", "Lantian Li", "Dong Wang" ],
    "emails" : [ "lilt}@cslt.riit.tsinghua.edu.cn", "wangdong99@mails.tsinghua.edu.cn" ],
    "sections" : [ {
      "heading" : null,
      "text" : "This paper presents a multi-task recurrent model that involves a multilingual speech recognition (ASR) component and a language recognition (LR) component, and the ASR component is informed of the language information by the LR component, leading to a language-aware recognition. We tested the approach on an English-Chinese bilingual recognition task. The results show that the proposed multi-task recurrent model can improve performance of multilingual recognition systems.\nI. INTRODUCTION Speech recognition (ASR) technologies develop fast in recent years, partly due to the powerful deep learning approach [1], [2]. An interesting and important task within the ASR research is recognizing multiple languages. One reason that makes the multilingual ASR research attractive is that people from different countries are communicating more frequently today. Another reason is that there are limited resources for most languages, and multilingual techniques may help to improve performance for these low-resource languages.\nThere has been much work on multilingual ASR, especially with the deep neural architecture. The mostly studied architecture is the feature-shared deep neural network (DNN), where the input and low-level hidden layers are shared across languages, while the top-level layers and the output layer are separated for each language [3], [4], [5]. The insight of this design is that the human languages share some commonality in both acoustic and phonetic layers, and so some signal patterns at some levels of abstraction can be shared.\nDespite the brilliant success of the feature-sharing approach, it is only useful for model training, not for decoding. This means that although part of the model structure is shared, in recognition (decoding), the models are used independently for individual languages, with their own language models. Whenever more than one language are supported, the performance on all the languages will be significantly decreased, due to\nthe inter-language competition in the decoding process. This means that the feature-sharing approach cannot deal with true multilingual ASR, or more precisely, multilingual decoding.\nA possible solution to the multilingual decoding problem is to inform the decoder which language it is now processing. By this language information, the multilingual decoding essentially falls back to monolingual decoding and the performance is recovered. However, language recognition is subject to recognition mistakes, and it requires sufficient signal to give a reasonable inference, leading to unacceptable delay. Another possibility is to invoke monolingual decoding for each language, and then decide which result is correct, due to either confidence or a language recognizer. This approach obviously requires more computing resource. In Deepspeech2 [6], English and Chinese can be jointly decoded under the end-to-end learning framework. However, this is based on the fact that the training data for the two languages are both abundant, so that language identities can be learned by the deep structure. This certainly can not be migrated to other low-resource languages, and is difficult to accommodate more languages.\nIn this paper, we introduce a multi-task recurrent model for multilingual decoding. With this model, the ASR model and the LR model are treated as two components of a unified architecture, where the output of one component is propagated back to the other as extra information. More specifically, the ASR component provides speech information for the LR component to deliver more accurate language information, which in turn helps the ASR component to produce better results. Note that this collaboration among ASR and LR takes places in both model training and inference (decoding).\nThis model is particularly attractive for multilingual decoding. By this model, the LR component provides language information for the ASR component when decoding an utterance. This language information is produced frame by frame, and becomes more and more accurate when the decoding proceeds. With this information, the decoder becomes more and more confident about which language it is processing, and gradually removes decoding paths in hopeless languages. Note that the multi-task recurrent model was proposed in [7], where we found that it can learn speech and speaker recognition models in a collaborative way. The same idea was also proposed\nar X\niv :1\n60 9.\n08 33\n7v 1\n[ cs\n.C L\n] 2\n7 Se\np 20\n16\nby [8], though it focused on ASR only. This paper tests the approach on an English-Chinese bilingual recognition task.\nThe rest of the paper is organized as follows: Section II describes the model architectures, and Section III reports the experiments. The conclusions plus the future work are presented in Section IV."
    }, {
      "heading" : "II. MODELS",
      "text" : "Consider the feature-sharing bilingual ASR. Let x represent the primary input feature, t1 and t2 represent the targets for each language respectively, and c is the extra input obtained from other component (LR in our experiments). With the information c, the model estimates the probability P (t1|x, c) and P (t2|x, c) respectively, that makes the decoding of two languages absolutely separate. P (t|x, c) is truly required by multilingual decoding, where t means the targets for both two languages. If we regard the extra input c as a language indicator, the model is language-aware. Note that the languageaware model is a conditional model with the context c as the condition. In contrast, the feature-sharing model, which can be formulated as P (t1|x) or P (t2|x), is essentially a marginal model ∑ c P (t2|x, c)P (c|x) or ∑ c P (t2|x, c)P (c|x), which are more complex and less effective for listing c. We refer the bilingual ASR as a single task, with respect to the single task of LR. So P (t|x, c) is what we actually compute with the proposed model jointly training ASR and LR, that indicates the two languages use the same Gaussian Mixture Model (GMM) system for generative modeling, though the two languages still use their own phone sets.\nWe first describe the single-task baseline model and then multi-task recurrent model as in [7]."
    }, {
      "heading" : "A. Basic single-task model",
      "text" : "The most promising architecture for ASR is the recurrent neural network, especially the long short-term memory (LSTM) [9], [10] for its ability of modeling temporal sequences and their long-range dependencies. The modified LSTM structure proposed in [9] is used. The network structure is shown in Fig. 1.\nThe associated computation is as follows:\nit = σ(Wixxt +Wirrt−1 +Wicct−1 + bi)\nft = σ(Wfxxt +Wfrrt−1 +Wfcct−1 + bf )\nct = ft ct−1 + it g(Wcxxt +Wcrrt−1 + bc) ot = σ(Woxxt +Worrt−1 +Wocct + bo)\nmt = ot h(ct) rt = Wrmmt\npt = Wpmmt\nyt = Wyrrt +Wyppt + by\nIn the above equations, the W terms denote weight matrices and those associated with cells were set to be diagonal in our implementation. The b terms denote bias vectors. xt and yt are the input and output symbols respectively; it, ft, ot represent respectively the input, forget and output gates; ct is the cell and mt is the cell output. rt and pt are two output components derived from mt, where rt is recurrent and fed to the next time step, while pt is not recurrent and contributes to the present output only. σ(·) is the logistic sigmoid function, and g(·) and h(·) are non-linear activation functions, often chosen to be hyperbolic. denotes the element-wise multiplication."
    }, {
      "heading" : "B. Multi-task recurrent model",
      "text" : "The basic idea of the multi-task recurrent model is to use the output of one task at the current frame as an auxiliary information to supervise other tasks when processing the next frame. As there are many alternatives that need to be carefully investigated. In this study, we use the recurrent LSTM model following the setting of [7] to build the ASR component and the LR component, as shown in Fig. 2. These two components are identical in structure and accept the same input signal. The only difference is that they are trained with different targets, one for phone discrimination and the other for language discrimination. Most importantly, there are some inter-task recurrent links that combine the two components as a single network, as shown by the dash lines in Fig. 2.\nFig. 2 is one simple example, where the recurrent information is extracted from both the recurrent projection rt and the nonrecurrent projection pt, and the information is applied to the non-linear function g(·). We use the superscript a and l to denote the ASR and LR tasks respectively. The computation for ASR can be expressed as follows:\niat = σ(W a ixxt +W a irr a t−1 +W a icc a t−1 + b a i )\nfat = σ(W a fxxt +W a frr a t−1 +W a fcc a t−1 + b a f ) gat = g(W a cxx a t +W a crr a t−1 + b a c +W al cr r l t−1 +W al cpp l t−1) cat = f a t cat−1 + iat gat oat = σ(W a oxx a t +W a orr a t−1 +W a occ a t + b a o)\nmat = o a t h(cat )\nrat = W a rmm a t pat = W a pmm a t yat = W a yrr a t +W a ypp a t + b a y\nand the computation for LR is as follows:\nilt = σ(W l ixxt +W l irr l t−1 +W l icc l t−1 + b l i)\nf lt = σ(W l fxxt +W l frr l t−1 +W l fcc l t−1 + b l f ) glt = g(W l cxx l t +W l crr l t−1 + b l c +W la cr r a t−1 +W la cpp a t−1)\nclt = f l t clt−1 + ilt glt olt = σ(W l oxx l t +W l orr l t−1 +W l occ l t + b l o)\nmlt = o l t h(clt)\nrlt = W l rmm l t plt = W l pmm l t ylt = W l yrr l t +W l ypp l t + b l y"
    }, {
      "heading" : "III. EXPERIMENTS",
      "text" : "The proposed method was tested with the Aurora4 and Thchs30 databases labelled with word transcripts. There are 2 language identities, one for English and the other for Chinese. We first present the single-task ASR baseline and then report the multi-task joint training model. All the experiments were conducted with the Kaldi toolkit [11]."
    }, {
      "heading" : "A. Data",
      "text" : "• Training set: This set involves the train sets of Aurora4 and Thchs30. It consists of 17, 137 utterances. This set was used to train the LSTM-based single-task bilingual system and the proposed multi-task recurrent system. The two subsets were also used to train monolingual ASR respectively.\n• Test set: This set involves ‘eval92’ from Aurora4 for English and ‘test’ from Thchs30 for Chinese. These two sets consist of 4, 620 and 2, 495 utterances and were used to evaluate the performance of ASR for English and Chinese respectively."
    }, {
      "heading" : "B. ASR baseline",
      "text" : "The ASR system was built largely following the Kaldi WSJ s5 nnet3 recipe, except that we used a single LSTM layer for simplicity. The dimension of the cell was 1, 024, and the dimensions of the recurrent and nonrecurrent projections were set to 256. The target delay was 5 frames. The natural stochastic gradient descent (NSGD) algorithm was employed to train the model [12]. The input feature was the 40- dimensional Fbanks, with a symmetric 2-frame window to splice neighboring frames. The output layer consisted of 6, 468 units, equal to the total number of pdfs in the conventional GMM system that was trained to bootstrap the LSTM model.\nThe baseline of monolingual ASR is presented in Table I, where the two languages were trained and decoded separately. Then we present the baseline of bilingually-trained system in Table II, where a unified GMM system was shared. As for the latter one, we first decoded the two languages with English and Chinese language models (LMs) respectively, denoted as ‘mono-LM’, and further we merged together the two LMs with a mixture weight of 0.5 using the tool ngram, so both languages can be decoded within a single unified graph built with weighted finite-state transducers, denoted as ‘bi-LM’."
    }, {
      "heading" : "C. Multi-task joint training",
      "text" : "Due to the flexibility of the multi-task recurrent LSTM structure, it is not possible to evaluate all the configurations. We explored some typical ones in [7] and report the results in Table III. Note that the last configure, where the recurrent information is fed to all the gates and the non-linear activation g(·), is equal to augmenting the information to the input variable x.\nFrom the results shown in Table III and IV decoded with mono-LM and bi-LM respectively, we first observe that the multi-task recurrent model improves the performance of English ASR more than that of Chinese. We attribute this to several reasons. First, the auxiliary component was designed to do language recognition and expected to provide extra language information only, but as the English and Chinese databases are not from the same source, the speech signal involves too much channel information, that makes the effect of auxiliary language information decrease when channel classification is done at the same time. Moreover, the channel\nclassification was easily achieved by the regular DNN, then the superiority with an additional LR component decays. Second, from the results in Table II, we find that when using their respective LMs, English gets gains of performance, while that is not obvious for Chinese, even considering monolingual results in Table I. Results with mono-LM for Chinese in Table IV were not far away from that of monolingual and bilingual baselines. All imply that a method for improving speech recognition wanting remarkable improvement for this database configuration may not work well. So it’s not strange that the performance of Chinese could not be improved much in the enhanced model. Furthermore, we have done another test on part of the train set and all the multi-task recurrent models perform better than the baseline on both English and Chinese, which means the recurrent models overfit the train set extremely, that demonstrates the ability of the proposed model.\nWe also observe that the multi-task recurrent model still has the potential to exceed the baseline, such as when the recurrent information was extracted from the recurrent projection and fed into the activation function, which led to a better performance for both English and Chinese. We suppose, with many more carefully-designed architectures, the baseline will be surpassed more easily."
    }, {
      "heading" : "IV. CONCLUSIONS",
      "text" : "We report a multi-task recurrent learning architecture for language-aware speech recognition. Primary results of the bilingual ASR experiments on the Aurora4/Thchs30 database demonstrated that the presented method can employ both commonality and diversity of different languages between two languages to some extent by learning ASR and LR models simultaneously. Future work involves using more ideal databases from the same source, developing more suitable architecture for language-aware recurrent training and introducing more than two languages including source-scarce ones."
    }, {
      "heading" : "ACKNOWLEDGMENT",
      "text" : "This work was supported by the National Science Foundation of China (NSFC) Project No. 61371136, and the MESTDC PhD Foundation Project No. 20130002120011."
    } ],
    "references" : [ {
      "title" : "Deep neural networks for acoustic modeling in speech recognition: The shared views of four research groups",
      "author" : [ "G. Hinton", "L. Deng", "D. Yu", "G.E. Dahl", "A.-r. Mohamed", "N. Jaitly", "A. Senior", "V. Vanhoucke", "P. Nguyen", "T.N. Sainath" ],
      "venue" : "Signal Processing Magazine, IEEE, vol. 29, no. 6, pp. 82–97, 2012.",
      "citeRegEx" : "1",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Automatic Speech Recognition - A Deep Learning Approach, ser. Signals and Communication",
      "author" : [ "D. Yu", "L. Deng" ],
      "venue" : null,
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 2015
    }, {
      "title" : "Cross-language knowledge transfer using multilingual deep neural network with shared hidden layers",
      "author" : [ "J.-T. Huang", "J. Li", "D. Yu", "L. Deng", "Y. Gong" ],
      "venue" : "Proceedings of IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, 2013, pp. 7304–7308.",
      "citeRegEx" : "3",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Multilingual training of deep neural networks",
      "author" : [ "A. Ghoshal", "P. Swietojanski", "S. Renals" ],
      "venue" : "Proceedings of IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, 2013, pp. 7319–7323.",
      "citeRegEx" : "4",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Multilingual acoustic models using distributed deep neural networks",
      "author" : [ "G. Heigold", "V. Vanhoucke", "A. Senior", "P. Nguyen", "M. Ranzato", "M. Devin", "J. Dean" ],
      "venue" : "Proceedings of IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, 2013, pp. 8619–8623.",
      "citeRegEx" : "5",
      "shortCiteRegEx" : null,
      "year" : 2013
    }, {
      "title" : "Deep speech 2: End-to-end speech recognition in english and mandarin",
      "author" : [ "D. Amodei", "R. Anubhai", "E. Battenberg", "C. Case", "J. Casper", "B. Catanzaro", "J. Chen", "M. Chrzanowski", "A. Coates", "G. Diamos" ],
      "venue" : "arXiv preprint arXiv:1512.02595, 2015.",
      "citeRegEx" : "6",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Multi-task recurrent model for speech and speaker recognition",
      "author" : [ "Z. Tang", "L. Li", "D. Wang" ],
      "venue" : "arXiv preprint arXiv:1603.09643, 2016.",
      "citeRegEx" : "7",
      "shortCiteRegEx" : null,
      "year" : 2016
    }, {
      "title" : "Modeling speaker variability using long shortterm memory networks for speech recognition",
      "author" : [ "X. Li", "X. Wu" ],
      "venue" : "Proceedings of the Annual Conference of International Speech Communication Association (INTERSPEECH), 2015.",
      "citeRegEx" : "8",
      "shortCiteRegEx" : null,
      "year" : 2015
    }, {
      "title" : "Long short-term memory based recurrent neural network architectures for large vocabulary speech recognition",
      "author" : [ "H. Sak", "A. Senior", "F. Beaufays" ],
      "venue" : "arXiv preprint arXiv:1402.1128, 2014.",
      "citeRegEx" : "9",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "Long short-term memory recurrent neural network architectures for large scale acoustic modeling",
      "author" : [ "H. Sak", "A.W. Senior", "F. Beaufays" ],
      "venue" : "Proceedings of the Annual Conference of International Speech Communication Association (INTERSPEECH), 2014, pp. 338–342.",
      "citeRegEx" : "10",
      "shortCiteRegEx" : null,
      "year" : 2014
    }, {
      "title" : "The kaldi speech recognition toolkit",
      "author" : [ "D. Povey", "A. Ghoshal", "G. Boulianne", "L. Burget", "O. Glembek", "N. Goel", "M. Hannemann", "P. Motlicek", "Y. Qian", "P. Schwarz" ],
      "venue" : "Proceedings of IEEE 2011 workshop on automatic speech recognition and understanding. IEEE Signal Processing Society, 2011.",
      "citeRegEx" : "11",
      "shortCiteRegEx" : null,
      "year" : 2011
    }, {
      "title" : "Parallel training of deep neural networks with natural gradient and parameter averaging",
      "author" : [ "D. Povey", "X. Zhang", "S. Khudanpur" ],
      "venue" : "arXiv preprint arXiv:1410.7455, 2014.",
      "citeRegEx" : "12",
      "shortCiteRegEx" : null,
      "year" : 2014
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "Speech recognition (ASR) technologies develop fast in recent years, partly due to the powerful deep learning approach [1], [2].",
      "startOffset" : 118,
      "endOffset" : 121
    }, {
      "referenceID" : 1,
      "context" : "Speech recognition (ASR) technologies develop fast in recent years, partly due to the powerful deep learning approach [1], [2].",
      "startOffset" : 123,
      "endOffset" : 126
    }, {
      "referenceID" : 2,
      "context" : "The mostly studied architecture is the feature-shared deep neural network (DNN), where the input and low-level hidden layers are shared across languages, while the top-level layers and the output layer are separated for each language [3], [4], [5].",
      "startOffset" : 234,
      "endOffset" : 237
    }, {
      "referenceID" : 3,
      "context" : "The mostly studied architecture is the feature-shared deep neural network (DNN), where the input and low-level hidden layers are shared across languages, while the top-level layers and the output layer are separated for each language [3], [4], [5].",
      "startOffset" : 239,
      "endOffset" : 242
    }, {
      "referenceID" : 4,
      "context" : "The mostly studied architecture is the feature-shared deep neural network (DNN), where the input and low-level hidden layers are shared across languages, while the top-level layers and the output layer are separated for each language [3], [4], [5].",
      "startOffset" : 244,
      "endOffset" : 247
    }, {
      "referenceID" : 5,
      "context" : "In Deepspeech2 [6], English and Chinese can be jointly decoded under the end-to-end learning framework.",
      "startOffset" : 15,
      "endOffset" : 18
    }, {
      "referenceID" : 6,
      "context" : "Note that the multi-task recurrent model was proposed in [7], where we found that it can learn speech and speaker recognition models in a collaborative way.",
      "startOffset" : 57,
      "endOffset" : 60
    }, {
      "referenceID" : 7,
      "context" : "by [8], though it focused on ASR only.",
      "startOffset" : 3,
      "endOffset" : 6
    }, {
      "referenceID" : 6,
      "context" : "We first describe the single-task baseline model and then multi-task recurrent model as in [7].",
      "startOffset" : 91,
      "endOffset" : 94
    }, {
      "referenceID" : 8,
      "context" : "The most promising architecture for ASR is the recurrent neural network, especially the long short-term memory (LSTM) [9], [10] for its ability of modeling temporal sequences and their long-range dependencies.",
      "startOffset" : 118,
      "endOffset" : 121
    }, {
      "referenceID" : 9,
      "context" : "The most promising architecture for ASR is the recurrent neural network, especially the long short-term memory (LSTM) [9], [10] for its ability of modeling temporal sequences and their long-range dependencies.",
      "startOffset" : 123,
      "endOffset" : 127
    }, {
      "referenceID" : 8,
      "context" : "The modified LSTM structure proposed in [9] is used.",
      "startOffset" : 40,
      "endOffset" : 43
    }, {
      "referenceID" : 8,
      "context" : "The picture is reproduced from [9].",
      "startOffset" : 31,
      "endOffset" : 34
    }, {
      "referenceID" : 6,
      "context" : "In this study, we use the recurrent LSTM model following the setting of [7] to build the ASR component and the LR component, as shown in Fig.",
      "startOffset" : 72,
      "endOffset" : 75
    }, {
      "referenceID" : 10,
      "context" : "All the experiments were conducted with the Kaldi toolkit [11].",
      "startOffset" : 58,
      "endOffset" : 62
    }, {
      "referenceID" : 11,
      "context" : "The natural stochastic gradient descent (NSGD) algorithm was employed to train the model [12].",
      "startOffset" : 89,
      "endOffset" : 93
    }, {
      "referenceID" : 6,
      "context" : "We explored some typical ones in [7] and report the results in Table III.",
      "startOffset" : 33,
      "endOffset" : 36
    } ],
    "year" : 2016,
    "abstractText" : "Research on multilingual speech recognition remains attractive yet challenging. Recent studies focus on learning shared structures under the multi-task paradigm, in particular a feature sharing structure. This approach has been found effective to improve performance on each individual language. However, this approach is only useful when the deployed system supports just one language. In a true multilingual scenario where multiple languages are allowed, performance will be significantly reduced due to the competition among languages in the decoding space. This paper presents a multi-task recurrent model that involves a multilingual speech recognition (ASR) component and a language recognition (LR) component, and the ASR component is informed of the language information by the LR component, leading to a language-aware recognition. We tested the approach on an English-Chinese bilingual recognition task. The results show that the proposed multi-task recurrent model can improve performance of multilingual recognition systems.",
    "creator" : "LaTeX with hyperref package"
  }
}