{
  "name" : "1609.03321.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Stride Length Estimation with Deep Learning",
    "authors" : [ "Julius Hannink", "Thomas Kautz", "Cristian F. Pasluosta", "Jens Barth", "Samuel Schülein", "Karl-Günter Gaßmann", "Jochen Klucken", "Bjoern M. Eskofier" ],
    "emails" : [ "julius.hannink@fau.de" ],
    "sections" : [ {
      "heading" : null,
      "text" : "We describe a novel approach to stride length estimation that uses deep convolutional neural networks to map stride-specific inertial sensor data to the resulting stride length. The model is trained on a publicly available and clinically relevant benchmark dataset consisting of 1220 strides from 101 geriatric patients. Evaluation is done in a 10-fold cross validation and for three different stride definitions.\nEven though best results are achieved with strides defined from mid-stance to mid-stance with average accuracy and precision of 0.01 ± 5.37 cm, performance does not strongly depend on stride definition. The achieved precision outperforms state-of-the-art methods evaluated on this benchmark dataset by 3.0 cm (36%).\nDue to the independence of stride definition, the proposed method is not subject to the methodological constrains that limit applicability of state-of-the-art double integration methods. Furthermore, precision on the benchmark dataset could be improved.\nWith more precise mobile stride length estimation, new insights to the progression of neurological disease or early indications might be gained. Due to the independence of stride definition, previously uncharted diseases in terms of mobile gait analysis can now be investigated by re-training and applying the proposed method.\nIndex Terms—deep learning, convolutional neural networks, gait analysis, stride length, regression, inertial sensors\nI. Introduction\nIn a variety of neurological or musculoskeletal diseases, motor impairment leads to specific gait characteristics. In Parkinson’s disease (PD), for example, the experienced gait impairment is often characterised by shuffling steps, reduced stride length or impaired gait initiation [1]. These symptoms can lead to a severe reduction in patient mobility and quality of life [2] and it is thus important to quantify and treat gait impairments as early as possible. However, the physician’s rating of gait quality e.g. in terms of the MDS Unified Parkinson Disease Rating Scale (UPDRS) [3] is often biased by subjectiveness. Moreover, it requires long-time experience by the movement disorder specialist, is thus costly and restricted to the availability of the physician. With an ageing world\nJ. Hannink, T. Kautz, C. Pasluosta and B. M. Eskofier: Digital Sports Group, Department of Computer Science, University of Erlangen-Nürnberg (FAU), Germany\nJ. Barth: ASTRUM IT GmbH, Erlangen, Germany S. Schülein, K.-G. Gaßmann: Geriatrics Centre Erlangen, Waldkrankenhaus St. Marien, Erlangen, Germany J. Klucken: Department of Molecular Neurology, University Hospital Erlangen, University of Erlangen-Nürnberg (FAU), Germany Corresponding author: J. Hannink, julius.hannink@fau.de\npopulation ([4], [5]) and a resulting increase in prevalence of chronic age-related disorders such as PD, this also requires a change in the healthcare system towards a new era of diagnostics and individualized treatment [6].\nIn the past, this has led to the development of several electronic measurement systems with the aim to extract spatiotemporal gait parameters and aid the physician in an objective gait impairment scoring. These systems include for example camera based, stationary 3D optical tracking of markers affixed to the body [7] or electronic walkways with embedded pressure sensors [8]. Optical tracking systems require time-consuming preparation of the subject, but enable threedimensional, sub millimetre accurate tracking. Computerized walkways with embedded pressure sensors, however, require no preparation of the subject, but are limited in accuracy. Furthermore, they can only assess gait parameters related to ground contact, i.e. foot angles outside the ground plane can not be tracked. Both of these systems are expensive and need a laboratory environment for gait analysis which prohibits their use in everyday clinical practice or outpatient monitoring.\nUnlike stationary systems, inertial sensors placed at the lower extremity enable mobile and unobtrusive gait analysis that is unconstrained by the laboratory setting [1]. This type of measurement system is inexpensive and requires little subjectpreparation while at the same time enabling estimation of three-dimensional spatio-temporal gait parameters ([9]–[15]). Although mobile systems are increasingly developed to support clinical diagnostics, monitor medical treatment or provide early indicators for gait impairment, they are still an open field of research [6]. One of the most crucial components of such systems is accurate estimation of stride-by-stride parameters. Therefore, the purpose of this work is accurate estimation of stride length based on stride-specific inertial sensor data captured at the subjects feet.\nII. RelatedWork\nThere is a growing body of literature regarding stride length estimation from inertial sensors placed at the lower extremity of the human body. The methods covered generally divide into two classes: (Bio)mechanical model based approaches ([11], [12], [16]) and double-integration approaches ([9], [10], [13]–[15], [17], [18]).\na) Model based approaches: The model based approaches employ a double pendulum model for the swing phase and an inverse double pendulum for the stance phase. Three joints (hip and knees) and four segments (shank and thigh) are modelled. Integration of the respective equations of motion is driven by gyroscope data captured at\nar X\niv :1\n60 9.\n03 32\n1v 1\n[ cs\n.L G\n] 1\n2 Se\np 20\n16\n2 the shank and thigh of the subjects ([11], [12], [16]). Salarian et al. [16] additionally try to reduce the number of sensing units either by duplicating data of the right thigh on the left thigh or by simplifying the model to a single-pendulum with two sensors at the shanks. Apart from the amount of sensors needed on the patient, the models described in [11], [12] and [16] confine the movement-model to the sagittal plane and thus limit their applicability for analysis of impaired gait. However, one of the major benefits in such biomechanical modelling approaches is the intrinsic implementation of biomechanical constraints between the two legs.\nb) Double-integration approaches: The vast majority of stride length estimation algorithms comes from the class of double-integration methods. This family of algorithms makes use of the stance phase as a zero-velocity update point (ZUPT) to re-initialize the integration process. Due to intrinsic measurement errors in currently available inertial sensors, this is necessary in order to minimize the integration drift [19]. For one gait cycle, the algorithm consists of sensor orientation estimation from gyroscope measurements in order to convert sensor readings from the local, constantly changing sensor frame to global coordinates. This is followed by gravity cancellation and double-integration of accelerometer readings. Due to aforementioned limitations in currently available mobile sensors, the integration result has to be corrected or dedrifted in a last processing step by enforcing several constrains (e.g. zero-velocity at the start and end of the stride, level floor, etc.). This class of methods is mostly evaluated per leg and biomechanical constrains are hard to implement. However, three-dimensional sensor trajectories can be reconstructed allowing a deeper analysis of gait characteristics or diseasespecific alterations.\nThe contributions on the double-integration approach covered here ([9], [10], [13]–[15], [17], [18]) all employ accelerometer and gyroscope data captured at the subjects’ feet, Trojaniello et al. [14] additionally use magnetometer information. Sampling rates are comparable and between 100 and 200 Hz for all studies. The contributions mainly differ in the choice of orientation estimation method. Rampp et al. [10] and Mariani et al. [9] apply a quaternion-based time integration of angular rates to estimate the sensor orientation, as proposed by Sabatini [18]. Other contributions ([13]–[15]) make use of a Kalman filter to obtain sensor orientations. Integration is mainly done directly, i.e. forward in time. Only Trojaniello et al. [14] use a direct and reverse integration scheme which spawns two integrations – one from the start and one from the end of the current stride – and computes a weighted mean between the two with weights depending on the distance to the next ZUPT. This is said to further resolve integration drifts [20]. De-drifting of integrated gravity-free acceleration signals is done in the spatial domain in [10], [13] and [9] with a linear de-drifting function. Trojaniello et al. [14] use a frequency-based de-drifting approach to suppress the low-frequency drift component in the integrated signals. Another possibility is to combine all steps above in one Kalman filter estimating orientation, velocity and position from angular rates and acceleration. This is implemented by\nFerrari et al. [15].\nc) Clinical applicability: Tab. I summarizes the dataset characteristics and results on all related work covered here. Regarding the mean accuracies and precisions, the majority of methods are similar with accuracies within 1 cm and precisions around 6 − 8 cm. There are two exceptions: Rebula et al. [13] reach good precision but are outperformed by others in terms of accuracy. The method proposed by Trojaniello et al. [14] achieves the best accuracy and precision almost resolving the reference precision of ±1.27 cm [14]. They are the only ones employing a magnetometer which might greatly improve their orientation estimation. However, this is only true if indoor magnetic field distortions by e.g. ferroconcrete in the proximity of the gait acquisition track are small enough. In a general setting without prior knowledge about earth magnetic field disturbances due to construction materials, this out-rules the use of magnetometers for indoor gait data acquisitions with wearable sensors [21].\nThis also applies to other studies listed in Tab. I. Regarding the number and type of subjects, there are major differences in terms of variability within the datasets. Not listed are other quite important characteristics of the study populations, i.e. stride length distribution, diversity of gait alterations, precise age distribution, gender, study protocol or track length used during data acquisition. This is greatly threatening the comparability of methods and their clinical application due to non-representative study populations. It shows the urgent need of a unified evaluation of all stride length estimation methods on the same, clinically relevant benchmark dataset.\nAlthough there has been much progress on stride length estimation from inertial sensor data over the last years, a variety of clinically relevant phenomena still cannot be resolved due to the achieved measurement precision. These phenomena include for example the decline in stride length with age in healthy controls, the reduction in stride length with disease progression in e.g. PD patients or the effect of medication. Hollman et al. [22] report normative data on mean stride length in elderly, healthy controls. Between the age groups 70-75 years and 85+ years, stride length decreases by 20 cm in males and 14 cm in females in the mean values over 294 participants [22]. This translates to a reduction around 1-2 cm/year. Resolving this difference with mobile sensors requires the effect to be larger than typically twice the standard deviation of the error distribution (i.e. precision) obtained in the validation study of a stride length estimation method. In order to resolve the yearly decline with age, the precision of a mobile stride length estimation method would therefore need to be around 5 mm. Similarly, Hass et al. [23] report normative values on mean stride length in PD patients over the course of the disease as measured by the Hoehn&Yahr (H&Y) scale [24]. Between the groups H&Y < 1.5 (mild) and H&Y = 3-4 (severe), they observed a reduction in mean stride length of 11 cm for males and 12 cm for females based on data from 310 PD patients [23]. Following the argument above, mobile stride length estimation methods would require precisions around 5 cm in order to resolve the effect of stride length reduction with disease progression\n3\neven on the very coarse H&Y scale ranging from 0-5. Lastly, Bryant et al. [25] investigated the change in stride length between the best possible (on) and worst (off) medication state in PD patients. Based on data from 21 PD patients, they found a stride length difference of 18 cm between the on- and off-state. These values help to get a feeling about the ranges of stride length effects between best possible to worst medication levels or mild to severe disease progression. Moreover, the clinician is probably interested in more minute changes in clinical scores or medication levels corresponding to smaller effects on the parameter stride length. To this date, mobile stride length estimation is not yet precise enough for this kind of tasks. From a clinical perspective, the problem thus stays challenging.\nd) Towards a new type of methodology: Until now, the choice of method for stride length estimation has been based on biomechanical, physical or geometrical reasoning and these approaches have proven to work in technical validation settings. However, one could also aim to learn a regression function linking the raw sensor data of a stride directly with the corresponding stride length. Similar approaches were reported by Aminian et al. [26] in 1995 where a two-layer perceptron was used to estimate speed and incline of human walking. Due to the limits on computing power 20 years ago, the neural network structure presented by Aminian et al. [26] is very shallow with 10 input nodes, one hidden layer of five units and one output node. A 10 feature parametrization of the accelerometer signal based on physiological and statistical reasoning is used as input to the network.\nWith the recent advances in deep learning ([27]–[29]) and user-friendly interfaces to such techniques like torch [30] or google’s TensorFlow library [31], the parametrization of the input data has become obsolete. By regressing against raw sensor data instead of parametrizations and by employing sufficiently deep architectures, the true potential of the neural network approach can be utilized. Based on a publicly available and clinically relevant benchmark dataset, we describe a method to learn a non-linear relationship between stridespecific sensor data and the corresponding stride length with a convolutional neural network. The network can be trained on big data sets [32] while at the same time promising excellent individualisation capabilities to the patient at hand [33]. We evaluate the approach in a cross-validation and obtain mean accuracy and precision regarding stride length estimation. In\norder to assess the method’s dependency on the data segment provided as input, this is done for three different stride definitions. These are either based on biomechanical events (heelstrike and mid-stance) or contain the relevant information (i.e. the swing phase where stride length is produced) but are not directly related to biomechanical events in the datastream.\nThe method we propose here adds a completely novel approach to the problem of stride length estimation from inertial sensor data. It is not subject to the zero-velocity assumption that the double-integration approaches need to reinitialize the integration process. Thereby, the current work enables spatial gait parameter estimation in situations where this assumption is violated, e.g. in patients with spasticity. Compared to the long processing chain employed by doubleintegration methods that results in amplification of errors and requires cumbersome, careful and error-prone tuning of counter measures such as de-drifting, the method proposed here is purely data-driven. There is no need to carefully keep track of and account for the accumulating error during processing.\nOur main contributions are: 1) We show feasibility regarding estimation of spatial gait characteristics with deep convolutional neural networks. 2) With that change in methodology, we drop the zero-velocity phase assumption that constrains state-of-the-art double integration methods and limits their applicability.\nIII. Methods a) Data Collection and Setup: We use a benchmark dataset collected by Rampp et al. [10] that is publicly available at https://www5.cs.fau.de/activitynet/benchmark-datasets/ digital-biobank/ and briefly described here. For data collection, the Shimmer2R sensor platform [34] was used. It contains a 3d-accelerometer (range ±6 g) and a 3d-gyroscope (range ±500 ◦/s) and was attached laterally right below each ankle joint (see Fig. 1). The same shoe model (adidas Duramo 3) was used by all subjects to avoid gait changes due to different shoe characteristics [35]. Data was captured at 102.4 Hz and a resolution of 12 bit. Simultaneously, validation data was acquired with the well established, instrumented pressure mat GAITRite ([36], [37]). The sensitive area of the pressure mat was 609.60 cm × 60.96 cm with a spatial resolution of ±1.27 cm and a track width of 84 cm.\nIn total, 116 geriatric inpatients were assessed with this setup at the Geriatrics Centre Erlangen (Waldkrankenhaus\n4\nSt. Marien, Erlangen, Germany). Written informed consent was obtained prior to the gait assessment in accordance with the ethical committee of the medical faculty at FriedrichAlexander University Erlangen-Nürnberg (Re.-No. 4208).\nPatients performed a detailed geriatric assessment, described in detail by Rampp et al. [10]. For the scope of this manuscript, we focus on the free walking test over 10 m at comfortable walking speed instrumented with the inertial sensors and the GAITRite system. Here, the number of strides acquired from each patient ranges from 7 – 32 with a mean of 12 strides per patient. After excluding datasets from eight patients due to medical reasons, two due to inertial sensor malfunction and additional five due to measurement errors with the GAITRite system, a total of 101 datasets were left for training and evaluation of the stride length estimation method proposed here. In 54% of the study population, gait disorders or fall proneness were diagnosed. The other top three diagnoses were heart rhythm disorder (70%), arterial hypertension (69%) and coronary artery disease (41%) all of which are associated with gait and balance disorders [38]. Therefore, this dataset constitutes a clinically relevant study population both in terms of the number of subjects and the presence of unpredictable gait alterations.\nb) Preprocessing: Before the inertial sensor data is fed to the convolutional neural network, we perform a series of preprocessing steps.These include identification and extraction of annotated strides in the continuous recordings and calibration from raw sensor readings to physical units [39]. Due to different sensor mounting on the shoe, coordinate system transformations are needed to align sensor axes on left and right feet. Furthermore, the signals from accelerometer and gyroscope are normalised w.r.t. the respective sensor ranges and padded to fixed length of 256 samples per stride to ensure equally scaled and fixed size input to the network.\nSince we will compare the algorithm on different stride definitions, we need to detect mid-stance (MS) and heel-strike (HS) events in the stride segmentation provided by the dataset and adjust the stride borders accordingly. Detection of these two events within the sensor data is done according to [10]. We call the stride definition provided by the dataset msDTW because of the multi-dimensional subsequence dynamic time warping they used for segmentation (for details see [10], [40]).\nAn exemplary, pre-processed input signal for the network\nfor one stride defined from MS→MS is shown in Fig. 2.\nc) Network Architecture: The neural network architecture we choose is a two layer convolutional network followed by one fully connected layer and a readout-layer (see Fig. 3). The main theoretical motivation for this choice is the locality of features gained by this type of architecture [27]. Furthermore, the approach forces the network to take the true topology of the input data as multi-channel, synchronized time series into account.\nThe preprocessed inertial sensor data xi, j with i = 1 . . . L0 samples and j = 1 . . .N0 channels serves as input to the network. In the first convolutional layer, feature maps are constructed from xi, j by convolution with k = 1 . . .N1 kernels ψ(1)i, j,k of size i = 1 . . . L1 and j ∈ [1,N0]. A bias term b (1) k is added to each feature map before a ReLU activation function [41] produces the output activations of the first convolutional layer\nc(1)k = ReLU ∑ j ψ(1)j,k ∗ x j + b (1) k  (1) with k ∈ [1,N1].\nAfter each convolutional layer, we insert a max-pooling layer that downsamples the feature maps by taking the maximum in non-overlapping windows of length r. The downsampling factor thus is 1/r. The output from the first max-pooling layer is called o(1)i, j with i ∈ [1, L0/r] and j ∈ [1,N1].\nIn the second convolutional layer, the same approach is repeated with different kernels and biases. Given the input signal o(1)i, j , feature maps are constructed by convolution with k = 1 . . .N2 kernels ψ (2) i, j,k of length i = 1 . . . L2 and j ∈ [1,N1]. A bias term b(2)k is added before a ReLU activation function produces the output nodes\nc(2)k = ReLU ∑ j ψ(2)j,k ∗ o (1) j + b (2) k  (2) with k ∈ [1,N2]. After max-pooling, the output o(2)i, j is of size i ∈ [1, L0/r2] and j ∈ [1,N2]. Similarly, up to logr L0 convolu-\n5\ntional layers followed by max-pooling could be stacked before the input signal is downsampled to size 1.\nFor the fully connected layer, the output from the last maxpooling layer o(2)i, j is flattened to a one dimensional vector õ(2)i with i ∈ [1,N2 L0/r2]. This vector is multiplied with the weights W (fc)i, j with i = 1 . . . (N2 L0/r\n2) and j = 1 . . .Nfc. A bias term b(fc)j is added before a ReLU activation function produces the output of the fully connected layer\no(fc)j = ReLU ∑ i W (fc)i, j õ (2) i + b (fc) j  (3) with j ∈ [1,Nfc].\nFinally, a readout layer compresses the Nfc output nodes of the hidden layer to the single target variable stride length. This is done by multiplication with a weight vector W (ro)i,1 with i ∈ [1,Nfc]. A final bias b(ro) is added to arrive at the estimate of the target variable\ny = ∑\ni\nW (ro)i,1 o (fc) i + b (ro) (4)\nSimilarly, a target vector (y1, . . . , yn) representing a set of stride features could be estimated by changing the dimensionality of weight and bias in the readout layer.\nFor our application of stride length estimation, the input data is of length L0 = 256 with N0 = 6 channels. On the first\nlayer of the network, we chose to learn N1 = 32 filters of length L1 = 30 samples, followed by N2 = 64 and L2 = 15 on the second. Max-pooling is done in non-overlapping windows of length r = 2 and the fully connected layer has Nfc = 1024 nodes. Given the downsampling factor and the sampling rate, the filter lengths both correspond to approximately 0.29 s. The theoretical motivation for this choice is to keep the resulting receptive field size constant (L1 = r L2) while increasing the amount of features maps (N2 > N1) with network depth.\nd) Learning a Regression Function: Given a training dataset, we now focus on determining the parameters involved in the previously described network architecture, i.e. kernels/weights and biases on each layer.\nTraining neural networks is commonly posed as an optimization problem regarding a scalar error function (implicitly) depending on the network parameters. This error implements a discrepancy measure between the predicted output and a ground truth reference on the training dataset or subsets thereof. Using back-propagation, weights and biases on all layers are changed with the aim to minimize the error. In practice, only random subsets of the training dataset, called mini-batches, are shown to the optimizer in one iteration of the training loop to speed up the learning phase (stochastic learning).\nGiven the relative error distribution\ni = yi − yi,ref\nyi,ref with i ∈ [1,Nbatch] (5)\non such a mini-batch of size Nbatch, we define the discrepancy measure to minimize as E( ) = rmsq( ). The term rmsq( ) is the root-mean-square-error on the mini-batch.\nFor optimization, we use Adam [42] which is a state-ofthe-art optimization method for stochastic learning. It shows faster convergence than other stochastic optimization routines on benchmark datasets and we use default settings of α = 1e−3, β1 = 0.9, β2 = 0.999 and = 1e−8 (for details see [42]). All weights are initialized randomly by sampling a truncated normal distribution with standard deviation 0.1 and biases are initialized from 0.1. Training is done for a fixed number of 4000 iterations with a mini-batch size Nbatch = 100 strides.\nAs a measure against over-fitting we use dropout on the fully connected layer. Dropout effectively samples a large number of thinned architectures on the hidden layer by randomly dropping nodes and their connections during training. This technique has been shown to prevent over-fitting significantly in many use-cases and is superior to weight-regularisation methods [43]. We use a fixed dropout probability of pdrop = 0.5, so every node on the fully connected layer has a 50/50 chance of being dropped during training. During testing, however, the full architecture is used and no connections are dropped.\nThe network is implemented and trained using google’s TensorFlow library [31].\ne) Evaluation Scheme: Evaluation of the proposed method is based on a 10-fold cross validation scheme. The strides from 101 patients on the dataset are sorted into training\n6 and test set depending on the patient identifier to ensure distinct splits of the dataset. For each of the three stride definitions msDTW, HS→HS and MS→MS, the model is evaluated in such a cross-validation scheme and the stride length is estimated on the test set in each fold. The predictions from individual folds are then pooled to arrive at average statistics for the current stride definition. Evaluation statistics include average accuracy ± precision, precision relative to the mean stride length, average absolute accuracy ± precision as well as Spearman correlation coefficients between the reference system and our approach.\nIn order to assess the learning speed and performance of the convolutional neural network, we compute the training error and the corresponding precision over the training iterations for an exemplary 90/10% (patient-wise) split of the dataset.\nIV. Results\na) Training: On a mobile workstation equipped with an Intel Core i7 processor (8 cores), 16GB of RAM and no GPU acceleration, training takes around 20 min. per fold.\nFor an exemplary fold, Fig. 4 shows the error as well as the precision on the entire training set over the iterations. The fixed number of 4000 iterations is sufficient to reach a stable regime of the error E( ) and precision evaluated on the entire training dataset. Moreover, we reach the reference precision after training which demonstrates the usability of the described approach for estimating stride length at high precision with a model tuned to the individual.\nb) Stride Length Estimation on Unseen Data: Tab. II lists average statistics from the 10-fold cross validation for each of the three stride definitions. Bland-Altman plots in Fig. 5 assess the agreement between the two measurements for all three stride definitions. Additionally, Fig. 5 includes regression lines between the measurement error y − yref and the measurement agreement 12 (y + yref) in order to assess the dependency of the measurement error w.r.t. the stride length.\nThe model yields best performance when strides are defined from MS→MS with a mean accuracy and precision of\n0.01±5.37 cm. The range of precisions achieved for individual patients ranges between ±1.54 cm in the best case (patient P114) and ±10.43 cm in the worst case (patient P106).\nFurthermore, the stride length estimation with the proposed approach is robust w.r.t. the stride definition. When trained and evaluated on the other two stride definitions (HS→HS and msDTW), the mean precision differs only marginally from the one achieved on the MS→MS strides. The mean accuracy, however, decreases to −0.27 cm and −0.42 cm for HS→HS and msDTW strides respectively.\nThe regression lines that indicate the dependency of the measurement error on the stride length regime are comparable for all three stride definitions. The low stride length regime is on average overestimated while high stride lengths are on average underestimated. This reflects an imbalance found in the training data. Since a fixed track length was used for data acquisition, there are more examples from the low stride length regime on the dataset compared to high stride length strides.\nV. Discussion\nOverall, our results show that stride length estimation with deep convolutional neural networks based on stride-specific inertial sensor data is possible. This is the first major contributions of this work. We show feasibility and contribute a completely new type of algorithm to the field of stride length estimation.\nThe best result achieved with the method described here outperforms the approach by Rampp et al. [10] by 3.0 cm (36%) in precision and also gives a more balanced error distribution. We can directly compare these two approaches since they are evaluated on an identical dataset. This is not the case for the other methods found in literature (see Tab. I). Although our approach shows similar performance, the discrepancy in evaluation datasets and their characteristics limits comparability. This manifests the urgent need for a standardised and clinically relevant benchmark dataset regarding stride length estimation from inertial sensor data. Given the number of subjects and the presence of gait alterations in the study population used here, it would serve well as such a benchmark dataset. Furthermore, it is publicly available at https://www5.cs.fau.de/activitynet/ benchmark-datasets/digital-biobank/.\nThe second main contribution of this work is the independence of stride definition. The mean accuracy and precision of the approach described is only marginally affected by the stride definition (Tab. II). This is particularly interesting since the different events in the datastream forming the stride definition can be determined with different degrees of exactness. The MS event, for example, is defined as the instant of lowest energy in all gyroscope axes during the stride (see [10] for details). In cases where the high frequency vibrations caused during heel-strike are not dampened enough to ensure a relatively stable sensor during the stance phase, this can lead to a temporal offset regarding individual MS events. The heel-strike detection, however, is defined as a minimum in the accelerometer x-axis (see [10] for details) and can thus be detected more accurately. Subsequently, the MS→MS stride definition is not as exact as for example the HS→HS\n7\nstride definition. This results in more extreme outliers for the MS→MS strides in the Bland-Altman plots (Fig. 5). The fact that this stride definition still yields best mean accuracy and precision is probably coincidence here.\nFrom a clinical perspective, the independence of stride definition opens up new possibilities regarding analysis of impaired gait. In clinical practice, the zero-velocity assumption is easily violated as in the case of spastic forms of gait alterations as e.g. experienced by post-stroke, multiple sclerosis or spastic paraplegia patients. Standard double-integration methods would fail in estimating spatial stride parameters in these clinically relevant situations. This is not the case with the approach presented here.\nLastly, the high precision on the training dataset shown in Fig. 4 promises excellent results in case of individualization. If we have a training/calibration dataset to tune the neural network to the patient at hand, i.e. by collecting one gait sequence instrumented with inertial sensors and the GAITRite, the proposed method could reach the precision of the reference. This would enable highly accurate stride-by-stride analysis of spatial gait parameters in daily clinical routine or outpatient monitoring at a level sufficient to address clinically relevant phenomena as for example the decline in stride length with disease progression in PD patients or medication effects.\nFurthermore, our methodology is not limited to stride length estimation. Targeting the underlying regression task at a different stride-specific gait characteristic e.g. stride width or timings of individual gait phases does not involve changing the underlying algorithms. The very same technology can be used to estimate different target parameters by simply changing or extending the reference annotation on the training dataset.\nThe main limitation of the proposed method is that the training of a regression function between stride-specific sensor data and the spatial parameter stride length implicitly depends on the training set. Therefore, the dataset used for training has to capture as much variability as possible for the problem at hand. Otherwise, application on a population that differs from the one used for training might result in lack of model-validity. This is the profound difference between the data-driven approach described here and a double-integration approach that is based on geometric and physical reasoning and does not encounter this kind of problem. However, given enough training data this problem can be solved. Additionally, preliminary experiments already show good generalisation to a PD population without any adaptation of the model trained on the geriatric population presented here.\nFuture work focusses on further improving the optimization of network parameters by introducing a dynamic stop criterion\ndepending on the performance on the entire training set. Early stopping could also be investigated in this respect. The imbalance on the training data mentioned earlier is another issue that needs to be addressed. Since limiting the number of strides per patient by random subsampling dramatically reduces the amount of training samples in the current dataset, a balanced training set could for example be acquired by means of simulation. Here, a biomechanical model could be used to sample the space of possible, three-dimensional foot trajectories and output the accelerometer and gyroscope readings for each stride as well as the corresponding target parameter of interest, e.g. stride length. This would also enable much richer datasets for training the network and thereby resolve the aforementioned limitation. Regarding the individualization of the proposed model to a specific patient, this work only shows promising results. This has to be investigated in further detail. Finally, the application of deep convolutional neural networks to other spatial stride parameters, e.g. stride width, or the extraction of complete foot trajectories including foot orientation from stride-specific inertial sensor data will be investigated in future work.\nIn summary, we used convolutional neural networks to estimate stride length based on stride-specific inertial sensor data captured at the subject’s feet. We provide technical validation of the proposed method on a publicly available and clinically relevant benchmark dataset. Furthermore, the proposed approach is robust w.r.t. the stride definition and thus not subject to the zero-velocity phase assumption. Consequently, the current work enables estimation of stride length in clinically relevant situations where the diversity of gait alterations easily violates the assumptions made by state-ofthe-art methods.\n8 0 20 40 60 80 100 120 140\nMeasurement agreement 1 2 (y + yref) [cm]\n−40\n−30\n−20\n−10\n0\n10\n20\n30\n40\nM ea\nsu re\nm en\nt er\nro r y − y r\nef [c\nm ]\n+1.96σ\n−1.96σ\nMean acc. ± prec. 0.01± 5.37 cm Regression line −0.02 x+ 1.69 cm\nMS→MS strides Fold 1 Fold 2 Fold 3 Fold 4 Fold 5 Fold 6 Fold 7 Fold 8 Fold 9 Fold 10\n0 20 40 60 80 100 120 140\nMeasurement agreement 1 2 (y + yref) [cm]\n−40\n−30\n−20\n−10\n0\n10\n20\n30\n40\nM ea\nsu re\nm en\nt er\nro r y − y r\nef [c\nm ]\n+1.96σ\n−1.96σ\nMean acc. ± prec. −0.27± 5.43 cm Regression line −0.03 x+ 1.79 cm\nHS→HS strides Fold 1 Fold 2 Fold 3 Fold 4 Fold 5 Fold 6 Fold 7 Fold 8 Fold 9 Fold 10\n0 20 40 60 80 100 120 140\nMeasurement agreement 1 2 (y + yref) [cm]\n−40\n−30\n−20\n−10\n0\n10\n20\n30\n40\nM ea\nsu re\nm en\nt er\nro r y − y r\nef [c\nm ]\n+1.96σ\n−1.96σ\nMean acc. ± prec. −0.42± 5.42 cm Regression line −0.03 x+ 1.61 cm\nmsDTW strides\nFold 1 Fold 2 Fold 3 Fold 4 Fold 5 Fold 6 Fold 7 Fold 8 Fold 9 Fold 10\nFig. 5. Bland-Altman plots from the evaluation of the proposed algorithm in a 10-fold cross validation for all three stride definitions. Mean accuracy and ±1.96 σ bounds as well as a regression line between mean stride length and the measurement error are shown.\nAcknowledgements This work was supported by the FAU Emerging Fields Initiative (EFIMoves). The authors would like to thank all participants of the study for their contributions.\nReferences [1] J. Klucken, J. Barth, P. Kugler, J. Schlachetzki, T. Henze et al.,\n“Unbiased and Mobile Gait Analysis Detects Motor Impairment in Parkinson’s Disease,” PLoS ONE, vol. 8, no. 2, 2013.\n[2] T. Ellis, J. T. Cavanaugh, G. M. Earhart, M. P. Ford, K. B. Foreman et al., “Which measures of physical function and motor impairment best predict quality of life in Parkinson’s disease?” Parkinsonism and Related Disorders, vol. 17, no. 9, pp. 693–697, 2011. [3] C. G. Goetz, B. C. Tilley, S. R. Shaftman, G. T. Stebbins, S. Fahn et al., “Movement Disorder Society-Sponsored Revision of the Unified Parkinson’s Disease Rating Scale (MDS-UPDRS): Scale presentation and clinimetric testing results,” Movement Disorders, vol. 23, no. 15, pp. 2129–2170, 2008. [4] United Nations, Department of Economic and Social Affairs, Population Division, “World Population Prospects: The 2015 Revision, Volume I: Comprehensive Tables,” ST/ESA/SER.A/379, 2015. [5] S. Grammenos, “Implications of demographic ageing in the enlarged EU in domains of quality of life, health promotion and health care,” Centre for European Social and Economic Policy, 2005. [6] C. Pasluosta, H. Gassner, J. Winkler, J. Klucken, and B. M. Eskofier, “An Emerging Era in the Management of Parkinson’s Disease: Wearable Technologies and the Internet of Things.” IEEE Journal of Biomedical and Health Informatics, vol. 19, no. 6, pp. 1873–81, 2015. [7] R. W. Kressig, R. J. Gregor, A. Oliver, D. Waddell, W. Smith et al., “Temporal and spatial features of gait in older adults transitioning to frailty.” Gait & Posture, vol. 20, no. 1, pp. 30–5, Aug. 2004. [8] U. Givon, G. Zeilig, and A. Achiron, “Gait analysis in multiple sclerosis: characterization of temporal-spatial parameters using GAITRite functional ambulation system.” Gait & Posture, vol. 29, no. 1, pp. 138– 42, 2009. [9] B. Mariani, C. Hoskovec, S. Rochat, C. Büla, J. Penders et al., “3D gait assessment in young and elderly subjects using foot-worn inertial sensors,” Journal of Biomechanics, vol. 43, no. 15, pp. 2999–3006, 2010. [10] A. Rampp, J. Barth, S. Schülein, K.-G. Gaßmann, J. Klucken et al., “Inertial Sensor Based Stride Parameter Calculation from Gait Sequences in Geriatric Patients.” IEEE Transactions on Biomedical Engineering, vol. 62, no. 4, pp. 1089–1097, 2014. [11] K. Aminian, B. Najafi, C. Büla, P. F. Leyvraz, and P. Robert, “Spatiotemporal parameters of gait measured by an ambulatory system using miniature gyroscopes,” Journal of Biomechanics, vol. 35, no. 5, pp. 689– 699, 2002. [12] A. Salarian, H. Russmann, F. J. G. Vingerhoets, C. Dehollain, Y. Blanc et al., “Gait assessment in Parkinson’s disease: Toward an ambulatory system for long-term monitoring,” IEEE Transactions on Biomedical Engineering, vol. 51, no. 8, pp. 1434–1443, 2004. [13] J. R. Rebula, L. V. Ojeda, P. G. Adamczyk, and A. D. Kuo, “Measurement of foot placement and its variability with inertial sensors.” Gait & Posture, vol. 38, no. 4, pp. 974–80, Sep. 2013. [14] D. Trojaniello, A. Cereatti, E. Pelosin, L. Avanzino, A. Mirelman et al., “Estimation of step-by-step spatio-temporal parameters of normal and impaired gait using shank-mounted magneto-inertial sensors: application to elderly, hemiparetic, parkinsonian and choreic gait,” Journal of Neuroengineering and Rehabilitation, vol. 11, no. 1, p. 152, 2014. [15] A. Ferrari, P. Ginis, M. Hardegger, F. Casamassima, L. Rocchi et al., “A Mobile Kalman-Filter Based Solution for the Real-Time Estimation of Spatio-Temporal Gait Parameters,” IEEE Transactions on Neural Systems and Rehabilitation Engineering, vol. PP, no. 99, 2015. [16] A. Salarian, P. R. Burkhard, B. M. Jolles, and K. Aminian, “A Novel Approach to Reducing Number of Sensing Units for Wearable Gait Analysis Systems,” IEEE Transactions on Biomedical Engineering, vol. 60, no. 1, pp. 72–77, 2013. [17] P. H. Veltink, P. Slycke, J. Hemssems, R. Buschman, G. Bultstra et al., “Three dimensional inertial sensing of foot movements for automatic tuning of a two-channel implantable drop-foot stimulator,” Medical Engineering & Physics, vol. 25, no. 1, pp. 21–28, 2003. [18] A. M. Sabatini, “Quaternion-based strap-down integration method for applications of inertial sensing to gait analysis,” Medical and Biological Engineering and Computing, vol. 43, no. 1, pp. 94–101, 2005. [19] A. Peruzzi, U. Della Croce, and A. Cereatti, “Estimation of stride length in level walking using an inertial measurement unit attached to the foot: A validation of the zero velocity assumption during stance,” Journal of Biomechanics, vol. 44, no. 10, pp. 1991–1994, 2011. [20] M. Zok, C. Mazzà, and U. Della Croce, “Total body centre of mass displacement estimated using ground reactions during transitory motor tasks: Application to step ascent,” Medical Engineering and Physics, vol. 26, no. 9 SPEC.ISS., pp. 791–798, 2004. [21] W. H. K. de Vries, H. E. J. Veeger, C. T. M. Baten, and F. C. T. van der Helm, “Magnetic distortion in motion labs, implications for validating inertial magnetic sensors,” Gait and Posture, vol. 29, no. 4, pp. 535–541, 2009.\n9 [22] J. H. Hollman, E. M. McDade, and R. C. Petersen, “Normative spatiotemporal gait parameters in older adults,” Gait and Posture, vol. 34, no. 1, pp. 111–118, 2011. [23] C. J. Hass, P. Malczak, J. Nocera, E. L. Stegemöller, A. Shukala et al., “Quantitative normative Gait data in a large cohort of ambulatory persons with parkinson’s disease,” PLoS ONE, vol. 7, no. 8, pp. 4–8, 2012. [24] M. M. Hoehn and M. D. Yahr, “Parkinsonism: onset, progression, and mortality,” Neurology, vol. 57, no. 2, p. 318 and 16 pages following, 1967. [25] M. S. Bryant, D. H. Rintala, J. G. Hou, E. C. Lai, and E. J. Protas, “Effects of levodopa on forward and backward gait patterns in persons with Parkinson’s disease,” NeuroRehabilitation, vol. 29, no. 3, pp. 247– 252, 2011. [26] K. Aminian, P. Robert, E. Jequier, and Y. Schutz, “Estimation of speed and incline of walking using neural network,” IEEE Transactions on Instrumentation and Measurement, vol. 44, no. 3, pp. 743–746, 1995. [27] Y. LeCun, Y. Bengio, and G. Hinton, “Deep learning,” Nature, vol. 521, no. 7553, pp. 436–444, 2015. [28] A. Krizhevsky, I. Sutskever, and G. E. Hinton, “ImageNet Classification with Deep Convolutional Neural Networks,” Advances In Neural Information Processing Systems, pp. 1–9, 2012. [29] G. E. Hinton and R. Salakhutdinov, “Reducing the Dimensionality of Data with Neural Networks,” Science, vol. 313, pp. 504–507, 2006. [30] R. Collobert, K. Kavukcuoglu, and C. Farabet, “Torch7: A matlablike environment for machine learning,” 2011, software available from torch.ch. [31] M. Abadi, A. Agarwal, P. Barham, E. Brevdo, Z. Chen et al., “TensorFlow: Large-scale machine learning on heterogeneous systems,” 2015, software available from tensorflow.org. [32] Xue-Wen Chen and Xiaotong Lin, “Big Data Deep Learning: Challenges and Perspectives,” IEEE Access, vol. 2, pp. 514–525, 2014. [33] S. Stober, A. Sternin, A. M. Owen, and J. A. Grahn, “Deep Feature Learning for EEG Recordings,” arXiv:1511.04306, 2015. [34] A. Burns, B. R. Greene, M. J. McGrath, T. J. O’Shea, B. Kuris et al., “SHIMMERTM – A wireless sensor platform for noninvasive biomedical research,” Sensors, vol. 10, no. 9, pp. 1527–1534, 2010. [35] J. C. Menant, J. R. Steele, H. B. Menz, B. J. Munro, and S. R. Lord, “Effects of walking surfaces and footwear on temporo-spatial gait parameters in young and older people.” Gait & Posture, vol. 29, no. 3, pp. 392–7, Apr. 2009. [36] A. L. McDonough, M. Batavia, F. C. Chen, S. Kwon, and J. Ziai, “The validity and reliability of the GAITRite system’s measurements: A preliminary evaluation.” Archives of Physical Medicine and Rehabilitation, vol. 82, no. 3, pp. 419–25, Mar. 2001. [37] K. E. Webster, J. E. Wittwer, and J. a. Feller, “Validity of the GAITRite R© walkway system for the measurement of averaged and individual step parameters of gait,” Gait & Posture, vol. 22, no. 4, pp. 317–321, 2005. [38] B. Salzman, “Gait and Balance Disorders in Older Adults,” American Family Physician, vol. 82, no. 1, pp. 61–68, 2010. [39] F. Ferraris, U. Grimaldi, and M. Parvis, “Procedure for effortless infield calibration of three-axial rate gyro and accelerometers,” Sensors and Materials, vol. 7, no. 5, pp. 311–330, 1995. [40] J. Barth, C. Oberndorfer, C. Pasluosta, S. Schülein, H. Gassner et al., “Stride segmentation during free walk movements using multidimensional subsequence dynamic time warping on inertial sensor data,” Sensors, vol. 15, no. 3, pp. 6419–6440, 2015. [41] X. Glorot, A. Bordes, and Y. Bengio, “Deep Sparse Rectifier Neural Networks,” AISTATS, vol. 15, pp. 315–323, 2011. [42] D. P. Kingma and J. L. Ba, “Adam: a Method for Stochastic Optimization,” International Conference on Learning Representations, pp. 1–13, 2015. [43] N. Srivastava, G. Hinton, A. Krizhevsky, I. Sutskever, and R. Salakhutdinov, “Dropout : A Simple Way to Prevent Neural Networks from Overfitting,” Journal of Machine Learning Research, vol. 15, pp. 1929– 1958, 2014."
    } ],
    "references" : [ ],
    "referenceMentions" : [ ],
    "year" : 2017,
    "abstractText" : "Accurate estimation of spatial gait characteristics is critical to assess motor impairments resulting from neurological or musculoskeletal disease. Currently, however, methodological constraints limit clinical applicability of state-of-the-art double integration approaches to gait patterns with a clear zero-velocity phase. We describe a novel approach to stride length estimation that uses deep convolutional neural networks to map stride-specific inertial sensor data to the resulting stride length. The model is trained on a publicly available and clinically relevant benchmark dataset consisting of 1220 strides from 101 geriatric patients. Evaluation is done in a 10-fold cross validation and for three different stride definitions. Even though best results are achieved with strides defined from mid-stance to mid-stance with average accuracy and precision of 0.01 ± 5.37 cm, performance does not strongly depend on stride definition. The achieved precision outperforms state-of-the-art methods evaluated on this benchmark dataset by 3.0 cm (36%). Due to the independence of stride definition, the proposed method is not subject to the methodological constrains that limit applicability of state-of-the-art double integration methods. Furthermore, precision on the benchmark dataset could be improved. With more precise mobile stride length estimation, new insights to the progression of neurological disease or early indications might be gained. Due to the independence of stride definition, previously uncharted diseases in terms of mobile gait analysis can now be investigated by re-training and applying the proposed method.",
    "creator" : "LaTeX with hyperref package"
  }
}