{
  "name" : "1610.09033.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Operator Variational Inference",
    "authors" : [ "Rajesh Ranganath", "Jaan Altosaar", "Dustin Tran", "David M. Blei" ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "Variational inference is an umbrella term for algorithms that cast Bayesian inference as optimization [11]. Originally developed in the 1990s, recent advances in variational inference have scaled Bayesian computation to massive data [8], provided black box strategies for generic inference in many models [20], and enabled more accurate approximations of a model’s posterior without sacrificing efficiency [22, 21]. These innovations have both scaled Bayesian analysis and removed the analytic burdens that have traditionally taxed its practice.\nGiven a model of latent and observed variables p(x, z), variational inference posits a family of distributions over its latent variables and then finds the member of that family closest to the posterior, p(z |x). This is typically formalized as minimizing a Kullback-Leibler (kl) divergence from the approximating family q(·) to the posterior p(·). However, while the kl(q ‖ p) objective offers many beneficial computational properties, it is ultimately designed for convenience; it sacrifices many desirable statistical properties of the resultant approximation.\nWhen optimizing kl, there are two issues with the posterior approximation that we highlight. First, it typically underestimates the variance of the posterior. Second, it can result in degenerate solutions that zero out the probability of certain configurations of the latent variables. While both of these issues can be partially circumvented by using more expressive approximating families, they ultimately stem from the choice of the objective. Under the kl divergence, we pay a large price when q(·) is big where p(·) is tiny; this price becomes infinite when q(·) has larger support than p(·). In this paper, we revisit variational inference from its core principle as an optimization problem. We use operators—mappings from functions to functions—to design variational objectives, explicitly trading off computational properties of the optimization with statistical properties of the approximation. We use operators to formalize the basic properties needed for variational inference algorithms. We further outline how to use them to define new variational objectives; as one example, we design a variational objective using a Langevin-Stein operator.\n30th Conference on Neural Information Processing Systems (NIPS 2016), Barcelona, Spain.\nar X\niv :1\n61 0.\n09 03\n3v 1\n[ st\nat .M\nL ]\n2 7\nO ct\n2 01\n6\nWe develop operator variational inference (opvi), a black box algorithm that optimizes any operator objective. In the context of opvi, we show that the Langevin-Stein objective enjoys two good properties. First, it is amenable to data subsampling, which allows inference to scale to massive data. Second, it permits rich approximating families, called variational programs, which do not require analytically tractable densities. This greatly expands the class of variational families and the fidelity of the resulting approximation. (We note that the traditional kl is not amenable to using variational programs.) We study opvi with the Langevin-Stein objective on a mixture model and a generative model of images.\nRelated Work. There are several threads of research in variational inference with alternative divergences. An early example is expectation propagation (ep) [17]. ep promises approximate minimization of the inclusive kl divergence kl(p||q) to find overdispersed approximations to the posterior. ep hinges on local minimization with respect to subsets of data and connects to work on α-divergence minimization [18, 7]. However, it does not have convergence guarantees and typically does not minimize kl or an α-divergence because it is not a global optimization method. We note that these divergences can be written as operator variational objectives, but they do not satisfy the tractability criteria and thus require further approximations. Li and Turner [15] present a variant ofα-divergences that satisfy the full requirements of opvi. Score matching [10], a method for estimating models by matching the score function of one distribution to another that can be sampled, also falls into the class of objectives we develop.\nHere we show how to construct new objectives, including some not yet studied. We make explicit the requirements to construct objectives for variational inference. Finally, we discuss further properties that make them amenable to both scalable and flexible variational inference."
    }, {
      "heading" : "2 Operator Variational Objectives",
      "text" : "We define operator variational objectives and the conditions needed for an objective to be useful for variational inference. We develop a new objective, the Langevin-Stein objective, and show how to place the classical kl into this class. In the next section, we develop a general algorithm for optimizing operator variational objectives."
    }, {
      "heading" : "2.1 Variational Objectives",
      "text" : "Consider a probabilistic model p(x, z) of data x and latent variables z. Given a data set x, approximate Bayesian inference seeks to approximate the posterior distribution p(z |x), which is applied in all downstream tasks. Variational inference posits a family of approximating distributions q(z) and optimizes a divergence function to find the member of the family closest to the posterior.\nThe divergence function is the variational objective, a function of both the posterior and the approximating distribution. Useful variational objectives hinge on two properties: first, optimizing the function yields a good posterior approximation; second, the problem is tractable when the posterior distribution is known up to a constant.\nThe classic construction that satisfies these properties is the evidence lower bound (elbo),\nEq(z)[log p(x, z)− log q(z)]. (1)\nIt is maximized when q(z) = p(z |x) and it only depends on the posterior distribution up to a tractable constant, log p(x, z). The elbo has been the focus in much of the classical literature. Maximizing the elbo is equivalent to minimizing the kl divergence to the posterior, and the expectations are analytic for a large class of models [5]."
    }, {
      "heading" : "2.2 Operator Variational Objectives",
      "text" : "We define a new class of variational objectives, operator variational objectives. An operator objective has three components. The first component is an operator Op,q that depends on p(z |x) and q(z). (Recall that an operator maps functions to other functions.) The second component is a family of test functions F , where each f(z) ∈ F maps realizations of the latent variables to real vectors Rd. In the objective, the operator and a function will combine in an expectation Eq(z)[(Op,q f)(z)], designed such that values close to zero indicate that q is close to p. The third component is a distance\nfunction t(a) : R→ [0,∞), which is applied to the expectation so that the objective is non-negative. (Our example uses the square function t(a) = a2.)\nThese three components combine to form the operator variational objective. It is a non-negative function of the variational distribution,\nL(q;Op,q,F , t) = sup f∈F t(Eq(z)[(Op,q f)(z)]). (2)\nIntuitively, it is the worst-case expected value among all test functions f ∈ F . Operator variational inference seeks to minimize this objective with respect to the variational family q ∈ Q.\nWe use operator objectives for posterior inference. This requires two conditions on the operator and function family.\n1. Closeness. The minimum of the variational objective is at the posterior, q(z) = p(z |x). We meet this condition by requiring that Ep(z |x)[(Op,p f)(z)] = 0 for all f ∈ F . Thus, optimizing the objective will produce p(z |x) if it is the only member ofQ with zero expectation (otherwise it will produce a distribution in the equivalence class: q ∈ Q with zero expectation). In practice, the minimum will be the closest member of Q to p(z |x).\n2. Tractability. We can calculate the variational objective up to a constant without involving the exact posterior p(z |x). In other words, we do not require calculating the normalizing constant of the posterior, which is typically intractable. We meet this condition by requiring that the operator Op,q—originally in terms of p(z |x) and q(z)—can be written in terms of p(x, z) and q(z). Tractability also imposes conditions on F : it must be feasible to find the supremum. Below, we satisfy this by defining a parametric family for F that is amenable to stochastic optimization.\nEq.2 and the two conditions provide a mechanism to design meaningful variational objectives for posterior inference. Operator variational objectives try to match expectations with respect to q(z) to those with respect to p(z |x)."
    }, {
      "heading" : "2.3 Understanding Operator Variational Objectives",
      "text" : "Consider operators where Eq(z)[(Op,q f)(z)] only takes positive values. In this case, distance to zero can be measured with the identity t(a) = a, so tractability implies the operator need only be known up to a constant. This family includes tractable forms of familiar divergences like the kl divergence (elbo), Rényi’s α-divergence [15], and the χ-divergence [19]. When the expectation can take positive or negative values, operator variational objectives are closely related to Stein divergences [2]. Consider a family of scalar test functions F∗ that have expectation zero with respect to the posterior,Ep(z |x)[f∗(z)] = 0. Using this family, a Stein divergence is\nDStein(p, q) = sup f∗∈F∗\n|Eq(z)[f∗(z)]− Ep(z |x)[f∗(z)]|.\nNow recall the operator objective of Eq.2. The closeness condition implies that\nL(q;Op,q,F , t) = sup f∈F t(Eq(z)[(Op,q f)(z)]− Ep(z |x)[(Op,p f)(z)]).\nIn other words, operators with positive or negative expectations lead to Stein divergences with a more generalized notion of distance."
    }, {
      "heading" : "2.4 Langevin-Stein Operator Variational Objective",
      "text" : "We developed the operator variational objective. It is a class of tractable objectives, each of which can be optimized to yield an approximation to the posterior. An operator variational objective is built from an operator, function class, and distance function to zero. We now use this construction to design a new type of variational objective.\nAn operator objective involves a class of functions that has known expectations with respect to an intractable distribution. There are many ways to construct such classes [1, 2]. Here, we construct an operator objective from the generator Stein’s method applied to the Langevin diffusion.\nLet∇>f denote the divergence of a vector-valued function f , that is, the sum of its individual gradients. Applying the generator method of Barbour [2] to Langevin diffusion gives the operator\n(Opls f)(z) = ∇z log p(x, z)>f(z) +∇>f. (3)\nWe call this the Langevin-Stein (ls) operator. We obtain the corresponding variational objective by using the squared distance function and substituting Eq.3 into Eq.2,\nL(q;Opls,F) = sup f∈F (Eq[∇z log p(x, z)>f(z) +∇>f ])2. (4)\nThe ls operator satisfies both conditions. First, it satisfies closeness because it has expectation zero under the posterior (Appendix A) and its unique minimizer is the posterior (Appendix B). Second, it is tractable because it requires only the joint distribution. The functions f will also be a parametric family, which we detail later.\nAdditionally, while the kl divergence finds variational distributions that underestimate the variance, the ls objective does not suffer from that pathology. The reason is that kl is infinite when the support of q is larger than p; here this is not the case.\nWe provided one example of a variational objectives using operators, which is specific to continuous variables. In general, operator objectives are not limited to continuous variables; Appendix C describes an operator for discrete variables."
    }, {
      "heading" : "2.5 The KL Divergence as an Operator Variational Objective",
      "text" : "Finally, we demonstrate how classical variational methods fall inside the operator family. For example, traditional variational inference minimizes the kl divergence from an approximating family to the posterior [11]. This can be construed as an operator variational objective,\n(Op,qKL f)(z) = log q(z)− log p(z|x) ∀f ∈ F . (5)\nThis operator does not use the family of functions—it trivially maps all functions f to the same function. Further, because kl is strictly positive, we use the identity distance t(a) = a. The operator satisfies both conditions. It satisfies closeness because KL(p||p) = 0. It satisfies tractability because it can be computed up to a constant when used in the operator objective of Eq.2. Tractability comes from the fact that log p(z |x) = log p(z,x)− log p(x)."
    }, {
      "heading" : "3 Operator Variational Inference",
      "text" : "We described operator variational objectives, a broad class of objectives for variational inference. We now examine how it can be optimized. We develop a black box algorithm [29, 20] based on Monte Carlo estimation and stochastic optimization. Our algorithm applies to a general class of models and any operator objective.\nMinimizing the operator objective involves two optimizations: minimizing the objective with respect to the approximating family Q and maximizing the objective with respect to the function class F (which is part of the objective).\nWe index the familyQ with variational parameters λ and require that it satisfies properties typically assumed by black box methods [20]: the variational distribution q(z;λ) has a known and tractable density; we can sample from q(z;λ); and we can tractably compute the score function∇λ log q(z;λ). We index the function class F with parameters θ, and require that fθ(·) is differentiable. In the experiments, we use neural networks, which are flexible enough to approximate a general family of test functions [9].\nGiven parameterizations of the variational family and test family, operator variational inference (opvi) seeks to solve a minimax problem,\nλ∗ = inf λ sup θ t(Eλ[(Op,qfθ)(z)]). (6)\nWe will use stochastic optimization [24, 13]. In principle, we can find stochastic gradients of λ by rewriting the objective in terms of the optimized value of θ, θ∗(λ). In practice, however, we\nAlgorithm 1: Operator variational inference Input : Model log p(x, z), variational approximation q(z;λ) Output: Variational parameters λ Initialize λ and θ randomly. while not converged do\nCompute unbiased estimates of ∇λLθ from Eq.7. Compute unbiased esimates of ∇θLλ from Eq.8. Update λ, θ with unbiased stochastic gradients.\nend\nsimultaneously solve the maximization and minimization. Though computationally beneficial, this produces saddle points. In our experiments we found it to be stable enough. We derive gradients for the variational parameters λ and test function parameters θ. (We fix the distance function to be the square t(a) = a2; the identity t(a) = a also readily applies.)\nGradient with respect toλ. For a fixed test function with parameters θ, denote the objective\nLθ = t(Eλ[(Op,q fθ)(z)]).\nThe gradient with respect to variational parameters λ is\n∇λLθ = 2 Eλ[(Op,q fθ)(z)]∇λEλ[(Op,q fθ)(z)].\nNow write the second expectation with the score function gradient [20]. This gradient is\n∇λLθ = 2 Eλ[(Op,q fθ)(z)] Eλ[∇λ log q(z;λ)(Op,q fθ)(z) +∇λ(Op,q fθ)(z)]. (7)\nEq.7 lets us calculate unbiased stochastic gradients. We first generate two sets of independent samples from q; we then formMonte Carlo estimates of the first and second expectations. For the second expectation, we can use the variance reduction techniques developed for black box variational inference, such as Rao-Blackwellization [20].\nWe described the score gradient because it is general. An alternative is to use the reparameterization gradient for the second expectation [12, 23]. It requires that the operator be differentiable with respect to z and that samples from q can be drawn as a transformation r of a parameter-free noise source , z = r( ,λ). In our experiments, we use the reparameterization gradient.\nGradient with respect to θ. Mirroring the notation above, the operator objective for fixed variational λ is\nLλ = t(Eλ[(Op,q fθ)(z)]).\nThe gradient with respect to test function parameters θ is\n∇θLλ = 2 Eλ[(Op,qfθ)(z)] Eλ[∇θOp,q fθ(z)]. (8)\nAgain, we can construct unbiased stochastic gradients with two sets of Monte Carlo estimates. Note that gradients for the test function do not require score gradients (or reparameterization gradients) because the expectation does not depend on θ.\nAlgorithm. Algorithm 1 outlines opvi. We simultaneously minimize the variational objective with respect to the variational family qλ while maximizing it with respect to the function class fθ. Given a model, operator, and function class parameterization, we can use automatic differentiation to calculate the necessary gradients [3]. Provided the operator does not require model-specific computation, this algorithm satisfies the black box criteria.\n3.1 Data Subsampling and opvi\nWith stochastic optimization, data subsampling scales up traditional variational inference to massive data [8, 27]. The idea is to calculate noisy gradients by repeatedly subsampling from the data set, without needing to pass through the entire data set for each gradient.\nAn as illustration, consider hierarchical models. Hierarchical models consist of global latent variables β that are shared across data points and local latent variables zi each of which is associated to a data point xi. The model’s log joint density is\nlog p(x1:n, z1:n, β) = log p(β) + n∑ i=1 [ log p(xi | zi, β) + log p(zi |β) ] .\nHoffman et al. [8] calculate unbiased estimates of the log joint density (and its gradient) by subsampling data and appropriately scaling the sum.\nWe can characterize whether opvi with a particular operator supports data subsampling. opvi relies on evaluating the operator and its gradient at different realizations of the latent variables (Eq.7 and Eq.8). Thus we can subsample data to calculate estimates of the operator when it derives from linear operators of the log density, such as differentiation and the identity. This follows as a linear operator of sums is a sum of linear operators, so the gradients in Eq.7 and Eq.8 decompose into a sum. The Langevin-Stein and kl operator are both linear in the log density; both support data subsampling."
    }, {
      "heading" : "3.2 Variational Programs",
      "text" : "Given an operator and variational family, Algorithm 1 optimizes the corresponding operator objective. Certain operators require the density of q. For example, the kl operator (Eq.5) requires its log density. This potentially limits the construction of rich variational approximations for which the density of q is difficult to compute.1\nSome operators, however, do not depend on having a analytic density; the Langevin-Stein (ls) operator (Eq.3) is an example. These operators can be used with a much richer class of variational approximations, those that can be sampled from but might not have analytically tractable densities. We call such approximating families variational programs.\nInference with a variational program requires the family to be reparameterizable [12, 23]. (Otherwise we need to use the score function, which requires the derivative of the density.) A reparameterizable variational program consists of a parametric deterministic transformation R of random noise . Formally, let\n∼ Normal(0, 1), z = R( ;λ). (9)\nThis generates samples for z, is differentiable with respect toλ, and its densitymay be intractable. For operators that do not require the density of q, it can be used as a powerful variational approximation. This is in contrast to the standard Kullback-Leibler (kl) operator. As an example, consider the following variational program for a one-dimensional random variable. Let λi denote the ith dimension of λ and make the corresponding definition for :\nz = ( 3 > 0)R( 1;λ1)− ( 3 ≤ 0)R( 2;λ2). (10)\nWhen R outputs positive values, this separates the parametrization of the density to the positive and negative halves of the reals; its density is generally intractable. In Section 4, we will use this distribution as a variational approximation.\nEq.9 contains many densities when the function class R can approximate arbitrary continuous functions. We state it formally. Theorem 1. Consider a posterior distribution p(z |x) with a finite number of latent variables and continuous quantile function. Assume the operator variational objective has a unique root at the posterior p(z |x) and that R can approximate continuous functions. Then there exists a sequence of parameters λ1, λ2 . . . , in the variational program, such that the operator variational objective converges to 0, and thus q converges in distribution to p(z |x). This theorem says that we can use variational programs with an appropriate q-independent operator to approximate continuous distributions. The proof is in Appendix D.\n1It is possible to construct rich approximating families with kl(q||p), but this requires the introduction of an auxiliary distribution [16]."
    }, {
      "heading" : "4 Empirical Study",
      "text" : "We evaluate operator variational inference on a mixture of Gaussians, comparing different choices in the objective. We then study logistic factor analysis for images."
    }, {
      "heading" : "4.1 Mixture of Gaussians",
      "text" : "Consider a one-dimensional mixture of Gaussians as the posterior of interest, p(z) = 12Normal(z;−3, 1) + 1 2Normal(z; 3, 1). The posterior contains multiple modes. We seek to approximate it with three variational objectives: Kullback-Leibler (kl) with a Gaussian approximating family, Langevin-Stein (ls) with a Gaussian approximating family, and ls with a variational program.\nFigure 1 displays the posterior approximations. We find that the kl divergence and ls divergence choose a single mode and have slightly different variances. These operators do not produce good results because a single Gaussian is a poor approximation to the mixture. The remaining distribution in Figure 1 comes from the toy variational program described by Eq.10 with the ls operator. Because this program captures different distributions for the positive and negative half of the real line, it is able to capture the posterior.\nIn general, the choice of an objective balances statistical and computational properties of variational inference. We highlight one tradeoff: the ls objective admits the use of a variational program; however, the objective is more difficult to optimize than the kl."
    }, {
      "heading" : "4.2 Logistic Factor Analysis",
      "text" : "Logistic factor analysis models binary vectorsxi with amatrix of parametersW and biasesb,\nzi ∼ Normal(0, 1) xi,k ∼ Bernoulli(σ(w>k zi + bk)),\nwhere zi has fixed dimensionK and σ is the sigmoid function. This model captures correlations of the entries in xi through W.\nWe apply logistic factor analysis to analyze the binarizedMNIST data set [25], which contains 28x28 binary pixel images of handwritten digits. (We set the latent dimensionality to 10.) We fix the model parameters to those learned with variational expectation-maximization using the kl divergence, and focus on comparing posterior inferences.\nWe compare the kl operator to the ls operator and study two choices of variational models: a fully factorized Gaussian distribution and a variational program. The variational program generates samples by transforming aK-dimensional standard normal input with a two-layer neural network, using rectified linear activation functions and a hidden size of twice the latent dimensionality. Formally,\nthe variational program we use generates samples of z as follows:\nz0 ∼ Normal(0, I)\nh0 = ReLU(Wq0 > z0 + b q 0) h1 = ReLU(Wq1 > h0 + b q 1)\nz = Wq2 > h1 + b q 2.\nThe variational parameters are the weightsWq and biases bq . For f , we use a three-layer neural network with the same hidden size as the variational program and hyperbolic tangent activations where unit activations were bounded to have norm two. Bounding the unit norm bounds the divergence. We used the Adam optimizer [? ] with learning rates 2×10−4 for f and 2×10−5 for the variational approximation.\nThere is no standard for evaluating generative models and their inference algorithms [26]. Following Rezende et al. [23], we consider a missing data problem. We remove half of the pixels in the test set (at random) and reconstruct them from a fitted posterior predictive distribution. Table 1 summarizes the results on 100 test images; we report the log-likelihood of the completed image. ls with the variational program performs best. It is followed bykl and the simpler ls inference. The ls performs better than kl even though the model parameters were learned with kl."
    }, {
      "heading" : "5 Summary",
      "text" : "We present operator variational objectives, a broad yet tractable class of optimization problems for approximating posterior distributions. Operator objectives are built from an operator, a family of test functions, and a distance function. We outline the connection between operator objectives and existing divergences such as the KL divergence, and develop a new variational objective using the Langevin-Stein operator. In general, operator objectives produce new ways of posing variational inference.\nGiven an operator objective, we develop a black box algorithm for optimizing it and show which operators allow scalable optimization through data subsampling. Further, unlike the popular evidence lower bound, not all operators explicitly depend on the approximating density. This permits flexible approximating families, called variational programs, where the distributional form is not tractable. We demonstrate this approach on a mixture model and a factor model of images.\nThere are several possible avenues for future directions such as developing new variational objectives, adversarially learning [6] model parameters with operators, and learning model parameters with operator variational objectives.\nAcknowledgments. This work is supported by NSF IIS-1247664, ONR N00014-11-1-0651, DARPA FA8750-14-2-0009, DARPA N66001-15-C-4032, Adobe, NSERC PGS-D, Porter Ogden Jacobus Fellowship, Seibel Foundation, and the Sloan Foundation. The authors would like to thank Dawen Liang, Ben Poole, Stephan Mandt, Kevin Murphy, Christian Naesseth, and the anonymous reviews for their helpful feedback and comments."
    }, {
      "heading" : "A Technical Conditions for Langevin-Stein Operators",
      "text" : "Here we establish the conditions needed on the function class F or the posterior distribution shorthanded p for the operators to have expectation zero for all f ∈ F . W derive properties using integration by parts for supports that are bounded open sets. Then we extend the result to unbounded supports using limits. We start with the Langevin-Stein operator. Let S be the set over which we integrate and let B be its boundary. Let v be the unit normal to the surface B, and vi be the ith component of the surface normal (which is d dimensional). Then we have that∫\nS\np(OpLS f)dS = ∫ S p∇z log p>f + p∇>fdS\n= d∑ i=1 ∫ S ∂ ∂zi [p]fi + p ∂ ∂zi [fi]dS\n= d∑ i=1 ∫ S ∂ ∂zi [p]fidS + ∫ B fipvidB − ∫ S ∂ ∂zi [p]fidS\n= ∫ B v>fpdB.\nA sufficient condition for this expectation to be zero is that either p goes to zero at its boundary or that the vector field f is zero at the boundary.\nFor unbounded sets, the result can be written as a limit for a sequence of increasing sets Sn → S and a set of boundaries Bn → B using the dominated convergence theorem [4]. To use dominated convergence, we establish absolute integrability. Sufficient conditions for absolute integrability of the Langevin-Stein operator are for the gradient of log p to be bounded and the vector field f and its derivatives to be bounded. Via dominated convergence, we get that limn ∫ Bn\nv>fpdB = 0 for the Langevin-Stein operator to have expectation zero."
    }, {
      "heading" : "B Characterizing the zeros of the Langevin-Stein Operators",
      "text" : "We provide analysis on how to characterize the equivalence class of distributions defined as (Op,qf)(z) = 0. One general condition for equality in distribution comes from equality in probability on all Borel sets. We can build functions that have expectation zero with respect to the posterior that test this equality. Formally, for any Borel set A with δA being the indicator, these functions on A have the form:\nδA(z)− ∫ A p(y)dy\nWe show that if the Langevin-Stein operator satisfies L(q;OpLS,F) = 0, then q is equivalent to p in distribution. We do this by showing the above functions are in the span of OpLS. Expanding the Langevin-Stein operator we have\n(OpLS f) = p −1∇zp>f +∇>f = p−1 d∑ i=1 ∂fip ∂zi .\nSetting this equal to the desired function above yields the differential equation δA(z)− ∫ A p(y)dy = p−1(z) d∑ i=1 ∂fip ∂zi (z).\nTo solve this, set fi = 0 for all but i = 1. This yields δA(z)− ∫ A p(y)dy = p−1(z) ∂f1p ∂z1 (z),\nwhich is an ordinary differential equation with solution for f1\nfA1 (z) = 1\np(z) z1∫ −∞ p(a, z2...d) ( δA(a, z2...d)− ∫ A p(y)dy ) da.\nThis function is differentiable with respect to z1, so this gives the desired result. Plugging the function back into the operator variational objective gives\nEq [ δA(z)− ∫ A p(y)dy ] = 0 ⇐⇒ Eq[δA(z)] = Ep[δA(z)],\nfor all Borel measurable A. This implies the induced distance captures total variation."
    }, {
      "heading" : "C Operators for Discrete Variables",
      "text" : "Some operators based on Stein’s method are applicable only for latent variables in a continuous space. There are Stein operators that workwith discrete variables [1, 14]. We present one amenable to operator variational objectives based on a discrete analogue to the Langevin-Stein operator developed in [14]. For simplicity, consider a one-dimensional discrete posterior with support {0, ..., c}. Let f be a function such that f(0) = 0, then an operator can be defined as\n(Opdiscrete f)(z) = f(z + 1)p(z + 1,x)− f(z)p(z,x)\np(z,x) .\nSince the expectation of this operator with respect to the posterior p(z |x) is a telescoping sum with both endpoints 0, it has expectation zero.\nThis relates to the Langevin-Stein operator in the following. The Langevin-Stein operator in one dimension can be written as\n(OpLS f) = d dz [fp]\np .\nThis operator is the discrete analogue as the differential is replaced by a discrete difference. We can extend this operator to multiple dimensions by an ordered indexing. For example, binary numbers of length n would work for n binary latent variables."
    }, {
      "heading" : "D Proof of Universal Representations",
      "text" : "Consider the optimal form of R such that transformations of standard normal draws are equal in distribution to exact draws from the posterior. This means\nR( ;λ) = P−1(Φ( )),\nwhereΦ( ) squashes the draw from a standard normal such that it is equal in distribution to a uniform random variable. The posterior’s inverse cumulative distribution function P−1 is applied to the uniform draws. The transformed samples are now equivalent to exact samples from the posterior. For a rich-enough parameterization of R, we may hope to sufficiently approximate this function.\nIndeed, as in the universal approximation theorem of Tran et al. [28] there exists a sequence of parameters {λ1, λ2, . . .} such that the operator variational objective goes to zero, but the function class is no longer limited to local interpolation. Universal approximators like neural networks [9] also work. Further, under the assumption that p is the unique root and by satisfying the conditions described in Section B for equality in distribution, this implies that the variational program given by drawing ∼ N (0, I) and applying R( ) converges in distribution to p(z |x)."
    } ],
    "references" : [ {
      "title" : "Zero-variance principle for monte carlo algorithms",
      "author" : [ "R. Assaraf", "M. Caffarel" ],
      "venue" : "In Phys. Rev. Let",
      "citeRegEx" : "1",
      "shortCiteRegEx" : "1",
      "year" : 1999
    }, {
      "title" : "Stein’s method and poisson process convergence",
      "author" : [ "A.D. Barbour" ],
      "venue" : "Journal of Applied Probability",
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 1988
    }, {
      "title" : "The Stan Math Library: Reverse-mode automatic differentiation in C++",
      "author" : [ "B. Carpenter", "M.D. Hoffman", "M. Brubaker", "D. Lee", "P. Li", "M. Betancourt" ],
      "venue" : "arXiv preprint arXiv:1509.07164",
      "citeRegEx" : "3",
      "shortCiteRegEx" : "3",
      "year" : 2015
    }, {
      "title" : "Probability and Stochastics",
      "author" : [ "E. Cinlar" ],
      "venue" : null,
      "citeRegEx" : "4",
      "shortCiteRegEx" : "4",
      "year" : 2011
    }, {
      "title" : "Propagation algorithms for variational Bayesian learning",
      "author" : [ "Z. Ghahramani", "M. Beal" ],
      "venue" : "In NIPS",
      "citeRegEx" : "5",
      "shortCiteRegEx" : "5",
      "year" : 2001
    }, {
      "title" : "Generative adversarial nets",
      "author" : [ "I. Goodfellow", "J. Pouget-Abadie", "M. Mirza", "B. Xu", "D. Warde-Farley", "S. Ozair", "A. Courville", "Y. Bengio" ],
      "venue" : "In Neural Information Processing Systems",
      "citeRegEx" : "6",
      "shortCiteRegEx" : "6",
      "year" : 2014
    }, {
      "title" : "Black-box α-divergence Minimization",
      "author" : [ "J.M. Hernández-Lobato", "Y. Li", "M. Rowland", "D. Hernández-Lobato", "T. Bui", "R.E. Turner" ],
      "venue" : null,
      "citeRegEx" : "7",
      "shortCiteRegEx" : "7",
      "year" : 2015
    }, {
      "title" : "Stochastic variational inference",
      "author" : [ "M. Hoffman", "D. Blei", "C. Wang", "J. Paisley" ],
      "venue" : "Journal of Machine Learning Research,",
      "citeRegEx" : "8",
      "shortCiteRegEx" : "8",
      "year" : 2013
    }, {
      "title" : "Multilayer feedforward networks are universal approximators",
      "author" : [ "K. Hornik", "M. Stinchcombe", "H. White" ],
      "venue" : "Neural networks,",
      "citeRegEx" : "9",
      "shortCiteRegEx" : "9",
      "year" : 1989
    }, {
      "title" : "Estimation of non-normalized statistical models by score matching",
      "author" : [ "A. Hyvärinen" ],
      "venue" : "Journal of Machine Learning Research,",
      "citeRegEx" : "10",
      "shortCiteRegEx" : "10",
      "year" : 2005
    }, {
      "title" : "Introduction to variational methods for graphical models",
      "author" : [ "M. Jordan", "Z. Ghahramani", "T. Jaakkola", "L. Saul" ],
      "venue" : "Machine Learning,",
      "citeRegEx" : "11",
      "shortCiteRegEx" : "11",
      "year" : 1999
    }, {
      "title" : "Auto-encoding variational bayes",
      "author" : [ "D. Kingma", "M. Welling" ],
      "venue" : null,
      "citeRegEx" : "12",
      "shortCiteRegEx" : "12",
      "year" : 2014
    }, {
      "title" : "Stochastic Approximation Algorithms and Applications",
      "author" : [ "H. Kushner", "G. Yin" ],
      "venue" : null,
      "citeRegEx" : "13",
      "shortCiteRegEx" : "13",
      "year" : 1997
    }, {
      "title" : "Discrete stein characterizations and discrete information distances. arXiv preprint arXiv:1201.0143",
      "author" : [ "C. Ley", "Y. Swan" ],
      "venue" : null,
      "citeRegEx" : "14",
      "shortCiteRegEx" : "14",
      "year" : 2011
    }, {
      "title" : "Rényi divergence variational inference. arXiv preprint arXiv:1602.02311",
      "author" : [ "Y. Li", "R.E. Turner" ],
      "venue" : null,
      "citeRegEx" : "15",
      "shortCiteRegEx" : "15",
      "year" : 2016
    }, {
      "title" : "Auxiliary deep generative models",
      "author" : [ "L. Maaløe", "C.K. Sønderby", "S.K. Sønderby", "O. Winther" ],
      "venue" : "arXiv preprint arXiv:1602.05473",
      "citeRegEx" : "16",
      "shortCiteRegEx" : "16",
      "year" : 2016
    }, {
      "title" : "Expectation propagation for approximate Bayesian inference. In UAI",
      "author" : [ "T.P. Minka" ],
      "venue" : null,
      "citeRegEx" : "17",
      "shortCiteRegEx" : "17",
      "year" : 2001
    }, {
      "title" : "On the chi square and higher-order chi distances for approximating f-divergences",
      "author" : [ "F. Nielsen", "R. Nock" ],
      "venue" : "arXiv preprint arXiv:1309.3029",
      "citeRegEx" : "19",
      "shortCiteRegEx" : "19",
      "year" : 2013
    }, {
      "title" : "Hierarchical variational models",
      "author" : [ "R. Ranganath", "D. Tran", "D.M. Blei" ],
      "venue" : "In International Conference on Machine Learning",
      "citeRegEx" : "21",
      "shortCiteRegEx" : "21",
      "year" : 2016
    }, {
      "title" : "Variational inference with normalizing flows",
      "author" : [ "D.J. Rezende", "S. Mohamed" ],
      "venue" : "In Proceedings of the 31st International Conference on Machine Learning (ICML-15)",
      "citeRegEx" : "22",
      "shortCiteRegEx" : "22",
      "year" : 2015
    }, {
      "title" : "Stochastic backpropagation and approximate inference in deep generative models",
      "author" : [ "D.J. Rezende", "S. Mohamed", "D. Wierstra" ],
      "venue" : "In International Conference on Machine Learning",
      "citeRegEx" : "23",
      "shortCiteRegEx" : "23",
      "year" : 2014
    }, {
      "title" : "A stochastic approximation method",
      "author" : [ "H. Robbins", "S. Monro" ],
      "venue" : "The Annals of Mathematical Statistics,",
      "citeRegEx" : "24",
      "shortCiteRegEx" : "24",
      "year" : 1951
    }, {
      "title" : "On the quantitative analysis of deep belief networks",
      "author" : [ "R. Salakhutdinov", "I. Murray" ],
      "venue" : "In International Conference on Machine Learning",
      "citeRegEx" : "25",
      "shortCiteRegEx" : "25",
      "year" : 2008
    }, {
      "title" : "A note on the evaluation of generative models",
      "author" : [ "L. Theis", "A. van den Oord", "M. Bethge" ],
      "venue" : "In International Conference on Learning Representations",
      "citeRegEx" : "26",
      "shortCiteRegEx" : "26",
      "year" : 2016
    }, {
      "title" : "Doubly stochastic variational bayes for non-conjugate inference",
      "author" : [ "M. Titsias", "M. Lázaro-Gredilla" ],
      "venue" : "In Proceedings of the 31st International Conference on Machine Learning (ICML-14),",
      "citeRegEx" : "27",
      "shortCiteRegEx" : "27",
      "year" : 2014
    }, {
      "title" : "The variational Gaussian process",
      "author" : [ "D. Tran", "R. Ranganath", "D.M. Blei" ],
      "venue" : "In ICLR",
      "citeRegEx" : "28",
      "shortCiteRegEx" : "28",
      "year" : 2016
    } ],
    "referenceMentions" : [ {
      "referenceID" : 10,
      "context" : "Variational inference is an umbrella term for algorithms that cast Bayesian inference as optimization [11].",
      "startOffset" : 102,
      "endOffset" : 106
    }, {
      "referenceID" : 7,
      "context" : "Originally developed in the 1990s, recent advances in variational inference have scaled Bayesian computation to massive data [8], provided black box strategies for generic inference in many models [20], and enabled more accurate approximations of a model’s posterior without sacrificing efficiency [22, 21].",
      "startOffset" : 125,
      "endOffset" : 128
    }, {
      "referenceID" : 19,
      "context" : "Originally developed in the 1990s, recent advances in variational inference have scaled Bayesian computation to massive data [8], provided black box strategies for generic inference in many models [20], and enabled more accurate approximations of a model’s posterior without sacrificing efficiency [22, 21].",
      "startOffset" : 298,
      "endOffset" : 306
    }, {
      "referenceID" : 18,
      "context" : "Originally developed in the 1990s, recent advances in variational inference have scaled Bayesian computation to massive data [8], provided black box strategies for generic inference in many models [20], and enabled more accurate approximations of a model’s posterior without sacrificing efficiency [22, 21].",
      "startOffset" : 298,
      "endOffset" : 306
    }, {
      "referenceID" : 16,
      "context" : "An early example is expectation propagation (ep) [17].",
      "startOffset" : 49,
      "endOffset" : 53
    }, {
      "referenceID" : 6,
      "context" : "ep hinges on local minimization with respect to subsets of data and connects to work on α-divergence minimization [18, 7].",
      "startOffset" : 114,
      "endOffset" : 121
    }, {
      "referenceID" : 14,
      "context" : "Li and Turner [15] present a variant ofα-divergences that satisfy the full requirements of opvi.",
      "startOffset" : 14,
      "endOffset" : 18
    }, {
      "referenceID" : 9,
      "context" : "Score matching [10], a method for estimating models by matching the score function of one distribution to another that can be sampled, also falls into the class of objectives we develop.",
      "startOffset" : 15,
      "endOffset" : 19
    }, {
      "referenceID" : 4,
      "context" : "Maximizing the elbo is equivalent to minimizing the kl divergence to the posterior, and the expectations are analytic for a large class of models [5].",
      "startOffset" : 146,
      "endOffset" : 149
    }, {
      "referenceID" : 14,
      "context" : "This family includes tractable forms of familiar divergences like the kl divergence (elbo), Rényi’s α-divergence [15], and the χ-divergence [19].",
      "startOffset" : 113,
      "endOffset" : 117
    }, {
      "referenceID" : 17,
      "context" : "This family includes tractable forms of familiar divergences like the kl divergence (elbo), Rényi’s α-divergence [15], and the χ-divergence [19].",
      "startOffset" : 140,
      "endOffset" : 144
    }, {
      "referenceID" : 1,
      "context" : "When the expectation can take positive or negative values, operator variational objectives are closely related to Stein divergences [2].",
      "startOffset" : 132,
      "endOffset" : 135
    }, {
      "referenceID" : 0,
      "context" : "There are many ways to construct such classes [1, 2].",
      "startOffset" : 46,
      "endOffset" : 52
    }, {
      "referenceID" : 1,
      "context" : "There are many ways to construct such classes [1, 2].",
      "startOffset" : 46,
      "endOffset" : 52
    }, {
      "referenceID" : 1,
      "context" : "Applying the generator method of Barbour [2] to Langevin diffusion gives the operator (O ls f)(z) = ∇z log p(x, z)>f(z) +∇>f.",
      "startOffset" : 41,
      "endOffset" : 44
    }, {
      "referenceID" : 10,
      "context" : "For example, traditional variational inference minimizes the kl divergence from an approximating family to the posterior [11].",
      "startOffset" : 121,
      "endOffset" : 125
    }, {
      "referenceID" : 8,
      "context" : "In the experiments, we use neural networks, which are flexible enough to approximate a general family of test functions [9].",
      "startOffset" : 120,
      "endOffset" : 123
    }, {
      "referenceID" : 21,
      "context" : "We will use stochastic optimization [24, 13].",
      "startOffset" : 36,
      "endOffset" : 44
    }, {
      "referenceID" : 12,
      "context" : "We will use stochastic optimization [24, 13].",
      "startOffset" : 36,
      "endOffset" : 44
    }, {
      "referenceID" : 11,
      "context" : "An alternative is to use the reparameterization gradient for the second expectation [12, 23].",
      "startOffset" : 84,
      "endOffset" : 92
    }, {
      "referenceID" : 20,
      "context" : "An alternative is to use the reparameterization gradient for the second expectation [12, 23].",
      "startOffset" : 84,
      "endOffset" : 92
    }, {
      "referenceID" : 2,
      "context" : "Given a model, operator, and function class parameterization, we can use automatic differentiation to calculate the necessary gradients [3].",
      "startOffset" : 136,
      "endOffset" : 139
    }, {
      "referenceID" : 7,
      "context" : "With stochastic optimization, data subsampling scales up traditional variational inference to massive data [8, 27].",
      "startOffset" : 107,
      "endOffset" : 114
    }, {
      "referenceID" : 24,
      "context" : "With stochastic optimization, data subsampling scales up traditional variational inference to massive data [8, 27].",
      "startOffset" : 107,
      "endOffset" : 114
    }, {
      "referenceID" : 7,
      "context" : "[8] calculate unbiased estimates of the log joint density (and its gradient) by subsampling data and appropriately scaling the sum.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 11,
      "context" : "Inference with a variational program requires the family to be reparameterizable [12, 23].",
      "startOffset" : 81,
      "endOffset" : 89
    }, {
      "referenceID" : 20,
      "context" : "Inference with a variational program requires the family to be reparameterizable [12, 23].",
      "startOffset" : 81,
      "endOffset" : 89
    }, {
      "referenceID" : 15,
      "context" : "1It is possible to construct rich approximating families with kl(q||p), but this requires the introduction of an auxiliary distribution [16].",
      "startOffset" : 136,
      "endOffset" : 140
    }, {
      "referenceID" : 22,
      "context" : "We apply logistic factor analysis to analyze the binarizedMNIST data set [25], which contains 28x28 binary pixel images of handwritten digits.",
      "startOffset" : 73,
      "endOffset" : 77
    }, {
      "referenceID" : 23,
      "context" : "There is no standard for evaluating generative models and their inference algorithms [26].",
      "startOffset" : 85,
      "endOffset" : 89
    }, {
      "referenceID" : 20,
      "context" : "[23], we consider a missing data problem.",
      "startOffset" : 0,
      "endOffset" : 4
    } ],
    "year" : 2017,
    "abstractText" : "Variational inference is an umbrella term for algorithms which cast Bayesian inference as optimization. Classically, variational inference uses the Kullback-Leibler divergence to define the optimization. Though this divergence has been widely used, the resultant posterior approximation can suffer from undesirable statistical properties. To address this, we reexamine variational inference from its roots as an optimization problem. We use operators, or functions of functions, to design variational objectives. As one example, we design a variational objective with a Langevin-Stein operator. We develop a black box algorithm, operator variational inference (opvi), for optimizing any operator objective. Importantly, operators enable us to make explicit the statistical and computational tradeoffs for variational inference. We can characterize different properties of variational objectives, such as objectives that admit data subsampling—allowing inference to scale to massive data—as well as objectives that admit variational programs—a rich class of posterior approximations that does not require a tractable density. We illustrate the benefits of opvi on a mixture model and a generative model of images.",
    "creator" : "LaTeX with hyperref package"
  }
}