{
  "name" : "1610.03106.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Supervised Term Weighting Metrics for Sentiment Analysis in Short Text",
    "authors" : [ "Hussam Hamdan", "Patrice Bellot", "Frederic Bechet" ],
    "emails" : [ "hussam.hamdan@lsis.org", "patrice.bellot@lsis.org", "frederic.bechet@lif.univ-mrs.fr" ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "Polarity classification is the basic task in sentiment analysis in which the polarity of a given text should be determined, i.e. whether the expressed opinion is positive, negative or neutral. This analysis can be done at different levels of granularity: Document Level, Sentence Level or Aspect Level. Different machine learning approaches have been proposed for accomplishing this task: lexiconbased and supervised. The supervised methods have been widely used and have achieved good results since 2002.\nDocument representation is a critical component in sentiment analysis just like in information retrieval and text classification, the Vector Space Model (VSM) is one of the most popular models in which each document can be seen as a vector of independent features or terms, and each term assigned a weight according to a weighting schema. The basic weighting schema uses binary weights (w = 1 if the term is present in the document, and w = 0 if not). A better and\nar X\niv :1\n61 0.\n03 10\n6v 1\n[ cs\n.C L\n] 1\n0 O\nmuch referenced weighting schema is the tf (Term Frequency) or the tf*idf (Inverted Document Frequency) schema. Many other schemas have been proposed aiming at making the text classifiers more accurate.\nIn sentiment analysis, the early work by Pang et al. (2002) reported that binary weight schema outperforms the term frequency. More recent research has focused on more complex term weighting schemas which are usually called supervised weighting metrics as they exploit the categorical information. Some metrics have been adopted from information retrieval such as DeltaIDF (Martineau and Finin, 2009; Paltoglou and Thelwall, 2010), later on several metrics have been proposed involving those adopted from information theory and widely used in text classification such as information gain and Mutual Information (Deng et al., 2014). Recently, Wu and Gu (2014) also tested several methods adopted from information retrieval and information theory, they also proposed a new metric called natural entropy (ne) inspired from information theory.\nJust like Information Retrieval, term weight is depending on three factors:\n1. Local factor: which is a function of term frequency tf within the document.\n2. Global factor: which is a function of term frequency at the corpus level such as the document frequency.\n3. Normalization factor: which normalizes the weights in each document, the normalization can also be done for local and global factors.\nThis general definition of term weight is used in (Paltoglou and Thelwall, 2010). While Deng et al. (2014); Wu and Gu (2014) considered that a supervised term weighting schema based on two basic factors: Importance of a Term in a Document (ITD) and Importance of a Term for expressing Sentiment (ITS), the ITD is exactly the local factor, ITS is the global factor in the general definition of term weighting.\nWe can also distinguish between the unsupervised weighting methods which only use the distribution of the term in the corpus for global weight without any category information just like in information retrieval, and supervised weighting methods which use the available category information for more efficient estimation of term importance. Thus, for each term in each category we get a score, the final score should be a function of these scores such as the maximum score, the sum or the weighted sum of the term scores over the categories.\nThis study presents an empirical study of four local weighting schema and fifteen supervised global weighting schema. Theses metrics are evaluated on three datasets provided in SemEval tasks: Sentiment Analysis in Twitter (Nakov et al., 2013) and Aspect-Based Sentiment Analysis (Pontiki et al., 2015). In context of sentiment analysis, several studies have evaluated some schemas, but they all evaluated their schema using binary classification (if a given text is positive or negative) and at document level (movie reviews), they reported the results on different datasets but they did not explain the results or the behavior of each metric in order to understand why their proposed metrics improve the performance. In all these studies, Support Vector Machine (SVM) classifier has been used for evaluating the metrics.\nThe intuition beyond using these metrics is that a supervised weighting schema may give more realistic representation of a document which may improve the performance of a classifier.\nThe remaining of this study is organized as follows. Section 2 shows our research objectives. Section 3 outlines existing work concerning supervised weighting metrics in sentiment analysis. Section 4 describes the term weighting metrics. Datasets are presented in Section 5. Our experiments and analysis are discussed in section 6, and the conclusion and future work is presented in Section 7."
    }, {
      "heading" : "2 Research Objectives",
      "text" : "Different term weighting metrics have been proposed and implemented for improving the performance in text classification. To our knowledge, all these studies have either compared some existing metrics or proposed a new one. But they have not analysed these metrics, they have not provide a mathematical analysis or a statistical analysis which may explain why a certain metric can be more useful than the others. In this study, we aim to understanding why some metrics give good results while others do not. The mathematical analysis cannot provide us with any reasonable explanation. It seems that all metrics depends on the same components but each metric constitues them with its own method. Therefore, we propose to analyse the metrics statistically, we study how each metric distributes the words in the corpus and try to deduce some characteristics of the metrics which give good and bad results. Thus, given a metric and a corpus we can estimate if it is good or bad according to how it distribute the corpus. For this purpose, we study the impact of term weighting on short text sentiment analysis (sentence or aspect level), and on three-classes classification problem (positive, negative, neutral). We formulate our study to address three questions:\n1. Are the global weighting metrics useful for sentiment analysis? 2. If a global weighting metric is useful, are the local metrics useful? 3. What does make a global metric useful and how can we interpret its perfor-\nmance?"
    }, {
      "heading" : "3 Related Work",
      "text" : "Term weighting is the task of assigning scores to terms, these scores measure the importance of a term according to the objective task. A lot of term weighting methods have been proposed for Information Retrieval, all based on Salton’s definition (Salton and Buckley, 1988) where term weight is function of three factors: term frequency, inverse document frequency, and normalization.\nWhile the term weighting methods in Information Retrieval are unsupervised, many supervised methods have been proposed in Text Classification, they have proved their efficiency in many studies (Debole and Sebastiani, 2003; Forman, 2003; Ren and Sohrab, 2013; Savoy, 2013; Sebastiani, 2002).\nSupervised classification methods have been widely used for sentiment analysis, early work by Pang et al. (2002) reported that SVM outperforms other classifiers and the binary term representation also outperforms term frequency. Thus, following research has used the binary representation. Recently, research has focused on more efficient term weighting methods to improve the performance of sentiment analysis, Martineau and Finin (2009) proposed Delta tf*idf in which the final term weight is the difference between tf*idf in positive class and negative class, their experiments have been done on two-class classification. Later on, Paltoglou and Thelwall (2010) studied some variants of the classic tf*idf schema adapted to sentiment analysis which provides significant improvement in terms of accuracy. Deng et al. (2014) presented several supervised weighting metrics adopted from information theory and TC. Wu and Gu (2014) reviewed several existing weighting metrics in SA, they found that existing methods suffer from over-weighting, thus they proposed two regularization techniques, singular term cutting and bias term in addition to a new weighting metric called natural entropy (ne) adopted from information theory.\nMany other researches in Sentiment Analysis and Text Classification have studied some weighting metrics for feature selection, their objective is to reduce the feature space size by selecting the most important features. Document Frequency Difference was proposed to automatically identify the words which are more useful for classifying sentiment (Nicholls and Song, 2010). Savoy (2013) combined different weighting metrics to select the most important features. Rehman et al. (2015) have proposed a new feature ranking metric termed as relative discrimination criterion (RDC), which takes document frequencies for each term count of a term into account while estimating the usefulness of a term. Haddoud et al. (2016) have studied 96 term-weighting metrics, and among them 80 metrics have not been used. A combination method with different metrics has been shown to get better performance."
    }, {
      "heading" : "4 Term Weighting Metrics",
      "text" : "In this section, we describe the weighting metrics for sentiment analysis. Firstly, Let us denote the set of documents by D = {d1, d2, .., dn}, the set of classes C = {c1, c2, .., cm}, F = {f1, f2, ..., fr} is the vocabulary, which is set of terms in D. The document dj is represented by a bag-of-words vector: dj = (w1j , w2j , ..., wlj), where wij stands for the weight of feature fi in document dj . In our weighting methods, wij is defined as function of three factors: local weight, global weight and normalization factor. The final weight will be the product of these three components:\nwij = localweight ∗ globalweight ∗ normalization"
    }, {
      "heading" : "4.1 Local Weight",
      "text" : "Local term weight is derived from the frequency of the term within the document. Table 1 shows four local weighting metrics which have been proposed in context of Information Retrieval."
    }, {
      "heading" : "4.2 Global Weight",
      "text" : "Global term weighting metrics take into account the frequency of term in the whole collection, these metrics fall into two categories. The first one, known as unsupervised term weighting method, does not take category information into account. The second called supervised term weighting method which exploits the category information of training documents in the classification tasks. Before describing the fifteen supervised weighting metrics used in this study, we present the notation used to define these metrics, we use the words term and feature interchangeably:\nN : Number of documents in the corpus. Nc : Number of documents in the class c. Nc̄ : Number of documents out of the class c. df : Number of documents containing the feature f in whole corpus. dfc : Number of documents in class c containing the feature f. dfc̄: Number of documents out of class c containing the feature f. p(c) : The probability of the class c. p(c|f) : The probability of class c given the feature f. p(f) : The probability of the feature f in the corpus. df̄ : The number of documents which do not contain the feature f in the corpus. p(c̄|f): The complimentary probability of class c given the feature f. p(c, f) : The joint probability of the class c and the feature f. p(c, f̄): The probability of class c in the documents which do not contain the feature f. df̄ c̄ : The number of documents out of c that do not contain the feature f. tfc : The frequency of feature f in the class c. df̄c : The number of document do not contain the feature f in the class c. The formulas of the fifteen weighting metrics are illustrated in Table 2:\n1. BaseLine (bl) bl assigns 1 to the feature existing in the document and 0 to absent features, this binary representation is the baseline which we use to compare the efficiency of the other metrics.\n2. Delta Smoothed IDF (dsidf) dsidf boosts the importance of terms that are unevenly distributed between one category and other categories and discounts evenly distributed words, the original version Delta TF-IDF is presented in (Martineau and Finin, 2009),\nthe smoothed version seems to be more efficient (Paltoglou and Thelwall, 2010).\n3. Delta BM25 IDF (dbidf) dbidf is a variant of the dsidf metric, BM25-IDF variant is used instead of classical IDF (Paltoglou and Thelwall, 2010).\n4. Relevance Frequency (rf) rf boosts the terms which have high frequency in the positive category, that helps in selecting the positive samples from the negative ones Lan et al. (2009).\n5. Information Gain (ig) ig Yang and Pedersen (1997) tries to find out how well each single feature separates the given dataset. Information entropy is used to measure the uncertainty of the feature and the dataset. ig is the overall entropy of the training set minus the entropy of the feature. Thus, it measures how much the feature reduces the dataset uncertainty when it is observed.\n6. Pairwise Mutual Information (pmi) pmi is a measure of association used in information theory and statistics, it measures how much the feature associates with the class (Church and Hanks, 1990).\n7. Natural Entropy (ne) The basics beyond ne (Wu and Gu, 2014) is the more uneven the distribution of documents where a feature occurs, the larger the weight of this feature is. Thus, the entropy of the feature can express the uncertainty of the class given the feature. One minus this degree of uncertainty boosts the features those are unevenly distributed between the category and other categories. 8. Chi Square χ2 (chi) chi (Yang and Pedersen, 1997) measures the lack of independence between the feature and the category, the higher value of the χ2, the closer relationship the feature and the class have.\n9. NGL Coefficient (ngl) ngl is a variant of the Chi square metric (Ng et al., 1997). I takes the squared root of Chi after replacing df̄ c̄ with df̄c̄ and df̄c with df̄c. 10. Class Discrimination Measure (cdm) cdm measures the difference between the distribution of the feature in one class and other classes (Chen et al., 2009).\n11. Categorical Proportional Difference (cpd) cpd is a ratio that considers the number of documents of a category in which the feature occurs and the number of documents from other categories in which the feature also occurs (Simeon and Hilderman, 2008).\n12. Multinomial Z Score (zd) zd supposes that a feature follows binomial distribution, calculates Z transformation for a feature in each class, zd boosts the highly unevenly distributed features among the classes, it gives high positive score for a feature in the class where it is highly frequent and negative score in the class where it rarely appears (Hamdan et al., 2014; Savoy, 2012).\n13. Kullback-Leibler Divergence (kl) kl is a non-symmetric measure of the difference between the distribution of the category and the distribution of the category given the feature. A measure of how dissimilar the two distributions are. Useful feature value implies a high degree of dissimilarity. 14. Weighted Log Likelihood Ratio(wllr) wllr is a measure of how dissimilar are the distribution of the feature given the category and the distribution of the feature given the other categories (Nigam et al., 2000). 15. Odds Ratio (orr) orr gives a positive score to features that occur more often in one category than in the other, and a negative score if it occurs more in the other. A score of zero means the odds for a feature to occur in one category is exactly the same as the odds for it to occur in the other (Shaw, 1995)."
    }, {
      "heading" : "4.3 Normalization",
      "text" : "Document length normalization adjusts the term score in order to normalize the effect of document length on the document classification. The most known normalization factor in Information Retrieval is the cosine normalization in which each term score is divided by the square root of the sum of all squared term scores within the document.\ncosine = √ w2f1 + w 2 f2 + ...+ wfm 2"
    }, {
      "heading" : "4.4 Score Aggregation",
      "text" : "For each term in the corpus, we need one score as a weight for this term. The majority of the previous global metrics produce one score in each class for each term. Therefore, we have to apply an aggregation function to get only one score. We can apply different aggregation functions like max, min, sum or weighted sum.\nIn this study, we choose the max function which takes the maximum value of the term scores over classes, this function boosts the important terms in any class, if a term is important in positive class or negative or neutral it is more significant to give it a high score. One can think about other functions like the score of term in negative class, positive or neutral, but we think the max is the best one as it has been widely applied. And the sum function may be not efficient when the metrics produce negative and positive values, also the weighted sum, which takes into account the probability of class, but this probability has already been considered within the majority of the metrics, and therefore that may result in undesirable redundancy. Thus, the final term score can be written as following:\nscore(f) = Maxc∈C(gmetric(f, c))\nWhere gmetric is a global metrics which computes the correlation between the term f and the class c, it may be any one of the fifteen global metrics."
    }, {
      "heading" : "5 Datasets",
      "text" : "In this section, we describe the three datasets which we used for evaluating the term weighting metrics. The first one is extracted from Twitter, the second and the third are composed of sentences extracted from restaurant and laptop reviews, respectively."
    }, {
      "heading" : "5.1 Twitter Dataset",
      "text" : "This dataset consists of Twitter messages compiled for SemEval-2013 task 2 and SemEval-2014 task 9, the participants were provided with a script to download 10882 tweets annotated by their polarities (positive, negative, neutral), test set is provided for the SemEval workshop 2014. The task aims to determine whether the tweet of positive, negative, or neutral sentiment. The statistics about this dataset is shown in Table 3 #pos, #neg, #neut, #total, lAvg refer to the number positive documents, the number of negative documents, the number of neutral documents, the total number of documents, the average length of document (the average number of tokens in the document), respectively."
    }, {
      "heading" : "5.2 Restaurant and Laptop Reviews Datasets",
      "text" : "The second dataset is extracted from restaurant and laptop reviews, provided by SemEval 2015 ABSA organizers (Pontiki et al., 2015) where each review is composed of several sentences and each sentence may contain several Opinion Target Expressions. The statistics about these datasets is shown in Table 3."
    }, {
      "heading" : "6 Experiments",
      "text" : ""
    }, {
      "heading" : "6.1 Experiment Setup",
      "text" : "We only use uni-grams as features without neither word stemming nor stop word removal for the three datasets, all terms are used whatever their occurrences in\nthe corpus. Support Vector Machine (SVM) is used as classifier, SVM has been widely used in sentiment classification because its performance exceeds other machine learners (Pang et al., 2002).\nWe trained a L2-regularized L2-loss linear SVM using the implementation of LIBLINEAR (Fan et al., 2008) where all parameters are set to their default values. L2-regularized and L2-loss give a higher performance than other regularization techniques and have been used in most previous studies. For each dataset, we first tokenized the text for obtaining the terms, then we assign one score for each term with each metric, four classifiers have been trained for each dataset with each global metric scores, i.e. one classifier for each local weighting schema with each global one.\nWe normalized all scores produced from each global metric to make their values in the interval [0,1], therefore we can compare them disregarding the different intervals and the effect of negative values given by some metrics. For normalization, we applied the following formula:\nscore(t) = s−min\nmax−min\nwhere s is the original score produced by a global metric, min, max are the minimum, maximum value given by the metric, respectively."
    }, {
      "heading" : "6.2 Experiment Evaluations",
      "text" : "1. Twitter Dataset Table 4 reports the F1-scores of all combinations of global and local weighting metrics in Twitter dataset. The baseline bl*tp, which refers to the binary representation of tweets has obtained 58.64%. We will firstly discuss if the global weighting metrics can improve the baseline, then for those global ones which seem to give good results, we discuss if the local metrics work well. The majority of global metrics improve the performance, cdm, rf, wllr, kl, dsidf give more than 62% while zd, orr, ngl, dbidf give more than 61%, pmi and ne are close to the baseline but a little better, the remaining metrics do not improve the results but also they are not too far from the baseline such as ig, chi. Regarding the local metrics, for the baseline run, bl*atf improves the results. For other global metrics which their tp weighting improves the baseline, tf often improves the tp except pmi, dbidf, cdm. logtf also improves the tp except with cpd, dbidf, pmi, but the atf weighting schema always gives the best results over all good metrics which improve the baseline. Thus, we can conclude that most metrics improve the performance with tp local weighting, and those who improve the bl*tp produce the best results when using the atf local weighting. wllr*atf, cdm*atf, rf*atf produce the best F1-score of 63.33%, 63.01%, 63%, respectively. The idea behind all global metrics is to discriminate the terms which are unevenly distributed over the classes, the max aggregation function will take the max value produced by each metric for each term, and therefore the final score for each term is expected to be high if the term is important in one class else if it is not important in all classes its value will be small, and the terms which occur similarly in the corpus will have different values in function of a global metric because they have different distributions over the classes in the corpus. For understanding the behavior of each global weighting metric and being able to interpret its performance in Twitter dataset, we analyzed the distribution of term scores in function of their frequencies in whole corpus. Thus, we illustrate in Figure 1 how each global metric distributes the terms, fifteen diagram are drawn, one for each global metric with the max aggregation function. X-axis represents the frequencies in the corpus, while Y-axis represents the final score of each term. For example, the point (1, 0.5) refers to a term w which is repeated one time in the corpus and has 0.5 in function of a global metric. As ig and chi have produced the lowest results, we observe their distributions firstly. It seems that they have a narrow distribution and the mean value for y-axis is close to Zero. Therefore, it is more probable that the narrow distribution is an indicator of an inefficient metric because it badly discriminates the terms and has several outliers. wllr has also narrow distribution in spite of its good performance, but its mean value is far from zero. Thus, a metric with a narrow distribution and a mean value close to zero seems to be a bad one, therefore we can give an explanation of why the bias term has been efficient in (Wu and Gu, 2014) where the authors found that adding a bias\nterm to the score can improve the results and their results show that ne without this regularization produces bad results in some datasets.\nTo provide some statistical evidences to our observations, we compute three measurements for each metric:\n– meany : the mean value of the y-values produced by the metric.\n– sumstd : we first compute the standard deviation for each frequency at X-axis in Figure 3.1. For example, the standard deviation of the terms which have the frequency of 8 in the corpus. Then, we sum the standard deviation of all frequencies. This sumstd score designates how each global metric distributes the terms which have the same occurrence. If the metric produces scores very close and centered around the mean value, the sumstd will be small.\n– stdy : the standard deviation of y-values produced by the metric which measures if the distribution is narrow or wide. If the metric produces scores very close and centered around the mean value, the sumstd will be small. If the two measurements sumstd and stdy give small values, the distribution tends to be centered around the meany value. Table 4 shows for each metric the meany, sumstd and stdy. We remark that wllr, ig and chi have small values for textitsumstd and stdy and therefore a distribution centered around their meany .\n2. Restaurant Dataset Table 5 shows the F1-scores of all combinations of local and global weighting metrics in Restaurant dataset. The baseline bl*tp, which refers to the binary representation has obtained 63.42%. Like with Twitter set, we will firstly discuss if the global weighting metrics can improve the baseline, then for those global ones which seem to give good results, we discuss if the local metrics work well. The majority of metrics improve the performance, kl gives F1-score more than 65%, wllr, rf, cdm, ngl, cpd, zd give more than 64% while orr, dbidf give more than 63% but they still higher than bl, the other metrics decrease the performance however we should note that pmi and ne are still close to the baseline while ig, chi, dsidf are lower by 2% or 3%. Regarding local metrics, for the baseline, tf produces the best result. For other metrics which improve the baseline, atf often improves the tp except with bl and dbidf. logtf always improves but the tf weighting schema always gives the best results over all metrics except rf.\nThus, the most metrics improve the performance with tp local weighting, and those who improve the bl*tp produce the best results when using the tf weighting. cpd*tf, zd*tf, ngl*tf, rf*tf, rf*logtf produce the best F1-score of 66.80%, 66.27%, 66.27%, 66.04%, 66.21%, respectively.\nLike for Twitter, Figure 3.2 shows the distribution of each metric over the dataset.\n3. Laptop Dataset\nTable 6 displays the F1-scores of all combinations of local and global weighting metrics in laptop dataset. The baseline bl*tp, which refers to the binary representation has obtained 69.33%. Like with Twitter and Restaurant sets, we will firstly discuss if the global weighting metrics can improve the base-\nline, then for those global ones which seem to give good results, we discuss if the local metrics work well. The majority of metrics improve the performance, dsidf and ne give F1-score more than 71%, dbidf and rf give more than 70% while pmi, kl, wllr, orr, ngl and zd give more than 69% but they are still higher than bl, the other metrics decrease the performance however we should note that ig, chi, cpd are still close to the baseline.\nRegarding local metrics, for the baseline, tf produces the best result. For other metrics which improve the baseline, atf often improves the tp except with dbidf. logtf always improves but the atf weighting schema always gives the best results over all metrics except rf. dsidf*atf and ne*atf give the best results 72.02%, 71.71%, respectively. Thus, most metrics improve the performance with tp local weighting, and those who improve the bl*tp produce the best results when using the tf or atf weighting. Like for Twitter and restaurant reviews, Figure 3.3 shows the distribution of each metric over the laptop dataset.\nThus, we can answer the questions of our research, can the global and local weighting schema improve the performance of a classifier? Obviously, the answer is yes, we point out that most global metrics improve the simple binary representation performance. We cannot conclude that there is always a metric which achieve the best result but it is more probably that some metrics always work well, the bad metrics are those who have narrow distribution and means\nclose to zero. The local metrics seem to be influential in Twitter and Restaurant but not so influential in Laptop, we note that rf is always among the best metrics over all the datasets."
    }, {
      "heading" : "7 Conclusion and Future Work",
      "text" : "This study is an evaluation of supervised term weighting metrics for sentiment analysis in short text. We have studied fifteen different metrics of global weighting and four local weighting metrics. Three datasets are used for the evaluation. While our experimental results reveal that these metrics improve the polarity classification, there is no best choice for all datasets, several global metrics seem to work well with all datasets such as rf, kl, wllr, and the local metrics often improve the performance especially tf and atf. We have analysed how each metric\ndistributes the corpus in order to deduce the characteristics of the good and bad metrics. We have found that the bad metrics tend to have a narrow distribution with a mean value nearby to zero but we could not deduce some common characteristics among the metrics which give the best results.\nIn future work, we will investigate the normalization and the combination of term weighting metrics. Combining different metrics could be more effective than one, because it can use complementary information of the discriminating power of a term. And normalization can derease the difference in performance between the datasets with long and short document average length."
    } ],
    "references" : [ {
      "title" : "Feature selection for text classification with Näıve Bayes",
      "author" : [ "J. Chen", "H. Huang", "S. Tian", "Y. Qu" ],
      "venue" : "Expert Systems with Applications,",
      "citeRegEx" : "Chen et al\\.,? \\Q2009\\E",
      "shortCiteRegEx" : "Chen et al\\.",
      "year" : 2009
    }, {
      "title" : "Word Association Norms, Mutual Information, and Lexicography",
      "author" : [ "K.W. Church", "P. Hanks" ],
      "venue" : null,
      "citeRegEx" : "Church and Hanks,? \\Q1990\\E",
      "shortCiteRegEx" : "Church and Hanks",
      "year" : 1990
    }, {
      "title" : "Supervised Term Weighting for Automated Text Categorization",
      "author" : [ "F. Debole", "F. Sebastiani" ],
      "venue" : "In Proceedings of the 2003 ACM Symposium on Applied Computing,",
      "citeRegEx" : "Debole and Sebastiani,? \\Q2003\\E",
      "shortCiteRegEx" : "Debole and Sebastiani",
      "year" : 2003
    }, {
      "title" : "A study of supervised term weighting scheme for sentiment analysis",
      "author" : [ "Deng", "Z.-H", "Luo", "K.-H", "Yu", "H.-L" ],
      "venue" : "Expert Systems with Applications,",
      "citeRegEx" : "Deng et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Deng et al\\.",
      "year" : 2014
    }, {
      "title" : "LIBLINEAR: A Library for Large Linear Classification",
      "author" : [ "Fan", "R.-E", "Chang", "K.-W", "Hsieh", "C.-J", "Wang", "X.-R", "Lin" ],
      "venue" : "Journal of Machine Learning Research,",
      "citeRegEx" : "Fan et al\\.,? \\Q2008\\E",
      "shortCiteRegEx" : "Fan et al\\.",
      "year" : 2008
    }, {
      "title" : "An Extensive Empirical Study of Feature Selection Metrics for Text Classification",
      "author" : [ "G. Forman" ],
      "venue" : "Journal of Machine Learning Research,",
      "citeRegEx" : "Forman,? \\Q2003\\E",
      "shortCiteRegEx" : "Forman",
      "year" : 2003
    }, {
      "title" : "Combining supervised term-weighting metrics for SVM text classification with extended term representation",
      "author" : [ "M. Haddoud", "A. Mokhtari", "T. Lecroq", "S. Abdeddäım" ],
      "venue" : "Knowledge and Information Systems,",
      "citeRegEx" : "Haddoud et al\\.,? \\Q2016\\E",
      "shortCiteRegEx" : "Haddoud et al\\.",
      "year" : 2016
    }, {
      "title" : "The Impact of Z score on Twitter Sentiment Analysis",
      "author" : [ "H. Hamdan", "P. Bellot", "F. Bechet" ],
      "venue" : "Proceedings of the Eighth International Workshop on Semantic Evaluation (SemEval",
      "citeRegEx" : "Hamdan et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Hamdan et al\\.",
      "year" : 2014
    }, {
      "title" : "Supervised and Traditional Term Weighting Methods for Automatic Text Categorization",
      "author" : [ "M. Lan", "C.L. Tan", "J. Su", "Y. Lu" ],
      "venue" : "IEEE Trans. Pattern Anal. Mach. Intell.,",
      "citeRegEx" : "Lan et al\\.,? \\Q2009\\E",
      "shortCiteRegEx" : "Lan et al\\.",
      "year" : 2009
    }, {
      "title" : "Delta TFIDF: An Improved Feature Space for Sentiment Analysis",
      "author" : [ "J. Martineau", "T. Finin" ],
      "venue" : "In ICWSM,",
      "citeRegEx" : "Martineau and Finin,? \\Q2009\\E",
      "shortCiteRegEx" : "Martineau and Finin",
      "year" : 2009
    }, {
      "title" : "SemEval-2013 Task 2: Sentiment Analysis in Twitter",
      "author" : [ "P. Nakov", "S. Rosenthal", "Z. Kozareva", "V. Stoyanov", "A. Ritter", "T. Wilson" ],
      "venue" : "In Second Joint Conference on Lexical and Computational Semantics (*SEM),",
      "citeRegEx" : "Nakov et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Nakov et al\\.",
      "year" : 2013
    }, {
      "title" : "Feature Selection, Perceptron Learning, and a Usability Case Study for Text Categorization",
      "author" : [ "H.T. Ng", "W.B. Goh", "K.L. Low" ],
      "venue" : "In Proceedings of the 20th Annual International ACM SIGIR Conference on Research and Development in Information Retrieval,",
      "citeRegEx" : "Ng et al\\.,? \\Q1997\\E",
      "shortCiteRegEx" : "Ng et al\\.",
      "year" : 1997
    }, {
      "title" : "Comparison of Feature Selection Methods for Sentiment Analysis",
      "author" : [ "C. Nicholls", "F. Song" ],
      "venue" : "Advances in Artificial Intelligence,",
      "citeRegEx" : "Nicholls and Song,? \\Q2010\\E",
      "shortCiteRegEx" : "Nicholls and Song",
      "year" : 2010
    }, {
      "title" : "Text Classification from Labeled and Unlabeled Documents Using EM",
      "author" : [ "K. Nigam", "A.K. McCallum", "S. Thrun", "T. Mitchell" ],
      "venue" : "Machine Learning,",
      "citeRegEx" : "Nigam et al\\.,? \\Q2000\\E",
      "shortCiteRegEx" : "Nigam et al\\.",
      "year" : 2000
    }, {
      "title" : "A Study of Information Retrieval Weighting Schemes for Sentiment Analysis",
      "author" : [ "G. Paltoglou", "M. Thelwall" ],
      "venue" : "In Proceedings of the 48th Annual Meeting of the Association for Computational Linguistics,",
      "citeRegEx" : "Paltoglou and Thelwall,? \\Q2010\\E",
      "shortCiteRegEx" : "Paltoglou and Thelwall",
      "year" : 2010
    }, {
      "title" : "Thumbs Up?: Sentiment Classification Using Machine Learning Techniques",
      "author" : [ "B. Pang", "L. Lee", "S. Vaithyanathan" ],
      "venue" : "In Proceedings of the ACL-02 Conference on Empirical Methods in Natural Language Processing - Volume 10,",
      "citeRegEx" : "Pang et al\\.,? \\Q2002\\E",
      "shortCiteRegEx" : "Pang et al\\.",
      "year" : 2002
    }, {
      "title" : "SemEval-2015 Task 12: Aspect Based Sentiment Analysis",
      "author" : [ "M. Pontiki", "D. Galanis", "H. Papageogiou", "S. Manandhar", "I. Androutsopoulos" ],
      "venue" : "Proceedings of the 9th International Workshop on Semantic Evaluation (SemEval",
      "citeRegEx" : "Pontiki et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Pontiki et al\\.",
      "year" : 2015
    }, {
      "title" : "Relative discrimination criterion - A novel feature ranking method for text data",
      "author" : [ "A. Rehman", "K. Javed", "H.A. Babri", "M. Saeed" ],
      "venue" : "Expert Systems with Applications,",
      "citeRegEx" : "Rehman et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Rehman et al\\.",
      "year" : 2015
    }, {
      "title" : "Class-indexing-based term weighting for automatic text classification",
      "author" : [ "F. Ren", "M.G. Sohrab" ],
      "venue" : "Information Sciences,",
      "citeRegEx" : "Ren and Sohrab,? \\Q2013\\E",
      "shortCiteRegEx" : "Ren and Sohrab",
      "year" : 2013
    }, {
      "title" : "Term-weighting approaches in automatic text retrieval",
      "author" : [ "G. Salton", "C. Buckley" ],
      "venue" : "Information Processing & Management,",
      "citeRegEx" : "Salton and Buckley,? \\Q1988\\E",
      "shortCiteRegEx" : "Salton and Buckley",
      "year" : 1988
    }, {
      "title" : "Authorship Attribution Based on Specific Vocabulary",
      "author" : [ "J. Savoy" ],
      "venue" : "Transactions on Information Systems (TOIS),",
      "citeRegEx" : "Savoy,? \\Q2012\\E",
      "shortCiteRegEx" : "Savoy",
      "year" : 2012
    }, {
      "title" : "Feature Selections for Authorship Attribution",
      "author" : [ "J. Savoy" ],
      "venue" : "In Proceedings of the 28th Annual ACM Symposium on Applied Computing,",
      "citeRegEx" : "Savoy,? \\Q2013\\E",
      "shortCiteRegEx" : "Savoy",
      "year" : 2013
    }, {
      "title" : "Machine Learning in Automated Text Categorization",
      "author" : [ "F. Sebastiani" ],
      "venue" : "Computing Surveys (CSUR),",
      "citeRegEx" : "Sebastiani,? \\Q2002\\E",
      "shortCiteRegEx" : "Sebastiani",
      "year" : 2002
    }, {
      "title" : "Term-relevance Computations and Perfect Retrieval Performance",
      "author" : [ "Shaw", "W.M. Jr." ],
      "venue" : "IInformation Processing and Management,",
      "citeRegEx" : "Shaw and Jr.,? \\Q1995\\E",
      "shortCiteRegEx" : "Shaw and Jr.",
      "year" : 1995
    }, {
      "title" : "Categorical Proportional Difference: A Feature Selection Method for Text Categorization",
      "author" : [ "M. Simeon", "R. Hilderman" ],
      "venue" : "In Proceedings of the 7th Australasian Data Mining Conference - Volume 87,",
      "citeRegEx" : "Simeon and Hilderman,? \\Q2008\\E",
      "shortCiteRegEx" : "Simeon and Hilderman",
      "year" : 2008
    }, {
      "title" : "Reducing Over-Weighting in Supervised Term Weighting for Sentiment Analysis",
      "author" : [ "H. Wu", "X. Gu" ],
      "venue" : "COLING",
      "citeRegEx" : "Wu and Gu,? \\Q2014\\E",
      "shortCiteRegEx" : "Wu and Gu",
      "year" : 2014
    }, {
      "title" : "A Comparative Study on Feature Selection in Text Categorization",
      "author" : [ "Y. Yang", "J.O. Pedersen" ],
      "venue" : "In Proceedings of the Fourteenth International Conference on Machine Learning,",
      "citeRegEx" : "Yang and Pedersen,? \\Q1997\\E",
      "shortCiteRegEx" : "Yang and Pedersen",
      "year" : 1997
    } ],
    "referenceMentions" : [ {
      "referenceID" : 9,
      "context" : "Some metrics have been adopted from information retrieval such as DeltaIDF (Martineau and Finin, 2009; Paltoglou and Thelwall, 2010), later on several metrics have been proposed involving those adopted from information theory and widely used in text classification such as information gain and Mutual Information (Deng et al.",
      "startOffset" : 75,
      "endOffset" : 132
    }, {
      "referenceID" : 14,
      "context" : "Some metrics have been adopted from information retrieval such as DeltaIDF (Martineau and Finin, 2009; Paltoglou and Thelwall, 2010), later on several metrics have been proposed involving those adopted from information theory and widely used in text classification such as information gain and Mutual Information (Deng et al.",
      "startOffset" : 75,
      "endOffset" : 132
    }, {
      "referenceID" : 3,
      "context" : "Some metrics have been adopted from information retrieval such as DeltaIDF (Martineau and Finin, 2009; Paltoglou and Thelwall, 2010), later on several metrics have been proposed involving those adopted from information theory and widely used in text classification such as information gain and Mutual Information (Deng et al., 2014).",
      "startOffset" : 313,
      "endOffset" : 332
    }, {
      "referenceID" : 12,
      "context" : "In sentiment analysis, the early work by Pang et al. (2002) reported that binary weight schema outperforms the term frequency.",
      "startOffset" : 41,
      "endOffset" : 60
    }, {
      "referenceID" : 3,
      "context" : "Some metrics have been adopted from information retrieval such as DeltaIDF (Martineau and Finin, 2009; Paltoglou and Thelwall, 2010), later on several metrics have been proposed involving those adopted from information theory and widely used in text classification such as information gain and Mutual Information (Deng et al., 2014). Recently, Wu and Gu (2014) also tested several methods adopted from information retrieval and information theory, they also proposed a new metric called natural entropy (ne) inspired from information theory.",
      "startOffset" : 314,
      "endOffset" : 361
    }, {
      "referenceID" : 14,
      "context" : "This general definition of term weight is used in (Paltoglou and Thelwall, 2010).",
      "startOffset" : 50,
      "endOffset" : 80
    }, {
      "referenceID" : 3,
      "context" : "While Deng et al. (2014); Wu and Gu (2014) considered that a supervised term weighting schema based on two basic factors: Importance of a Term in a Document (ITD) and Importance of a Term for expressing Sentiment (ITS), the ITD is exactly the local factor, ITS is the global factor in the general definition of term weighting.",
      "startOffset" : 6,
      "endOffset" : 25
    }, {
      "referenceID" : 3,
      "context" : "While Deng et al. (2014); Wu and Gu (2014) considered that a supervised term weighting schema based on two basic factors: Importance of a Term in a Document (ITD) and Importance of a Term for expressing Sentiment (ITS), the ITD is exactly the local factor, ITS is the global factor in the general definition of term weighting.",
      "startOffset" : 6,
      "endOffset" : 43
    }, {
      "referenceID" : 10,
      "context" : "Theses metrics are evaluated on three datasets provided in SemEval tasks: Sentiment Analysis in Twitter (Nakov et al., 2013) and Aspect-Based Sentiment Analysis (Pontiki et al.",
      "startOffset" : 104,
      "endOffset" : 124
    }, {
      "referenceID" : 16,
      "context" : ", 2013) and Aspect-Based Sentiment Analysis (Pontiki et al., 2015).",
      "startOffset" : 44,
      "endOffset" : 66
    }, {
      "referenceID" : 19,
      "context" : "A lot of term weighting methods have been proposed for Information Retrieval, all based on Salton’s definition (Salton and Buckley, 1988) where term weight is function of three factors: term frequency, inverse document frequency, and normalization.",
      "startOffset" : 111,
      "endOffset" : 137
    }, {
      "referenceID" : 2,
      "context" : "While the term weighting methods in Information Retrieval are unsupervised, many supervised methods have been proposed in Text Classification, they have proved their efficiency in many studies (Debole and Sebastiani, 2003; Forman, 2003; Ren and Sohrab, 2013; Savoy, 2013; Sebastiani, 2002).",
      "startOffset" : 193,
      "endOffset" : 289
    }, {
      "referenceID" : 5,
      "context" : "While the term weighting methods in Information Retrieval are unsupervised, many supervised methods have been proposed in Text Classification, they have proved their efficiency in many studies (Debole and Sebastiani, 2003; Forman, 2003; Ren and Sohrab, 2013; Savoy, 2013; Sebastiani, 2002).",
      "startOffset" : 193,
      "endOffset" : 289
    }, {
      "referenceID" : 18,
      "context" : "While the term weighting methods in Information Retrieval are unsupervised, many supervised methods have been proposed in Text Classification, they have proved their efficiency in many studies (Debole and Sebastiani, 2003; Forman, 2003; Ren and Sohrab, 2013; Savoy, 2013; Sebastiani, 2002).",
      "startOffset" : 193,
      "endOffset" : 289
    }, {
      "referenceID" : 21,
      "context" : "While the term weighting methods in Information Retrieval are unsupervised, many supervised methods have been proposed in Text Classification, they have proved their efficiency in many studies (Debole and Sebastiani, 2003; Forman, 2003; Ren and Sohrab, 2013; Savoy, 2013; Sebastiani, 2002).",
      "startOffset" : 193,
      "endOffset" : 289
    }, {
      "referenceID" : 22,
      "context" : "While the term weighting methods in Information Retrieval are unsupervised, many supervised methods have been proposed in Text Classification, they have proved their efficiency in many studies (Debole and Sebastiani, 2003; Forman, 2003; Ren and Sohrab, 2013; Savoy, 2013; Sebastiani, 2002).",
      "startOffset" : 193,
      "endOffset" : 289
    }, {
      "referenceID" : 12,
      "context" : "Supervised classification methods have been widely used for sentiment analysis, early work by Pang et al. (2002) reported that SVM outperforms other classifiers and the binary term representation also outperforms term frequency.",
      "startOffset" : 94,
      "endOffset" : 113
    }, {
      "referenceID" : 8,
      "context" : "Recently, research has focused on more efficient term weighting methods to improve the performance of sentiment analysis, Martineau and Finin (2009) proposed Delta tf*idf in which the final term weight is the difference between tf*idf in positive class and negative class, their experiments have been done on two-class classification.",
      "startOffset" : 122,
      "endOffset" : 149
    }, {
      "referenceID" : 8,
      "context" : "Recently, research has focused on more efficient term weighting methods to improve the performance of sentiment analysis, Martineau and Finin (2009) proposed Delta tf*idf in which the final term weight is the difference between tf*idf in positive class and negative class, their experiments have been done on two-class classification. Later on, Paltoglou and Thelwall (2010) studied some variants of the classic tf*idf schema adapted to sentiment analysis which provides significant improvement in terms of accuracy.",
      "startOffset" : 122,
      "endOffset" : 375
    }, {
      "referenceID" : 3,
      "context" : "Deng et al. (2014) presented several supervised weighting metrics adopted from information theory and TC.",
      "startOffset" : 0,
      "endOffset" : 19
    }, {
      "referenceID" : 3,
      "context" : "Deng et al. (2014) presented several supervised weighting metrics adopted from information theory and TC. Wu and Gu (2014) reviewed several existing weighting metrics in SA, they found that existing methods suffer from over-weighting, thus they proposed two regularization techniques, singular term cutting and bias term in addition to a new weighting metric called natural entropy (ne) adopted from information theory.",
      "startOffset" : 0,
      "endOffset" : 123
    }, {
      "referenceID" : 12,
      "context" : "Document Frequency Difference was proposed to automatically identify the words which are more useful for classifying sentiment (Nicholls and Song, 2010).",
      "startOffset" : 127,
      "endOffset" : 152
    }, {
      "referenceID" : 11,
      "context" : "Document Frequency Difference was proposed to automatically identify the words which are more useful for classifying sentiment (Nicholls and Song, 2010). Savoy (2013) combined different weighting metrics to select the most important features.",
      "startOffset" : 128,
      "endOffset" : 167
    }, {
      "referenceID" : 11,
      "context" : "Document Frequency Difference was proposed to automatically identify the words which are more useful for classifying sentiment (Nicholls and Song, 2010). Savoy (2013) combined different weighting metrics to select the most important features. Rehman et al. (2015) have proposed a new feature ranking metric termed as relative discrimination criterion (RDC), which takes document frequencies for each term count of a term into account while estimating the usefulness of a term.",
      "startOffset" : 128,
      "endOffset" : 264
    }, {
      "referenceID" : 6,
      "context" : "Haddoud et al. (2016) have studied 96 term-weighting metrics, and among them 80 metrics have not been used.",
      "startOffset" : 0,
      "endOffset" : 22
    }, {
      "referenceID" : 9,
      "context" : "Delta Smoothed IDF (dsidf) dsidf boosts the importance of terms that are unevenly distributed between one category and other categories and discounts evenly distributed words, the original version Delta TF-IDF is presented in (Martineau and Finin, 2009),",
      "startOffset" : 226,
      "endOffset" : 253
    }, {
      "referenceID" : 14,
      "context" : "the smoothed version seems to be more efficient (Paltoglou and Thelwall, 2010).",
      "startOffset" : 48,
      "endOffset" : 78
    }, {
      "referenceID" : 14,
      "context" : "Delta BM25 IDF (dbidf) dbidf is a variant of the dsidf metric, BM25-IDF variant is used instead of classical IDF (Paltoglou and Thelwall, 2010).",
      "startOffset" : 113,
      "endOffset" : 143
    }, {
      "referenceID" : 8,
      "context" : "Relevance Frequency (rf) rf boosts the terms which have high frequency in the positive category, that helps in selecting the positive samples from the negative ones Lan et al. (2009).",
      "startOffset" : 165,
      "endOffset" : 183
    }, {
      "referenceID" : 26,
      "context" : "Information Gain (ig) ig Yang and Pedersen (1997) tries to find out how well each single feature separates the given dataset.",
      "startOffset" : 25,
      "endOffset" : 50
    }, {
      "referenceID" : 1,
      "context" : "Pairwise Mutual Information (pmi) pmi is a measure of association used in information theory and statistics, it measures how much the feature associates with the class (Church and Hanks, 1990).",
      "startOffset" : 168,
      "endOffset" : 192
    }, {
      "referenceID" : 25,
      "context" : "Natural Entropy (ne) The basics beyond ne (Wu and Gu, 2014) is the more uneven the distribution of documents where a feature occurs, the larger the weight of this feature is.",
      "startOffset" : 42,
      "endOffset" : 59
    }, {
      "referenceID" : 26,
      "context" : "Chi Square χ (chi) chi (Yang and Pedersen, 1997) measures the lack of independence between the feature and the category, the higher value of the χ, the closer relationship the feature and the class have.",
      "startOffset" : 23,
      "endOffset" : 48
    }, {
      "referenceID" : 11,
      "context" : "NGL Coefficient (ngl) ngl is a variant of the Chi square metric (Ng et al., 1997).",
      "startOffset" : 64,
      "endOffset" : 81
    }, {
      "referenceID" : 0,
      "context" : "Class Discrimination Measure (cdm) cdm measures the difference between the distribution of the feature in one class and other classes (Chen et al., 2009).",
      "startOffset" : 134,
      "endOffset" : 153
    }, {
      "referenceID" : 24,
      "context" : "Categorical Proportional Difference (cpd) cpd is a ratio that considers the number of documents of a category in which the feature occurs and the number of documents from other categories in which the feature also occurs (Simeon and Hilderman, 2008).",
      "startOffset" : 221,
      "endOffset" : 249
    }, {
      "referenceID" : 7,
      "context" : "Multinomial Z Score (zd) zd supposes that a feature follows binomial distribution, calculates Z transformation for a feature in each class, zd boosts the highly unevenly distributed features among the classes, it gives high positive score for a feature in the class where it is highly frequent and negative score in the class where it rarely appears (Hamdan et al., 2014; Savoy, 2012).",
      "startOffset" : 350,
      "endOffset" : 384
    }, {
      "referenceID" : 20,
      "context" : "Multinomial Z Score (zd) zd supposes that a feature follows binomial distribution, calculates Z transformation for a feature in each class, zd boosts the highly unevenly distributed features among the classes, it gives high positive score for a feature in the class where it is highly frequent and negative score in the class where it rarely appears (Hamdan et al., 2014; Savoy, 2012).",
      "startOffset" : 350,
      "endOffset" : 384
    }, {
      "referenceID" : 13,
      "context" : "Weighted Log Likelihood Ratio(wllr) wllr is a measure of how dissimilar are the distribution of the feature given the category and the distribution of the feature given the other categories (Nigam et al., 2000).",
      "startOffset" : 190,
      "endOffset" : 210
    }, {
      "referenceID" : 16,
      "context" : "The second dataset is extracted from restaurant and laptop reviews, provided by SemEval 2015 ABSA organizers (Pontiki et al., 2015) where each review is composed of several sentences and each sentence may contain several Opinion Target Expressions.",
      "startOffset" : 109,
      "endOffset" : 131
    }, {
      "referenceID" : 15,
      "context" : "Support Vector Machine (SVM) is used as classifier, SVM has been widely used in sentiment classification because its performance exceeds other machine learners (Pang et al., 2002).",
      "startOffset" : 160,
      "endOffset" : 179
    }, {
      "referenceID" : 4,
      "context" : "We trained a L2-regularized L2-loss linear SVM using the implementation of LIBLINEAR (Fan et al., 2008) where all parameters are set to their default values.",
      "startOffset" : 85,
      "endOffset" : 103
    }, {
      "referenceID" : 25,
      "context" : "Thus, a metric with a narrow distribution and a mean value close to zero seems to be a bad one, therefore we can give an explanation of why the bias term has been efficient in (Wu and Gu, 2014) where the authors found that adding a bias",
      "startOffset" : 176,
      "endOffset" : 193
    } ],
    "year" : 2016,
    "abstractText" : "Term weighting metrics assign weights to terms in order to discriminate the important terms from the less crucial ones. Due to this characteristic, these metrics have attracted growing attention in text classification and recently in sentiment analysis. Using the weights given by such metrics could lead to more accurate document representation which may improve the performance of the classification. While previous studies have focused on proposing or comparing different weighting metrics at two-classes document level sentiment analysis, this study propose to analyse the results given by each metric in order to find out the characteristics of good and bad weighting metrics. Therefore we present an empirical study of fifteen global supervised weighting metrics with four local weighting metrics adopted from information retrieval, we also give an analysis to understand the behavior of each metric by observing and analysing how each metric distributes the terms and deduce some characteristics which may distinguish the good and bad metrics. The evaluation has been done using Support Vector Machine on three different datasets: Twitter, restaurant and laptop reviews.",
    "creator" : "LaTeX with hyperref package"
  }
}