{
  "name" : "1611.06439.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "A Survey of Credit Card Fraud Detection Techniques: Data and Technique Oriented Perspective",
    "authors" : [ "Zahra Zojaji", "Reza Ebrahimi Atani", "Amir Hassan Monadjemi" ],
    "emails" : [ "sorournejad@yahoo.com", "z.zojaji@aut.ac.ir", "rebrahimi@guilan.ac.ir", "monadjemi@eng.ui.ac.ir" ],
    "sections" : [ {
      "heading" : null,
      "text" : "Credit card plays a very important rule in today's economy. It becomes an unavoidable part of household, business and global activities. Although using credit cards provides enormous benefits when used carefully and responsibly,significant credit and financial damagesmay be causedby fraudulent activities. Many techniques have been proposed to confront thegrowthin credit card fraud. However, all of these techniques have the same goal of avoiding the credit card fraud; each one has its own drawbacks, advantages and characteristics. In this paper, after investigating difficultiesof credit card fraud detection, we seek to review the state of the art in credit card fraud detection techniques, datasets and evaluation criteria.The advantages and disadvantages of fraud detection methods are enumerated and compared.Furthermore, a classification of mentioned techniques into two main fraud detection approaches, namely, misuses (supervised) and anomaly detection (unsupervised) is presented. Again, a classification of techniques is proposed based on capability to process the numerical and categorical datasets. Different datasets used in literatureare then described and grouped into real and synthesized data and the effective and common attributesare extracted for further usage.Moreover, evaluation employed criterions in literature are collected and discussed.Consequently, open issues for credit card fraud detection are explained as guidelinesfor new researchers.\nKeywords: Credit Card, Fraud Classification, Fraud Detection Techniques"
    }, {
      "heading" : "1. Introduction",
      "text" : "At the current state of the world, financial organizations expand the availability of financial facilitiesbyemployingof innovative servicessuch ascredit cards, Automated Teller Machines (ATM), internet and mobile banking services. Besides, along with the rapid advances of e-commerce,the use of credit card has become a convenience and necessary part of financial life. Credit card is a payment cardsupplied to customers as a system of payment. There are lots of advantages in usingcredit cards such as:\n Ease of purchase\nCredit cards can make life easier. They allow customers to purchase on credit in arbitrary time, location and amount, without carrying the cash.Provide a convenient payment method for purchases made on the internet, over the telephone, through ATMs, etc.\n Keep customer credit history\nHaving a good credit history is often important in detecting loyal customers. This history is valuable not only for credit cards, but also for other financial serviceslike loans, rental applications, or even some jobs. Lenders and issuers of creditmortgage companies, credit card companies, retail stores, and utility companies can review customer credit score and history to see how punctualand responsible customers are in paying back their debts.\n Protection of Purchases Credit cards may also offer customers, additional protection if the purchased\nmerchandisebecomes lost, damaged, or stolen. Both the buyer‟s credit card statement and company can confirmthat the customer has bought if the original receipt is lost or stolen. In addition, some credit card companies provideinsurance forlarge purchases.\nIn spite of all mentioned advantages, the problem of fraud is a serious issue ine-banking services that threaten credit card transactions especially. Fraud is an intentional deceptionwith the purpose of obtaining financial gain or causing loss by implicit or explicit trick.Fraud is a public law violation in which the fraudster gains an unlawful advantage or causes unlawful damage. The estimation ofamount of damage made by fraud activities indicates that fraud costs a very considerable sum of money.Credit card fraud is increasing significantly with the development of modern technology resulting in the loss of billions of dollars worldwide each year.Statistics from the Internet Crime Complaint Center show that there has been a significant rising in reported fraud in last decade. Financial losses caused due to online fraud only in US, was reported $3.4 billion in 2011. Fraud detection involves identifying scarce fraud activities among numerous legitimate transactions as quickly as possible. Fraud detection methods are developing rapidlyin order to adapt with new incoming fraudulent strategies across the world. But, development of new fraud detection techniquesbecomes more difficult due to the severe limitation of the ideas exchange in fraud detection. On the other hand, fraud detection is essentially a rare event problem, which has been variously called outlier analysis, anomaly detection, exception mining, mining rare classes, mining imbalanced data etc. The number of fraudulent transactions is usually a very low fraction of the total transactions. Hence the task of detecting fraud transactions in an accurate and efficient manner is fairly difficult and challengeable.Therefore, development of efficient methods which can distinguish rarefraud activities from billions of legitimate transaction seems essential. Although, credit card fraud detection has gained attention and extensive studyespecially in recent years and there are lots of surveys about this kind of fraud such as [1], [2], [3],neither classify all credit card fraud detection techniques with analysis of datasets and attributes. Therefore in this paper, we attempt to collect and integrate a complete set of researches of literature and analyze them from various aspects. The main contributions of this work are highlighted as follows:\n To the best of our knowledge, the absence of complete and detailed credit card fraud detection survey is an important issue, which is addressed by analyzing the state of the art in\ncredit card fraud detection.\n The state of the art fraud detection techniques are described and classified from different aspects of supervised/unsupervised and numerical/categorical data consistent.\n In credit card fraud research each author has used its own dataset. There isno standard dataset or benchmark to evaluate detection methods. We attemptto gather different\ndatasetsinvestigated by researchers, categorize them into real and synthetized groups and extract the common attributes affects the quality of detection.\nThe rest of the paper is organized as follows: a general description of types of fraud is presented in Section2.Challengesof credit card fraud detection are identified in Section3. Section4describes the credit card fraud detection techniques, their advantages and disadvantages and classification of them. In section 5 the dataset used by researchers and corresponding evaluation criteria are explained; another classification upon data types is also drawn in this section. Finally open issues of credit card fraud detection are presented in Section6."
    }, {
      "heading" : "2. Credit card fraud",
      "text" : "Illegal use of credit card or its information without the knowledge of the owner is referred to as credit card fraud.Different credit card fraud tricks belong mainly to two groups of application and behavioral fraud [3]. Application fraud takes place when, fraudsters apply new cards from bank or issuing companies using false or other‟s information. Multiple applications may be submitted by one user with one set of user details (called duplication fraud) or different user with identical details (called identity fraud).\nBehavioral fraud, on the other hand,has four principal types: stolen/lost card, mail theft, counterfeit\ncard and „card holder not present‟ fraud.Stolen/lost card fraud occurs when fraudsters steala credit card or get access to a lost card. Mail theft fraud occurs when the fraudster get a credit card in mail or personal information from bank before reaching to actual cardholder[3]. In both counterfeit and „card holder not present‟ frauds, credit card details are obtained without the knowledge of card holders. In the former, remote transactions can be conducted using card details through mail, phone, or the Internet. In the latter, counterfeit cards are made based on card information. Based on statistical data stated in [1] in 2012, the high risk countries facing credit card fraud threat is illustrated in Fig.1. Ukraine has the most fraud rate with staggering 19%, which is closely followed by Indonesia at 18.3% fraud rate. After these two, Yugoslavia with the rate of17.8% is the most risky country. The next highest fraud rate belongs to Malaysia (5.9%), Turkey (9%) and finally United States. Other countries that are prune to credit card fraud with the rate below than 1% are not demonstrated in figure 1.\nFig1. High risk countries facing credit card fraud threat"
    }, {
      "heading" : "3. Difficulties of Credit Card Fraud Detection",
      "text" : "Fraud detection systems are prune to several difficulties and challenges enumerated bellow. An effective frauddetection technique should have abilities to address these difficulties in order to achievebest performance.\n Imbalanced data:The credit card fraud detection data has imbalanced nature. It means thatvery small percentages of all credit card transactions are fraudulent. This cause the\ndetection of fraud transactions very difficult and imprecise.\n Different misclassification importance: in fraud detection task, different misclassification errors have different importance.Misclassification of a normal transaction asfraud is not as\nharmful as detecting a fraud transaction as normal. Because in the first case the mistake in classification will be identified in further investigations.\n Overlapping data: many transactions may be considered fraudulent, while actually they are normal (false positive) and reversely, a fraudulent transaction may also seem to be legitimate\n(false negative). Hence obtaining low rate of false positive and false negative is a key challenge of fraud detection systems[4, 5, and 6].\n Lack of adaptability: classification algorithms are usually faced with the problem of detecting new types of normal or fraudulent patterns. The supervised and unsupervised fraud\ndetection systems are inefficient in detecting new patterns of normal and fraud behaviors, respectively.\n Fraud detection cost: The system should take into account both the cost of fraudulent behavior that is detected and the cost of preventing it. For example, no revenue is obtained by\nstopping a fraudulent transaction of a few dollars [5, 7].\nUkraine\n19%\nIndonesia\n18%\nYugoslavia\n18%\nMalaysia\n6%\nTurkey\n9%\nUnited States\n1%\nother counry\n29%\nStatistical Classification of Credit Card Fraud Occurrence\nUkraine\nIndonesia\nYugoslavia\nMalaysia\nTurkey\nUnited States\nother counry\n Lack of standard metrics: there is no standard evaluation criterion for assessing and comparing the results of fraud detection systems."
    }, {
      "heading" : "4. Credit Card Fraud Detection Techniques",
      "text" : "The credit card fraud detection techniques are classified in two general categories: fraud analysis (misuse detection) and userbehavior analysis (anomaly detection).\nThe first group of techniques deals with supervised classification task in transaction level. In these methods, transactions are labeled as fraudulent or normal based on previous historical data. This dataset is then used to create classification models which can predict the state (normal or fraud) of new records. There are numerous model creation methods for a typical two class classification tasksuch as rule induction [1], decision trees [2] and neural networks [3].This approach is proven to reliably detect most fraud tricks which have been observed before [4], it also known as misuse detection.\nThe second approach deals with unsupervised methodologies which are based on account behavior. In this method a transaction is detected fraudulent if it is in contrast with user‟s normal behavior. This is because we don‟t expect fraudsters behave the same as the account owner or be aware of the behavior model of the owner [5].To this aim, we need to extract the legitimate user behavioral model (e.. user profile)for each account and then detect fraudulent activities according to it. Comparingnew behaviors with this model, different enough activities are distinguished as frauds. The profiles may contain the activity information of the account; such as merchant types, amount, location and time of transactions, [6].This method is also known as anomaly detection.\nIt is important to highlight the key differences between user behavior analysis and fraud analysis approaches.Thefraud analysis methodcan detect known fraud tricks, with a low false positiverate.These systems extract the signature and model of fraud tricks presented in oracle dataset and can then easily determine exactly which frauds, the system is currently experiencing. If the test data does not containanyfraud signatures, no alarm is raised. Thus, the false positive rate can be reduced extremely.However,sincelearning of a fraud analysis system (i.e. classifier) is based on limited and specific fraud records,It cannot detect novel frauds. As a result, the false negativesratemay be extremely high depending on how ingenious are the fraudsters.User behavioranalysis, on the other hand, greatly addresses the problem of detecting novel frauds. Thesemethods do not search for specific fraud patterns, but rather compare incoming activitieswiththe constructed model of legitimate user behavior. Any activity that is enough different from the model will be considered as a possible fraud. Though, user behavior analysis approaches are powerful in detectinginnovative frauds, they reallysuffer from high rates of false alarm. Moreover, if a fraud occurs during the training phase, this fraudulent behavior will be entered in baseline mode and is assumed to be normal in further analysis[7].In this section we will brieflyintroduce some current fraud detection techniques which are applied to credit card fraud detection tasks, also main advantage and disadvantage of each approachwill be discussed."
    }, {
      "heading" : "4.1 Artificial Neural Network",
      "text" : "An artificial neural network (ANN) is a set of interconnected nodes designed to imitate the functioning of the human brain [9]. Each node has a weighted connection to several other nodes in adjacent layers. Individual nodes take the input received from connected nodes and use the weights\ntogether with a simple function to compute output values. Neural networks come in many shapes and architectures.The Neural network architecture, including the number of hidden layers, the number of nodeswithin a specific hidden layer and their connectivity, most be specified by user based on the complexity of the problem. ANNs can be configured by supervised, unsupervised or hybrid learning methods."
    }, {
      "heading" : "4.1.1 Supervised techniques",
      "text" : "In supervised learning, samples of both fraudulent and non-fraudulent records, associated with their labels are used to create models. These techniques are often used in fraud analysis approach.One of the most popular supervised neural networks is back propagation network (BPN). It minimizes the objective function using a multi-stage dynamic optimization methodthat is a generalization of the delta rule.The back propagation method is often useful for feed-forward network with no feedback. The BPN algorithm is usually time-consuming and parameters like the number of hidden neurons and learning rate of delta rules require extensive tuning and trainingto achieve the best performance [10]. In the domain of fraud detection, supervised neural networks like back-propagation are known as efficient tool that have numerous applications [11], [12], [13].\nRaghavendraPatidar, et al. [14] used a dataset to train a three layers backpropagation neural network in combination with genetic algorithms (GA)[15]forcredit card fraud detection. In this work, genetic algorithms was responsible for making decision about the network architecture, dealing with the network topology, number of hidden layers and number of nodes in each layer.\nAlso, Aleskerovet al. [16] developed a neural network based data mining system for credit card fraud detection.The proposed system (CARDWATCH) had three layers autoassociativearchitectures.They used a set of synthetized data for training and testing the system. The reportedresultsshow very successfulfraud detection rates.\nIn [17], a P-RCE neural network was applied for credit card fraud detection.P-RCE is a type of radial-basis function networks [18, 19]that usually applied for pattern recognition tasks.Krenkeret al. proposed a model for real time fraud detection based on bidirectional neural networks [20]. They used a large data set of cell phone transactions provided by a credit card company. It was claimed that the system outperforms the rule based algorithms in terms of false positive rate.\nAgain in [21] a parallel granular neural network (GNN) is proposed to speed up data mining and knowledge discoveryprocess for credit card fraud detection.GNNis a kind of fuzzy neural network based on knowledge discovery (FNNKD).The underlying dataset was extracted from SQL server database containing sample Visa Card transactions and then preprocessed for applying in fraud detection. They obtained less average training errors in the presence of larger training dataset.\n4.1.2Unsupervised techniques The unsupervised techniques do not need the previous knowledge of fraudulent and normalrecords.These methodsraise alarmfor those transactions that are most dissimilar from the normalones.These techniques are often used in user behavior approach.ANNs can produce acceptable result for enough large transaction dataset. They need a long training dataset. Selforganizing map (SOM) is one of the most popular unsupervised neural networks learning which was introduced by [22]. SOM provides a clustering method, which is appropriate for constructing and analyzing customer profiles,in credit card fraud detection, as suggested in [23]. SOM operates in two phase: training and mapping. In the former phase, the map is built and weights of the neurons are\nupdated iteratively, based on input samples [24], in latter, test data is classified automatically into normal and fraudulent classes through the procedure of mapping. As stated in [25], after training the SOM, new unseen transactions are compared to normal and fraud clusters, if it is similar to all normal records, it is classified as normal. New fraud transactions are also detected similarly.\nOne of the advantages of using unsupervised neural networks over similar techniques is that these methods can learn from data stream. The more data passed to a SOM model, the more adaptation and improvement on result is obtained. More specifically, the SOM adapts its model as time passes. Therefore it can be used and updated online in banks or other financial corporations. As a result, the fraudulent use of a card can be detected fast and effectively. However, neural networks has some drawbacks and difficulties which are mainly related to specifying suitable architecture in one hand and excessive training required for reaching to best performance in other hand."
    }, {
      "heading" : "4. 1.3 Hybrid supervised and unsupervisedtechniques",
      "text" : "In addition to supervised and unsupervised learning models of neural networks, some researchers have applied hybrid models. John ZhongLeiet.Al.[26] proposed hybrid supervised (SICLN) and unsupervised (ICLN)learning networkfor credit card fraud detection. They improved the reward only rule of SICLNmodel to ICLN in order to update weights according to both reward and penalty. This improvement appeared in terms of increasing stability and reducing the training time.Moreover, the number of final clusters of the ICLN is independent from the number of initial network neurons. As a result the inoperable neurons can be omitted from the clusters by applying the penalty rule.The results indicated that both the ICLN and the SICLN havehigh performance, but the SICLN outperforms well-known unsupervised clustering algorithms."
    }, {
      "heading" : "4.2 Artificial Immune System (AIS)",
      "text" : "The natural immune system is a highly complex system, comprised of an intricate network of specialized tissues, organs, cells and chemical molecules. These elements are interrelated and act in a highly co- ordinate and specific manner when they recognize, remember disease causing foreign cells and eliminate them. Any element that could be recognized by the immune system is named an antigen. The immune system‟s detectors are the antibodies that are capable to recognition and destruction harmful and risky antigens [27].\nThe immune system consists of the two main response of immune and defense: innate immune response and acquired immune response. The body‟s first response for defense is made of the outer, unbroken skin and the „mucus membranes‟ lining internal channels, such as the respiratory and digestive tracts. If the harmful cells could pass through innate immune defense the acquired immunity will defense. In fact, adaptive immune response performs based on antigen-specific recognition of almost unlimited types of infectious substances, even if previously unseen or mutated. It is worth mentioning that the acquired immune response is capable of “remembering” every infection, so that a second exposure to the same pathogen is dealt with more efficiently.\nThere are two organs responsible for the generation and development of immune cells: the bone marrow and the thymus. The bone marrow is the site where all blood cells are generated and where some of them are developed. The thymus is the organ to which a class of immune cells named Tcells migrates and maturates [28]. There exist a great number of different immune cells, but lymphocytes (white blood cells), are the prevailing ones. Their main function is distinguishing selfcells, which are the human body cells, from non-self cells, the dangerous foreign cells (the pathogens). Lymphocytes are classified into two main types: B-cells and T-cells, both originated in the bone marrow. Those lymphocytes that develop within the bone marrow are named B-cells, and\nthose that migrate to and develop within the thymus (the organ which is located behind the breastbone) are named T-cells.\nArtificial Immune System (AIS) is a recent sub field based on the biological metaphor of the immune system [29]. The immune system can distinguish between self and non-self-cells, or more specific, between harmful cells (called as pathogens) and other cells. The ability to recognize differences in patterns and being all to detect and eliminate infections precisely has attracted the engineer‟s intention in all fields. Researchers have used the concepts of immunology in order to develop a set of algorithms, such as negative selection algorithm [30], immune networks algorithm [31], clonal selection algorithm [32], and the dendritic cells algorithm [33]."
    }, {
      "heading" : "4.2.1 Negative Selection:",
      "text" : "Negative Selection Algorithm or NSA proposed by [34] is a change detection algorithm based on the\nT-Cells generation process of biological immune system. It is one of the earliest AIS algorithms\napplied in various real-world applications. Since it was first conceived, it has attracted many\nresearchers and practitioners in AIS and has gone through some phenomenal evolution. NSA has two\nstages: generation and detection. In generation stage, the detectors are generated by some random\nprocess and censored by trying to match self samples. Those candidates that match (by affinity of\nhigher than affinity threshold) are eliminated and the rest are kept as detectors. In detection stage, the\ncollection of detectors (or detector set) is used in checking whether an incoming data instance is self\nor non-self. If it matches (by affinity of higher than affinity threshold) any detector, it is claimed as\nnon-self or anomaly.\nBrabazonet.al [35] proposed an AIS based model for online credit card fraud detection. Three AIS\nalgorithms were implemented and their performance was standardized against a logistic regression\nmodel. Their three chosenalgorithms were the unmodified negative selectionAlgorithm, the modified\nnegative selection algorithm andthe Clonal selection algorithm.They proposed the Distance Value\nMetric for calculating distance between records. This metric is based on the probability of data\noccurrence in the training set. Where the detection rate increased, but the number of false alarms and\nmissed frauds remained."
    }, {
      "heading" : "4.2.2 Clonal selection:",
      "text" : "Clonal selection theory is used by the immune system to explain the basic features of an immune response to an antigenic stimulus. The selection mechanism guarantees that only those clones (antibodies) with higher affinity for the encountered antigen will survive. On the basis of clonal selection principle, clonal selection algorithm was initially proposed in [36] and formally explained in [37]. The general algorithm was called CLONALG. Gadiet.al in [36] applied the AIRS in fraud detection on credit card transactions. AIRS is a classification algorithm that is based on AIS whichapplies clonal selection to create detectors.AIRS generatesdetectors for all of the classes in the database and in detectionstage uses k Nearest Neighbor algorithm (also called K-NN)in order to classify eachrecord.They compared their method with other methods like the neural networks, Bayesian networks, and decision trees and claimed that, after improving the input parameters for all the methods, AIRS has show the best results of all, partly perhaps since the number of input parameters for AIRS is comparatively high. If we consider a\nparticular training dataset, and set the parameters depending on the same database, the results indicate a tendency to improve. The experiment was carried out on Weka package. Soltaniet.alin [8] proposed AIRS on credit card fraud detection. Since AIRS has a long training time,\nauthors have implemented the model in Cloud Computing environment to shorten this time. They\nhad used MapReduce API which works based on Hadoop distributed file system, and runs the\nalgorithm in parallel."
    }, {
      "heading" : "4.2.3 Immune Network:",
      "text" : "The nature immune system is applied through the interactions between a huge numbers of different types of cells. Instead of using a central coordinator, the nature immune systems sustain the appropriate level of immune responses by maintaining the equilibrium status between antibody suppression and stimulation using idiotypes and paratopes antibodies [38], [39]. The first Artificial Immune Network (AIN) proposed by [40]. Neal M.et.al [41] introduced the AISFD, which adopted thetechniques developed by CBR (case based reasoning) communityand applied various methods borrowed from genetic algorithm andother techniques to clone the B cells (network nodes) for mortgage fraud detection.\n4.2.4 Danger Theory:\nThe novel immune theory, named Danger Theory was proposed in 1994 [42]. It embarked from the concept that defined “self-non-self” in the traditional theories and emphasizes that the immune system does not respond to “non-self” but to danger. According to the theory a useful evolutionarily immune system should focus on those things that are foreign and dangerous, rather than on those that are simply foreign [43]. Danger is measured by damage inflicted to cells indicated by distress signals emitted when cells go through an unnatural death (necrosis).\nDendritic cells (DCs), part of the innate immune system, interact with antigens derived from the host tissue; therefore, the algorithm inspired by Danger Theory is named Dendritic cell algorithm. Dendritic cells control the state of adaptive immune system cells by emitting the following signals:\n PAMP (pathogen associated molecular pattern)\n Danger\n Safe\n Inflammation PAMP is released from tissue cells following sudden necrotic cell death; actually, the presence of PAMP usually indicates an anomalous situation The presence of Danger signals may or may not indicate an anomalous situation; however the probability of an anomaly is higher than the same, under normal circumstances\nSafe signal act as an indicator of healthy tissue Inflammation signal is classed as the molecules of an inflammatory response to tissue injury. In fact,\nthe presence of this signal amplifies the above three signals. DCs exist in a number of different states of maturity, depending on the type of environmental signal present in the surrounding fluid. They can exist in immature, semi-mature or mature forms. Initially, when a DC enters the tissue, it exists in an immature state. DCs which have the ability to present both the antigen and active T-cells are mature. For an immature DC to become mature it should be exposed to PAMP and danger signals predominantly. The immature DCs exposed to safe signals predominantly are termed “semi-mature”; they produce semi-mature DCs output signaling molecule, which has the ability to de-activate the T-cells. Exposure to PAMP, danger and safe signals lead to\nan increase in co-stimulatory molecules production, which in turn ends up in removal from the tissue and its migration to local lymph nodes."
    }, {
      "heading" : "4.2.5 Hybrid AIS or methods",
      "text" : "Some researchers applied different algorithms (i.e. vaccination algorithm, CART and so on) by AIS\nalgorithm which are presented below:\nWong [44] presents the AISCCFD prototype proposed to measure and manage the memory population and mutate detectors in real time. In their work both the two algorithms the vaccination and negative selection were combined. The results were tested for different fraud types. The proposed method demonstrated higher detection rates when vaccination algorithm was applied, but it failed to detect some types of fraud precisely. Huang et.al [45] presented a novel hybrid Artificial Immune inspired model for fraud detection by combining triplealgorithms: CSPRA, the dendritic cell algorithm (DCA), and CART. Though their proposed method had high detection rate and low false alarm, their approach was focused on logging data and limited to VoD (video on demand) systems and not credit card transactions. Ayaraet.al [46] applied AIS to predict failures of ATM 1 . Their approach is enriched by adding a generation of new antibodies from the antigens that correspond to the unpredicted failures."
    }, {
      "heading" : "4.3 Genetic Algorithm (GA)",
      "text" : "Inspired from natural evolution, Genetic algorithms (GA), were originally introduced by John Holland [15]. GA searches for optimum solution with a population of candidate solutions that are traditionally represented in the form of binary strings called chromosomes.\nThe basic idea is that the stronger members of the population have more chance to survive and reproduce. The strength of a solution is its capability to solve the underlying problem which is indicated by fitness. New generation is selected in proportion to fitness among previous population and newly created offspring. Normally, new offspring will be produced by applying genetic operators such as mutation and crossing over on some fitter members of current generation (parents). As generations progress, the solution are evolved and the average fitness of population increases.This process is repeated until some stopping criteria, (i.e. often passing a pre-specified number of generations) is satisfied.\nGenetic Programming (GP)[47] is an extension of genetic algorithms that represent each individual by a tree rather than a bit string. Due to hierarchy nature of the tree, GP can produce various types of model such as mathematical functions, logical and arithmetic expressions, computer programs, networks structures, etc.\nGenetic algorithms have been used in data mining tasks mainly for feature selection. It is also widely used in combination with other algorithms for parameter tuning and optimization. Due to availability of genetic algorithm code in different programming languages, it is a popular and strong algorithm in credit card fraud detection. However, GA is very expensive in consuming time and memory. Genetic programming has also various applications in data mining as classification tool.\n1 Automatic Teller Machine (ATM)\nEkremDuman et al. developed a method for credit card fraud detection [48]. They defined a costsensitive objective function that assigned different cost to different misclassification errors (e.g. false positive, false negative). In this case, the goal of a classifier will be the minimization of overall cost instead of the number of misclassified transactions. This is due the fact that the correct classification of some transactions was more important than others. The utilized classifier in this work was a novel combination of the genetic algorithms and the scatter search. For evaluating the proposed method, it was applied to real data and showed promising result in comparison to literature. Analyzing the influence of the features in detecting fraud indicated that statistics of the popular and unpopular regions for a credit card holder is the most important feature. Authors excluded some type of features such as the MCC and country statistics from their study that resulted in less generality for typical fraud detection problem.\nK.RamaKalyaniet al. [49] presented a model of credit card fraud detection based on the principles of genetic algorithm. The goal of the approach was first developing a synthetizing algorithm for generating test data and then to detect fraudulent transaction with the proposed algorithm..\nBentley et al. [50]developed a genetic programming based fuzzy system to extract rules for classifying data tested on real home insurance claims and credit card transactions.\nIn [51], authors applied Genetic Programming to the prediction of the price in the stock market of Japan. The objective of the work was to make decision in stock market about the best stocks as well as the time and amount of stocks to sell or buy. The experimental results showed the superior performance of GP over neural networks."
    }, {
      "heading" : "4.4 Hidden Markov Model (HMM)",
      "text" : "A Hidden Markov Model is a double embedded stochastic process which is applied to model much more complicated stochastic processes as compared to a traditional Markov model. The underlying system is assumed to be a Markov process with unobserved states. In simpler Markov models like Markov chains, states are definite transition probabilities are only unknown parameters. In contrast, the states of a HMM are hidden, but state dependent outputs are visible. In credit card fraud detection a HMM is trained for modeling the normal behavior encoded in user profiles [52]. According to this model, a new incoming transaction will be classified to fraud if it is not accepted by model with sufficiently high probability.Each user profile contains a set of information about last 10 transactions of that user liketime; category and amount of for each transaction [52, 53, and 54].HMM produces high false positive rate [55].V. Bhusari et al. [56] utialized HMM for detecting credit card frauds with low false alarm. The proposed system was also scalable for processing huge number of transactions. HMM can also be embedded in online fraud detection systems which receive transaction details and verify whether it is normal or fraudulent.If the system confirms the transaction to be malicious, an alarm is raised and related bank rejects that transaction. The responding cardholder may then be informed about possible card misuse."
    }, {
      "heading" : "4.5 Support Vector Machine (SVM)",
      "text" : "Support vector machine (SVM)[57] is a supervised learning model with associated learning algorithms that can analyze and recognize patterns for classification and regression tasks[48]. SVM is a binary classifier. The basic idea of SVM was to find an optimal hyper-plane which can separate instances of two given classes, linearly. This hyper-plane was assumed to be located in the gap between some marginal instances called support vectors. Introducing the kernel functions, the idea\nwas extended for linearly inseparable data. A kernel function represents the dot product of projections of two data points in a high dimensional space. It is a transform that disperses data by mapping from the input space to a new space (feature space) in which the instances are more likely to be linearly separable. Kernels, such as radial basis function (RBF), can be used to learn complex input spaces. In classification tasks, given a set of training instances, marked with the label of the associated class, the SVM training algorithm find a hyper-plane that can assign new incoming instances into one of two classes. The class prediction of each new data point is based on which side of the hyper-plane it falls on feature space. SVM has been successfully applied to a broad range of applications such as [58] [59] [60]. In credit card fraud detection, Ghosh and Reilly [61] developed a model using SVMs and admired neural networks. In this research a three layer feed-forward RBF neural network applied for detecting fraudulent credit card transactions through only two passes required to churn out a fraud score in every two hours. Tung-shou Chen et al. [62] proposed a binary support vector system (BSVS), in which support vectors were selected by means of the genetic algorithms (GA). In proposed model self-organizing map (SOM) was first applied to obtain a high true negative rate and BSVS was then used to better train the data according their distribution. In [63], a classification model based on decision trees and support vector machines (SVM) was constructed respectively for detecting credit card fraud. The first comparative study among SVM and decision tree methods in credit card fraud detection with a real data set was performed in this paper. The results revealed that the decision tree classifiers such as CART outperform SVM in solving the problem under investigation. Rongchang Chen et al. [64] suggested a novel questionnaire-responder transaction (QRT) approach with SVM for credit card fraud detection. The objective of this research was the usage of SVM as well as other approaches such as Over-sampling and majority voting for investigating the prediction accuracy of their method in fraud detection. The experimental results indicated that the QRT approach has high degree of efficiency in terms of prediction accuracy. Qibei Lu et al. [65] established a credit card fraud detection model based on Class Weighted SVM. Employing Principal Component Analysis (PCA), they initially reduced data dimension to less synthetic composite features due to the high dimensionality of data. Then according to imbalance characteristics of data, an improved Imbalance Class Weighted SVM (ICW-SVM) was proposed."
    }, {
      "heading" : "4.6 Bayesian Network",
      "text" : "A Bayesian network is a graphical model that represents conditional dependencies among random variables. The underlying graphical model is in the form of directed acyclic graph. Bayesian networks are usefulfor finding unknown probabilities given known probabilitiesin the presence of uncertainty [66]. Bayesian networks can play an important and effective role in modeling situations where some basic information is already known but incoming data is uncertain or partially unavailable [67], [68], [69].The goal of using Bayes rules is often the prediction of the class label associated to a given vector of features or attributes [70].Bayesian networks have been successfully applied to various fields of interest for instance churn prevention[71] in business,pattern recognition in vision[72], generation of diagnostic in medicine[73]and fault diagnosis [74] as well as forecasting [75] in power systems.Besides, these networks have also been used to detect anomaly and frauds in credit card transactions or telecommunication networks [76, 77, and 5]. In [70], two approaches are suggested for credit card fraud detection using Bayesian network.In the first, the fraudulent user behavior and in the second the legitimate (normal) user behavior are\nmodeled by Bayesian network. The fraudulent behavior net is constructed fromexpert knowledge, while the legitimate net is set up in respect to available data from non fraudulent users. During operation, legitimatenet is adapted to a specific user based on emerging data.Classification of new transactions were simplyconducted by inserting it to both networksand then specify the type of behavior (legitimate/fraud) according to correspondingprobabilities. Applying Bayes rule, gives the probability of fraud for new transactions [78]. Again, Ezawa and Nortondeveloped a four-stage Bayesian network [79]. They claimed that lots of popular methods such as regression, K-nearest neighbor and neural networks takes too long time to be applicable in their data."
    }, {
      "heading" : "4.7 Fuzzy Logic Based System",
      "text" : "Fuzzy logic based system is the system based on fuzzy rules. Fuzzy logic systems address the\nuncertainty of the input and output variables by defining fuzzy sets and numbers in order to express values in the form of linguistic variables (e.g. small, medium and large). Two important types of these systems are fuzzy neural network and fuzzy Darwinian system.\n4.7.1Fuzzy Neural Network (FNN) The aim of applying Fuzzy Neural Network (FNN) is to learn fromgreatnumber of uncertain and imprecise records of information, which is very common in real world applications [80]. Fuzzy neural networks proposedin [81] to accelerate rule induction for fraud detection in customer specific credit cards. In this research authors applied GNN (Granular Neural Network) method which implements fuzzy neural network based on knowledge discovery (FNNKD), for accelerating thetraining network and detecting fraudster in parallel.\n4.7.2Fuzzy Darwinian System Fuzzy Darwinian Detection [82] is a kind of Evolutionary-Fuzzy system that uses genetic programming in order to evolve fuzzy rules. Extracting the rules, the systemcan classify the transactions into fraudulent and normal. This system was composed of genetic programming (GP) unit in combination with fuzzy expert system. Results indicated that the proposed system has very high accuracy and low false positive rate in comparison with other techniques, but it is extremely expensive [83]."
    }, {
      "heading" : "4.8 Expert Systems",
      "text" : "Rules can be generated from information which are obtained from a human expert and stored in a rule-based system as IF-THEN rules. Knowledge base system or an expert system is the information which is stored in Knowledge base. The rules in the expert system appliedin order to perform operations on a data to inference to reach appropriate conclusion. Powerful and flexible solutions for many application problemsprovides by expert system. Financial analysis and fraud detection are one of the general areas which it can be apply. By applying expert system suspicious activity or transaction can be detected from deviations from \"normal' spending patterns [84]. In [85] authors presented a model to detect credit card frauds in various payment channels. In their model fuzzy expert system gives the abnormal degree which determines how the new transaction is fraudulent in comparison with user behavioral. The fraud tendency weight is achieved by user behavioral analysis. So, this system is named FUZZGY. Also, another research [86] proposed expert system model to detect fraud for alert financial institutions."
    }, {
      "heading" : "4.9 Inductive logic programming (ILP)",
      "text" : "ILP by using a set of positive and negative examples uses first order predicate logic to define a concept. This logic program is then used to classify new instances. Complex relationship among components or attributes can be easily expressed,in this approach of classification.The effectiveness of the system improves by domain knowledge which can be easily represented in an ILP system [87].Muggleton et al.[88] proposed the model applying labeled data in fraud detection which using relational learning approaches such as Inductive Logic Programming (ILP) and simple homophilybased classifiers on relational databases. Perlich, et al. [89] also propose novel target-dependent detection techniques for converting the relational learning problem into a conventional one."
    }, {
      "heading" : "4.10 Case-based reasoning (CBR)",
      "text" : "Adapting solutions in order to solve previous problems and use them to solve new problems is the basic idea of CBR. In CBR, cases introduce as descriptions of past experience of human specialists and stored in a database which uses for later retrieval when the user encounters a new case with similar parameters. These cases can apply for classification purposes. A CBR system attempts to find a matching case when face with a new problem. In this method the model defined as the training data, and in test phase when a new case or instance is given to the model it looks in all the data to discover a subset of cases that are most similar to new case and uses them to predict the result. Nearest neighbor matching algorithm usually applied with CBR, although there are several another algorithms which used with this approach such as [90]. Case-based reasoning is well documented both as the framework for hybrid frauddetection systems and as an inference engine in [91]. Also, E.b. Reategui applied hybrid approaches of CBR and NN which divides the task of fraud detection into two separate components and found that this multiple approach was more effective than either approach on its own [92]. In this model, CBR looks for best matches in the case base while an artificial neural net (ANN) learns patterns of use and misuse of credit cards. The case base included information such as transaction amounts, dates, place and type, theft date, and MCC (merchant category code). The hybrid CBR and ANN system reported a classification accuracy of 89% on a case base of 1606 cases.\nTable1. Advantages and disadvantages of fraud detection methods\nTechniques Advantages Disadvantages\nArtificial Neural Network\n(ANN)\nAbility to learn from the past/lack of need to be reprogrammed/ Ability to extract rules and predict\nfuture activities based on the current situation/ High\naccuracy/ Portability/ high speed in detection/ the ability to generate code to be used in real-time systems/\nthe easiness to be built and operated/ Effectiveness in\ndealing with noisy data, in predicting patterns, in solving complex problems, and in processing new\ninstances/Adaptability /Maintainability /knowledge\ndiscovery and data miming\nDifficulty to confirm the structure/high\nprocessing time for large neural networks and excessive training/ poor explanation\ncapability/ difficult to setup and operate/high\nexpense/ non numerical data need to be converted and normalized/Sensitivity to data\nformat.\nArtificial Immune System\n(AIS)\nHigh capability in pattern recognition/powerful in\nLearning and memory/Self-organization/ easy in\nintegration with other systems/dynamically changing coverage/ self Identity/ multilayered/ has diversity/\nnoise tolerance/ fault tolerance/ predator-prey\ndynamics/ Inexpensive / no need to training phase in\nDCA.\nNeed high training time in NSA/ poor in handle missing data in ClonalG and NSA\nGenetic Algorithm\nWorks well with noisy data/easy to integrate with other\nsystems/ usually combined into other techniques to\nincrease the performance of those techniques and optimize their parameters/ easy in build and operate/In\nexpensive/fast in detection/\nAdaptability/Maintainability/knowledge discovery and data miming\nRequires extensive tool knowledge to set up and operate and difficult to understand.\nHidden Markov Model\n(HMM)\nFast in detection\nHighly expensive/ low accuracy/not scalable\nto large size data sets\nSupport Vector Machines\n(SVM)\nSVMs deliver a unique solution, since the optimality\nproblem is convex/by choosing an appropriate generalization grade,\nSVMs can be robust, even when the training sample has\nsome bias.\nPoor in process largedataset/expensive/has low speed of detection/ medium\naccuracy/lack of transparency of results\nBayesian Network High processing and detection speed/high\naccuracy\nExcessive training need/\nexpensive\nFuzzy Logic\nBased System\nFuzzy Neural Network Very fast in detection/good accuracy Expensive\nFuzzy Darwinian\nSystem Very high accuracy/ Maintainability\nHas very low speed in detection/ High expensive\nExpert System\nEasy to modify the KB/ easy to develop and build the\nsystem/ easy to manage complexity or missing information/high degree of accuracy/ explanation\nfacilities/good performance/Rules from other\ntechniques such as NN and DT can be extracted, modified, and stored in the KB.\nPoor in handling missing information or unexpected data values/poor in process different data types /knowledge\nrepresentation languages do not approach\nhuman flexibility/ poor in build and operate/ poor in integration\nInductive logic programming (ILP)\nPowerful in process different data types/ powerful\nmodeling language that can model complex\nrelationships/powerful in handle missing data\nHas low predictive accuracy/extremely\nsensitive to noise/ their performance deteriorates rapidly in the presence of\nspurious data.\nCase based reasoning (CBR)\nUseful in domain that has a large number of examples/\nhas the ability to work with incomplete or noisy data/effective/ flexible/ easy to update and maintain/\ncan be used in a hybrid approach.\nMay suffer from the problem of incomplete\nor noisy data.\nDecision tree (DT) High flexibility/good haleness/ explainable/easy to\nimplement/easy to display and to understand\nRequirements to check each condition one by one. In fraud detection condition is\ntransaction.\nIn order to best comprise in fraud detection techniques we have been summarizes the advantages and disadvantages of the mentioned techniques, which demonstrated in Table1. It is important to make a point that primary version of this Table presented in [87].Finally,Fig. 2shows a complete classification of fraud detection techniques.\n5-Data set and evaluation The mentioned methods in any field definitely need a creditable data set to test upon it, and examine efficiency in compare to other‟s related work. The lack of publicly available database has been a limiting factor for the publications on financial fraud detection [36], particularly credit card transactions. On the other hand, credit card is inherently private so, creating a proper data set for this purpose is very difficult and there are no standard techniques to do this. Also, there is no universal corpus for credit card. Altogether, some works build their own data set for evaluation [48], [93]. However others use data sets which are gains by certain banks or financial institutions in a specific time window [36], [32], [94], [59], [95], and [96]. Table2 will be present some credit card fraud detection research which had used real or synthetically generated dataset.\nTable2. Details of data set used by researchers Collection form Amount Used in Methods\nLarge Brazilian bank, with registers within time window between\nJul/14/2004 through Sep/12/2004. (Real Data\nset)\n41647 transactions/ 3.14%\nfraudulent transactions\nManoel Fernando, Alonso Gadi et al.\n(2008)\nAIS\nFinancial institute in\nIreland (WebBiz) (Real Data set)\n4 million transactions from 462279\nunique customers/ 5417 fraudulent transactions\nAnthony Brabazon et\nal. (2010) AIS\nHong kong bank, with registers within time\nwindow between January 2006 to January 2007 (13 month)\n(Real Data set)\n50 million credit card transactions on about one million (1,167,757 credit cards) credit cards from a single country\nC. Paasch (2007) /\nSiddhartha\nBhattacharyya et al. (2010)\nANN tuned by genetic algorithm/ Data mining techniques\nChase Bank and First Union Bank\n(Real Data set)\nEach bank supplied 500,000 records spanning one year with/ 20% fraud and 80% non\nfraud distribution for Chase Bank/ 15% versus 85%\nfor First Union Bank\nPhilip K. Chan (1999) Data mining techniques\nMajor US bank (Real Data set)\n6000 credit card data with 64\npredictor variables plus 1 class variable, 84% of the data are normal accounts and 16% are fraudulent accounts\nG. Kou, et al. (2005)\nMultiple criteria linear programming\nLarge Australian bank\n(Real Data set)\n640361 total transactions,\nwith 21746 credit cards\nNicholas Wong et al.\n(2012) AIS\nVesta Corporation (Vesta corporation is an innovator and worldwide\nleader in virtual commerce with\nheadquarter in Portland,\nOregon, USA) (Real Data set)\n206,541 transactions, 204,078\ntransaction are normal and\n2463 are fraudulent\nJohn Zhong Lei (2012) ANN\nMellon Bank (Real Data set)\n1,100,000 transactions/\nauthorized in two month\nperiod\nSushmitoGhosh(1994) ANN\nSynthetically generated\ndata\n320000000 transactions/ 1050\ncredit card/ 42 features\nM. Hamdiozcelik et al.\n(2010) GA\nSynthetically generated\ndata\n1000000 transactions/ 20\nfeatures\nK.RamaKalyani et al.\n(2012) GA\nSynthetically generated\ndata 10000 transactions Tao guo et al. (2008) Data mining techniques\nSynthetically generated\ndata\nThe data are extracted into a\nflat file from SQL server database containing sample Visa Card transactions and then preprocessed.\nMubeenaSyeda et al.\n(2002) ANN\nPrimary attributes are attributes of credit card transactions which are available in the most datasets. We present these mentioned attributes in Table3.\nTable3. Thecommon attributes in most datasets.\nRow Attribute Name Description\n1 Posting date Date when transaction was posted to the accounts 2 Merchant Category Code (MCC) a code devote to each goods 3 Transaction Date and Time Date and Time which the transaction was actually performed 4 Transaction status status of transaction success/fail 5 Transaction Place place of transaction (usually determine by IP Address) 6 Money Amount Amount of Money 7 Transaction Type Type of transaction payment/deposit/transfer and etc 8 customer identification The identification code which advocate to each customer 9 Scheme The type of credit card used, e.g. MasterCard, Visa, etc.\nThe volume of fraud in every dataset is different. This might be because of the different security protocols used by different organizations and banks and so on. Whatever the reason is, this fact causes different fraud characteristics on each dataset, which affects the performance of the fraud detection system. Therefore considering the dataset‟s characteristics will help the system having more precise results. A proper data set is a data set which covers various fraud and several attributes of customer profile or behavior. We believe that the contribution of attributes is a critical factor that should be considered. Also, a proper data set should be able to reflect the real world of credit card.\nCredit card transaction datasets usually divided in to two types: numerical and categorical attributes.\nIn statistics, categorical data is a statistical data type consisting of categorical variables, used for observed data whose value is one of a fixed number of nominal categories, or for data that has been converted into that form, for example as grouped data. However numeric data are numbers like age, cost, etc. In fraud detection applications customer‟s gender and name are the typical numerical attribute, and categorical attributes are those like merchant category code, date of transaction, amount of transaction and etc. Some of these categorical variables can, depending on the dataset, have hundreds and thousands of categories. Finally, Fig. 3shows a complete classification in two groups: numerical and categorical attributes which is suitable for each algorithm.\n Evaluation There are a variety of measures for various algorithms and these measures have been developed to evaluate very different things. So it should be criteria for evaluation of various proposedmethod. False Positive (FP), False Negative (FN), True Positive (TP), and True Negative (TN) and the\nrelation between them are quantities which usually adopted by credit card fraud detection researcher to compare the accuracy of different approaches. The definitions of mentioned parameters are presented below:\n FP: the false positive rate indicates the portion of the non-fraudulent transactions wrongly being classified as fraudulent transactions.\n FN: the false negative rate indicates the portion of the fraudulent transactions wrongly being classified as normal transactions.\n TP: the true positive rate represents the portion of the fraudulent transactions correctly being classified as fraudulent transactions.\n TN: the true negative rate represents the portion of the normal transactions correctly being classified as normal transactions.\nThe aim of all algorithms and techniques is to minimize FP and FN rate and maximize TP and TN rate and with a good detection rate at the same time."
    }, {
      "heading" : "6. Open issues",
      "text" : "While credit card fraud detection has gained wide-scale attention in the literature, there are yet some\nissues (a number of significant open issues) that face researchers and have not been addressed\nbeforeadequately. Wehope this overview focuses the direction of future research to provide more\nefficient and trustable fraud detection systems.These issues are as follow:\n Nonexistence of standard and comprehensive credit card benchmark or dataset\nCredit card is inherently private property, so creating a proper benchmark for this purpose is very difficult. Incomplete datasets can cause fraud detection system to learn fraud tricks or normal behavior partially. On the other hand, lack of a standard dataset makes comparison of various techniques problematic or impossible. Many researchers used datasets that are only permitted to authors and cannot be published in order to privacy considerations.\n Nonexistence of standard algorithm\nThere is not any powerful algorithm known in credit card fraud literature that outperforms all\nothers.Eachtechnique hasits own advantages and disadvantages as stated in previous sections.\nCombining these algorithms to support each other‟s benefits and cover their weaknesses would be of\ngreat interest.\n Nonexistence of suitable metrics\nThe limitation of good metrics in order to evaluate the results of fraud detection system is yet an open issue. Nonexistence of such metrics causes incapability of researchers and practitioners in comparing different approaches and determining priority of most efficient fraud detection systems.\n Lack of adaptive credit card fraud detection systems\nAlthough lots of researches have been investigated credit card fraud detection field, there are none or limited adaptive techniques which can learn data stream of transactions as they are conducted. Such a system can update its internal model and mechanisms over a time without need to be relearned offline. Therefore, it can add novel frauds (or normal behaviors) immediately to model of learn fraud tricks and detect them afterward as soon as possible."
    } ],
    "references" : [ {
      "title" : "A survey of signature based methods for financial fraud detection”, journal of computers and security, Vol. 28, pp 3 8 1 ",
      "author" : [ "Michael Edward Edge", "Pedro R", "Falcone Sampaio" ],
      "venue" : null,
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 2009
    }, {
      "title" : "Credit card fraud and detection techniques: a review",
      "author" : [ "Linda Delamaire", "Hussein Abdou", "John Pointon" ],
      "venue" : "Banks and Bank Systems,",
      "citeRegEx" : "3",
      "shortCiteRegEx" : "3",
      "year" : 2009
    }, {
      "title" : "Credit Card Fraud Detection Using Meta-Learning: Issues and Initial Results\"",
      "author" : [ "Salvatore J. Stolfo", "David W. Fan", "Wenke Lee", "Andreas L. Prodromidis" ],
      "venue" : null,
      "citeRegEx" : "4",
      "shortCiteRegEx" : "4",
      "year" : 1997
    }, {
      "title" : "Credit Card Fraud Detection Using Bayesian and Neural Networks\"",
      "author" : [ "B. Manderick" ],
      "venue" : "Vrije University Brussel – Belgium;",
      "citeRegEx" : "5",
      "shortCiteRegEx" : "5",
      "year" : 2002
    }, {
      "title" : "Agent-Based Distributed Learning Applied to Fraud Detection\"; Department of Computer Science",
      "author" : [ "Andreas L. Prodromidis", "Salvatore J. Stolfo" ],
      "venue" : null,
      "citeRegEx" : "6",
      "shortCiteRegEx" : "6",
      "year" : 2000
    }, {
      "title" : "Cost-based Modeling for Fraud and Intrusion Detection: Results from the JAM Project\"",
      "author" : [ "Salvatore J. Stolfo", "Wei Fan", "Wenke Lee", "Andreas L. Prodromidis" ],
      "venue" : null,
      "citeRegEx" : "7",
      "shortCiteRegEx" : "7",
      "year" : 1999
    }, {
      "title" : "A new user-based model for credit card fraud detection based on artificial immune system",
      "author" : [ "N. Soltani", "M.K. Akbari", "M. SargolzaeiJavan" ],
      "venue" : "Artificial Intelligence and Signal Processing (AISP), 2012 16th CSI International Symposium on., IEEE, pp. 029-033, 2012.",
      "citeRegEx" : "8",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "Credit card fraud detection with a neural-network",
      "author" : [ "S. Ghosh", "D.L. Reilly" ],
      "venue" : "Proceedings of the 27  th Annual Conference on System Science,",
      "citeRegEx" : "9",
      "shortCiteRegEx" : "9",
      "year" : 1994
    }, {
      "title" : "Credit Card Fraud Detection Using Neural Network",
      "author" : [ "RaghavendraPatidar", "Lokesh Sharma" ],
      "venue" : "International Journal of Soft Computing and Engineering (IJSCE) ISSN: 2231-2307,",
      "citeRegEx" : "14",
      "shortCiteRegEx" : "14",
      "year" : 2011
    }, {
      "title" : "Adaptation in natural and artificial systems.",
      "author" : [ "J.H. Holland" ],
      "venue" : "Ann Arbor: The University of Michigan Press",
      "citeRegEx" : "15",
      "shortCiteRegEx" : "15",
      "year" : 1975
    }, {
      "title" : "CARDWATCH: A Neural Network-Based Database Mining System for Credit Card Fraud Detection",
      "author" : [ "E. Aleskerov", "B. Freisleben", "B. Rao" ],
      "venue" : "the International Conference on Computational Intelligence for Financial Engineering,",
      "citeRegEx" : "16",
      "shortCiteRegEx" : "16",
      "year" : 1997
    }, {
      "title" : "Credit Card Fraud Detection with a Neural- Network",
      "author" : [ "SushmitoGhosh", "Douglas L. Reilly", "Nestor" ],
      "venue" : "Proceedings of 27  th Annual Hawaii International Conference on System Sciences,",
      "citeRegEx" : "17",
      "shortCiteRegEx" : "17",
      "year" : 1994
    }, {
      "title" : "Learning with localized receptive fields.",
      "author" : [ "Moody", "C. Darken" ],
      "venue" : "Proc. of the 1988 Connectionist Models Summer School,",
      "citeRegEx" : "18",
      "shortCiteRegEx" : "18",
      "year" : 1989
    }, {
      "title" : "Max likelihood competition in RBP networks",
      "author" : [ "S.J. Nowlan" ],
      "venue" : "Technical Report CRG-TR-90- 2, Dept. of Computer Science, University of Toronto, Canada, 1990.  22",
      "citeRegEx" : "19",
      "shortCiteRegEx" : null,
      "year" : 1990
    }, {
      "title" : "Bidirectional Artificial Neural Networks for Mobile-Phone Fraud Detection",
      "author" : [ "A. Krenker", "M. Volk", "U. Sedlar", "J. Bester", "A. Kosh" ],
      "venue" : "Journal of Artificial Neural Networks, Vol. 31, No. 1, pp. 92-98, 2009.",
      "citeRegEx" : "20",
      "shortCiteRegEx" : null,
      "year" : 2009
    }, {
      "title" : "Parallel granular neural networks for fast credit card fraud",
      "author" : [ "MubeenaSyeda", "Yan-Qing Zbang", "Yi Pan" ],
      "venue" : "detection”, international conference on e-commerce application,",
      "citeRegEx" : "21",
      "shortCiteRegEx" : "21",
      "year" : 2002
    }, {
      "title" : "Strizhak “Credit card fraud detection using self organizing maps",
      "author" : [ "Vladimir Zaslavsky", "Anna" ],
      "venue" : "Information & Security. An International Journal,",
      "citeRegEx" : "23",
      "shortCiteRegEx" : "23",
      "year" : 2006
    }, {
      "title" : "Clustering of the self-organizing map”.IEEE",
      "author" : [ "J. Vesanto", "E. Alhoniemi" ],
      "venue" : "Transactions on Neural Networks,",
      "citeRegEx" : "24",
      "shortCiteRegEx" : "24",
      "year" : 2000
    }, {
      "title" : "Self-organizing neural networks for financial diagnosis",
      "author" : [ "C Serrano-Cinca" ],
      "venue" : "Decision Support Systems,",
      "citeRegEx" : "25",
      "shortCiteRegEx" : "25",
      "year" : 1996
    }, {
      "title" : "AliA.Ghorbani, “Improved competitive learning neural networks for network intrusion and fraud detection “,Neuro computing 75(2012)135–145",
      "author" : [ "John Zhong Lei" ],
      "venue" : null,
      "citeRegEx" : "26",
      "shortCiteRegEx" : "26",
      "year" : 2012
    }, {
      "title" : "Learning to Detect Objects by Artificial Immune Approaches",
      "author" : [ "H. Zheng", "J. Zhang" ],
      "venue" : "Journal of Future Generation Computer Systems,",
      "citeRegEx" : "27",
      "shortCiteRegEx" : "27",
      "year" : 2004
    }, {
      "title" : "Artificial immune systems as a novel soft computing paradigm",
      "author" : [ "L.N. de Castro", "J.I. Timmis" ],
      "venue" : "Journal of Soft Computing,",
      "citeRegEx" : "28",
      "shortCiteRegEx" : "28",
      "year" : 2003
    }, {
      "title" : "Artificial immune systems as a novel soft computing paradigm",
      "author" : [ "L.N. de Castro", "J. Timmis" ],
      "venue" : "Journal of Soft Computing,",
      "citeRegEx" : "29",
      "shortCiteRegEx" : "29",
      "year" : 2003
    }, {
      "title" : "Negative Selection Algorithms: From the Thymus to V-Detector",
      "author" : [ "J. Zhou" ],
      "venue" : "PhD Thesis, School of Computer Science, University of Memphis,",
      "citeRegEx" : "30",
      "shortCiteRegEx" : "30",
      "year" : 2006
    }, {
      "title" : "Artificial Immune Systems: A Novel Data Analysis Technique Inspired by the Immune Network Theory",
      "author" : [ "J. Timmis" ],
      "venue" : "PhD. Thesis,",
      "citeRegEx" : "31",
      "shortCiteRegEx" : "31",
      "year" : 2000
    }, {
      "title" : "Clonal Selection Algorithms: A Comparative Case Study Using Effective Mutation Potentials",
      "author" : [ "V. Cutello", "G. Narzisi", "G. Nicosia", "M. Pavone" ],
      "venue" : "proceeding of International Conference on Artificial Immune Systems (ICARIS),",
      "citeRegEx" : "32",
      "shortCiteRegEx" : "32",
      "year" : 2005
    }, {
      "title" : "The Dendritic Cells Algorithm",
      "author" : [ "J. Green smith" ],
      "venue" : "PhD thesis, School of Computer Science, University of Nottingham,",
      "citeRegEx" : "33",
      "shortCiteRegEx" : "33",
      "year" : 2007
    }, {
      "title" : "An immunological model of distributed detection and its application to computer security",
      "author" : [ "S. Hofmeyr" ],
      "venue" : "PhD thesis, University Of New Mexico,",
      "citeRegEx" : "34",
      "shortCiteRegEx" : "34",
      "year" : 1999
    }, {
      "title" : "Identifying Online Credit Card Fraud using Artificial Immune Systems",
      "author" : [ "A. Brabazon", "et.al" ],
      "venue" : "IEEE Congress on Evolutionary Computation (CEC),",
      "citeRegEx" : "35",
      "shortCiteRegEx" : "35",
      "year" : 2011
    }, {
      "title" : "Credit Card Fraud Detection with Artificial Immune System",
      "author" : [ "M. Gadi", "X. Wang", "A. Lago" ],
      "venue" : null,
      "citeRegEx" : "36",
      "shortCiteRegEx" : "36",
      "year" : 2008
    }, {
      "title" : "Artificial Immune System for Fraud Detection",
      "author" : [ "J. Tuo", "S. Red", "W. Lid", "X. Li. B. Li", "L. Lei" ],
      "venue" : "3th International Conference on Systems, Man and Cybernetics,",
      "citeRegEx" : "37",
      "shortCiteRegEx" : "37",
      "year" : 2004
    }, {
      "title" : "Multiple algorithms for fraud detection",
      "author" : [ "R. Wheeler", "S. Aitken" ],
      "venue" : "Journal of Knowledge-Based Systems, Vol. 13,pp",
      "citeRegEx" : "38",
      "shortCiteRegEx" : "38",
      "year" : 2000
    }, {
      "title" : "A comparison of state-of-the-art classification techniques for expert automobile insurance claim fraud detection",
      "author" : [ "S. Viaene", "R.A. Derrig", "B. Baesens", "G. Dedene" ],
      "venue" : "Journal of Risk and Insurance,",
      "citeRegEx" : "39",
      "shortCiteRegEx" : "39",
      "year" : 2002
    }, {
      "title" : "Towards a network theory of the immune system, Annals of Immunology (Paris) 125C",
      "author" : [ "N.K. Jerne" ],
      "venue" : null,
      "citeRegEx" : "40",
      "shortCiteRegEx" : "40",
      "year" : 1974
    }, {
      "title" : "Artificial immune system for fraud detection ",
      "author" : [ "Jianyong Tuo", "Shouju Ren", "Wenhuang Liu", "Xiu Li", "Bing Li", "Lei Lin" ],
      "venue" : "IEEE International Conference on Systems, Man, and Cybernetics - SMC ,",
      "citeRegEx" : "41",
      "shortCiteRegEx" : "41",
      "year" : 2004
    }, {
      "title" : "Tolerance, Danger and the Extended Family",
      "author" : [ "P. Matzinger" ],
      "venue" : "Annual Reviews in Immunology, 12,",
      "citeRegEx" : "42",
      "shortCiteRegEx" : "42",
      "year" : 1994
    }, {
      "title" : "The Danger Model in Its Historical Context",
      "author" : [ "P. Matzinger" ],
      "venue" : "Journal of Immunology",
      "citeRegEx" : "43",
      "shortCiteRegEx" : "43",
      "year" : 2001
    }, {
      "title" : "Artificial Immune Systems for Detection of Credit Card Fraud: an Architecture, Prototype and Preliminary Results",
      "author" : [ "N. Wong", "P. Ray", "G. Stephens", "L. Lewis" ],
      "venue" : "Journal of Information Systems, Vol. 22, No. 1, pp. 53–76, 2012.",
      "citeRegEx" : "44",
      "shortCiteRegEx" : null,
      "year" : 2012
    }, {
      "title" : "A Novel Hybrid Artificial Immune Inspired Approach for Online Break-in Fraud Detection,",
      "author" : [ "R. Huang", "H. Tawfik", "A. Nagar" ],
      "venue" : "International Conference on Computational Science,",
      "citeRegEx" : "45",
      "shortCiteRegEx" : "45",
      "year" : 2010
    }, {
      "title" : "Immunising Automated Teller Machines",
      "author" : [ "M. Ayara", "J. Timmis", "R. deLemos", "S. Forrest" ],
      "venue" : "InProceedings of the 4th International Conference onArtificial Immune Systems,",
      "citeRegEx" : "46",
      "shortCiteRegEx" : "46",
      "year" : 2005
    }, {
      "title" : "Genetic programming for prevention of cyber terrorism through dynamic and evolving intrusion detection",
      "author" : [ "James V. Hansena", "Paul Benjamin Lowrya", "Rayman D. Meservya", "Daniel M. c Donald" ],
      "venue" : "\"Journal Decision Support Systems,",
      "citeRegEx" : "47",
      "shortCiteRegEx" : "47",
      "year" : 2007
    }, {
      "title" : "Detecting credit card fraud by genetic algorithm and scatter search",
      "author" : [ "EkremDuman", "M. HamdiOzcelik" ],
      "venue" : "Expert Systems with Applications",
      "citeRegEx" : "48",
      "shortCiteRegEx" : "48",
      "year" : 2011
    }, {
      "title" : "Fraud Detection of Credit Card Payment System by Genetic Algorithm",
      "author" : [ "K.RamaKalyani", "D.UmaDevi" ],
      "venue" : "International Journal of Scientific & Engineering Research Volume 3,",
      "citeRegEx" : "49",
      "shortCiteRegEx" : "49",
      "year" : 2012
    }, {
      "title" : "Fuzzy Darwinian Detection of Credit Card Fraud",
      "author" : [ "P. Bentley", "J. Kim", "G. Jung", "J. Choi" ],
      "venue" : "Proc. of 14  th Annual Fall Symposium of the Korean Information Processing Society",
      "citeRegEx" : "50",
      "shortCiteRegEx" : "50",
      "year" : 2000
    }, {
      "title" : "Credit Card Fraud Detection using Hidden Markov Model",
      "author" : [ "AbhinavSrivastava", "AmlanKundu", "ShamikSural", "Arun K. Majumdar" ],
      "venue" : "IEEE Transactions on dependable and secure computing, Volume",
      "citeRegEx" : "52",
      "shortCiteRegEx" : "52",
      "year" : 2008
    }, {
      "title" : "A Survey on Hidden Markov Model for Credit Card Fraud Detection",
      "author" : [ "Anshul Singh", "Devesh Narayan" ],
      "venue" : "International Journal of Engineering and Advanced Technology (IJEAT),",
      "citeRegEx" : "53",
      "shortCiteRegEx" : "53",
      "year" : 2012
    }, {
      "title" : "K.lakshminadh “Markova Scheme for Credit Card Fraud Detection",
      "author" : [ "B.SanjayaGandhi", "R.LaluNaik", "S.Gopi Krishna" ],
      "venue" : "International Conference on Advanced Computing, Communication and Networks;",
      "citeRegEx" : "54",
      "shortCiteRegEx" : "54",
      "year" : 2011
    }, {
      "title" : "Analysis on Credit Card Fraud Detection Methods",
      "author" : [ "S. Benson Edwin Raj", "A. Annie Portia" ],
      "venue" : "IEEE-International Conference on Computer, Communication and Electrical Technology;",
      "citeRegEx" : "55",
      "shortCiteRegEx" : "55",
      "year" : 2011
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "Although, credit card fraud detection has gained attention and extensive studyespecially in recent years and there are lots of surveys about this kind of fraud such as [1], [2], [3],neither classify all credit card fraud detection techniques with analysis of datasets and attributes.",
      "startOffset" : 173,
      "endOffset" : 176
    }, {
      "referenceID" : 1,
      "context" : "Although, credit card fraud detection has gained attention and extensive studyespecially in recent years and there are lots of surveys about this kind of fraud such as [1], [2], [3],neither classify all credit card fraud detection techniques with analysis of datasets and attributes.",
      "startOffset" : 178,
      "endOffset" : 181
    }, {
      "referenceID" : 1,
      "context" : "Different credit card fraud tricks belong mainly to two groups of application and behavioral fraud [3].",
      "startOffset" : 99,
      "endOffset" : 102
    }, {
      "referenceID" : 1,
      "context" : "Mail theft fraud occurs when the fraudster get a credit card in mail or personal information from bank before reaching to actual cardholder[3].",
      "startOffset" : 139,
      "endOffset" : 142
    }, {
      "referenceID" : 3,
      "context" : "For example, no revenue is obtained by stopping a fraudulent transaction of a few dollars [5, 7].",
      "startOffset" : 90,
      "endOffset" : 96
    }, {
      "referenceID" : 5,
      "context" : "For example, no revenue is obtained by stopping a fraudulent transaction of a few dollars [5, 7].",
      "startOffset" : 90,
      "endOffset" : 96
    }, {
      "referenceID" : 0,
      "context" : "There are numerous model creation methods for a typical two class classification tasksuch as rule induction [1], decision trees [2] and neural networks [3].",
      "startOffset" : 128,
      "endOffset" : 131
    }, {
      "referenceID" : 1,
      "context" : "There are numerous model creation methods for a typical two class classification tasksuch as rule induction [1], decision trees [2] and neural networks [3].",
      "startOffset" : 152,
      "endOffset" : 155
    }, {
      "referenceID" : 2,
      "context" : "This approach is proven to reliably detect most fraud tricks which have been observed before [4], it also known as misuse",
      "startOffset" : 93,
      "endOffset" : 96
    }, {
      "referenceID" : 3,
      "context" : "This is because we don‟t expect fraudsters behave the same as the account owner or be aware of the behavior model of the owner [5].",
      "startOffset" : 127,
      "endOffset" : 130
    }, {
      "referenceID" : 4,
      "context" : "transactions, [6].",
      "startOffset" : 14,
      "endOffset" : 17
    }, {
      "referenceID" : 5,
      "context" : "assumed to be normal in further analysis[7].",
      "startOffset" : 40,
      "endOffset" : 43
    }, {
      "referenceID" : 7,
      "context" : "1 Artificial Neural Network An artificial neural network (ANN) is a set of interconnected nodes designed to imitate the functioning of the human brain [9].",
      "startOffset" : 151,
      "endOffset" : 154
    }, {
      "referenceID" : 8,
      "context" : "[14] used a dataset to train a three layers backpropagation neural network in combination with genetic algorithms (GA)[15]forcredit card fraud detection.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 9,
      "context" : "[14] used a dataset to train a three layers backpropagation neural network in combination with genetic algorithms (GA)[15]forcredit card fraud detection.",
      "startOffset" : 118,
      "endOffset" : 122
    }, {
      "referenceID" : 10,
      "context" : "[16] developed a neural network based data mining system for credit card fraud detection.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 11,
      "context" : "In [17], a P-RCE neural network was applied for credit card fraud detection.",
      "startOffset" : 3,
      "endOffset" : 7
    }, {
      "referenceID" : 12,
      "context" : "P-RCE is a type of radial-basis function networks [18, 19]that usually applied for pattern recognition tasks.",
      "startOffset" : 50,
      "endOffset" : 58
    }, {
      "referenceID" : 13,
      "context" : "P-RCE is a type of radial-basis function networks [18, 19]that usually applied for pattern recognition tasks.",
      "startOffset" : 50,
      "endOffset" : 58
    }, {
      "referenceID" : 14,
      "context" : "proposed a model for real time fraud detection based on bidirectional neural networks [20].",
      "startOffset" : 86,
      "endOffset" : 90
    }, {
      "referenceID" : 15,
      "context" : "Again in [21] a parallel granular neural network (GNN) is proposed to speed up data mining and knowledge discoveryprocess for credit card fraud detection.",
      "startOffset" : 9,
      "endOffset" : 13
    }, {
      "referenceID" : 16,
      "context" : "SOM provides a clustering method, which is appropriate for constructing and analyzing customer profiles,in credit card fraud detection, as suggested in [23].",
      "startOffset" : 152,
      "endOffset" : 156
    }, {
      "referenceID" : 17,
      "context" : "7 updated iteratively, based on input samples [24], in latter, test data is classified automatically into normal and fraudulent classes through the procedure of mapping.",
      "startOffset" : 46,
      "endOffset" : 50
    }, {
      "referenceID" : 18,
      "context" : "As stated in [25], after training the SOM, new unseen transactions are compared to normal and fraud clusters, if it is similar to all",
      "startOffset" : 13,
      "endOffset" : 17
    }, {
      "referenceID" : 19,
      "context" : "[26] proposed hybrid supervised (SICLN) and unsupervised (ICLN)learning networkfor credit card fraud detection.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 20,
      "context" : "The immune system‟s detectors are the antibodies that are capable to recognition and destruction harmful and risky antigens [27].",
      "startOffset" : 124,
      "endOffset" : 128
    }, {
      "referenceID" : 21,
      "context" : "The thymus is the organ to which a class of immune cells named Tcells migrates and maturates [28].",
      "startOffset" : 93,
      "endOffset" : 97
    }, {
      "referenceID" : 22,
      "context" : "Artificial Immune System (AIS) is a recent sub field based on the biological metaphor of the immune system [29].",
      "startOffset" : 107,
      "endOffset" : 111
    }, {
      "referenceID" : 23,
      "context" : "Researchers have used the concepts of immunology in order to develop a set of algorithms, such as negative selection algorithm [30], immune networks algorithm [31], clonal selection algorithm [32], and the dendritic cells algorithm [33].",
      "startOffset" : 127,
      "endOffset" : 131
    }, {
      "referenceID" : 24,
      "context" : "Researchers have used the concepts of immunology in order to develop a set of algorithms, such as negative selection algorithm [30], immune networks algorithm [31], clonal selection algorithm [32], and the dendritic cells algorithm [33].",
      "startOffset" : 159,
      "endOffset" : 163
    }, {
      "referenceID" : 25,
      "context" : "Researchers have used the concepts of immunology in order to develop a set of algorithms, such as negative selection algorithm [30], immune networks algorithm [31], clonal selection algorithm [32], and the dendritic cells algorithm [33].",
      "startOffset" : 192,
      "endOffset" : 196
    }, {
      "referenceID" : 26,
      "context" : "Researchers have used the concepts of immunology in order to develop a set of algorithms, such as negative selection algorithm [30], immune networks algorithm [31], clonal selection algorithm [32], and the dendritic cells algorithm [33].",
      "startOffset" : 232,
      "endOffset" : 236
    }, {
      "referenceID" : 27,
      "context" : "1 Negative Selection: Negative Selection Algorithm or NSA proposed by [34] is a change detection algorithm based on the",
      "startOffset" : 70,
      "endOffset" : 74
    }, {
      "referenceID" : 28,
      "context" : "al [35] proposed an AIS based model for online credit card fraud detection.",
      "startOffset" : 3,
      "endOffset" : 7
    }, {
      "referenceID" : 29,
      "context" : "On the basis of clonal selection principle, clonal selection algorithm was initially proposed in [36] and formally explained in [37].",
      "startOffset" : 97,
      "endOffset" : 101
    }, {
      "referenceID" : 30,
      "context" : "On the basis of clonal selection principle, clonal selection algorithm was initially proposed in [36] and formally explained in [37].",
      "startOffset" : 128,
      "endOffset" : 132
    }, {
      "referenceID" : 29,
      "context" : "al in [36] applied the AIRS in fraud detection on credit card transactions.",
      "startOffset" : 6,
      "endOffset" : 10
    }, {
      "referenceID" : 6,
      "context" : "alin [8] proposed AIRS on credit card fraud detection.",
      "startOffset" : 5,
      "endOffset" : 8
    }, {
      "referenceID" : 31,
      "context" : "Instead of using a central coordinator, the nature immune systems sustain the appropriate level of immune responses by maintaining the equilibrium status between antibody suppression and stimulation using idiotypes and paratopes antibodies [38], [39].",
      "startOffset" : 240,
      "endOffset" : 244
    }, {
      "referenceID" : 32,
      "context" : "Instead of using a central coordinator, the nature immune systems sustain the appropriate level of immune responses by maintaining the equilibrium status between antibody suppression and stimulation using idiotypes and paratopes antibodies [38], [39].",
      "startOffset" : 246,
      "endOffset" : 250
    }, {
      "referenceID" : 33,
      "context" : "The first Artificial Immune Network (AIN) proposed by [40].",
      "startOffset" : 54,
      "endOffset" : 58
    }, {
      "referenceID" : 34,
      "context" : "al [41] introduced the AISFD, which adopted thetechniques developed by CBR (case based reasoning) communityand applied various methods borrowed from genetic algorithm andother techniques to clone the B cells (network nodes) for mortgage fraud detection.",
      "startOffset" : 3,
      "endOffset" : 7
    }, {
      "referenceID" : 35,
      "context" : "4 Danger Theory: The novel immune theory, named Danger Theory was proposed in 1994 [42].",
      "startOffset" : 83,
      "endOffset" : 87
    }, {
      "referenceID" : 36,
      "context" : "According to the theory a useful evolutionarily immune system should focus on those things that are foreign and dangerous, rather than on those that are simply foreign [43].",
      "startOffset" : 168,
      "endOffset" : 172
    }, {
      "referenceID" : 37,
      "context" : "Wong [44] presents the AISCCFD prototype proposed to measure and manage the memory population and mutate detectors in real time.",
      "startOffset" : 5,
      "endOffset" : 9
    }, {
      "referenceID" : 38,
      "context" : "al [45] presented a novel hybrid Artificial Immune inspired model for fraud detection by combining triplealgorithms: CSPRA, the dendritic cell algorithm (DCA), and CART.",
      "startOffset" : 3,
      "endOffset" : 7
    }, {
      "referenceID" : 39,
      "context" : "al [46] applied AIS to predict failures of ATM 1 .",
      "startOffset" : 3,
      "endOffset" : 7
    }, {
      "referenceID" : 9,
      "context" : "3 Genetic Algorithm (GA) Inspired from natural evolution, Genetic algorithms (GA), were originally introduced by John Holland [15].",
      "startOffset" : 126,
      "endOffset" : 130
    }, {
      "referenceID" : 40,
      "context" : "Genetic Programming (GP)[47] is an extension of genetic algorithms that represent each individual by a tree rather than a bit string.",
      "startOffset" : 24,
      "endOffset" : 28
    }, {
      "referenceID" : 41,
      "context" : "developed a method for credit card fraud detection [48].",
      "startOffset" : 51,
      "endOffset" : 55
    }, {
      "referenceID" : 42,
      "context" : "[49] presented a model of credit card fraud detection based on the principles of genetic algorithm.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 43,
      "context" : "[50]developed a genetic programming based fuzzy system to extract rules for",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 44,
      "context" : "In credit card fraud detection a HMM is trained for modeling the normal behavior encoded in user profiles [52].",
      "startOffset" : 106,
      "endOffset" : 110
    }, {
      "referenceID" : 47,
      "context" : "HMM produces high false positive rate [55].",
      "startOffset" : 38,
      "endOffset" : 42
    }, {
      "referenceID" : 41,
      "context" : "5 Support Vector Machine (SVM) Support vector machine (SVM)[57] is a supervised learning model with associated learning algorithms that can analyze and recognize patterns for classification and regression tasks[48].",
      "startOffset" : 210,
      "endOffset" : 214
    }, {
      "referenceID" : 29,
      "context" : "The lack of publicly available database has been a limiting factor for the publications on financial fraud detection [36], particularly credit card transactions.",
      "startOffset" : 117,
      "endOffset" : 121
    }, {
      "referenceID" : 41,
      "context" : "Altogether, some works build their own data set for evaluation [48], [93].",
      "startOffset" : 63,
      "endOffset" : 67
    }, {
      "referenceID" : 29,
      "context" : "However others use data sets which are gains by certain banks or financial institutions in a specific time window [36], [32], [94], [59], [95], and [96].",
      "startOffset" : 114,
      "endOffset" : 118
    }, {
      "referenceID" : 25,
      "context" : "However others use data sets which are gains by certain banks or financial institutions in a specific time window [36], [32], [94], [59], [95], and [96].",
      "startOffset" : 120,
      "endOffset" : 124
    }, {
      "referenceID" : 29,
      "context" : "(2008)[36], soltani et al.",
      "startOffset" : 6,
      "endOffset" : 10
    }, {
      "referenceID" : 6,
      "context" : "[8],A.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 28,
      "context" : "(2011) [35], Siddhartha et al.",
      "startOffset" : 7,
      "endOffset" : 11
    }, {
      "referenceID" : 44,
      "context" : "(2008) [52], John Zhong et al.",
      "startOffset" : 7,
      "endOffset" : 11
    }, {
      "referenceID" : 19,
      "context" : "(2012) [26], Qibei Lu et al.",
      "startOffset" : 7,
      "endOffset" : 11
    }, {
      "referenceID" : 29,
      "context" : "(2008)[36], Siddhartha et al.",
      "startOffset" : 6,
      "endOffset" : 10
    }, {
      "referenceID" : 43,
      "context" : "(2008) [50], John Zhong et al.",
      "startOffset" : 7,
      "endOffset" : 11
    }, {
      "referenceID" : 19,
      "context" : "(2012) [26], Qibei Lu et al.",
      "startOffset" : 7,
      "endOffset" : 11
    }, {
      "referenceID" : 3,
      "context" : "(2002) [5], Siddhartha et al.",
      "startOffset" : 7,
      "endOffset" : 10
    }, {
      "referenceID" : 44,
      "context" : "(2008) [52], John Zhong et al.",
      "startOffset" : 7,
      "endOffset" : 11
    }, {
      "referenceID" : 19,
      "context" : "(2012) [26], Qibei Lu et al.",
      "startOffset" : 7,
      "endOffset" : 11
    }, {
      "referenceID" : 19,
      "context" : "(2012) [26], Maes S.",
      "startOffset" : 7,
      "endOffset" : 11
    }, {
      "referenceID" : 3,
      "context" : "(2002) [5], Qibei Lu et al.",
      "startOffset" : 7,
      "endOffset" : 10
    }, {
      "referenceID" : 6,
      "context" : "[8], Maes S.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 3,
      "context" : "(2002) [5], Philip K.",
      "startOffset" : 7,
      "endOffset" : 10
    }, {
      "referenceID" : 44,
      "context" : "(2008) [52], John Zhong et al.",
      "startOffset" : 7,
      "endOffset" : 11
    }, {
      "referenceID" : 19,
      "context" : "(2012) [26], Qibei Lu et al.",
      "startOffset" : 7,
      "endOffset" : 11
    }, {
      "referenceID" : 29,
      "context" : "(2008)[36], Maes S.",
      "startOffset" : 6,
      "endOffset" : 10
    }, {
      "referenceID" : 3,
      "context" : "(2002) [5], Tao guo et al.",
      "startOffset" : 7,
      "endOffset" : 10
    }, {
      "referenceID" : 19,
      "context" : "(2012) [26], Qibei Lu et al.",
      "startOffset" : 7,
      "endOffset" : 11
    }, {
      "referenceID" : 29,
      "context" : ",(2008)[36], soltani et al.",
      "startOffset" : 7,
      "endOffset" : 11
    }, {
      "referenceID" : 6,
      "context" : "[8], Philip K.",
      "startOffset" : 0,
      "endOffset" : 3
    } ],
    "year" : 2016,
    "abstractText" : "Credit card plays a very important rule in today's economy. It becomes an unavoidable part of household, business and global activities. Although using credit cards provides enormous benefits when used carefully and responsibly,significant credit and financial damagesmay be causedby fraudulent activities. Many techniques have been proposed to confront thegrowthin credit card fraud. However, all of these techniques have the same goal of avoiding the credit card fraud; each one has its own drawbacks, advantages and characteristics. In this paper, after investigating difficultiesof credit card fraud detection, we seek to review the state of the art in credit card fraud detection techniques, datasets and evaluation criteria.The advantages and disadvantages of fraud detection methods are enumerated and compared.Furthermore, a classification of mentioned techniques into two main fraud detection approaches, namely, misuses (supervised) and anomaly detection (unsupervised) is presented. Again, a classification of techniques is proposed based on capability to process the numerical and categorical datasets. Different datasets used in literatureare then described and grouped into real and synthesized data and the effective and common attributesare extracted for further usage.Moreover, evaluation employed criterions in literature are collected and discussed.Consequently, open issues for credit card fraud detection are explained as guidelinesfor",
    "creator" : "Microsoft® Word 2010"
  }
}