{
  "name" : "1612.01812.pdf",
  "metadata" : {
    "source" : "META",
    "title" : "Control Matching via Discharge Code Sequences",
    "authors" : [ "Dang Nguyen", "Wei Luo", "Dinh Phung", "Svetha Venkatesh" ],
    "emails" : [ "svetha.venkatesh}@deakin.edu.au" ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "Recently, using ICD codes [9] encoded in Electronic Medical Records (EMR) for patient similarity matching has attracted a lot of attention [1, 4, 6]. The basic idea is that a patient (called a case) is typically paired with a clinically similar patient (called a control) with respect to ICD code sequence. To determine the similarity of two ICD code sequences, one can compare their primary diagnosis (i.e., their first ICD code) [1, 6] or compute their Hamming distance [5]. A major difficulty in comparing ICD code sequences is the variation in encoding, i.e., different ICD codes can be used to record the same disease. For example, both ICD codes I20.0 and R57.0 are related to “heart issue”. Another difficulty is the sequential importance in the code sequences. Most existing approaches miss to leverage either the clinical relation among syntactically different ICD codes or the relative position of ICD codes within a sequence [5, 6].\nTo incorporate these two sets of important information in patient similarity matching, we here introduce WVM, a method that matches sequences of ICD codes within the embedded vector space. The method embeds ICD codes using Word2Vec [7] to capture semantic similarity among syntactically different codes. It also has a new sequential matching technique that leverages the domain coding convention to capture similarity among patients with complex syndromes and comorbidities. Our proposed method not only addresses the unavoidable coding variation problem but also considers the important sequential structure in ICD code sequences. We evaluate the performance of our model based on the similarity of the matched patients on two sets of outcomes: 28-day readmission and death due to cancer. A good matching should produce patient pairs similar in these two outcomes. Our cohort consists of more than 220,000 patients whose data were collected from a state-wide cancer registry in Australia—The study constitutes the first step for a set of comparative observational studies. While sharing a similarity with medical concept embedding as in Code sum based matching (CSM) [2], our framework with the proposed sequential matching yields better matching result. In comparison with recent non-embedding approaches such as Primary code based matching (PCM) [6] and Hamming distance based matching (HDM) [5], we also achieve a better performance."
    }, {
      "heading" : "2 Word2Vec based matching (WVM)",
      "text" : "The proposed WVM method for patient similarity matching has two phases.\n30th Conference on Neural Information Processing Systems (NIPS 2016), Barcelona, Spain.\nar X\niv :1\n61 2.\n01 81\n2v 1\n[ cs\n.L G\n] 2\nD ec\n2 01"
    }, {
      "heading" : "2.1 Phase 1: Learning ICD code vectors",
      "text" : "WVM uses Word2Vec (Skip-gram model [7]) to learn ICD code vectors that can capture the latent relations among ICD codes. This idea was also used in [3, 2]. The local context is defined to be ICD codes that appear in the same episode (admission) with a window size of 5. Those ICD code vectors are then used in a sequential matching algorithm in phase 2."
    }, {
      "heading" : "2.2 Phase 2: Building a matching algorithm",
      "text" : "The inputs of the sequential matching (SM) algorithm are a group of cases (case group) and a group of controls (control group). We will describe how we select case group and control group in Section 3.2. SM has three main steps. Step 1: For a given case tc(i) it finds a validation group that consists of the controls that have the same gender and age group with tc(i). Matching on factors such as gender and age is commonly used in case-control studies [8]. Step 2: It generates two sets S and matched to store the controls that match t ICD codes in tc(i) (t ∈ [0,n], where n is the number of ICD codes in tc(i)). Step 3: It matches tc(i) with a control based on S and matched.\nIn steps 2 and 3, to find a matching control for tc(i), there are three scenarios to consider.\nScenario 1: We can find the controls that match all ICD codes in tc(i). SM selects randomly a control in S for it to be the matching control mc.\nScenario 2: We cannot find any control that matches all ICD codes in tc(i) but we are still able to find the controls that match at least one ICD code in tc(i). Thus, S is empty but matched is not. Assume that matched contains the controls that match (k−1) ICD codes in tc(i). Since we cannot find any control that matches the kth ICD code in tc(i) (called tc(i)k ), SM tries to search for a control vc( j) whose the kth ICD code (called vc( j)k ) is similar to tc (i) k . SM first obtains the ICD code vector vi of tc (i) k . For each vc ( j) in matched, it obtains the ICD code vector v j of vc ( j) k . It then computes the cosine distance between vi and v j. The matching control for tc(i) is the one with the smallest distance.\nScenario 3: We cannot find any control that matches the first ICD code in tc(i). Thus, both S and matched are empty. SM attempts to match tc(i) with a control in validation group whose the first ICD code is similar to the first ICD code in tc(i) by computing the distance between them.\nWe provide three examples as shown in Figures 1-3 to demonstrate the three scenarios processed by steps 2 and 3."
    }, {
      "heading" : "3 Experiments",
      "text" : ""
    }, {
      "heading" : "3.1 Data",
      "text" : "The dataset is a cancer cohort of more than 220,000 patients (58.2% males, median age 71), collected between 1997 and 2012 from a state-wide cancer registry including 21 hospitals in Australia. The data attributes include patient demographic and diagnoses indicated by ICD-10 codes. There is no information of labs, procedures, and drugs. A subset of data for control matching was selected as follows: 1) we removed the ICD codes occurring less than 30 times; 2) we only kept the admissions\nthat have at least one ICD code; and 3) we removed the admissions that have discharge date after 2008/12/31. The remaining dataset contains 1,810,967 admissions (216,844 unique patients)."
    }, {
      "heading" : "3.2 Construction of case group and control group",
      "text" : "First, we selected randomly a combination of a hospital H and an admission year Y from the dataset. We then selected the admissions that have the same hospital and admission year as H and Y . Note that each admission is associated with a different patient. This set is called HY . Final, we constructed the case group by sampling 200 admissions from HY . The remaining admissions in HY were used to construct the control group. The admissions in the control group are associated with the patients who are different from those in the case group."
    }, {
      "heading" : "3.3 Performance evaluation",
      "text" : "We ran four methods randomly in 150 times. To have a fair comparison, all baselines were performed after step 1 in SM was done (i.e., after we obtained a validation group). Each time of running, we obtained 200 cases and 200 matching controls and measured the agreement of the two cohorts on the two clinical outcomes."
    }, {
      "heading" : "3.3.1 Readmission matching accuracy",
      "text" : "Let trial(i) = (y1,y2, ...,y200) be a set of readmission statuses of 200 cases at the iteration i (true values). yr = trial (i) r (r ∈ [1,200]) is one of four readmission statuses: “Missing” (0.01%), “Readmitted within 28 days to another facility” (4.07%), “Readmitted within 28 days to the same facility” (23.03%), and “Not formally readmitted within 28 days” (72.89%). Let match(i) be a set of readmission statuses of 200 matching controls at the iteration i (predicted values). The readmission matching accuracy at the iteration i is computed as follows.\nacc(i) = 200\n∑ r=1\nω ( trial(i)r ,match (i) r ) /200, (1)\nwhere ω ( trial(i)r ,match (i) r ) = { 0 if trial(i)r 6= match(i)r 1 if trial(i)r = match (i) r .\nTable 1 reports the average readmission matching accuracy for 150 running times of each method. Our proposed method (WVM) is better than non-embedding ICD code methods (PCM and HDM). Although both CSM and WVM learn ICD code vectors, CSM1 however does not consider the importance of the orderliness of ICD codes within a code sequence; its accuracy is thus lower than WVM."
    }, {
      "heading" : "3.3.2 Incidence rate (IR) error for cancer mortality",
      "text" : "Let trial(i) = ((s1, t1) ,(s2, t2) , ...,(s200, t200)) be a set of 2-tuples (discharge date, death date) of 200 cases at the iteration i. Each case has a discharge date and a death date that may be null. For example, the first case in the case group has (discharge date, death date) of (2005/07/11, 2008/05/12); the second case has (discharge date, death date) of (2005/10/27, null). The incidence rate of the case group at the iteration i (true value) is computed as follows.\nIR ( trial(i) ) =\ncount (# of death cases) 200\n∑ r=1,tr 6=null\n(tr− sr)+ 200\n∑ r=1,tr=null\n(dcensor− sr) , (2)\nwhere count (# of death cases) is the number of cases that have death date (i.e., their death dates are not null), tr and sr are death date and discharge date respectively, and dcensor is the censoring date (i.e., the end date of our study, that is 2008/12/31).\nSimilarly, we can compute the incidence rate of 200 matching controls at the iteration i (predicted value), called IR ( match(i) ) . The incidence rate error (absolute error) at the iteration i is computed\nas follows.\nIR(i)err = ∣∣∣IR(trial(i))− IR(match(i))∣∣∣ (3)\nTable 2 reports the mean incidence rate error of each method in 150 running times. Again, the mean incidence rate error of our proposed method (WVM) has the smallest value.\nTable 1: Readmission matching accuracy\nMethod Accuracy PCM [6] 0.7565±0.0070 HDM [5] 0.7693±0.0067 CSM [2] 0.7755±0.0067 WVM 0.7952±0.0068\nTable 2: Incidence rate error\nMethod IR Error PCM [6] 0.0342±0.0032 HDM [5] 0.0316±0.0026 CSM [2] 0.0322±0.0028 WVM 0.0299±0.0022"
    }, {
      "heading" : "4 Conclusion",
      "text" : "We have introduced WVM, a case-control matching method that leverages both representational similarity among ICD-10 codes and the sequential structure of coding in each admission. The evaluation on two similarity measures based on clinical outcomes, namely readmission matching accuracy and incidence rate error for cancer mortality, proves that WVM constitutes an effective solution for patient similarity matching in a large cancer cohort. In practice, it means that WVM can identify a control cohort better matching the case cohort, hence minimizing the potential bias between the two cohorts. This enables more effective experiment or quasi-experiment designs using a large coded dataset that is similar to ours.\n1For a given case tc(i), CSM sums up the vectors of all ICD codes in tc(i) into a single vector. For each control, it performs the same task. It then determines the similarity between tc(i) and a control by computing the cosine distance between their summed vectors."
    } ],
    "references" : [ {
      "title" : "Mcneill dysphagia therapy program: a case-control study",
      "author" : [ "Giselle Carnaby-Mann", "Michael Crary" ],
      "venue" : "Archives of Physical Medicine and Rehabilitation,",
      "citeRegEx" : "1",
      "shortCiteRegEx" : "1",
      "year" : 2010
    }, {
      "title" : "Medical concept representation learning from electronic health records and its application on heart failure prediction",
      "author" : [ "Edward Choi", "Andy Schuetz", "Walter F Stewart", "Jimeng Sun" ],
      "venue" : "arXiv preprint arXiv:1602.03686,",
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 2016
    }, {
      "title" : "Learning low-dimensional representations of medical concepts",
      "author" : [ "Youngduck Choi", "Chill Yi-I Chiu", "David Sontag" ],
      "venue" : "In The AMIA Summit on Clinical Research Informatics,",
      "citeRegEx" : "3",
      "shortCiteRegEx" : "3",
      "year" : 2016
    }, {
      "title" : "A method for inferring medical diagnoses from patient similarities",
      "author" : [ "Assaf Gottlieb", "Gideon Y Stein", "Eytan Ruppin", "Russ B Altman", "Roded Sharan" ],
      "venue" : "BMC Medicine,",
      "citeRegEx" : "4",
      "shortCiteRegEx" : "4",
      "year" : 2013
    }, {
      "title" : "Using participant similarity for the classification of epidemiological data on hepatic steatosis",
      "author" : [ "Tommy Hielscher", "Myra Spiliopoulou", "Henry Völzke", "Jens-Peter Kühn" ],
      "venue" : "In The IEEE 27th International Symposium on Computer-Based Medical Systems,",
      "citeRegEx" : "5",
      "shortCiteRegEx" : "5",
      "year" : 2014
    }, {
      "title" : "Personalized mortality prediction driven by electronic medical data and a patient similarity metric",
      "author" : [ "Joon Lee", "David M Maslove", "Joel Dubin" ],
      "venue" : "PloS one,",
      "citeRegEx" : "6",
      "shortCiteRegEx" : "6",
      "year" : 2015
    }, {
      "title" : "Distributed representations of words and phrases and their compositionality",
      "author" : [ "Tomas Mikolov", "Ilya Sutskever", "Kai Chen", "Greg Corrado", "Jeffrey Dean" ],
      "venue" : "Advances in Neural Information Processing Systems,",
      "citeRegEx" : "7",
      "shortCiteRegEx" : "7",
      "year" : 2013
    }, {
      "title" : "Analysis of matched case-control studies",
      "author" : [ "Neil Pearce" ],
      "venue" : "BMJ, 352:i969,",
      "citeRegEx" : "8",
      "shortCiteRegEx" : "8",
      "year" : 2016
    } ],
    "referenceMentions" : [ {
      "referenceID" : 0,
      "context" : "1 Introduction Recently, using ICD codes [9] encoded in Electronic Medical Records (EMR) for patient similarity matching has attracted a lot of attention [1, 4, 6].",
      "startOffset" : 154,
      "endOffset" : 163
    }, {
      "referenceID" : 3,
      "context" : "1 Introduction Recently, using ICD codes [9] encoded in Electronic Medical Records (EMR) for patient similarity matching has attracted a lot of attention [1, 4, 6].",
      "startOffset" : 154,
      "endOffset" : 163
    }, {
      "referenceID" : 5,
      "context" : "1 Introduction Recently, using ICD codes [9] encoded in Electronic Medical Records (EMR) for patient similarity matching has attracted a lot of attention [1, 4, 6].",
      "startOffset" : 154,
      "endOffset" : 163
    }, {
      "referenceID" : 0,
      "context" : ", their first ICD code) [1, 6] or compute their Hamming distance [5].",
      "startOffset" : 24,
      "endOffset" : 30
    }, {
      "referenceID" : 5,
      "context" : ", their first ICD code) [1, 6] or compute their Hamming distance [5].",
      "startOffset" : 24,
      "endOffset" : 30
    }, {
      "referenceID" : 4,
      "context" : ", their first ICD code) [1, 6] or compute their Hamming distance [5].",
      "startOffset" : 65,
      "endOffset" : 68
    }, {
      "referenceID" : 4,
      "context" : "Most existing approaches miss to leverage either the clinical relation among syntactically different ICD codes or the relative position of ICD codes within a sequence [5, 6].",
      "startOffset" : 167,
      "endOffset" : 173
    }, {
      "referenceID" : 5,
      "context" : "Most existing approaches miss to leverage either the clinical relation among syntactically different ICD codes or the relative position of ICD codes within a sequence [5, 6].",
      "startOffset" : 167,
      "endOffset" : 173
    }, {
      "referenceID" : 6,
      "context" : "The method embeds ICD codes using Word2Vec [7] to capture semantic similarity among syntactically different codes.",
      "startOffset" : 43,
      "endOffset" : 46
    }, {
      "referenceID" : 1,
      "context" : "While sharing a similarity with medical concept embedding as in Code sum based matching (CSM) [2], our framework with the proposed sequential matching yields better matching result.",
      "startOffset" : 94,
      "endOffset" : 97
    }, {
      "referenceID" : 5,
      "context" : "In comparison with recent non-embedding approaches such as Primary code based matching (PCM) [6] and Hamming distance based matching (HDM) [5], we also achieve a better performance.",
      "startOffset" : 93,
      "endOffset" : 96
    }, {
      "referenceID" : 4,
      "context" : "In comparison with recent non-embedding approaches such as Primary code based matching (PCM) [6] and Hamming distance based matching (HDM) [5], we also achieve a better performance.",
      "startOffset" : 139,
      "endOffset" : 142
    }, {
      "referenceID" : 6,
      "context" : "1 Phase 1: Learning ICD code vectors WVM uses Word2Vec (Skip-gram model [7]) to learn ICD code vectors that can capture the latent relations among ICD codes.",
      "startOffset" : 72,
      "endOffset" : 75
    }, {
      "referenceID" : 2,
      "context" : "This idea was also used in [3, 2].",
      "startOffset" : 27,
      "endOffset" : 33
    }, {
      "referenceID" : 1,
      "context" : "This idea was also used in [3, 2].",
      "startOffset" : 27,
      "endOffset" : 33
    }, {
      "referenceID" : 7,
      "context" : "Matching on factors such as gender and age is commonly used in case-control studies [8].",
      "startOffset" : 84,
      "endOffset" : 87
    }, {
      "referenceID" : 0,
      "context" : "yr = trial (i) r (r ∈ [1,200]) is one of four readmission statuses: “Missing” (0.",
      "startOffset" : 22,
      "endOffset" : 29
    }, {
      "referenceID" : 5,
      "context" : "Table 1: Readmission matching accuracy Method Accuracy PCM [6] 0.",
      "startOffset" : 59,
      "endOffset" : 62
    }, {
      "referenceID" : 4,
      "context" : "0070 HDM [5] 0.",
      "startOffset" : 9,
      "endOffset" : 12
    }, {
      "referenceID" : 1,
      "context" : "0067 CSM [2] 0.",
      "startOffset" : 9,
      "endOffset" : 12
    }, {
      "referenceID" : 5,
      "context" : "0068 Table 2: Incidence rate error Method IR Error PCM [6] 0.",
      "startOffset" : 55,
      "endOffset" : 58
    }, {
      "referenceID" : 4,
      "context" : "0032 HDM [5] 0.",
      "startOffset" : 9,
      "endOffset" : 12
    }, {
      "referenceID" : 1,
      "context" : "0026 CSM [2] 0.",
      "startOffset" : 9,
      "endOffset" : 12
    } ],
    "year" : 2016,
    "abstractText" : "In this paper, we consider the patient similarity matching problem over a cancer cohort of more than 220,000 patients. Our approach first leverages on Word2Vec framework to embed ICD codes into vector-valued representation. We then propose a sequential algorithm for case-control matching on this representation space of diagnosis codes. The novel practice of applying the sequential matching on the vector representation lifted the matching accuracy measured through multiple clinical outcomes. We reported the results on a large-scale dataset to demonstrate the effectiveness of our method. For such a large dataset where most clinical information has been codified, the new method is particularly relevant.",
    "creator" : "LaTeX with hyperref package"
  }
}