{
  "name" : "1701.08374.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Feature base fusion for splicing forgery detection based on neuro fuzzy",
    "authors" : [ "Habib Ghaffari Hadigheh" ],
    "emails" : [ "ghhabib2@live.utm.my", "ghazali.s@umt.edu.my" ],
    "sections" : [ {
      "heading" : null,
      "text" : "Keywords Machine Learning · Splicing Forgery Detection · Image Processing.\nHabib Ghaffari-Hadigheh Universiti Tecknologi Malaysia (UTM) Tel.: +98-914-3091405 E-mail: ghhabib2@live.utm.my\nGhazali bin sulong Universiti Malaysia Terengganu (UMT) Tel.: +60-177-467128 E-mail: ghazali.s@umt.edu.my\nar X\niv :1\n70 1.\n08 37\n4v 1\n[ cs\n.C V\n] 2\n9 Ja\nn 20"
    }, {
      "heading" : "1 Introduction",
      "text" : "Nowadays, exploitation of digital images and photos taken by various smart recording devices is getting more prevalent along with the extensive use of social media like Facebook, Twitter, and Instagram. Individuals tend to spend a considerable amount of time surfing the Internet, and share almost all moments of their lives, as well as events in their districts such as festivals, concerts or some dreadful incidents e.g. terrorist attacks, armed robberies or anti-human rights behaviors. Recently, so many devices exist for producing digital images, and almost each communication device has access to the Internet and is equipped with a digital camera which produces very high-resolution pictures. These snapshots and professionally taken images are of very big advantage, since they are accounted as an inevitable part of the accompanying contexts in the media, and they help to elucidate different aspects of events, while at the same time they could be a source of troublemaking consequences both in local and global scales.\nImages might be the mean of deliberately cynical distortion of a reality, and aimed to convey special messages without other corroborating documents. A manipulated image taken from a protest may be intended to exaggerate the crowd thronged in supporting of an idea which might be ignored by the authorities. Distorted shots that are claimed have been taken from private moments of celebrities might be used for extortion or imposing them to act in favor of third parties which are the anomaly in their background. This innate and potential quality of pictures in general and digital image in particular, would make them susceptible for forgery by digital image editing and post processing.\nAbove mentioned issues assert the necessity for providing reliable tools to authenticate the originality of such images, which attracted many researchers to work on detecting the possible traces of forgery. Forgery detection methods are categorized in two general branches, the active and the passive methods [Farid (2009)]. The former is based on the idea of inserting information inside the images and use them for authentication and proving of their integrity. This information is usually inserted either at the time of taking the photos or during the post-processing operations. This approach needs special kind of hardware while the information could easily be altered [Katzenbeisser et al (2000); Cox et al (2003)]. The latter exploits the image data to detect the possible clues of forgery. Since most of devices in the market are not equipped with such complicated and fancy tools to accomplish the first method, and consequently taken photos are free of such embedded information, passive methods are more practical [Farid (2009)].\nThere are different kinds of passive methods for detecting possible forgeries, while none of them claims to have 100 percent accuracy, since forgers sometimes professionally manipulate images such that detection of forgery becomes very hard and even an impossible job [Kirchner and Böhme (2007); Kirchner and Bohme (2008)]. Image splicing, copy-paste attack, and image retouching are three examples of passive methods. Most of the researches just focus on one type of these methods, because they usually don’t use common features of photos during their process [Avcibas et al (2004); Hsiao and Pei (2005)].\nIn this research, we only focus on image splicing methods. These methods are applicable when the forged image are produced by integration of more than one image. Splicing detection is the most challenging problem while there is almost no ultimate guaranteeing solution [Ms. Sushama (2014)]. To overcome this uncertainty,\nwe use Neuro-Fuzzy Inference System (NFIS) for the fusion of features extracted by three different splicing forgery detection methods; Discrete Wavelet Transformation (DWT) decompression [Fu et al (2006)], Edge images based on Gray Level Co-occurrence Matrix (GLCM) [Wang et al (2009)], and N-Run Length [Dong et al (2009)]. To the best of our knowledge this is the first study on using NFIS in the combination of these methods.\nThe reminder of this paper is organized as follows: In Section 2 a literature of problem is reviewed. The methodology of the study is described in Section 3. Section 4 depicts experimental results, and the final section includes the discussion on the results and potential future work directions."
    }, {
      "heading" : "2 Problem Background",
      "text" : "Image splicing is a kind of forgery attack implemented by integration of some fragments from the same image or others, without further post-processing such as smoothing of boundaries among adjacent fragments [Zhang et al (2008)]. Several researches have been conducted on splicing forgery detection. One group focused on detecting the possible forgery using statistical analysis of the image pixels information, others diverted their focus on deriving the inconsistency of light directions, to discover the potentially existent splicing forgery traces [Redi et al (2011)].\nAny splicing operation, even when the forger tries to mask it with blending techniques, leaves some traces in the image statistics. Subsequently, these statistical inconsistencies could be used for locating the manipulated place . The primary application of this approach traces back to forgery detection in digital signals [Farid (1999)]. The main idea was that, when digital data are deformed, spectrum analysis could be used as a detection mean. This tool had been adapted for 2d signal in image processing [Ng et al (2004)]. For more details we refer the interested readers to [Birajdar and Mankar (2013)].\nIllumination analysis is another trend for splicing forgery detection where illumination directions could be detected by processing the intensity of the colors in the neighboring pixels. The majority of objects in an authenticated image are supposed to have consistent light directions [Redi et al (2011)]. Even though, modern editing tools allow concealing the traces of splicing in a deceptive manner, but it is not always possible to match the lighting conditions of the fragments even when it has been perfumed by professionals. One of the pioneering attempts aimed to estimate the incident light direction of different objects in order to highlight the possible mismatches [Johnson and Farid (2005)]. Further findings are reported in [Johnson and Farid (2007); Zhang et al (2009)].\nIn spite of numerous practical findings in this area, all of the proposed methods suffer from a tangible degree of indeterminacy. This imperfection due to performing post-processing operations for hiding the traces of forgery or utilizing lossy compression formats. This problem is referred to as Uncertainty, and could be addressed by diverse approaches. One is to fuse more than one detection tool, either extracted features by each tool are intergraded before decision making [He et al (2006); Dong et al (2009); Chetty and Singh (2010)],or each tool individually results to a decision and a combination rule produces a final decision [Barni and Costanzo (2012)].\nUsing fuzzy as a combination rule in the fusion of forgery detection tools had been overlooked until it has been studied in Chetty and Singh (2010); Barni and Costanzo (2012)]. The main disadvantage of their method is that, adjusting membership functions in order to acquire accurate results is a time-consuming process. In this paper, we develop the idea presented in [Barni and Costanzo (2012)], and introduce a methodology in order to detect splicing forgery automatically using Neuro-Fuzzy fusion. The next section describes the steps of the proposed methodology."
    }, {
      "heading" : "3 Proposed Methodology",
      "text" : "The suggested method aims to combine three existing tools; DWT decompression, Edge images based on GLCM, and N-Run Length. In the sequel, three main steps are described in details. Preprocessing is the first step that has the responsibility to extract necessary data for the subsequent steps. This data includes features vectors from images for each tool and they are converted to decision values by a Support Vector Machine (SVM). These decision values are used for fusion based on an NFIS in the second step,. Analysis of the results and making final decisions are carried out in the last step. Fig. 1 illustrates the framework for fusion of forgery detection tools.\n3.1 Preprocessing Step\nThe first step is to make decision based on each forgery detection tool. Extraction of the features is the most important part of this step. The size of feature vectors in the Edge Image based on GLCM is reasonable [Wang et al (2009)], while Boosting Feature Selection (BFS) algorithm is used to reduce the size of feature vectors in DWT decompression [Fu et al (2006)] and N-Run Length [Dong et al (2009)]. Using BFS with an acceptable number of iterations, makes it possible to generate effective feature vectors with the smaller dimensions, an as a result, the main classification step could be accomplished faster. AdaBoost based feature selection\nsystem preserves a probability distribution over the training samples. These probabilities are assumed identical at the beginning of the learning stage. Adaboost adjusts them on a series of cycles via a weak learning algorithm. For each training sample, it affiliates a weight and these weights are updated by a multiplicative rule based on the errors of the former learning step. This process is carried out by giving the priority to those samples that are not classified correctly by the previous learning weak classifier. Thus, the samples with lower errors during the weak learning process have greater weights [Majid Valiollahzadeh et al (2008)]. Subsequently, a BFS system based on basic BFS introduced in [(Tieu and Viola, 2004)] is designed. Finally, SVM classifier with Radial Bases Function (RBF) kernel is used for stable classification, which provides a decision value of each tool for each individual image. Fig. 2 depicts the process of generating decision values based on SVM classifier.\n3.2 Rule Generation and Fusion Step\nLet us discuss the process of converting the decision values generated in the previous step into input values for fusion of forgery detection tools. All decision values are denoted as the detection rate, and should be standardized as a requirement for an NFIS. For this purpose, we have to convert them to numbers in [0, 1] [Platt et al (1999)]. The main idea is to extract the probability P (class/input) from the decision values of the SVM classifier. To this end, a sigmoid-based function is considered that fits with the output of the classifier to find two parameters A and B of Eq. 1.\np(f) = 1\n1 + exp(Af +B) , (1)\nwhere f is the decision value of the tool. Fig. 3 depicts a sample of the generated sigmoid function. The plus signs stand for the converted decision values which are fitted to an appropriate sigmoidal function.\nNow, these scaled values are considered as inputs for training/testing of the NFIS system, which integrates these values as a single decision value. Implementing details are presented in Section 4, and schematically depicted in Fig. 4.\n3.3 Evaluation and Comparison\nSensitivity and specificity are used for the construction of the final results. Let us define the following notations.\n– True positive (TP). The image is detected as a forged one, and it is really a forged image. – False Positive (FP). The image is detected as an authenticated one, while it is a forged image. – True Negative (TN). The image is detected as an authenticated one, and it is a real authenticate image. – False Negative (FN). The image is detected as forged one, while it is an authenticated image.\nHere, the sensitivity of the test stands for the proportion of images identified to be forged. Mathematically,\nsensitivity = number of TP\nnumber of TP + number of FN ,\n= number of TP\ntotal number of forged image in test samples .\nFurther, specificity is the proportion of authenticated images identified not to be forged. In mathematical notion, it is calculated as\nspecificity = number of TN\nnumber of TN + number of FP ,\n= number of TN\ntotal number of authenticate images in test samples ."
    }, {
      "heading" : "4 Experimental Results",
      "text" : "The proposed methodology was implemented on the benchmark data set Splicing Forgery Detection Data Set, provided by the Columbia University’s Computer Graphics and User Interfaces Lab [Yu-Feng Hsu (2006)]. It consists of 933 authenticated and 912 spliced image blocks of the size of 128×128. All images are in gray scale mode, and their blocks have been extracted from the CalPhotos image set. The splicing operation was down by cutting some part of the original image blocks and pasting inside the other original one, without any post processing operation. Fig. 5 depicts two images of this data set, one is authenticated and the other is its forged version. LIBSVM; a library for support vector machine has been utilized for implementation of the SVM classifier in Matlab [Chang and Lin (2011)]. Its RBF kernel has two parameters C and γ, must be specified before starting the training phase. Empirical results denote that RBF with default parameters values may imply to misclassification or overfitting of the classifier. Therefore, a method based on grid search was proposed and implemented [Dong et al (2009)].\nAll the calculations and implementations were performed using a desktop computer with an Intel(R) Core(TM)i7-2630QM CPU, 2.00 × 8 GHz processor, and 8 Gb of RAM on the Ubuntu 14.04 LTS operating system platform. Image processing toolbox of Matlab 8.1 is used for converting images to the matrices of the size 128×128. For obtaining the results, we carried out five runs, each run includes all images of the data set. In each run, 90% of images were randomly selected for training and the rest were left for testing of both SVMs and NFIS. For generating scaled values from each SVM classifier result, a method based on the one introduced in [Platt et al (1999)] was used. The image is considered the most authenticated as the associated output value approaches to one. Accordingly, authenticated images of the data set were labeled 1, and the others 0 in both training and testing steps. Complete algorithm and details on the performance of this method are presented thoroughly in [Platt et al (1999)], and a Matlab implementation is developed by [Lin et al (2007)].\nWe examined different kinds of Neuro-Fuzzy system to find out which of them has better accuracy rate. The input membership functions are considered as Gaussian. However, output membership function is selected either constant or linear, depending on the limitation of the fuzzy toolbox of Matlab. For implementation of NFIS, we applied the Matlab Fuzzy Toolbox. Based on the limitation of NFIS in Matlab, we are just able to implement Adaptive Neuro Fussy Inference System (ANFIS) [Turevskiy (2014); Castillo et al (2007)]. We classified the final results based on the threshold used by [Barni and Costanzo (2012)], when the final decision value of NFIS is greater than 0.5, the image was considered as authenticated one, and otherwise as a forged image. Fig. 4 depicts the flowchart of the evaluation step as well.\nThe results are reported in Tables 1 and 2. The former depicts the best obtained results of sensitivity measurement, and the latter shows the results of specificity. Five columns are included in both tables; the first column denotes the number of selected features by BFS, which varies from 30 to 100. The case when all all features are considered stands at the last row. The subsequent three columns respectively\ndenote the results of DWT, Edge Rune base on GLCM and N-Run Length, and the final column reports the results of the fusion based on NFIS.\nAs shown in Table 1, the best sensitivity for DWT and N-Run Length is achieved when all of the features are used, while this is not the case in others. The accuracy rate of sensitivity for NFIS reveals that there is no necessity for considering all features. Moreover, the results of the NFIS is as promising as the others. As denoted in Table 2, the behavior of specificity is contrariwise, the best results are obtained for Edge Rune base on GLCM and NFIS when all features are applied. However, the NFIS competes with the Edge Rune base on GLCM in specificity detection and approximately better than the two others."
    }, {
      "heading" : "5 Conclusion",
      "text" : "In this paper, we presented a methodology for fusion of features on the decision level, with the aim of automatically finding possible forgery traces in grayscale images. For this propose, we integrated the scaled decision values of three different tools using the NFIS. To achieve lower run time, we applied a BFS algorithm for detecting more efficients among all features.\nBased on the experimental results, our proposed method has almost promising results in comparison with individual tools. It seems that considering a trade-off between two objectives sensitivity and specificity is necessary for further investigation. Based on the limitation of our benchmark data set, we experimented only on grayscale images, while adapting the methodology on color images could be challenging. We restate that reducing the run time was not our main concern. Nevertheless, we observed that decreasing the number of features has the positive effect on the run time. Further study can be conducted using recently advanced machine learning methods such as deep learning.\nAcknowledgements We sincerely appreciate Columbia University Graphic Lab for the help in providing splicing forgery detection Data-set. We also acknowledge the UTM for providing facilities and fretful environment for this research."
    } ],
    "references" : [ ],
    "referenceMentions" : [ ],
    "year" : 2017,
    "abstractText" : "Most of researches on image forensics have been mainly focused on detection of artifacts introduced by a single processing tool. They lead in the development of many specialized algorithms looking for one or more particular footprints under specific settings. Naturally, the performance of such algorithms are not perfect, and accordingly the provided output might be noisy, inaccurate and only partially correct. Furthermore, a forged image in practical scenarios is often the result of utilizing several tools available by image-processing software systems. Therefore, reliable tamper detection requires developing more poweful tools to deal with various tempering scenarios. Fusion of forgery detection tools based on Fuzzy Inference System has been used before for addressing this problem. Adjusting the membership functions and defining proper fuzzy rules for attaining to better results are time-consuming processes. This can be accounted as main disadvantage of fuzzy inference systems. In this paper, a Neuro-Fuzzy inference system for fusion of forgery detection tools is developed. The neural network characteristic of these systems provides appropriate tool for automatically adjusting the membership functions. Moreover, initial fuzzy inference system is generated based on fuzzy clustering techniques. The proposed framework is implemented and validated on a benchmark image splicing data set in which three forgery detection tools are fused based on adaptive Neuro-Fuzzy inference system. The outcome of the proposed method reveals that applying Neuro Fuzzy inference systems could be a better approach for fusion of forgery detection tools.",
    "creator" : "LaTeX with hyperref package"
  }
}