{
  "name" : "1703.00887.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "How to Escape Saddle Points Efficiently",
    "authors" : [ "Chi Jin", "Rong Ge", "Praneeth Netrapalli", "Sham M. Kakade", "Michael I. Jordan" ],
    "emails" : [ "chijin@cs.berkeley.edu", "rongge@cs.duke.edu", "praneeth@microsoft.com", "sham@cs.washington.edu", "jordan@cs.berkeley.edu" ],
    "sections" : [ {
      "heading" : null,
      "text" : "ar X\niv :1\n70 3.\n00 88\n7v 1\n[ cs\n.L G\n] 2\nM ar\nOur results can be directly applied to many machine learning applications, including deep learning. As a particular concrete example of such an application, we show that our results can be used directly to establish sharp global convergence rates for matrix factorization. Our results rely on a novel characterization of the geometry around saddle points, which may be of independent interest to the non-convex optimization community."
    }, {
      "heading" : "1 Introduction",
      "text" : "Given a function f : Rd → R, gradient descent aims to minimize the function via the following iteration: xt+1 = xt − η∇f(xt), where η > 0 is a step size. Gradient descent and its variants (e.g., stochastic gradient) are widely used in machine learning applications due to their favorable computational properties. This is notably true in the deep learning setting, where gradients can be computed efficiently via backpropagation [Rumelhart et al., 1988].\nGradient descent is especially useful in high-dimensional settings because the number of iterations required to reach a point with small gradient is independent of the dimension (“dimensionfree”). More precisely, for a function that is ℓ-gradient Lipschitz (see Definition 1), it is well known that gradient descent finds an ǫ-first-order stationary point (i.e., a point x with ‖∇f(x)‖ ≤ ǫ)\n∗University of California, Berkeley. Email: chijin@cs.berkeley.edu †Duke University. Email: rongge@cs.duke.edu ‡Microsoft Research, India. Email: praneeth@microsoft.com §University of Washington. Email: sham@cs.washington.edu ¶University of California, Berkeley. Email: jordan@cs.berkeley.edu\nwithin ℓ(f(x0)− f⋆)/ǫ2 iterations [Nesterov, 1998], where x0 is the initial point and f⋆ is the optimal value of f . This bound does not depend on the dimension of x. In convex optimization, finding an ǫ-first-order stationary point is equivalent to finding an approximate global optimum.\nIn non-convex settings, however, convergence to first-order stationary points is not satisfactory. For non-convex functions, first-order stationary points can be global minima, local minima, saddle points or even local maxima. Finding a global minimum can be hard, but fortunately, for many non-convex problems, it is sufficient to find a local minimum. Indeed, a line of recent results show that, in many problems of interest, either all local minima are global minima (e.g., in tensor decomposition [Ge et al., 2015], dictionary learning [Sun et al., 2016a], phase retrieval [Sun et al., 2016b], matrix sensing [Bhojanapalli et al., 2016, Park et al., 2016], matrix completion [Ge et al., 2016], and certain classes of deep neural networks [Kawaguchi, 2016]). Moreover, there are suggestions that in more general deep newtorks most of the local minima are as good as global minima [Choromanska et al., 2014].\nOn the other hand, saddle points (and local maxima) can correspond to highly suboptimal solutions in many problems [see, e.g., Jain et al., 2015, Sun et al., 2016b]. Furthermore, Dauphin et al. [2014] argue that saddle points are ubiquitous in high-dimensional, non-convex optimization problems, and are thus the main bottleneck in training neural networks. Standard analysis of gradient descent cannot distinguish between saddle points and local minima, leaving open the possibility that gradient descent may get stuck at saddle points, either asymptotically or for a sufficiently long time so as to make training times for arriving at a local minimum infeasible. Ge et al. [2015] showed that by adding noise at each step, gradient descent can escape all saddle points in a polynomial number of iterations, provided that the objective function satisfies the strict saddle property (see Assumption A2). Lee et al. [2016] proved that under similar conditions, gradient descent with random initialization avoids saddle points even without adding noise. However, this result does not bound the number of steps needed to reach a local minimum.\nThough these results establish that gradient descent can find local minima in a polynomial number of iterations, they are still far from being efficient. For instance, the number of iterations required in Ge et al. [2015] is at least Ω(d4), where d is the underlying dimension. This is significantly suboptimal compared to rates of convergence to first-order stationary points, where the iteration complexity is dimension-free. This motivates the following question: Can gradient descent escape saddle points and converge to local minima in a number of iterations that is (almost) dimension-free?\nIn order to answer this question formally, this paper investigates the complexity of finding ǫsecond-order stationary points. For ρ-Hessian Lipschitz functions (see Definition 5), these points are defined as [Nesterov and Polyak, 2006]:\n‖∇f(x)‖ ≤ ǫ, and λmin(∇2f(x)) ≥ − √ ρǫ.\nUnder the assumption that all saddle points are strict (i.e., for any saddle point xs, λmin(∇2f(xs)) < 0), all second-order stationary points (ǫ = 0) are local minima. Therefore, convergence to secondorder stationary points is equivalent to convergence to local minima.\nThis paper studies gradient descent with phasic perturbations (see Algorithm 1). For ℓ-smooth functions that are also Hessian Lipschitz, we show that perturbed gradient descent will converge to an ǫ-second-order stationary point in Õ(ℓ(f(x0) − f⋆)/ǫ2), where Õ(·) hides polylog factors. This guarantee is almost dimension free (up to polylog(d) factors), answering the above highlighted question affirmatively. Note that this rate is exactly the same as the well-known convergence rate\nAlgorithm 1 Perturbed Gradient Descent (Meta-algorithm)\nfor t = 0, 1, . . . do if perturbation condition holds then\nxt ← xt + ξt, ξt uniformly ∼ B0(r) xt+1 ← xt − η∇f(xt)\nof gradient descent to first-order stationary points [Nesterov, 1998], up to log factors. Furthermore, our analysis admits a maximal step size of up to Ω(1/ℓ), which is the same as that in analyses for first-order stationary points.\nAs many real learning problems present strong local geometric properties, similar to strong convexity in the global setting [see, e.g. Bhojanapalli et al., 2016, Sun and Luo, 2016, Zheng and Lafferty, 2016], it is important to note that our analysis naturally takes advantage of such local structure. We show that when local strong convexity is present, the ǫ-dependence goes from a polynomial rate, 1/ǫ2, to linear convergence, log(1/ǫ). As an example, we show that sharp global convergence rates can be obtained for matrix factorization as a direct consequence of our analysis."
    }, {
      "heading" : "1.1 Our Contributions",
      "text" : "This paper presents the first sharp analysis that shows that (perturbed) gradient descent finds an approximate second-order stationary point in at most polylog(d) iterations, thus escaping all saddle points efficiently. Our main technical contributions are as follows:\n• For ℓ-gradient Lipschitz, ρ-Hessian Lipschitz functions (possibly non-convex), gradient descent with appropriate perturbations finds an ǫ-second-order stationary point in Õ(ℓ(f(x0)−f⋆)/ǫ2) iterations. This rate matches the well-known convergence rate of gradient descent to firstorder stationary points up to log factors.\n• Under a strict-saddle condition (see Assumption A2), this convergence result directly applies for finding local minima. This means that gradient descent can escape all saddle points with only logarithmic overhead in runtime.\n• When the function has local structure, such as local strong convexity (see Assumption A3.a), the above results can be further improved to linear convergence. We give sharp rates that are comparable to previous problem-specific local analysis of gradient descent with smart initialization (see Section 1.2).\n• All the above results rely on a new characterization of the geometry around saddle points: points from where gradient descent gets stuck at a saddle point constitute a thin “band.” We develop novel techniques to bound the volume of this band. As a result, we can show that after a random perturbation the current point is very unlikely to be in the “band”; hence, efficient escape from the saddle point is possible (see Section 5)."
    }, {
      "heading" : "1.2 Related Work",
      "text" : "Over the past few years, there have been many problem-specific convergence results for nonconvex optimization. One line of work requires a smart initialization algorithm to provide a coarse estimate lying inside a local neighborhood, from which popular local search algorithms\nenjoy fast local convergence [see, e.g., Netrapalli et al., 2013, Candes et al., 2015, Sun and Luo, 2016, Bhojanapalli et al., 2016]. While there are not many results that show global convergence for non-convex problems, Jain et al. [2015] show that gradient descent yields global convergence rates for matrix square-root problems. Although these results give strong guarantees, the analyses are heavily tailored to specific problems, and it is unclear how to generalize them to a wider class of non-convex functions.\nFor general non-convex optimization, there are a few previous results on finding second-order stationary points. These results can be divided into the following three categories, where, for simplicity of presentation, we only highlight dependence on dimension d and ǫ, assuming that all other problem parameters are constant from the point of view of iteration complexity: Hessian-based: Traditionally, only second-order optimization methods were known to converge to second-order stationary points. These algorithms rely on computing the Hessian to distinguish between first- and second-order stationary points. Nesterov and Polyak [2006] designed a cubic regularization algorithm which converges to an ǫ-second-order stationary point in O(1/ǫ1.5) iterations. Trust region algorithms [Curtis et al., 2014] can also achieve the same performance if the parameters are chosen carefully. These algorithms typically require the computation of the inverse of the full Hessian per iteration, which can be very expensive. Hessian-vector-product-based: A number of recent papers have explored the possibility of using only Hessian-vector products instead of full Hessian information in order to find second-order stationary points. These algorithms require a Hessian-vector product oracle: given a function f , a point x and a direction u, the oracle returns ∇2f(x) · u. Agarwal et al. [2016] and Carmon et al. [2016] presented accelerated algorithms that can find an ǫ-second-order stationary point in O(log d/ǫ7/4) steps. Also, Carmon and Duchi [2016] showed by running gradient descent as a subroutine to solve the subproblem of cubic regularization (which requires Hessian-vector product oracle), it is possible to find an ǫ-second-order stationary pointin O(log d/ǫ2) iterations. In many applications such an oracle can be implemented efficiently, in roughly the same complexity as the gradient oracle. Also, when the function has a Hessian Lipschitz property such an oracle can be approximated by differ-\nentiating the gradients at two very close points (although this may suffer from numerical issues, thus is seldom used in practice). Gradient-based: Another recent line of work shows that it is possible to converge to a secondorder stationary point without any use of the Hessian. These methods feature simple computation per iteration (only involving gradient operations), and are closest to the algorithms used in practice. Ge et al. [2015] showed that stochastic gradient descent could converge to a second-order stationary point in poly(d/ǫ) iterations, with polynomial of order at least four. This was improved in Levy [2016] to O(d3 ·poly(1/ǫ)) using normalized gradient descent. The current paper improves on both results by showing that perturbed gradient descent can actually find an ǫ-second-order stationary point inO(polylog(d)/ǫ2) steps, which matches the guarantee for converging to first-order stationary points up to polylog factors."
    }, {
      "heading" : "2 Preliminaries",
      "text" : "In this section, we will first introduce our notation, and then present some definitions and existing results in optimization which will be used later."
    }, {
      "heading" : "2.1 Notation",
      "text" : "We use bold upper-case letters A,B to denote matrices and bold lower-case letters x,y to denote vectors. Aij means the (i, j)\nth entry of matrix A. For vectors we use ‖·‖ to denote the ℓ2-norm, and for matrices we use ‖·‖ and ‖·‖F to denote spectral norm and Frobenius norm respectively. We use σmax(·), σmin(·), σi(·) to denote the largest, the smallest and the i-th largest singular values respectively, and λmax(·), λmin(·), λi(·) for corresponding eigenvalues.\nFor a function f : Rd → R, we use ∇f(·) and ∇2f(·) to denote its gradient and Hessian, and f⋆ to denote the global minimum of f(·). We use notation O(·) to hide only absolute constants which do not depend on any problem parameter, and notation Õ(·) to hide only absolute constants and log factors. We let B (d) x (r) denote the d-dimensional ball centered at x with radius r; when it is clear from context, we simply denote it as Bx(r). We use PX (·) to denote projection onto the set X . Distance and projection are always defined in a Euclidean sense."
    }, {
      "heading" : "2.2 Gradient Descent",
      "text" : "The theory of gradient descent often takes its point of departure to be the study of convex minimization where the function is both ℓ-smooth and α-strongly convex:\nDefinition 1. A differentiable function f(·) is ℓ-smooth (or ℓ-gradient Lipschitz) if:\n∀x1,x2, ‖∇f(x1)−∇f(x2)‖ ≤ ℓ‖x1 − x2‖.\nDefinition 2. A twice-differentiable function f(·) is α-strongly convex if ∀x, λmin(∇2f(x)) ≥ α\nSuch smoothness guarantees imply that the gradient can not change too rapidly, and strong convexity ensures that there is a unique stationary point (and hence a global minimum). Standard analysis using these two properties shows that gradient descent converges linearly to a global optimum x⋆ (see e.g. [Bubeck et al., 2015]).\nTheorem 1. Assume f(·) is ℓ-smooth and α-strongly convex. For any ǫ > 0, if we run gradient descent with step size η = 1ℓ , iterate xt will be ǫ-close to x ⋆ in iterations:\n2ℓ α log ‖x0 − x⋆‖ ǫ\nIn a more general setting, we no longer have convexity, let alone strong convexity. Though global optima are difficult to achieve in such a setting, it is possible to analyze convergence to first-order stationary points.\nDefinition 3. For a differentiable function f(·), we say that x is a first-order stationary point if ‖∇f(x)‖ = 0; we also say x is an ǫ-first-order stationary point if ‖∇f(x)‖ ≤ ǫ.\nUnder an ℓ-smoothness assumption, it is well known that by choosing the step size η = 1ℓ , gradient descent converges to first-order stationary points.\nTheorem 2 ([Nesterov, 1998]). Assume that the function f(·) is ℓ-smooth. Then, for any ǫ > 0, if we run gradient descent with step size η = 1ℓ and termination condition ‖∇f(x)‖ ≤ ǫ, the output will be ǫ-first-order stationary point, and the algorithm will terminate within the following number of iterations:\nℓ(f(x0)− f⋆) ǫ2 .\nNote that the iteration complexity does not depend explicitly on intrinsic dimension; in the literature this is referred to as “dimension-free optimization.”\nA first-order stationary point can be either a local minimum or a saddle point or a local maximum. For minimization problems, saddle points and local maxima are undesirable, and we abuse nomenclature to call both of them “saddle points” in this paper. The formal definition is as follows:\nDefinition 4. For a differentiable function f(·), we say that x is a local minimum if x is a first-order stationary point, and there exists ǫ > 0 so that for any y in the ǫ-neighborhood of x, we have f(x) ≤ f(y); we also say x is a saddle point if x is a first-order stationary point but not a local minimum. For a twice-differentiable function f(·), we further say a saddle point x is strict (or non-degenerate) if λmin(∇2f(x)) < 0.\nFor a twice-differentiable function f(·), we know a saddle point x must satify λmin(∇2f(x)) ≤ 0. Intuitively, for saddle point x to be strict, we simply rule out the undetermined case λmin(∇2f(x)) = 0, where Hessian information alone is not enough to check whether x is a local minimum or saddle point. In most non-convex problems, saddle points are undesirable.\nTo escape from saddle points and find local minima in a general setting, we move both the assumptions and guarantees in Theorem 2 one order higher. In particular, we require the Hessian to be Lipschitz:\nDefinition 5. A twice-differentiable function f(·) is ρ-Hessian Lipschitz if:\n∀x1,x2, ‖∇2f(x1)−∇2f(x2)‖ ≤ ρ‖x1 − x2‖.\nThat is, Hessian can not change dramatically in terms of spectral norm. We also generalize the definition of first-order stationary point to higher order:\nAlgorithm 2 Perturbed Gradient Descent: PGD(x0, ℓ, ρ, ǫ, c, δ,∆f )\nχ ← 3max{log(dℓ∆fcǫ2δ ), 4}, η ← c ℓ , r ←\n√ c χ2 · ǫ ℓ , gthres ← √ c χ2 · ǫ, fthres ← c χ3 · √ ǫ3 ρ , tthres ← χ c2 · ℓ√ ρǫ\ntnoise ← −tthres − 1 for t = 0, 1, . . . do\nif ‖∇f(xt)‖ ≤ gthres and t− tnoise > tthres then x̃t ← xt, tnoise ← t xt ← x̃t + ξt, ξt uniformly ∼ B0(r) if t− tnoise = tthres and f(xt)− f(x̃tnoise) > −fthres then return x̃tnoise xt+1 ← xt − η∇f(xt)\nDefinition 6. For a ρ-Hessian Lipschitz function f(·), we say that x is a second-order stationary point if ‖∇f(x)‖ = 0 and λmin(∇2f(x)) ≥ 0; we also say x is ǫ-second-order stationary point if:\n‖∇f(x)‖ ≤ ǫ, and λmin(∇2f(x)) ≥ − √ ρǫ\nSecond-order stationary points are very important in non-convex optimization because when all saddle points are strict, all second-order stationary points are exactly local minima.\nNote that the literature sometime defines ǫ-second-order stationary point by two independent error terms; i.e., letting ‖∇f(x)‖ ≤ ǫg and λmin(∇2f(x)) ≥ −ǫH . We instead follow the convention of Nesterov and Polyak [2006] by choosing ǫH = √ ρǫg to reflect the natural relations between the gradient and the Hessian. This definition of ǫ-second-order stationary point can also differ by reparametrization (and scaling), e.g. Nesterov and Polyak [2006] use ǫ′ = √\nǫ/ρ. We choose our parametrization so that the first requirement of ǫ-second-order stationary point coincides with the requirement of ǫ-first-order stationary point, for a fair comparison of our result with Theorem 2."
    }, {
      "heading" : "3 Main Result",
      "text" : "In this section we show that it possible to modify gradient descent in a simple way so that the resulting algorithm will provably converge quickly to a second-order stationary point.\nThe algorithm that we analyze is a perturbed form of gradient descent (see Algorithm 2). The algorithm is based on gradient descent with step size η. When the norm of the current gradient is small (≤ gthres) (which indicates that the current iterate x̃t is potentially near a saddle point), the algorithm adds a small random perturbation to the gradient. The perturbation is added at most only once every tthres iterations.\nTo simplify the analysis we choose the perturbation ξt to be uniformly sampled from a ddimensional ball1. The use of the threshold tthres ensures that the dynamics are mostly those of gradient descent. If the function value does not decrease enough (by fthres) after tthres iterations, the algorithm outputs x̃tnoise . The analysis in this section shows that under this protocol, the output x̃tnoise is necessarily “close” to a second-order stationary point.\nWe first state the assumptions that we require.\n1Note that uniform sampling from a d-dimensional ball can be done efficiently by sampling U 1\nd × Y ‖Y‖ where\nU ∼ Uniform([0, 1]) and Y ∼ N (0, Id) [Harman and Lacko, 2010].\nAssumption A1. Function f(·) is both ℓ-smooth and ρ-Hessian Lipschitz.\nThe Hessian Lipschitz condition ensures that the function is well-behaved near a saddle point, and the small perturbation we add will suffice to allow the subsequent gradient updates to escape from the saddle point. More formally, we have:\nTheorem 3. Assume that f(·) satisfies A1. Then there exists an absolute constant cmax such that, for any δ > 0, ǫ ≤ ℓ2ρ , ∆f ≥ f(x0)− f⋆, and constant c ≤ cmax, PGD(x0, ℓ, ρ, ǫ, c, δ,∆f ) will output an ǫ-second-order stationary point, with probability 1− δ, and terminate in the following number of iterations:\nO\n( ℓ(f(x0)− f⋆)\nǫ2 log4 ( dℓ∆f ǫ2δ )) .\nStrikingly, Theorem 3 shows that perturbed gradient descent finds a second-order stationary point in almost the same amount of time that gradient descent takes to find first-order stationary point. The step size η is chosen as O(1/ℓ) which is in accord with classical analyses of convergence to first-order stationary points. Though we state the theorem with a certain choice of parameters for simplicity of presentation, our result holds even if we vary the parameters up to constant factors.\nWithout loss of generality, we can focus on the case ǫ ≤ ℓ2/ρ, as in Theorem 3. This is because in the case ǫ > ℓ2/ρ, standard gradient descent without perturbation—Theorem 2—easily solves the problem (since by A1, we always have λmin(∇2f(x)) ≥ −ℓ ≥ − √ ρǫ, which means that all ǫ-second-order stationary points are ǫ-first order stationary points). We believe that the dependence on at least one log d factor in the iteration complexity is unavoidable in the non-convex setting, as our result can be directly applied to the principal component analysis problem, for which the best known runtimes (for the power method or Lanczos method) incur a log d factor. Establishing this formally is still an open question however.\nTo provide some intuition for Theorem 3, consider an iterate xt which is not yet an ǫ-secondorder stationary point. By definition, either (1) the gradient ∇f(xt) is large, or (2) the Hessian ∇2f(xt) has a significant negative eigenvalue. Traditional analysis works in the first case. The crucial step in the proof of Theorem 3 involves handling the second case: when the gradient is small ‖∇f(xt)‖ ≤ gthres and the Hessian has a significant negative eigenvalue λmin(∇2f(x̃t)) ≤ − √ ρǫ, then adding a perturbation, followed by standard gradient descent for tthres steps, decreases the function value by at least fthres, with high probability. The proof of this fact relies on a novel characterization of geometry around saddle points (see Section 5)\nIf we are able to make stronger assumptions on the objective function we are able to strengthen our main result. This further analysis is presented in the next section."
    }, {
      "heading" : "3.1 Functions with Strict Saddle Property",
      "text" : "In many real applications, objective functions further admit the property that all saddle points are strict [Ge et al., 2015, Sun et al., 2016a,b, Bhojanapalli et al., 2016, Ge et al., 2016]. In this case, all second-order stationary points are local minima and hence convergence to second-order stationary points (Theorem 3) is equivalent to convergence to local minima.\nTo state this result formally, we introduce a robust version of the strict saddle property [cf. Ge et al., 2015]:\nAssumption A2. Function f(·) is (θ, γ, ζ)-strict saddle. That is, for any x, at least one of following holds:\n• ‖∇f(x)‖ ≥ θ.\n• λmin(∇2f(x)) ≤ −γ.\n• x is ζ-close to X ⋆ — the set of local minima.\nIntuitively, the strict saddle assumption states that the Rd space can be divided into three regions: 1) a region where the gradient is large; 2) a region where the Hessian has a significant negative eigenvalue (around saddle point); and 3) the region close to a local minimum. With this assumption, we immediately have the following corollary:\nCorollary 4. Let f(·) satisfy A1 and A2. Then, there exists an absolute constant cmax such that, for any δ > 0,∆f ≥ f(x0)−f⋆, constant c ≤ cmax, and letting ǫ̃ = min(θ, γ2/ρ), PGD(x0, ℓ, ρ, ǫ̃, c, δ,∆f ) will output a point ζ-close to X ⋆, with probability 1− δ, and terminate in the following number of iterations:\nO\n( ℓ(f(x0)− f⋆)\nǫ̃2 log4 ( dℓ∆f ǫ̃2δ )) .\nCorollary 4 shows that by substituting ǫ in Theorem 3 using ǫ̃ = min(θ, γ2/ρ), the output of perturbed gradient descent will be in the ζ-neighborhood of some local minimum.\nNote although Corollary 4 only explicitly asserts that the output will lie within some fixed radius ζ from a local minimum. In many real applications, we can further write ζ as a function ζ(·) of gradient threshold θ, so that when θ decreases, ζ(θ) decreases linearly or polynomially depending on θ. Meanwhile, parameter γ is always nondecreasing when θ decreases due to the nature of this strict saddle definition. Therefore, in these cases, the above corollary further gives a convergence rate to a local minimum."
    }, {
      "heading" : "3.2 Functions with Strong Local Structure",
      "text" : "The convergence rate in Theorem 3 is polynomial in ǫ, which is similar to that of Theorem 2, but is worse than the rate of Theorem 1 because of the lack of strong convexity. Although global strong convexity does not hold in the non-convex setting that is our focus, in many machine learning problems the objective function may have a favorable local structure in the neighborhood of local minima [Ge et al., 2015, Sun et al., 2016a,b, Sun and Luo, 2016]. Exploiting this property can lead to much faster convergence (linear convergence) to local minima. One such property that ensures such convergence is a local form of smoothness and strong convexity:\nAssumption A3.a. In a ζ-neighborhood of the set of local minima X ⋆, the function f(·) is αstrongly convex, and β-smooth.\nHere we use different letter β to denote the local smoothness parameter (in contrast to the global smoothness parameter ℓ). Note that we always have β ≤ ℓ. However, often even local α-strong convexity does not hold. We thus introduce the following relaxation:\nAssumption A3.b. In a ζ-neighborhood of the set of local minima X ⋆, the function f(·) satisfies a (α, β)-regularity condition if for any x in this neighborhood:\n〈∇f(x),x− PX ⋆(x)〉 ≥ α\n2 ‖x− PX ⋆(x)‖2 +\n1\n2β ‖∇f(x)‖2. (1)\nAlgorithm 3 Perturbed Gradient Descent with Local Improvement: PGDli(x0, ℓ, ρ, ǫ, c, δ,∆f , β)\nx0 ← PGD(x0, ℓ, ρ, ǫ, c, δ,∆f ) for t = 0, 1, . . . do\nxt+1 ← xt − 1β∇f(xt)\nHere PX ⋆(·) is the projection on to the set X ⋆. Note (α, β)-regularity condition is more general and is directly implied by standard β-smooth and α-strongly convex conditions. This regularity condition commonly appears in low-rank problems such as matrix sensing and matrix completion, and has been used in Bhojanapalli et al. [2016], Zheng and Lafferty [2016], where local minima form a connected set, and where the Hessian is strictly positive only with respect to directions pointing outside the set of local minima.\nGradient descent naturally exploits local structure very well. In Algorithm 3, we first run Algorithm 2 to output a point within the neighborhood of a local minimum, and then perform standard gradient descent with step size 1β . We can then prove the following theorem: Theorem 5. Let f(·) satisfy A1, A2, and A3.a (or A3.b). Then there exists an absolute constant cmax such that, for any δ > 0, ǫ > 0,∆f ≥ f(x0) − f⋆, constant c ≤ cmax, and letting ǫ̃ = min(θ, γ2/ρ), PGDli(x0, ℓ, ρ, ǫ̃, c, δ,∆f , β) will output a point that is ǫ-close to X ⋆, with probability 1− δ, in the following number of iterations:\nO\n( ℓ(f(x0)− f⋆)\nǫ̃2 log4 ( dℓ∆f ǫ̃2δ ) + β α log ζ ǫ ) .\nTheorem 5 says that if strong local structure is present, the convergence rate can be boosted to linear convergence (log 1ǫ ). In this theorem we see that sequence of iterations can be decomposed into two phases. In the first phase, perturbed gradient descent finds a ζ-neighborhood by Corollary 4. In the second phase, standard gradient descent takes us from ζ to ǫ-close to a local minimum. Standard gradient descent and Assumption A3.a (or A3.b) make sure that the iterate never steps out of a ζ-neighborhood in this second phase, giving a result similar to Theorem 1 with linear convergence.\nFinally, we note our choice of local conditions (Assumption A3.a and A3.b) are not special. The interested reader can refer to Karimi et al. [2016] for other relaxed and alternative notions of convexity, which can also be potentially combined with Assumptions A1andA2 to yield convergence results of a similar flavor as that of Theorem 5."
    }, {
      "heading" : "4 Example — Matrix Factorization",
      "text" : "As a simple example to illustrate how to apply our general theorems to specific non-convex optimization problems, we consider a symmetric low-rank matrix factorization problem, based on the following objective function:\nmin U∈Rd×r\nf(U) = 1 2 ‖UU⊤ −M⋆‖2F, (2)\nwhere M⋆ ∈ Rd×d. For simplicity, we assume rank(M⋆) = r, and denote σ⋆1 := σ1(M⋆), σ⋆r := σr(M\n⋆). Clearly, in this case the global minimum of function value is zero, which is achieved at V⋆ = TD1/2 where TDT⊤ is the SVD of the symmetric real matrix M⋆.\nThe following two lemmas show that the objective function in Eq. (2) satisfies the geometric assumptions A1, A2,and A3.b. Moreover, all local minima are global minima.\nLemma 6. For any Γ ≥ σ⋆1, the function f(U) defined in Eq. (2) is 8Γ-smooth and 12Γ1/2-Hessian Lipschitz, inside the region {U|‖U‖2 < Γ}.\nLemma 7. For function f(U) defined in Eq.(2), all local minima are global minima. The set of global minima is X ⋆ = {V⋆R|RR⊤ = R⊤R = I}. Furthermore, f(U) satisfies:\n1. ( 124 (σ ⋆ r ) 3/2, 13σ ⋆ r , 1 3(σ ⋆ r ) 1/2)-strict saddle property.\n2. (23σ ⋆ r , 10σ ⋆ 1)-regularity condition in 1 3 (σ ⋆ r ) 1/2 neighborhood of X ⋆.\nOne caveat is that since the objective function is actually a fourth-order polynomial with respect to U, the smoothness and Hessian Lipschitz parameters from Lemma 6 naturally depend on ‖U‖. Fortunately, we can further show that gradient descent (even with perturbation) does not increase ‖U‖ beyond O(max{‖U0‖, (σ⋆1)1/2}). Then, applying Theorem 5 gives:\nTheorem 8. There exists an absolute constant cmax such that the following holds. For the objective function in Eq. (2), for any δ > 0 and constant c ≤ cmax, and for Γ1/2 := 2max{‖U0‖, 3(σ⋆1)1/2}, the output of PGDli(U0, 8Γ, 12Γ 1/2, (σ ⋆ r ) 2\n108Γ1/2 , c, δ, rΓ\n2\n2 , 10σ ⋆ 1), will be ǫ-close to the global minimum set\nX ⋆, with probability 1− δ, after the following number of iterations:\nO\n(\nr\n( Γ\nσ⋆r\n)4 log4 ( dΓ\nδσ⋆r\n)\n+ σ⋆1 σ⋆r log σ⋆r ǫ\n)\n.\nTheorem 8 establishes global convergence of perturbed gradient descent from an arbitrary initial point U0, including exact saddle points. Suppose we initialize at U0 = 0, then our iteration complexity becomes:\nO ( r(κ⋆)4 log4(dκ⋆/δ) + κ⋆ log(σ⋆r/ǫ) ) ,\nwhere κ⋆ = σ⋆1/σ ⋆ r is the condition number of the matrix M ⋆. We see that in the second phase, when convergence occurs inside the local region, we require O(κ⋆ log(σ⋆r/ǫ)) iterations which is the standard local linear rate for gradient descent. In the first phase, to find a neighborhood of the solution, our method requires a number of iterations scaling as Õ(r(κ⋆)4). We suspect that this strong dependence on condition number arises from our generic assumption that the Hessian Lipschitz is uniformly upper bounded; it may well be the case that this dependence can be reduced in the special case of matrix factorization via a finer analysis of the geometric structure of the problem."
    }, {
      "heading" : "5 Proof Sketch for Theorem 3",
      "text" : "In this section we will present the key ideas underlying the main result of this paper (Theorem 3). We will first argue the correctness of Theorem 3 given two important intermediate lemmas. Then we turn to the main lemma, which establishes that gradient descent can escape from saddle points quickly. We present full proofs of all these results in Appendix A. Throughout this section, we use η, r, gthres, fthres and tthres as defined in Algorithm 2."
    }, {
      "heading" : "5.1 Exploiting Large Gradient or Negative Curvature",
      "text" : "Recall that an ǫ-second-order stationary point is a point with a small gradient, and where the Hessian does not have a significant negative eigenvalue. Suppose we are currently at an iterate xt that is not an ǫ-second-order stationary point; i.e., it does not satisfy the above properties. There are two possibilities:\n1. Gradient is large: ‖∇f(xt)‖ ≥ gthres, or 2. Around saddle point: ‖∇f(xt)‖ ≤ gthres and λmin(∇2f(xt)) ≤ − √ ρǫ.\nThe following two lemmas address these two cases respectively. They guarantee that perturbed gradient descent will decrease the function value in both scenarios.\nLemma 9 (Gradient). Assume that f(·) satisfies A1. Then for gradient descent with stepsize η < 1ℓ , we have f(xt+1) ≤ f(xt)− η 2‖∇f(xt)‖2.\nLemma 10 (Saddle). (informal) Assume that f(·) satisfies A1, If xt satisfies ‖∇f(xt)‖ ≤ gthres and λmin(∇2f(xt)) ≤ − √ ρǫ, then adding one perturbation step followed by tthres steps of gradient descent, we have f(xt+tthres)− f(xt) ≤ −fthres with high probability.\nWe see that Algorithm 2 is designed so that Lemma 10 can be directly applied. According to these two lemmas, perturbed gradient descent will decrease the function value either in the case of a large gradient, or around strict saddle points. Computing the average decrease per step in function value yields the total iteration complexity. Since Algorithm 2 only terminate when the function value decreases too slowly, this guarantees that the output must be ǫ-second-order stationary point (see Appendix A for formal proofs)."
    }, {
      "heading" : "5.2 Main Lemma: Escaping from Saddle Points Quickly",
      "text" : "The proof of Lemma 9 is straightforward and follows from traditional analysis. The key technical contribution of this paper is the proof of Lemma 10, which gives a new characterization of the geometry around saddle points.\nConsider a point x̃ that satisfies the the preconditions of Lemma 10 (‖∇f(x̃)‖ ≤ gthres and λmin(∇2f(x̃)) ≤ − √ ρǫ). After adding the perturbation (x0 = x̃ + ξ), we can view x0 as coming from a uniform distribution over Bx̃(r), which we call the perturbation ball. We can divide this perturbation ball Bx̃(r) into two disjoint regions: (1) an escaping region Xescape which consists of all the points x ∈ Bx̃(r) whose function value decreases by at least fthres after tthres steps; (2) a stuck region Xstuck = Bx̃(r)− Xescape. Our general proof strategy is to show that Xstuck consists of a very small proportion of the volume of perturbation ball. After adding a perturbation to x̃, point x0 has a very small chance of falling in Xstuck, and hence will escape from the saddle point efficiently.\nLet us consider the nature of Xstuck. For simplicity, let us imagine that x̃ is an exact saddle point whose Hessian has only one negative eigenvalue, and d−1 positive eigenvalues. Let us denote the minimum eigenvalue direction as e1. In this case, if the Hessian remains constant (and we have a quadratic function), the stuck region Xstuck consists of points x such that x − x̃ has a small e1 component. This is a straight band in two dimensions and a flat disk in high dimensions. However, when the Hessian is not constant, the shape of the stuck region is distorted. In two dimensions, it\nforms a “narrow band” as plotted in Figure 2 on top of the gradient flow. In three dimensions, it forms a “thin pancake” as shown in Figure 1.\nThe major challenge here is to bound the volume of this high-dimensional non-flat “pancake” shaped region Xstuck. A crude approximation of this “pancake” by a flat “disk” loses polynomial factors in the dimensionalilty, which gives a suboptimal rate. Our proof relies on the following crucial observation: Although we do not know the explicit form of the stuck region, we know it must be very “thin,” therefore it cannot have a large volume. The informal statement of the lemma is as follows:\nLemma 11. (informal) Suppose x̃ satisfies the precondition of Lemma 10, and let e1 be the smallest eigendirection of ∇2f(x̃). For any δ ∈ (0, 1/3] and any two points w,u ∈ Bx̃(r), if w − u = µre1 and µ ≥ δ/(2 √ d), then at least one of w,u is not in the stuck region Xstuck.\nUsing this lemma it is not hard to bound the volume of the stuck region: we can draw a straight line along the e1 direction which intersects the perturbation ball (shown as purple line segment in Figure 2). For any two points on this line segment that are at least δr/(2 √ d) away from each other (shown as red points w,u in Figure 2), by Lemma 11, we know at least one of them must not be in Xstuck. This implies if there is one point ũ ∈ Xstuck on this line segment, then Xstuck on this line can be at most an interval of length δr/ √ d around ũ. This establishes the “thickness” of Xstuck in the e1 direction, which is turned into an upper bound on the volume of the stuck region Xstuck by standard calculus."
    }, {
      "heading" : "6 Conclusion",
      "text" : "This paper presents the first (nearly) dimension-free result for gradient descent in a general nonconvex setting. We present a general convergence result and show how it can be further strengthened when combined with further structure such as strict saddle conditions and/or local regularity/convexity.\nThere are still many related open problems. First, in the presence of constraints, it is worthwhile to study whether gradient descent still admits similar sharp convergence results. Another important question is whether similar techniques can be applied to accelerated gradient descent. We hope that this result could serve as a first step towards a more general theory with strong, almost dimension free guarantees for non-convex optimization."
    }, {
      "heading" : "A Detailed Proof of Main Theorem",
      "text" : "In this section, we give detailed proof for the main theorem. We will first state two key lemmas that show how the algorithm can make progress when the gradient is large or near a saddle point, and show how the main theorem follows from the two lemmas. Then we will focus on the novel technique in this paper: how to analyze gradient descent near saddle point.\nA.1 General Framework\nIn order to prove the main theorem, we need to show that the algorithm will not be stuck at any point that either has a large gradient or is near a saddle point. This idea is similar to previous works (e.g.[Ge et al., 2015]). We first state a standard Lemma that shows if the current gradient is large, then we make progress in function value.\nLemma 12 (Lemma 9 restated). Assume f(·) satisfies A1, then for gradient descent with stepsize η < 1ℓ , we have:\nf(xt+1) ≤ f(xt)− η\n2 ‖∇f(xt)‖2\nProof. By Assumption A1 and its property, we have:\nf(xt+1) ≤f(xt) +∇f(xt)⊤(xt+1 − xt) + ℓ\n2 ‖xt+1 − xt‖2\n=f(xt)− η‖∇f(xt)‖2 + η2ℓ\n2 ‖∇f(xt)‖2 ≤ f(xt)−\nη 2 ‖∇f(xt)‖2\nThe next lemma says that if we are “close to a saddle points”, i.e., we are at a point where the gradient is small, but the Hessian has a reasonably large negative eigenvalue. This is the main difficulty in the analysis. We show a perturbation followed by small number of standard gradient descent steps can also make the function value decrease with high probability.\nLemma 13 (Lemma 10 formal). There exist absolute constant cmax, for f(·) satisfies A1, and any c ≤ cmax, and χ ≥ 1. Let η, r, gthres, fthres, tthres calculated same way as in Algorithm 2. Then, if x̃t satisfies:\n‖∇f(x̃t)‖ ≤ gthres and λmin(∇2f(x̃t)) ≤ − √ ρǫ\nLet xt = x̃t+ξt where ξt comes from the uniform distribution over B0(r), and let xt+i be the iterates of gradient descent from xt with stepsize η, then with at least probability 1− dℓ√ρǫe−χ, we have:\nf(xt+tthres)− f(x̃t) ≤ −fthres The proof of this lemma is deferred to Section A.2. Using this Lemma, we can then prove the\nmain Theorem.\nTheorem 3. There exist absolute constant cmax such that: if f(·) satisfies A1, then for any δ > 0, ǫ ≤ ℓ2ρ ,∆f ≥ f(x0) − f⋆, and constant c ≤ cmax, with probability 1 − δ, the output of PGD(x0, ℓ, ρ, ǫ, c, δ,∆f ) will be ǫ−second order stationary point, and terminate in iterations:\nO\n( ℓ(f(x0)− f⋆)\nǫ2 log4 ( dℓ∆f ǫ2δ ))\nProof. Denote c̃max to be the absolute constant allowed in Theorem 13. In this theorem, we let cmax = min{c̃max, 1/2}, and choose any constant c ≤ cmax.\nIn this proof, we will actually achieve some point satisfying following condition:\n‖∇f(x)‖ ≤ gthres = √ c\nχ2 · ǫ, λmin(∇2f(x)) ≥ −\n√ ρǫ (3)\nSince c ≤ 1, χ ≥ 1, we have √ c\nχ2 ≤ 1, which implies any x satisfy Eq.(3) is also a ǫ-second-order\nstationary point. Starting from x0, we know if x0 does not satisfy Eq.(3), there are only two possibilities:\n1. ‖∇f(x0)‖ > gthres: In this case, Algorithm 2 will not add perturbation. By Lemma 12:\nf(x1)− f(x0) ≤ − η\n2 · g2thres = −\nc2\n2χ4 · ǫ\n2\nℓ\n2. ‖∇f(x0)‖ ≤ gthres: In this case, Algorithm 2 will add a perturbation of radius r, and will perform gradient descent (without perturbations) for the next tthres steps. Algorithm 2 will then check termination condition. If the condition is not met, we must have:\nf(xtthres)− f(x0) ≤ −fthres = − c χ3 · √ ǫ3 ρ\nThis means on average every step decreases the function value by\nf(xtthres)− f(x0) tthres ≤ − c 3 χ4 · ǫ 2 ℓ\nIn case 1, we can repeat this argument for t = 1 and in case 2, we can repeat this argument for t = tthres. Hence, we can conclude as long as algorithm 2 has not terminated yet, on average, every step decrease function value by at least c 3\nχ4 · ǫ2ℓ . However, we clearly can not decrease function value\nby more than f(x0)− f⋆, where f⋆ is the function value of global minima. This means algorithm 2 must terminate within the following number of iterations:\nf(x0)− f⋆ c3\nχ4 · ǫ2 ℓ\n= χ4 c3 · ℓ(f(x0)− f ⋆) ǫ2 = O\n( ℓ(f(x0)− f⋆)\nǫ2 log4 ( dℓ∆f ǫ2δ ))\nFinally, we would like to ensure when Algorithm 2 terminates, the point it finds is actually an ǫ-second-order stationary point. The algorithm can only terminate when the gradient is small, and the function value does not decrease after a perturbation and tthres iterations. We shall show every time when we add perturbation to iterate x̃t, if λmin(∇2f(x̃t)) < − √ ρǫ, then we will have f(xt+tthres)−f(x̃t) ≤ −fthres. Thus, whenever the current point is not an ǫ-second-order stationary point, the algorithm cannot terminate.\nAccording to Algorithm 2, we immediately know ‖∇f(x̃t)‖ ≤ gthres (otherwise we will not add perturbation at time t). By Lemma 13, we know this event happens with probability at least\n1 − dℓ√ρǫe−χ each time. On the other hand, during one entire run of Algorithm 2, the number of times we add perturbations is at most:\n1 tthres · χ\n4 c3 · ℓ(f(x0)− f ⋆) ǫ2 = χ3 c\n√ ρǫ(f(x0)− f⋆)\nǫ2\nBy union bound, for all these perturbations, with high probability Lemma 13 is satisfied. As a result Algorithm 2 works correctly. The probability of that is at least\n1− dℓ√ ρǫ e−χ · χ 3 c\n√ ρǫ(f(x0)− f⋆)\nǫ2 = 1− χ\n3e−χ c · dℓ(f(x0)− f ⋆) ǫ2\nRecall our choice of χ = 3max{log(dℓ∆f cǫ2δ ), 4}. Since χ ≥ 12, we have χ3e−χ ≤ e−χ/3, this gives:\nχ3e−χ c · dℓ(f(x0)− f ⋆) ǫ2 ≤ e−χ/3dℓ(f(x0)− f ⋆) cǫ2 ≤ δ\nwhich finishes the proof.\nA.2 Main Lemma: Escaping from Saddle Points Quickly\nNow we prove the main lemma (Lemma 13), which shows near a saddle point, a small perturbation followed by a small number of gradient descent steps will decrease the function value with high probability. This is the main step where we need new analysis, as the analysis previous works (e.g.[Ge et al., 2015]) do not work when the step size and perturbation do not depend polynomially in dimension d.\nIntuitively, after adding a perturbation, the current point of the algorithm comes from a uniform distribution over a d-dimensional ball centered at x̃, which we call perturbation ball. After a small number of gradient steps, some points in this ball (which we call the escaping region) will significantly decrease the function; other points (which we call the stuck region) does not see a significant decrease in function value. We hope to show that the escaping region constitutes at least 1− δ fraction of the volume of the perturbation ball.\nHowever, we do not know the exact form of the function near the saddle point, so the escaping region does not have a clean analytic description. Explicitly computing its volume can be very difficult. Our proof rely on a crucial observation: although we do not know the shape of the stuck region, we know the “width” of it must be small, therefore it cannot have a large volume. We will formalize this intuition later in Lemma 15.\nThe proof of the main lemma requires carefully balancing between different quantities including function value, gradient, parameter space and number of iterations. For clarify, we define following scalar quantities, which serve as the “units” for function value, gradient, parameter space, and time (iterations). We will use these notations throughout the proof.\nLet the condition number be the ratio of the smoothness parameter (largest eigenvalue of Hessian) and the negative eigenvalue γ: κ = ℓ/γ ≥ 1, we define the following units:\nF := ηℓ γ3 ρ2 · log−3(dκ δ ), G := √ ηℓ γ2 ρ · log−2(dκ δ )\nS := √ ηℓ γ ρ · log−1(dκ δ ), T :=\nlog(dκδ )\nηγ\nIntuitively, if we plug in our choice of learning rate ηℓ = O(1) (which we will prove later) and hide the logarithmic dependences, we have F = Õ(γ 3\nρ2 ),G = Õ(γ\n2\nρ ),S = Õ( γ ρ ), which is the only way to\ncorrectly discribe the units of function value, gradient, parameter space by just γ and ρ. Moreover,\nthese units are closely related, in particular, we know\n√\nF ·log(dκ δ ) γ = G ·log(dκ δ ) γ = S .\nFor simplicity of later proofs, we first restate Lemma 13 into a slightly more general form as follows. Lemma 13 is directly implied following lemma.\nLemma 14 (Lemma 13 restated). There exists universal constant cmax, for f(·) satisfies A1, for any δ ∈ (0, dκe ], suppose we start with point x̃ satisfying following conditions:\n‖∇f(x̃)‖ ≤ G and λmin(∇2f(x̃)) ≤ −γ\nLet x0 = x̃ + ξ where ξ come from the uniform distribution over ball with radius S /(κ · log(dκδ )), and let xt be the iterates of gradient descent from x0. Then, when stepsize η ≤ cmax/ℓ, with at least probability 1− δ, we have following for any T ≥ 1cmax T :\nf(xT )− f(x̃) ≤ −F\nLemma 14 is almost the same as Lemma 13. It is easy to verify that by substituting η = cℓ , γ =√ ρǫ and δ = dℓ√ρǫe −χ into Lemma 14, we immediately obtain Lemma 13.\nNow we will formalize the intuition that the “width” of stuck region is small.\nLemma 15 (Lemma 11 restated). There exists a universal constant cmax, for any δ ∈ (0, dκe ], let f(·), x̃ satisfies the conditions in Lemma 14, and without loss of generality let e1 be the minimum eigenvector of ∇2f(x̃). Consider two gradient descent sequences {ut}, {wt} with initial points u0,w0 satisfying: (denote radius r = S /(κ · log(dκδ )))\n‖u0 − x̃‖ ≤ r, w0 = u0 + µ · r · e1, µ ∈ [δ/(2 √ d), 1]\nThen, for any stepsize η ≤ cmax/ℓ, and any T ≥ 1cmax T , we have:\nmin{f(uT )− f(u0), f(wT )− f(w0)} ≤ −2.5F\nIntuitively, lemma 15 claims for any two points u0,w0 inside the perturbation ball, if u0 −w0 lies in the direction of minimum eigenvector of ∇2f(x̃), and ‖u0 −w0‖ is greater than threshold δr/(2 √ d), then at least one of two sequences {ut}, {wt} will “efficiently escape saddle point”. In other words, if u0 is a point in the stuck region, consider any point w0 that is on a straight line along direction of e1. As long as w0 is slightly far (δr/ √ d) from u0, it must be in the escaping region. This is what we mean by the “width” of the stuck region being small. Now we prove the main Lemma using this observation:\nProof of Lemma 14. By adding perturbation, in worst case we increase function value by:\nf(x0)− f(x̃) ≤ ∇f(x̃)⊤ξ + ℓ 2 ‖ξ‖2 ≤ G ( S\nκ · log(dκδ ) ) +\n1 2 ℓ(\nS κ · log(dκδ ) )2 ≤ 3 2 F\nOn the other hand, let radius r = S κ·log(dκ δ ) . We know x0 come froms uniform distribution over Bx̃(r). Let Xstuck ⊂ Bx̃(r) denote the set of bad starting points so that if x0 ∈ Xstuck, then\nf(xT )− f(x0) > −2.5F (thus stuck at a saddle point); otherwise if x0 ∈ Bx̃(r) − Xstuck, we have f(xT )− f(x0) ≤ −2.5F .\nBy applying Lemma 15, we know for any x0 ∈ Xstuck, it is guaranteed that (x0±µre1) 6∈ Xstuck where µ ∈ [ δ\n2 √ d , 1]. Denote IXstuck(·) be the indicator function of being inside set Xstuck; and vector\nx = (x(1),x(−1)), where x(1) is the component along e1 direction, and x(−1) is the remaining d− 1 dimensional vector. Recall B(d)(r) be d-dimensional ball with radius r; By calculus, this gives an upper bound on the volumn of Xstuck:\nVol(Xstuck) = ∫\nB (d) x̃\n(r) dx · IXstuck(x)\n=\n∫\nB (d−1) x̃\n(r) dx(−1)\n∫ x̃(1)+ √ r2−‖x̃(−1)−x(−1)‖2\nx̃(1)− √ r2−‖x̃(−1)−x(−1)‖2 dx(1) · IXstuck(x)\n≤ ∫\nB (d−1) x̃\n(r) dx(−1) ·\n(\n2 · δ 2 √ d r\n)\n= Vol(B (d−1) 0 (r))× δr√ d\nThen, we immediately have the ratio:\nVol(Xstuck) Vol(B\n(d) x̃ (r))\n≤ δr√ d ×Vol(B(d−1)0 (r))\nVol(B (d) 0 (r))\n= δ√ πd\nΓ(d2 + 1) Γ(d2 + 1 2) ≤ δ√ πd\n· √ d\n2 +\n1 2 ≤ δ\nThe second last inequality is by the property of Gamma function that Γ(x+1)Γ(x+1/2) < √ x+ 12 as long as x ≥ 0. Therefore, with at least probability 1− δ, x0 6∈ Xstuck. In this case, we have:\nf(xT )− f(x̃) =f(xT )− f(x0) + f(x0)− f(0) ≤− 2.5F + 1.5F ≤ −F\nwhich finishes the proof.\nA.3 Bounding the Width of Stuck Region\nIn order to prove Lemma 15, we do it in two steps:\n1. We first show if gradient descent from u0 does not decrease function value, then all the iterates must lie within a small ball around u0 (Lemma 16).\n2. If gradient descent starting from a point u0 stuck in a small ball around a saddle point, then gradient descent from w0 (moving u0 along e1 direction for at least a certain distance), will decreases the function value (Lemma 17).\nRecall we assumed without loss of generality e1 is the minimum eigenvector of ∇2f(x̃). In this context, we denote H := ∇2f(x̃), and for simplicity of calculation, we consider following quadratic approximation:\nf̃y(x) := f(y) +∇f(y)⊤(x− y) + 1 2 (x− y)⊤H(x− y) (4)\nNow we are ready to state two lemmas formally:\nLemma 16. For any constant ĉ ≥ 3, there exists absolute constant cmax: for any δ ∈ (0, dκe ], let f(·), x̃ satisfies the condition in Lemma 14, for any initial point u0 with ‖u0 − x̃‖ ≤ 2S /(κ · log(dκδ )), define:\nT = min {\ninf t\n{ t|f̃u0(ut)− f(u0) ≤ −3F } , ĉT }\nthen, for any η ≤ cmax/ℓ, we have for all t < T that ‖ut − x̃‖ ≤ 100(S · ĉ).\nLemma 17. There exists absolute constant cmax, ĉ such that: for any δ ∈ (0, dκe ], let f(·), x̃ satisfies the condition in Lemma 14, and sequences {ut}, {wt} satisfy the conditions in Lemma 15, define:\nT = min {\ninf t\n{ t|f̃w0(wt)− f(w0) ≤ −3F } , ĉT }\nthen, for any η ≤ cmax/ℓ, if ‖ut − x̃‖ ≤ 100(S · ĉ) for all t < T , we will have T < ĉT .\nNote the conclusion T < ĉT in Lemma 17 equivalently means:\ninf t\n{ t|f̃w0(wt)− f(w0) ≤ −3F } < ĉT\nThat is, for some T < ĉT , {wt} sequence “escape the saddle point” in the sense of sufficient function value decrease f̃w0(wt)− f(w0) ≤ −3F . Now, we are ready to prove Lemma 15.\nProof of Lemma 15. W.L.O.G, let x̃ = 0 be the origin. Let (c (2) max, ĉ) be the absolute constant so that Lemma 17 holds, also let c (1) max be the absolute constant to make Lemma 16 holds based on our current choice of ĉ. We choose cmax ≤ min{c(1)max, c(2)max} so that our learning rate η ≤ cmax/ℓ is small enough which make both Lemma 16 and Lemma 17 hold. Let T ⋆ := ĉT and define:\nT ′ = inf t\n{ t|f̃u0(ut)− f(u0) ≤ −3F }\nLet’s consider following two cases:\nCase T ′ ≤ T ⋆: In this case, by Lemma 16, we know ‖uT ′−1‖ ≤ O(S ), and therefore\n‖uT ′‖ ≤‖uT ′−1‖+ η‖∇f(uT ′−1)‖ ≤ ‖uT ′−1‖+ η‖∇f(x̃)‖+ ηℓ‖uT ′−1‖ ≤ O(S )\nBy choosing cmax small enough and η ≤ cmax/ℓ, this gives:\nf(uT ′)− f(u0) ≤∇f(u0)⊤(uT ′ − u0) + 1 2 (uT ′ − u0)⊤∇2f(u0)(uT ′ − u0) + ρ 6 ‖uT ′ − u0‖3\n≤f̃u0(ut)− f(u0) + ρ\n2 ‖u0 − x̃‖‖uT ′ − u0‖2 +\nρ 6 ‖uT ′ − u0‖3\n≤− 3F +O(ρS 3) = −3F +O( √ ηℓ · F ) ≤ −2.5F\nBy choose cmax ≤ min{1, 1ĉ}. We know η < 1ℓ , by Lemma 12, we know gradient descent always decrease function value. Therefore, for any T ≥ 1cmax T ≥ ĉT = T ⋆ ≥ T ′, we have:\nf(uT )− f(u0) ≤ f(uT ⋆)− f(u0) ≤ f(uT ′)− f(u0) ≤ −2.5F\nCase T ′ > T ⋆: In this case, by Lemma 16, we know ‖ut‖ ≤ O(S ) for all t ≤ T ⋆. Define\nT ′′ = inf t\n{ t|f̃w0(wt)− f(w0) ≤ −2F }\nBy Lemma 17, we immediately have T ′′ ≤ T ⋆. Apply same argument as in first case, we have for all T ≥ 1cmax T that f(wT )− f(w0) ≤ f(wT ⋆)− f(w0) ≤ −2.5F .\nNext we finish the proof by proving Lemma 16 and Lemma 17.\nA.3.1 Proof of Lemma 16\nIn Lemma 16, we hope to show if the function value did not decrease, then all the iterations must be constrained in a small ball. We do that by analyzing the dynamics of the iterations, and we decompose the d-dimensional space into two subspaces: a subspace S which is the span of significantly negative eigenvectors of the Hessian and its orthogonal compliment.\nRecall notation H := ∇2f(x̃) and quadratic approximation f̃y(x) as defined in Eq.(4). Since δ ∈ (0, dκe ], we always have log(dκδ ) ≥ 1. W.L.O.G, set u0 = 0 to be the origin, by gradient descent update function, we have:\nut+1 =ut − η∇f(ut)\n=ut − η∇f(0)− η [∫ 1\n0 ∇2f(θut)dθ\n]\nut\n=ut − η∇f(0)− η(H +∆t)ut =(I − ηH − η∆t)ut − η∇f(0) (5)\nHere, ∆t := ∫ 1 0 ∇2f(θut)dθ − H. By Hessian Lipschitz, we have ‖∆t‖ ≤ ρ(‖ut‖ + ‖x̃‖), and by smoothness of the gradient, we have ‖∇f(0)‖ ≤ ‖∇f(x̃)‖+ ℓ‖x̃‖ ≤ G + ℓ · 2S /(κ · log(dκδ )) ≤ 3G . We will now compute the projections of ut in different eigenspaces of H. Let S be the subspace spanned by all eigenvectors of H whose eigenvalue is less than − γ ĉ log(dκ δ ) . Sc denotes the subspace of remaining eigenvectors. Let αt and βt denote the projections of ut onto S and Sc respectively i.e., αt = PSut, and βt = PScut. We can decompose the update equations Eq.(5) into:\nαt+1 =(I− ηH)αt − ηPS∆tut − ηPS∇f(0) (6) βt+1 =(I− ηH)βt − ηPSc∆tut − ηPSc∇f(0) (7)\nBy definition of T , we know for all t < T :\n−3F < f̃0(ut)− f(0) =∇f(0)⊤ut − 1 2 u⊤t Hut ≤ ∇f(0)⊤ut − γ 2 ‖αt‖2 ĉ log(dκδ ) + 1 2 β⊤t Hβt\nCombined with the fact ‖ut‖2 = ‖αt‖2 + ‖βt‖2, we have:\n‖ut‖2 ≤ 2ĉ log(dκδ )\nγ\n(\n3F +∇f(0)⊤ut + 1 2 β⊤t Hβt\n)\n+ ‖βt‖2\n≤14 ·max { G ĉ log(dκδ )\nγ ‖ut‖,\nF ĉ log(dκδ ) γ , β⊤t Hβtĉ log(dκδ ) γ , ‖βt‖2\n}\nwhere last inequality is due to ‖∇f(0)‖ ≤ 3G . This gives:\n‖ut‖ ≤ 14 ·max\n \n\nG ĉ log(dκδ )\nγ ,\n√\nF ĉ log(dκδ )\nγ ,\n√\nβ⊤t Hβtĉ log(dκδ ) γ , ‖βt‖\n   (8)\nNow, we use induction to prove that\n‖ut‖ ≤ 100(S · ĉ) (9)\nClearly Eq.(9) is true for t = 0 since u0 = 0. Suppose Eq.(9) is true for all τ ≤ t. We will now show that Eq.(9) holds for t+1 < T . Note that by the definition of S , F and G , we only need to bound the last two terms of Eq.(8) i.e., ‖βt+1‖ and β⊤t+1Hβt+1.\nBy update function of βt (Eq.(7)), we have:\nβt+1 ≤(I− ηH)βt + ηδt (10)\nand the norm of δt is bounded as follows:\n‖δt‖ ≤ ‖∆t‖‖ut‖+ ‖∇f(0)‖ ≤ ρ (‖ut‖+ ‖x̃‖) ‖ut‖+ ‖∇f(0)‖\n≤ ρ · 100ĉ(100ĉ + 2/(κ · log(dκ δ )))S 2 + G = [100ĉ(100ĉ + 2) √ ηℓ+ 1]G ≤ 2G (11)\nThe last step follows by choosing small enough constant cmax ≤ 1100ĉ(100ĉ+2) and stepsize η < cmax/ℓ.\nBounding ‖βt+1‖: Combining Eq.(10), Eq.(11) and using the definiton of Sc, we have:\n‖βt+1‖ ≤ (1 + ηγ\nĉ log(dκδ ) )‖βt‖+ 2ηG\nSince ‖β0‖ = 0 and t+ 1 ≤ T , by applying above relation recurrsively, we have:\n‖βt+1‖ ≤ t∑\nτ=0\n2(1 + ηγ\nĉ log(dκδ ) )τηG ≤ 2 · 3 · TηG ≤ 6(S · ĉ) (12)\nThe second last inequality is because T ≤ ĉT by definition, so that (1 + ηγ ĉ log(dκ δ ) )T ≤ 3.\nBounding β⊤t+1Hβt+1: Using Eq.(10), we can also write the update equation as:\nβt =\nt−1∑\nτ=0\n(I − ηH)τδτ\nCombining with Eq.(11), this gives\nβ⊤t+1Hβt+1 =η2 t∑\nτ1=0\nt∑\nτ2=0\nδ⊤τ1(I− ηH) τ1H(I− ηH)τ2δτ2\n≤η2 t∑\nτ1=0\nt∑\nτ2=0\n‖δτ1‖‖(I − ηH)τ1H(I− ηH)τ2‖‖δτ2‖\n≤4η2G 2 t∑\nτ1=0\nt∑\nτ2=0\n‖(I − ηH)τ1H(I− ηH)τ2‖\nLet the eigenvalues of H to be {λi}, then for any τ1, τ2 ≥ 0, we know the eigenvalues of (I − ηH)τ1H(I−ηH)τ2 are {λi(1−ηλi)τ1+τ2}. Let gt(λ) := λ(1−ηλ)t, and setting its derivative to zero, we obtain: ∇gt(λ) = (1− ηλ)t − tηλ(1− ηλ)t−1 = 0 We see that λ⋆t = 1 (1+t)η is the unique maximizer, and gt(λ) is monotonically increasing in (−∞, λ⋆t ]. This gives:\n‖(I − ηH)τ1H(I− ηH)τ2‖ = max i\nλi(1− ηλi)τ1+τ2 ≤ λ̂(1− ηλ̂)τ1+τ2 ≤ 1\n(1 + τ1 + τ2)η\nwhere λ̂ = min{ℓ, λ⋆τ1+τ2}. Therefore, we have:\nβ⊤t+1Hβt+1 ≤4η2G 2 t∑\nτ1=0\nt∑\nτ2=0\n‖(I− ηH)τ1H(I− ηH)τ2‖\n≤4ηG 2 t∑\nτ1=0\nt∑\nτ2=0\n1 1 + τ1 + τ2 ≤ 8ηTG 2 ≤ 8S 2γĉ · log−1(dκ δ ) (13)\nThe second last inequality is because by rearrange summation:\nt∑\nτ1=0\nt∑\nτ2=0\n1\n1 + τ1 + τ2 =\n2t∑\nτ=0\nmin{1 + τ, 2t+ 1− τ} · 1 1 + τ ≤ 2t+ 1 < 2T\nFinally, substitue Eq.(12) and Eq.(13) into Eq.(8), this gives:\n‖ut+1‖ ≤14 ·max\n \n\nG ĉ log(dκδ )\nγ ,\n√\nF ĉ log(dκδ )\nγ ,\n√\nβ⊤t Hβtĉ log(dκδ ) γ , ‖βt‖\n \n\n≤100(S · ĉ)\nThis finishes the induction as well as the proof of the lemma.\nA.3.2 Proof of Lemma 17\nIn this Lemma we try to show if all the iterates from u0 are constrained in a small ball, iterates from w0 must be able to decrease the function value. In order to do that, we keep track of vector v which is the difference between u and w. Similar as before, we also decompose v into different eigenspaces. However, this time we only care about the projection of v on the direction e1 and its orthognal subspace.\nAgain, recall notation H := ∇2f(x̃), e1 as minimum eigenvector of H and quadratic approximation f̃y(x) as defined in Eq.(4). Since δ ∈ (0, dκe ], we always have log(dκδ ) ≥ 1. W.L.O.G, set u0 = 0 to be the origin. Define vt = wt − ut, by assumptions in Lemma 17, we have v0 = µ[S /(κ · log(dκδ ))]e1, µ ∈ [δ/(2 √ d), 1]. Now, consider the update equation for wt:\nut+1 + vt+1 = wt+1 =wt − η∇f(wt) =ut + vt − η∇f(ut + vt)\n=ut + vt − η∇f(ut)− η [∫ 1\n0 ∇2f(ut + θvt)dθ\n]\nvt\n=ut + vt − η∇f(ut)− η(H +∆′t)vt =ut − η∇f(ut) + (I− ηH− η∆′t)vt\nwhere ∆′t := ∫ 1 0 ∇2f(ut+ θvt)dθ−H. By Hessian Lipschitz, we have ‖∆′t‖ ≤ ρ(‖ut‖+ ‖vt‖+ ‖x̃‖). This gives the dynamic for vt satisfy:\nvt+1 = (I − ηH− η∆′t)vt (14) Since ‖w0 − x̃‖ ≤ ‖u0 − x̃‖ + ‖v0‖ ≤ S /(κ · log(dκδ )), directly applying Lemma 16, we know wt ≤ 100(S · ĉ) for all t ≤ T . By condition of Lemma 17, we know ‖ut‖ ≤ 100(S · ĉ) for all t < T . This gives: ‖vt‖ ≤ ‖ut‖+ ‖wt‖ ≤ 200(S · ĉ) for all t < T (15) This in sum gives for t < T :\n‖∆′t‖ ≤ ρ(‖ut‖+ ‖vt‖+ ‖x̃‖) ≤ ρ(300ĉS + S /(κ · log( dκ\nδ ))) ≤ ρS (300ĉ + 1)\nOn the other hand, denote ψt be the norm of vt projected onto e1 direction, and ϕt be the norm of vt projected onto remaining subspace. Eq.(14) gives us:\nψt+1 ≥(1 + γη)ψt − µ √ ψ2t + ϕ 2 t ϕt+1 ≤(1 + γη)ϕt + µ √ ψ2t + ϕ 2 t\nwhere µ = ηρS (300ĉ + 1). We will now prove via induction that for all t < T :\nϕt ≤ 4µt · ψt (16) By hypothesis of Lemma 17, we know ϕ0 = 0, thus the base case of induction holds. Assume Eq.(16) is true for τ ≤ t, For t+ 1 ≤ T , we have:\n4µ(t+ 1)ψt+1 ≥4µ(t+ 1) ( (1 + γη)ψt − µ √ ψ2t + ϕ 2 t )\nϕt+1 ≤4µt(1 + γη)ψt + µ √ ψ2t + ϕ 2 t\nFrom above inequalities, we see that we only need to show:\n(1 + 4µ(t+ 1)) √\nψ2t + ϕ 2 t ≤ 4(1 + γη)ψt\nBy choosing √ cmax ≤ 1300ĉ+1 min{ 12√2 , 1 4ĉ}, and η ≤ cmax/ℓ, we have\n4µ(t+ 1) ≤ 4µT ≤ 4ηρS (300ĉ + 1)ĉT = 4 √ ηℓ(300ĉ + 1)ĉ ≤ 1\nThis gives:\n4(1 + γη)ψt ≥ 4ψt ≤ 2 √ 2ψ2t ≥ (1 + 4µ(t+ 1)) √ ψ2t + ϕ 2 t\nwhich finishes the induction.\nNow, we know ϕt ≤ 4µt · ψt ≤ ψt, this gives:\nψt+1 ≥ (1 + γη)ψt − √ 2µψt ≥ (1 + γη\n2 )ψt (17)\nwhere the last step follows from µ = ηρS (300ĉ + 1) ≤ √cmax(300ĉ + 1)γη · log−1(dκδ ) < γη 2 √ 2 .\nFinally, combining Eq.(15) and (17) we have for all t < T :\n200(S · ĉ) ≥‖vt‖ ≥ ψt ≥ (1 + γη\n2 )tψ0\n=(1 + γη\n2 )tc0\nS\nκ log−1(\ndκ δ ) ≥ (1 + γη 2 )t δ 2 √ d S κ log−1( dκ δ )\nThis implies:\nT < 1\n2\nlog(400κ √ d\nδ · ĉ log(dκδ )) log(1 + γη2 )\n≤ log(400 κ √ d\nδ · ĉ log(dκδ )) γη ≤ (2 + log(400ĉ))T\nThe last inequality is due to δ ∈ (0, dκe ] we have log(dκδ ) ≥ 1. By choosing constant ĉ to be large enough to satisfy 2 + log(400ĉ) ≤ ĉ, we will have T < ĉT , which finishes the proof.\nB Improve Convergence by Local Structure\nIn this section, we show if the objective function has nice local structure (e.g. satisfies Assumptions A3.a or A3.b), then it is possible to combine our analysis with the local analysis in order to get very fast convergence to a local minimum.\nIn particular, we prove Theorem 5.\nTheorem 5. There exist absolute constant cmax such that: if f(·) satisfies A1, A2, and A3.a (or A3.b), then for any δ > 0, ǫ > 0,∆f ≥ f(x0) − f⋆, constant c ≤ cmax, let ǫ̃ = min(θ, γ2/ρ), with probability 1− δ, the output of PGDli(x0, ℓ, ρ, ǫ̃, c, δ,∆f , β) will be ǫ-close to X ⋆ in iterations:\nO\n( ℓ(f(x0)− f⋆)\nǫ̃2 log4 ( dℓ∆f ǫ̃2δ ) + β α log ζ ǫ )\nProof. Theorem 5 runs PGDli(x0, ℓ, ρ, ǫ̃, c, δ,∆f , β). According to algorithm 3, we know it calls PGD(x0, ℓ, ρ, ǫ, c, δ,∆f ) first (denote its output as x̂), then run standard gradient descent with learning rate 1β starting from x̂.\nBy Corollary 4, we know x̂ is already in the ζ-neighborhood of X ⋆, where X ⋆ is the set of local minima. Therefore, to prove this theorem, we only need to show prove following two claims:\n1. Suppose {xt} is the sequence of gradient descent starting from x0 = x̂ with learning rate 1β , then xt is always in the ζ-neighborhood of X ⋆.\n2. Local structure (assumption A3.a or A3.b) allows iterates to converge to points ǫ-close to X ⋆ within O(βα log ζ ǫ ) iterations.\nWe will focus on Assumption A3.b (as we will later see Assumption A3.a is a special case of Assumption A3.b). Assume xt is in ζ-neighborhood of X ⋆, by gradient updates and the definition of projection, we have:\n‖xt+1 − PX ⋆(xt+1)‖2 ≤‖xt+1 − PX ⋆(xt)‖2 = ‖xt − η∇f(xt)−PX ⋆(xt)‖2\n=‖xt − PX ⋆(xt)‖2 − 2η〈∇f(xt),xt − PX ⋆(xt)〉+ η2‖∇f(xt)‖2 ≤‖xt − PX ⋆(xt)‖2 − ηα‖xt − PX ⋆(xt)‖2 + (η2 − η\nβ )‖∇f(x)‖2\n≤(1− α β )‖xt − PX ⋆(xt)‖2\nThe second last inequality is due to (α, β)-regularity condition. The last inequality is because of the choice η = 1β .\nThere are two consequences of this calculation. First, it shows ‖xt+1 − PX ⋆(xt+1)‖2 ≤ ‖xt − PX ⋆(xt)‖2. As a result if xt in ζ-neighborhood of X ⋆, xt+1 is also in this ζ-neighborhood. Since x0 is in the ζ-neighborhood by Corollary 4, by induction we know all later iterations are in the same neighborhood.\nNow, since we know all the points xt are in the neighborhood, the equation also shows linear convergence rate (1 − αβ ). The initial distance is bounded by ‖x0 − PX ⋆(x0)‖ ≤ ζ, therefore to converge to points ǫ-close to X ⋆, we only need the following number of iterations:\nlog(ǫ/ζ) log(1− α/β) = O( β α log ζ ǫ ).\nThis finishes the proof under Assumption A3.b. Finally, we argue assumption A3.a implies A3.b. First, notice that if a function is locally strongly convex, then its local minima are isolated: for any two points x,x′ ∈ X ⋆, the local region Bx(ζ) and Bx′(ζ) must be disjoint (otherwise function f(x) is strongly convex in connected domain Bx(ζ) ∪ Bx′(ζ) but has two distinct local minima, which is impossible). Therefore, W.L.O.G, it suffices to consider one perticular disjoint region, with unique local minimum we denote as x⋆, clearly, for all x ∈ Bx⋆(ζ) we have PX ⋆(x) = x⋆.\nNow by α-strong convexity:\nf(x⋆) ≥ f(x) + 〈∇f(x),x⋆ − x〉+ α 2 ‖x− x⋆‖2 (18)\nOn the other hand, for any x in this ζ-neighborhood, we already proved x − 1β∇f(x) also in this ζ-neighborhood. By β-smoothness, we also have:\nf(x− 1 β ∇f(x)) ≤ f(x)− 1 2β ‖∇f(x)‖2 (19)\nCombining Eq.(18) and Eq.(19), and using the fact f(x⋆) ≤ f(x− 1β∇f(x)), we get:\n〈∇f(x),x− x⋆〉 ≥ α 2 ‖x− x⋆‖2 + 1 2β ‖∇f(x)‖2\nwhich finishes the proof."
    }, {
      "heading" : "C Geometric Structures of Matrix Factorization Problem",
      "text" : "In this Section we investigate the global geometric structures of the matrix factorization problem. These properties are summarized in Lemmas 6 and 7. Such structures allow us to apply our main Theorem and get fast convergence (as shown in Theorem 8).\nNote that our main results Theorems 3 and 5 are proved for functions f(·) whose input x is a vector. For the current function in 2, though the input U ∈ Rd×r is a matrix, we can always vectorize it to be a vector in Rdr and apply our results. However, for simplicity of presentation, we still write everything in matrix form (without explicit vectorization), while the reader should keep in mind the operations are same if one vectorizes everything first.\nRecall for vectors we use ‖·‖ to denote the 2-norm, and for matrices we use ‖·‖ and ‖·‖F to denote spectral norm, and Frobenius norm respectively. Furthermore, we always use σi(·) to denote the i-th largest singular value of the matrix.\nWe first show how the geometric properties (Lemma 6 and Lemma 7) imply a fast convergence (Theorem 8).\nTheorem 8. There exists an absolute constant cmax such that the following holds. For matrix factorization (2), for any δ > 0 and constant c ≤ cmax, let Γ1/2 := 2max{‖U0‖, 3(σ⋆1)1/2}, suppose we run PGDli(U0, 8Γ, 12Γ 1/2, (σ ⋆ r ) 2\n108Γ1/2 , c, δ, rΓ\n2\n2 , 10σ ⋆ 1), then:\n1. With probability 1, the iterates satisfy ‖Ut‖ ≤ Γ1/2 for every t ≥ 0.\n2. With probability 1−δ, the output will be ǫ-close to global minima set X ⋆ in following iterations:\nO\n(\nr\n( Γ\nσ⋆r\n)4 log4 ( dΓ\nδσ⋆r\n)\n+ σ⋆1 σ⋆r log σ⋆r ǫ\n)\nProof of Theorem 8. Denote c̃max to be the absolute constant allowed in Theorem 5. In this theorem, we let cmax = min{c̃max, 12}, and choose any constant c ≤ cmax.\nTheorem 8 consists of two parts. In part 1 we show that the iterations never bring the matrix to a very large norm, while in part 2 we apply our main Theorem to get fast convergence. We will first prove the bound on number of iterations assuming the bound on the norm. We will then proceed to prove part 1.\nPart 2: Assume part 1 of the theorem is true i.e., with probability 1, the iterates satisfy ‖Ut‖ ≤ Γ1/2 for every t ≥ 0. In this case, although we are doing unconstrained optimization, we can still use the geometric properties that hold inside this region. .\nBy Lemma 6 and 7, we know objective function Eq.(2) is 8Γ-smooth, 12Γ1/2-Lipschitz Hessian, ( 124 (σ ⋆ r ) 3/2, 13σ ⋆ r , 1 3(σ ⋆ r ) 1/2)-strict saddle, and holds (23σ ⋆ r , 10σ ⋆ 1)-regularity condition in 1 3 (σ ⋆ r ) 1/2 neighborhood of local minima (also global minima) X ⋆. Furthermore, note f⋆ = 0 and recall Γ1/2 = 2max{‖U0‖, 3(σ⋆1)1/2}, then, we have:\nf(U0)− f⋆ = ‖U0U⊤0 −M⋆‖2F ≤ 2r‖U0U⊤0 −M⋆‖2 ≤ rΓ2\n2 .\nThus, we can choose ∆f = rΓ2\n2 . Substituting the corresponding parameters from Theorem 5, we\nknow by running PGDli(U0, 8Γ, 12Γ 1/2, (σ\n⋆ r ) 2\n108Γ1/2 , c, δ, rΓ\n2\n2 , 10σ ⋆ 1), with probability 1 − δ, the output\nwill be ǫ-close to global minima set X ⋆ in iterations:\nO\n(\nr\n( Γ\nσ⋆r\n)4 log4 ( dΓ\nδσ⋆r\n)\n+ σ⋆1 σ⋆r log σ⋆r ǫ\n)\n.\nPart 1: We will now show part 1 of the theorem. Recall PGDli (Algorithm 3) runs PGD (Algorithm 2) first, and then runs gradient descent within 13(σ ⋆ r )\n1/2 neighborhood of X ⋆. It is easy to verify that 13 (σ ⋆ r )\n1/2 neighborhood of X ⋆ is a subset of {U|‖U‖2 ≤ Γ}. Therefore, we only need to show that first phase PGD will not leave the region. Specifically, we now use induction to prove the following for PGD:\n1. Suppose at iteration τ we add perturbation, and denote Ũτ to be the iterate before adding perturbation (i.e., Uτ = Ũτ + ξτ , and Ũτ = Uτ−1 − η∇f(Uτ−1)). Then, ‖Ũτ‖ ≤ 12Γ, and\n2. ‖Ut‖ ≤ Γ for all t ≥ 0.\nBy choice of parameters of Algorithm 2, we know η = c8Γ . First, consider gradient descent step without perturbations:\n‖Ut+1‖ =‖Ut − η∇f(Ut)‖ = ‖Ut − η(UtU⊤t −M⋆)Ut‖ ≤‖Ut − ηUtU⊤t Ut‖+ η‖M⋆Ut‖ ≤max\ni [σi(Ut)− ησ3i (Ut)] + η‖M⋆Ut‖\nFor the first term, we know function f(t) = t−ηt3 is monotonically increasing in [0, 1/√3η]. On the other hand, by induction assumption, we also know ‖Ut‖ ≤ Γ1/2 ≤ √ 8Γ/(3c) = 1/ √ 3η. Therefore, the max is taken when i = 1:\n‖Ut+1‖ ≤‖Ut‖ − η‖Ut‖3 + η‖M⋆Ut‖ ≤‖Ut‖ − η(‖Ut‖2 − σ⋆1)‖Ut‖. (20)\nWe seperate our discussion into following cases.\nCase ‖Ut‖ > 12Γ1/2: In this case ‖Ut‖ ≥ max{‖U0‖, 3(σ⋆1)1/2}. Recall Γ1/2 = 2max{‖U0‖, 3(σ⋆1)1/2}. Clearly, Γ ≥ 36σ⋆1 , we know:\n‖Ut+1‖ ≤‖Ut‖ − η(‖Ut‖2 − σ⋆1)‖Ut‖ ≤ ‖Ut‖ − c 8Γ ( 1 4 Γ− σ⋆1) 1 2 Γ1/2\n≤‖Ut‖ − c 8Γ ( 1 4 Γ− 1 36 Γ) 1 2 Γ1/2 = ‖Ut‖ − c 72 Γ1/2.\nThis means that in each iteration, the spectral norm would decrease by at least c72Γ 1/2.\nCase ‖Ut‖ ≤ 12Γ1/2: From (20), we know that as long as ‖Ut‖2 ≥ ‖M⋆‖, we will always have ‖Ut+1‖ ≤ ‖Ut‖ ≤ 12Γ1/2. For ‖Ut‖2 ≤ ‖M⋆‖, we have:\n‖Ut+1‖ ≤‖Ut‖ − η(‖Ut‖2 − σ⋆1)‖Ut‖ = ‖Ut‖+ c\n8Γ (σ⋆1 − ‖Ut‖2)‖Ut‖\n≤‖Ut‖+ ((σ⋆1)1/2 − ‖Ut‖)× c\n8Γ ((σ⋆1) 1/2 + ‖Ut‖)‖Ut‖\n≤‖Ut‖+ ((σ⋆1)1/2 − ‖Ut‖)× cσ⋆1 4Γ ≤ (σ⋆1)1/2\nThus, in this case, we always have ‖Ut+1‖ ≤ 12Γ1/2. In conclusion, if we don’t add perturbation in iteration t, we have:\n• If ‖Ut‖ > 12Γ1/2, then ‖Ut+1‖ ≤ ‖Ut‖ − c72Γ1/2.\n• If ‖Ut‖ ≤ 12Γ1/2, then ‖Ut+1‖ ≤ 12Γ1/2.\nNow consider the iterations where we add perturbation. By the choice of radius of perturbation in Algorithm 2 , we increase spectral norm by at most :\n‖ξt‖ ≤ ‖ξt‖F ≤ √ c\nχ2 (σ⋆r ) 2 108Γ1/2 · 8Γ ≤ 1 2 Γ1/2\nThe first inequality is because χ ≥ 1 and c ≤ 1. That is, if before perturbation we have ‖Ũt‖ ≤ 1 2Γ\n1/2, then ‖Ut‖ = ‖Ũt + ξt‖ ≤ Γ1/2. On the other hand, according to Algorithm 2, once we add perturbation, we will not add\nperturbation for next tthres = χ·24Γ c2σ⋆r ≥ 24 c2 ≥ 48c iterations. Let T = min{inf i{Ut+i|‖Ut+i‖ ≤ 1 2Γ 1/2}, tthres}:\n‖Ut+T−1‖ ≤ ‖Ut‖ − c 72 Γ1/2(T − 1) ≤ Γ1/2(1− c(T − 1) 72 )\nThis gives T ≤ 36c < 48c ≤ tthres. Let τ > t be the next time when we add perturbation (τ ≥ t+ tthres), we immediately know ‖UT+i‖ ≤ 12Γ1/2 for 0 ≤ i < τ − T and ‖Ũτ‖ ≤ 12Γ1/2.\nFinally, ‖U0‖ ≤ 12Γ1/2 by definition of Γ, so the initial condition holds. This finishes induction and the proof of the theorem.\nIn the next subsections we prove the geometric structures.\nC.1 Smoothness and Hessian Lipschitz\nBefore we start proofs of lemmas, we first state some properties about gradient and Hessians. The gradient of the objective function f(U) is\n∇f(U) = 2(UU⊤ −M⋆)U. Furthermore, we have the gradient and Hessian satisfy for any Z ∈ Rd×r:\n〈∇f(U),Z〉 = 2〈(UU⊤ −M⋆)U,Z〉, and (21) ∇2f(U)(Z,Z) = ‖UZ⊤ + ZU⊤‖2F + 2〈UU⊤ −M⋆,ZZ⊤〉. (22)\nLemma 6. For any Γ ≥ σ⋆1, inside the region {U|‖U‖2 < Γ}, f(U) defined in Eq.(2) is 8Γ-smooth and 12Γ1/2-Hessian Lipschitz.\nProof. Denote D = {U|‖U‖2 < Γ}, and recall Γ ≥ σ⋆1 .\nSmoothness: For any U,V ∈ D, we have: ‖∇f(U)−∇f(V)‖F =2‖(UU⊤ −M⋆)U− (VV⊤ −M⋆)V‖F\n≤2 [ ‖UU⊤U−VV⊤V‖F + ‖M⋆(U−V)‖F ]\n≤2 [3 · Γ‖U−V‖F + σ⋆1‖U−V‖F] ≤ 8Γ · ‖U−V‖F. The last line is due to following decomposition and triangle inequality:\nUU⊤U−VV⊤V = UU⊤(U−V) +U(U−V)⊤V + (U−V)V⊤V.\nHessian Lipschitz: For any U,V ∈ D, and any Z ∈ Rd×r, according to Eq.(22), we have: |∇2f(U)(Z,Z)−∇2f(V)(Z,Z)| = ‖UZ⊤ + ZU⊤‖2F − ‖VZ⊤ + ZV⊤‖2F\n︸ ︷︷ ︸\nA\n+2〈UU⊤ −VV⊤,ZZ⊤〉 ︸ ︷︷ ︸\nB\n.\nFor term A, we have:\nA =〈UZ⊤ + ZU⊤, (U −V)Z⊤ + Z(U−V)⊤〉+ 〈(U−V)Z⊤ + Z(U−V)⊤,VZ⊤ + ZV⊤〉 ≤‖UZ⊤ + ZU⊤‖F‖(U −V)Z⊤ + Z(U−V)⊤‖F + ‖(U−V)Z⊤ + Z(U−V)⊤‖F‖VZ⊤ + ZV⊤‖F ≤4‖U‖‖Z‖2F‖U−V‖F + 4‖V‖‖Z‖2F‖U−V‖F ≤ 8Γ1/2‖Z‖2F‖U−V‖F.\nFor term B, we have:\nB ≤ 2‖UU⊤ −VV⊤‖F‖ZZ⊤‖F ≤ 4Γ1/2‖Z‖2F‖U−V‖F. The inequality is due to following decomposition and triangle inequality:\nUU⊤ −VV⊤ = U(U−V)⊤ + (U−V)V⊤. Therefore, in sum we have:\nmax Z:‖Z‖F≤1 |∇2f(U)(Z,Z)−∇2f(V)(Z,Z)| ≤ max Z:‖Z‖F≤1 12Γ1/2‖Z‖2F‖U−V‖F\n≤12Γ1/2‖U−V‖F.\nC.2 Strict-Saddle Property and Local Regularity\nRecall the gradient and Hessian of objective function is calculated as in Eq.(21) and Eq.(22). We first prove an elementary inequality regarding to the trace of product of two symmetric PSD matrices. This lemma will be frequently used in the proof.\nLemma 18. For A,B ∈ Rd×d both symmetric PSD matrices, we have:\nσmin(A)tr(B) ≤ tr(AB) ≤ ‖A‖tr(B)\nProof. Let A = VDV⊤ be the eigendecomposition of A, where D is diagonal matrix, and V is orthogonal matrix. Then we have:\ntr(AB) = tr(DV⊤BV) = d∑\ni=1\nDii(V ⊤BV)ii.\nSince B is PSD, we know V⊤BV is also PSD, thus the diagonal entries are non-negative. That is, (V⊤BV)ii ≥ 0 for all i = 1, . . . , d. Finally, the lemma follows from the fact that σmin(A) ≤ Dii ≤ ‖A‖ and tr(V⊤BV) = tr(BVV⊤) = tr(B).\nNow, we are ready to prove Lemma 7.\nLemma 7. For f(U) defined in Eq.(2), all local minima are global minima. The set of global minima is X ⋆ = {V⋆R|RR⊤ = R⊤R = I}. Furthermore, f(U) satisfies:\n1. ( 124 (σ ⋆ r ) 3/2, 13σ ⋆ r , 1 3(σ ⋆ r ) 1/2)-strict saddle property, and\n2. (23σ ⋆ r , 10σ ⋆ 1)-regularity condition in 1 3 (σ ⋆ r ) 1/2 neighborhood of X ⋆. Proof. Let us denote the set X ⋆ := {V⋆R|RR⊤ = R⊤R = I}, in the end of proof, we will show this set is the set of all local minima (which is also global minima).\nThroughout the proof of this lemma, we always focus on the first-order and second-order property for one matrix U. For simplicity of calculation, when it is clear from the context, we denote U⋆ = PX ⋆(U) and ∆ = U − PX ⋆(U). By definition of X ⋆, we know U⋆ = V⋆RU and ∆ = U−V⋆RU, where\nRU = argmin R:RR⊤=R⊤R=I\n‖U−V⋆R‖2F\nWe first prove following claim, which will used in many places across this proof:\nU⊤U⋆ = U⊤V⋆RU is a symmetric PSD matrix. (23)\nThis because by expanding the Frobenius norm, and letting the SVD of V⋆⊤U be ADB⊤, we have:\nargmin R:RR⊤=R⊤R=I ‖U−V⋆R‖2F = argmin R:RR⊤=R⊤R=I −〈U,V⋆R〉\n= argmin R:RR⊤=R⊤R=I −tr(U⊤V⋆R) = argmin R:RR⊤=R⊤R=I −tr(DA⊤RB)\nSince A,B,R are all orthonormal matrix, we know A⊤RB is also orthonormal matrix. Moreover for any orthonormal matrix T, we have:\ntr(DT) = ∑\ni\nDiiTii ≤ ∑\ni\nDii\nThe last inequality is because Dii is singular value thus non-negative, and T is orthonormal, thus Tii ≤ 1. This means the maximum of tr(DT) is achieved when T = I, i.e., the minimum of −tr(DA⊤RB) is achieved when R = AB⊤. Therefore, U⊤V⋆RU = BDA⊤AB⊤ = BDB⊤ is symmetric PSD matrix.\nStrict Saddle Property: In order to show the strict saddle property, we only need to show that for any U satisfying ‖∇f(U)‖F ≤ 124 (σ⋆r )3/2 and ‖∆‖F = ‖U−U⋆‖F ≥ 13(σ⋆r )1/2, we always have σmin(∇2f(U)) ≤ −13σ⋆r .\nLet’s consider Hessian ∇2(U) in the direction of ∆ = U−U⋆. Clearly, we have:\nUU⊤ −M⋆ = UU⊤ − (U−∆)(U−∆)⊤ = (U∆⊤ +∆U⊤)−∆∆⊤\nand by (21):\n〈∇f(U),∆〉 =2〈(UU⊤ −M⋆)U,∆〉 = 〈UU⊤ −M⋆,∆U⊤ +U∆⊤〉 =〈UU⊤ −M⋆,UU⊤ −M⋆ +∆∆⊤〉\nTherefore, by Eq.(22) and above two equalities, we have:\n∇2f(U)(∆,∆) =‖U∆⊤ +∆U⊤‖2F + 2〈UU⊤ −M⋆,∆∆⊤〉 =‖UU⊤ −M⋆ +∆∆⊤‖2F + 2〈UU⊤ −M⋆,∆∆⊤〉 =‖∆∆⊤‖2F − 3‖UU⊤ −M⋆‖2F + 4〈UU⊤ −M⋆,UU⊤ −M⋆ +∆∆⊤〉 =‖∆∆⊤‖2F − 3‖UU⊤ −M⋆‖2F + 4〈∇f(U),∆〉\nConsider the first two terms, by expanding, we have:\n3‖UU⊤ −M⋆‖2F − ‖∆∆⊤‖2F = 3‖(U⋆∆⊤ +∆U⋆⊤) + ∆∆⊤‖2F − ‖∆∆⊤‖2F =3 · tr ( 2U⋆⊤U⋆∆⊤∆+ 2(U⋆⊤∆)2 + 4U⋆⊤∆∆⊤∆+ (∆⊤∆)2 ) − tr((∆⊤∆)2) =tr ( 6U⋆⊤U⋆∆⊤∆+ 6(U⋆⊤∆)2 + 12U⋆⊤∆∆⊤∆+ 2(∆⊤∆)2 ) =tr((4 √ 3− 6)U⋆⊤U⋆∆⊤∆+ (12− 4 √ 3)U⋆⊤(U⋆ +∆)∆⊤∆+ 2( √ 3U⋆⊤∆+∆⊤∆)2) ≥(4 √ 3− 6)tr(U⋆⊤U⋆∆⊤∆) ≥ (4 √ 3− 6)σ⋆r‖∆‖2F\nwhere the second last inequality is because U⋆⊤(U⋆+∆)∆⊤∆ = U⋆⊤U∆⊤∆ is the product of two symmetric PSD matrices (thus its trace is non-negative); the last inequality is by Lemma 18.\nFinally, in case we have ‖∇f(U)‖F ≤ 124(σ⋆r )3/2 and ‖∆‖F = ‖U−U⋆‖F ≥ 13(σ⋆r )1/2\nσmin(∇2f(U)) ≤ 1\n‖∆‖2F ∇2f(U)(∆,∆) ≤ −(4\n√ 3− 6)σ⋆r + 4 〈∇f(U),∆〉 ‖∆‖2F\n≤− (4 √ 3− 6)σ⋆r + 4 ‖∇f(U)‖F ‖∆‖F ≤ −(4 √ 3− 6.5)σ⋆r ≤ − 1 3 σ⋆r\nLocal Regularity: In 13 (σ ⋆ r ) 1/2 neigborhood of X ⋆, by definition, we know,\n‖∆‖2F = ‖U−U⋆‖2F ≤ 1\n9 σ⋆r .\nClearly, by Weyl’s inequality, we have ‖U‖ ≤ ‖U⋆‖ + ‖∆‖ ≤ 43 (σ⋆1)1/2, and σr(U) ≥ σr(U⋆)− ‖∆‖ ≥ 23(σ⋆r )1/2. Moreover, since U⋆⊤U is symmetric matrix, we have:\nσr(U ⋆⊤U) =\n1\n2\n(\nσr(U ⊤U⋆ +U⋆⊤U)\n)\n≥1 2\n(\nσr(U ⊤U+U⋆⊤U⋆)− ‖(U−U⋆)⊤(U−U⋆)‖\n)\n≥1 2\n(\nσr(U ⊤U) + σr(U ⋆⊤U⋆)− ‖∆‖2F )\n≥1 2 (1 + 4 9 − 1 9 )σ⋆r = 2 3 σ⋆r .\nAt a highlevel, we will prove (α, β)-regularity property (1) by proving that:\n1. 〈∇f(x),x− PX ⋆(x)〉 ≥ α‖x− PX ⋆(x)‖2, and\n2. 〈∇f(x),x− PX ⋆(x)〉 ≥ 1β‖∇f(x)‖2.\nAccording to (21), we know:\n〈∇f(U),U − PX ⋆(U)〉 =2〈(UU⊤ −M⋆)U,∆〉 = 2〈U∆⊤ +∆U⋆⊤,∆U⊤〉 =2(tr(U∆⊤U∆⊤) + tr(∆U⋆⊤U∆⊤))\n=2(‖∆⊤U‖2F + tr(U⋆⊤U∆⊤∆)). (24)\nThe last equality is because ∆⊤U is symmetric matrix. Since U⋆⊤U is symmetric PSD matrix, and recall σr(U ⋆⊤U) ≥ 23σ⋆r , by Lemma 18 we have:\n〈∇f(U),U − PX ⋆(U)〉 ≥ σr(U⋆⊤U)tr(∆⊤∆) ≥ 2\n3 σ⋆r‖∆‖2F. (25)\nOn the other hand, we also have:\n‖∇f(U)‖2F =4〈(UU⊤ −M⋆)U, (UU⊤ −M⋆)U〉 =4〈(U∆⊤ +∆U⋆⊤)U, (U∆⊤ +∆U⋆⊤)U〉\n=4\n\ntr[(∆⊤UU⊤∆)U⊤U] + 2tr[∆⊤UU⊤U⋆∆⊤U] ︸ ︷︷ ︸\nA\n+tr(U⋆⊤UU⊤U⋆∆⊤∆) ︸ ︷︷ ︸\nB\n\n .\nFor term A, by Lemma 18, and ∆⊤U being a symmetric matrix, we have:\nA ≤ ‖U⊤U‖‖∆⊤U‖2F + 2‖U⊤U⋆‖‖∆⊤U‖2F ≤ ( 16\n9 +\n8 3 )σ⋆1‖∆⊤U‖2F ≤ 5σ⋆1‖∆⊤U‖2F\nFor term B, by Eq.(23) we can denote C = U⋆⊤U = U⊤U⋆ which is symmetric PSD matrix, by Lemma 18, we have:\nB =tr(C2∆⊤∆) = tr(C(C1/2∆⊤∆C1/2))\n≤‖C‖tr(C1/2∆⊤∆C1/2) = ‖C‖tr(C∆⊤∆) ≤ 4 3 σ⋆1tr(U ⋆⊤U∆⊤∆).\nCombining with (24) we have:\n‖∇f(U)‖2F ≤ σ⋆1(20‖∆⊤U‖2F + 16 3 tr(U⋆⊤U∆⊤∆)) ≤ 10σ⋆1〈∇f(U),U − PX ⋆(U)〉. (26)\nCombining (25) and (26), we have:\n〈∇f(U),U− PX ⋆(U)〉 ≥ 1\n3 σ⋆r‖U− PX ⋆(U)‖2F +\n1\n20σ⋆1 ‖∇f(U)‖2F."
    } ],
    "references" : [ {
      "title" : "Finding approximate local minima for nonconvex optimization in linear time",
      "author" : [ "Naman Agarwal", "Zeyuan Allen-Zhu", "Brian Bullins", "Elad Hazan", "Tengyu Ma" ],
      "venue" : "arXiv preprint arXiv:1611.01146,",
      "citeRegEx" : "Agarwal et al\\.,? \\Q2016\\E",
      "shortCiteRegEx" : "Agarwal et al\\.",
      "year" : 2016
    }, {
      "title" : "Global optimality of local search for low rank matrix recovery",
      "author" : [ "Srinadh Bhojanapalli", "Behnam Neyshabur", "Nathan Srebro" ],
      "venue" : "arXiv preprint arXiv:1605.07221,",
      "citeRegEx" : "Bhojanapalli et al\\.,? \\Q2016\\E",
      "shortCiteRegEx" : "Bhojanapalli et al\\.",
      "year" : 2016
    }, {
      "title" : "Phase retrieval via wirtinger flow: Theory and algorithms",
      "author" : [ "Emmanuel J Candes", "Xiaodong Li", "Mahdi Soltanolkotabi" ],
      "venue" : "IEEE Transactions on Information Theory,",
      "citeRegEx" : "Candes et al\\.,? \\Q1985\\E",
      "shortCiteRegEx" : "Candes et al\\.",
      "year" : 1985
    }, {
      "title" : "Gradient descent efficiently finds the cubic-regularized non-convex newton step",
      "author" : [ "Yair Carmon", "John C Duchi" ],
      "venue" : "arXiv preprint arXiv:1612.00547,",
      "citeRegEx" : "Carmon and Duchi.,? \\Q2016\\E",
      "shortCiteRegEx" : "Carmon and Duchi.",
      "year" : 2016
    }, {
      "title" : "Accelerated methods for nonconvex optimization",
      "author" : [ "Yair Carmon", "John C Duchi", "Oliver Hinder", "Aaron Sidford" ],
      "venue" : "arXiv preprint arXiv:1611.00756,",
      "citeRegEx" : "Carmon et al\\.,? \\Q2016\\E",
      "shortCiteRegEx" : "Carmon et al\\.",
      "year" : 2016
    }, {
      "title" : "The loss surface of multilayer networks",
      "author" : [ "Anna Choromanska", "Mikael Henaff", "Michael Mathieu", "Gérard Ben Arous", "Yann LeCun" ],
      "venue" : null,
      "citeRegEx" : "Choromanska et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Choromanska et al\\.",
      "year" : 2014
    }, {
      "title" : "A trust region algorithm with a worst-case iteration complexity of\\ mathcal {O}(\\ epsilonˆ{-3/2}) for nonconvex optimization",
      "author" : [ "Frank E Curtis", "Daniel P Robinson", "Mohammadreza Samadi" ],
      "venue" : "Mathematical Programming,",
      "citeRegEx" : "Curtis et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Curtis et al\\.",
      "year" : 2014
    }, {
      "title" : "Identifying and attacking the saddle point problem in high-dimensional non-convex optimization",
      "author" : [ "Yann N Dauphin", "Razvan Pascanu", "Caglar Gulcehre", "Kyunghyun Cho", "Surya Ganguli", "Yoshua Bengio" ],
      "venue" : "In Advances in Neural Information Processing Systems,",
      "citeRegEx" : "Dauphin et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Dauphin et al\\.",
      "year" : 2014
    }, {
      "title" : "Escaping from saddle points—online stochastic gradient for tensor decomposition",
      "author" : [ "Rong Ge", "Furong Huang", "Chi Jin", "Yang Yuan" ],
      "venue" : "In COLT,",
      "citeRegEx" : "Ge et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Ge et al\\.",
      "year" : 2015
    }, {
      "title" : "Matrix completion has no spurious local minimum",
      "author" : [ "Rong Ge", "Jason D Lee", "Tengyu Ma" ],
      "venue" : "In Advances in Neural Information Processing Systems,",
      "citeRegEx" : "Ge et al\\.,? \\Q2016\\E",
      "shortCiteRegEx" : "Ge et al\\.",
      "year" : 2016
    }, {
      "title" : "On decompositional algorithms for uniform sampling from n-spheres and n-balls",
      "author" : [ "Radoslav Harman", "Vladimı́r Lacko" ],
      "venue" : "Journal of Multivariate Analysis,",
      "citeRegEx" : "Harman and Lacko.,? \\Q2010\\E",
      "shortCiteRegEx" : "Harman and Lacko.",
      "year" : 2010
    }, {
      "title" : "Computing matrix squareroot via non convex local search",
      "author" : [ "Prateek Jain", "Chi Jin", "Sham M Kakade", "Praneeth Netrapalli" ],
      "venue" : "arXiv preprint arXiv:1507.05854,",
      "citeRegEx" : "Jain et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Jain et al\\.",
      "year" : 2015
    }, {
      "title" : "Linear convergence of gradient and proximalgradient methods under the Polyak-Lojasiewicz condition",
      "author" : [ "Hamed Karimi", "Julie Nutini", "Mark Schmidt" ],
      "venue" : "In Joint European Conference on Machine Learning and Knowledge Discovery in Databases,",
      "citeRegEx" : "Karimi et al\\.,? \\Q2016\\E",
      "shortCiteRegEx" : "Karimi et al\\.",
      "year" : 2016
    }, {
      "title" : "Deep learning without poor local minima",
      "author" : [ "Kenji Kawaguchi" ],
      "venue" : "In Advances In Neural Information Processing Systems,",
      "citeRegEx" : "Kawaguchi.,? \\Q2016\\E",
      "shortCiteRegEx" : "Kawaguchi.",
      "year" : 2016
    }, {
      "title" : "Gradient descent only converges to minimizers",
      "author" : [ "Jason D Lee", "Max Simchowitz", "Michael I Jordan", "Benjamin Recht" ],
      "venue" : "In Conference on Learning Theory,",
      "citeRegEx" : "Lee et al\\.,? \\Q2016\\E",
      "shortCiteRegEx" : "Lee et al\\.",
      "year" : 2016
    }, {
      "title" : "The power of normalization: Faster evasion of saddle points",
      "author" : [ "Kfir Y Levy" ],
      "venue" : "arXiv preprint arXiv:1611.04831,",
      "citeRegEx" : "Levy.,? \\Q2016\\E",
      "shortCiteRegEx" : "Levy.",
      "year" : 2016
    }, {
      "title" : "Introductory lectures on convex programming volume",
      "author" : [ "Yu Nesterov" ],
      "venue" : "i: Basic course. Lecture notes,",
      "citeRegEx" : "Nesterov.,? \\Q1998\\E",
      "shortCiteRegEx" : "Nesterov.",
      "year" : 1998
    }, {
      "title" : "Cubic regularization of newton method and its global performance",
      "author" : [ "Yurii Nesterov", "Boris T Polyak" ],
      "venue" : "Mathematical Programming,",
      "citeRegEx" : "Nesterov and Polyak.,? \\Q2006\\E",
      "shortCiteRegEx" : "Nesterov and Polyak.",
      "year" : 2006
    }, {
      "title" : "Phase retrieval using alternating minimization",
      "author" : [ "Praneeth Netrapalli", "Prateek Jain", "Sujay Sanghavi" ],
      "venue" : "In Advances in Neural Information Processing Systems,",
      "citeRegEx" : "Netrapalli et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Netrapalli et al\\.",
      "year" : 2013
    }, {
      "title" : "Non-square matrix sensing without spurious local minima via the burer-monteiro approach",
      "author" : [ "Dohyung Park", "Anastasios Kyrillidis", "Constantine Caramanis", "Sujay Sanghavi" ],
      "venue" : "arXiv preprint arXiv:1609.03240,",
      "citeRegEx" : "Park et al\\.,? \\Q2016\\E",
      "shortCiteRegEx" : "Park et al\\.",
      "year" : 2016
    }, {
      "title" : "Gradient methods for the minimisation of functionals",
      "author" : [ "Boris T Polyak" ],
      "venue" : "USSR Computational Mathematics and Mathematical Physics,",
      "citeRegEx" : "Polyak.,? \\Q1963\\E",
      "shortCiteRegEx" : "Polyak.",
      "year" : 1963
    }, {
      "title" : "Learning representations by back-propagating errors",
      "author" : [ "David E Rumelhart", "Geoffrey E Hinton", "Ronald J Williams" ],
      "venue" : "Cognitive modeling,",
      "citeRegEx" : "Rumelhart et al\\.,? \\Q1988\\E",
      "shortCiteRegEx" : "Rumelhart et al\\.",
      "year" : 1988
    }, {
      "title" : "Complete dictionary recovery over the sphere i: Overview and the geometric picture",
      "author" : [ "Ju Sun", "Qing Qu", "John Wright" ],
      "venue" : "IEEE Transactions on Information Theory,",
      "citeRegEx" : "Sun et al\\.,? \\Q2016\\E",
      "shortCiteRegEx" : "Sun et al\\.",
      "year" : 2016
    }, {
      "title" : "A geometric analysis of phase retrieval",
      "author" : [ "Ju Sun", "Qing Qu", "John Wright" ],
      "venue" : "In Information Theory (ISIT),",
      "citeRegEx" : "Sun et al\\.,? \\Q2016\\E",
      "shortCiteRegEx" : "Sun et al\\.",
      "year" : 2016
    }, {
      "title" : "Guaranteed matrix completion via non-convex factorization",
      "author" : [ "Ruoyu Sun", "Zhi-Quan Luo" ],
      "venue" : "IEEE Transactions on Information Theory,",
      "citeRegEx" : "Sun and Luo.,? \\Q2016\\E",
      "shortCiteRegEx" : "Sun and Luo.",
      "year" : 2016
    }, {
      "title" : "Convergence analysis for rectangular matrix completion using burer-monteiro factorization and gradient descent",
      "author" : [ "Qinqing Zheng", "John Lafferty" ],
      "venue" : "arXiv preprint arXiv:1605.07051,",
      "citeRegEx" : "Zheng and Lafferty.,? \\Q2016\\E",
      "shortCiteRegEx" : "Zheng and Lafferty.",
      "year" : 2016
    } ],
    "referenceMentions" : [ {
      "referenceID" : 21,
      "context" : "This is notably true in the deep learning setting, where gradients can be computed efficiently via backpropagation [Rumelhart et al., 1988].",
      "startOffset" : 115,
      "endOffset" : 139
    }, {
      "referenceID" : 16,
      "context" : "within l(f(x0)− f⋆)/ǫ2 iterations [Nesterov, 1998], where x0 is the initial point and f⋆ is the optimal value of f .",
      "startOffset" : 34,
      "endOffset" : 50
    }, {
      "referenceID" : 8,
      "context" : ", in tensor decomposition [Ge et al., 2015], dictionary learning [Sun et al.",
      "startOffset" : 26,
      "endOffset" : 43
    }, {
      "referenceID" : 9,
      "context" : ", 2016], matrix completion [Ge et al., 2016], and certain classes of deep neural networks [Kawaguchi, 2016]).",
      "startOffset" : 27,
      "endOffset" : 44
    }, {
      "referenceID" : 13,
      "context" : ", 2016], and certain classes of deep neural networks [Kawaguchi, 2016]).",
      "startOffset" : 53,
      "endOffset" : 70
    }, {
      "referenceID" : 5,
      "context" : "Moreover, there are suggestions that in more general deep newtorks most of the local minima are as good as global minima [Choromanska et al., 2014].",
      "startOffset" : 121,
      "endOffset" : 147
    }, {
      "referenceID" : 17,
      "context" : "For ρ-Hessian Lipschitz functions (see Definition 5), these points are defined as [Nesterov and Polyak, 2006]:",
      "startOffset" : 82,
      "endOffset" : 109
    }, {
      "referenceID" : 1,
      "context" : ", 2016b], matrix sensing [Bhojanapalli et al., 2016, Park et al., 2016], matrix completion [Ge et al., 2016], and certain classes of deep neural networks [Kawaguchi, 2016]). Moreover, there are suggestions that in more general deep newtorks most of the local minima are as good as global minima [Choromanska et al., 2014]. On the other hand, saddle points (and local maxima) can correspond to highly suboptimal solutions in many problems [see, e.g., Jain et al., 2015, Sun et al., 2016b]. Furthermore, Dauphin et al. [2014] argue that saddle points are ubiquitous in high-dimensional, non-convex optimization problems, and are thus the main bottleneck in training neural networks.",
      "startOffset" : 26,
      "endOffset" : 524
    }, {
      "referenceID" : 1,
      "context" : ", 2016b], matrix sensing [Bhojanapalli et al., 2016, Park et al., 2016], matrix completion [Ge et al., 2016], and certain classes of deep neural networks [Kawaguchi, 2016]). Moreover, there are suggestions that in more general deep newtorks most of the local minima are as good as global minima [Choromanska et al., 2014]. On the other hand, saddle points (and local maxima) can correspond to highly suboptimal solutions in many problems [see, e.g., Jain et al., 2015, Sun et al., 2016b]. Furthermore, Dauphin et al. [2014] argue that saddle points are ubiquitous in high-dimensional, non-convex optimization problems, and are thus the main bottleneck in training neural networks. Standard analysis of gradient descent cannot distinguish between saddle points and local minima, leaving open the possibility that gradient descent may get stuck at saddle points, either asymptotically or for a sufficiently long time so as to make training times for arriving at a local minimum infeasible. Ge et al. [2015] showed that by adding noise at each step, gradient descent can escape all saddle points in a polynomial number of iterations, provided that the objective function satisfies the strict saddle property (see Assumption A2).",
      "startOffset" : 26,
      "endOffset" : 1005
    }, {
      "referenceID" : 1,
      "context" : ", 2016b], matrix sensing [Bhojanapalli et al., 2016, Park et al., 2016], matrix completion [Ge et al., 2016], and certain classes of deep neural networks [Kawaguchi, 2016]). Moreover, there are suggestions that in more general deep newtorks most of the local minima are as good as global minima [Choromanska et al., 2014]. On the other hand, saddle points (and local maxima) can correspond to highly suboptimal solutions in many problems [see, e.g., Jain et al., 2015, Sun et al., 2016b]. Furthermore, Dauphin et al. [2014] argue that saddle points are ubiquitous in high-dimensional, non-convex optimization problems, and are thus the main bottleneck in training neural networks. Standard analysis of gradient descent cannot distinguish between saddle points and local minima, leaving open the possibility that gradient descent may get stuck at saddle points, either asymptotically or for a sufficiently long time so as to make training times for arriving at a local minimum infeasible. Ge et al. [2015] showed that by adding noise at each step, gradient descent can escape all saddle points in a polynomial number of iterations, provided that the objective function satisfies the strict saddle property (see Assumption A2). Lee et al. [2016] proved that under similar conditions, gradient descent with random initialization avoids saddle points even without adding noise.",
      "startOffset" : 26,
      "endOffset" : 1244
    }, {
      "referenceID" : 1,
      "context" : ", 2016b], matrix sensing [Bhojanapalli et al., 2016, Park et al., 2016], matrix completion [Ge et al., 2016], and certain classes of deep neural networks [Kawaguchi, 2016]). Moreover, there are suggestions that in more general deep newtorks most of the local minima are as good as global minima [Choromanska et al., 2014]. On the other hand, saddle points (and local maxima) can correspond to highly suboptimal solutions in many problems [see, e.g., Jain et al., 2015, Sun et al., 2016b]. Furthermore, Dauphin et al. [2014] argue that saddle points are ubiquitous in high-dimensional, non-convex optimization problems, and are thus the main bottleneck in training neural networks. Standard analysis of gradient descent cannot distinguish between saddle points and local minima, leaving open the possibility that gradient descent may get stuck at saddle points, either asymptotically or for a sufficiently long time so as to make training times for arriving at a local minimum infeasible. Ge et al. [2015] showed that by adding noise at each step, gradient descent can escape all saddle points in a polynomial number of iterations, provided that the objective function satisfies the strict saddle property (see Assumption A2). Lee et al. [2016] proved that under similar conditions, gradient descent with random initialization avoids saddle points even without adding noise. However, this result does not bound the number of steps needed to reach a local minimum. Though these results establish that gradient descent can find local minima in a polynomial number of iterations, they are still far from being efficient. For instance, the number of iterations required in Ge et al. [2015] is at least Ω(d4), where d is the underlying dimension.",
      "startOffset" : 26,
      "endOffset" : 1685
    }, {
      "referenceID" : 16,
      "context" : "of gradient descent to first-order stationary points [Nesterov, 1998], up to log factors.",
      "startOffset" : 53,
      "endOffset" : 69
    }, {
      "referenceID" : 6,
      "context" : "Trust region algorithms [Curtis et al., 2014] can also achieve the same performance if the parameters are chosen carefully.",
      "startOffset" : 24,
      "endOffset" : 45
    }, {
      "referenceID" : 0,
      "context" : ", 2015, Sun and Luo, 2016, Bhojanapalli et al., 2016]. While there are not many results that show global convergence for non-convex problems, Jain et al. [2015] show that gradient descent yields global convergence rates for matrix square-root problems.",
      "startOffset" : 27,
      "endOffset" : 161
    }, {
      "referenceID" : 0,
      "context" : ", 2015, Sun and Luo, 2016, Bhojanapalli et al., 2016]. While there are not many results that show global convergence for non-convex problems, Jain et al. [2015] show that gradient descent yields global convergence rates for matrix square-root problems. Although these results give strong guarantees, the analyses are heavily tailored to specific problems, and it is unclear how to generalize them to a wider class of non-convex functions. For general non-convex optimization, there are a few previous results on finding second-order stationary points. These results can be divided into the following three categories, where, for simplicity of presentation, we only highlight dependence on dimension d and ǫ, assuming that all other problem parameters are constant from the point of view of iteration complexity: Hessian-based: Traditionally, only second-order optimization methods were known to converge to second-order stationary points. These algorithms rely on computing the Hessian to distinguish between first- and second-order stationary points. Nesterov and Polyak [2006] designed a cubic regularization algorithm which converges to an ǫ-second-order stationary point in O(1/ǫ1.",
      "startOffset" : 27,
      "endOffset" : 1079
    }, {
      "referenceID" : 0,
      "context" : "Agarwal et al. [2016] and Carmon et al.",
      "startOffset" : 0,
      "endOffset" : 22
    }, {
      "referenceID" : 0,
      "context" : "Agarwal et al. [2016] and Carmon et al. [2016] presented accelerated algorithms that can find an ǫ-second-order stationary point in O(log d/ǫ7/4) steps.",
      "startOffset" : 0,
      "endOffset" : 47
    }, {
      "referenceID" : 0,
      "context" : "Agarwal et al. [2016] and Carmon et al. [2016] presented accelerated algorithms that can find an ǫ-second-order stationary point in O(log d/ǫ7/4) steps. Also, Carmon and Duchi [2016] showed by running gradient descent as a subroutine to solve the subproblem of cubic regularization (which requires Hessian-vector product oracle), it is possible to find an ǫ-second-order stationary pointin O(log d/ǫ2) iterations.",
      "startOffset" : 0,
      "endOffset" : 183
    }, {
      "referenceID" : 8,
      "context" : "Ge et al. [2015] showed that stochastic gradient descent could converge to a second-order stationary point in poly(d/ǫ) iterations, with polynomial of order at least four.",
      "startOffset" : 0,
      "endOffset" : 17
    }, {
      "referenceID" : 8,
      "context" : "Ge et al. [2015] showed that stochastic gradient descent could converge to a second-order stationary point in poly(d/ǫ) iterations, with polynomial of order at least four. This was improved in Levy [2016] to O(d3 ·poly(1/ǫ)) using normalized gradient descent.",
      "startOffset" : 0,
      "endOffset" : 205
    }, {
      "referenceID" : 16,
      "context" : "Theorem 2 ([Nesterov, 1998]).",
      "startOffset" : 11,
      "endOffset" : 27
    }, {
      "referenceID" : 16,
      "context" : "We instead follow the convention of Nesterov and Polyak [2006] by choosing ǫH = √ ρǫg to reflect the natural relations between the gradient and the Hessian.",
      "startOffset" : 36,
      "endOffset" : 63
    }, {
      "referenceID" : 16,
      "context" : "We instead follow the convention of Nesterov and Polyak [2006] by choosing ǫH = √ ρǫg to reflect the natural relations between the gradient and the Hessian. This definition of ǫ-second-order stationary point can also differ by reparametrization (and scaling), e.g. Nesterov and Polyak [2006] use ǫ′ = √ ǫ/ρ.",
      "startOffset" : 36,
      "endOffset" : 292
    }, {
      "referenceID" : 10,
      "context" : "Note that uniform sampling from a d-dimensional ball can be done efficiently by sampling U 1 d × Y ‖Y‖ where U ∼ Uniform([0, 1]) and Y ∼ N (0, Id) [Harman and Lacko, 2010].",
      "startOffset" : 147,
      "endOffset" : 171
    }, {
      "referenceID" : 1,
      "context" : "This regularity condition commonly appears in low-rank problems such as matrix sensing and matrix completion, and has been used in Bhojanapalli et al. [2016], Zheng and Lafferty [2016], where local minima form a connected set, and where the Hessian is strictly positive only with respect to directions pointing outside the set of local minima.",
      "startOffset" : 131,
      "endOffset" : 158
    }, {
      "referenceID" : 1,
      "context" : "This regularity condition commonly appears in low-rank problems such as matrix sensing and matrix completion, and has been used in Bhojanapalli et al. [2016], Zheng and Lafferty [2016], where local minima form a connected set, and where the Hessian is strictly positive only with respect to directions pointing outside the set of local minima.",
      "startOffset" : 131,
      "endOffset" : 185
    }, {
      "referenceID" : 12,
      "context" : "The interested reader can refer to Karimi et al. [2016] for other relaxed and alternative notions of convexity, which can also be potentially combined with Assumptions A1andA2 to yield convergence results of a similar flavor as that of Theorem 5.",
      "startOffset" : 35,
      "endOffset" : 56
    }, {
      "referenceID" : 8,
      "context" : "[Ge et al., 2015]).",
      "startOffset" : 0,
      "endOffset" : 17
    }, {
      "referenceID" : 8,
      "context" : "[Ge et al., 2015]) do not work when the step size and perturbation do not depend polynomially in dimension d.",
      "startOffset" : 0,
      "endOffset" : 17
    } ],
    "year" : 2017,
    "abstractText" : "This paper shows that a perturbed form of gradient descent converges to a second-order stationary point in a number iterations which depends only poly-logarithmically on dimension (i.e., it is almost “dimension-free”). The convergence rate of this procedure matches the wellknown convergence rate of gradient descent to first-order stationary points, up to log factors. When all saddle points are non-degenerate, all second-order stationary points are local minima, and our result thus shows that perturbed gradient descent can escape saddle points almost for free. Our results can be directly applied to many machine learning applications, including deep learning. As a particular concrete example of such an application, we show that our results can be used directly to establish sharp global convergence rates for matrix factorization. Our results rely on a novel characterization of the geometry around saddle points, which may be of independent interest to the non-convex optimization community.",
    "creator" : "LaTeX with hyperref package"
  }
}