{
  "name" : "1703.01830.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Decomposable Submodular Function Minimization: Discrete and Continuous",
    "authors" : [ "Alina Ene", "Huy L. Nguyễn", "László A. Végh" ],
    "emails" : [ "aene@bu.edu", "hu.nguyen@northeastern.edu", "L.Vegh@lse.ac.uk" ],
    "sections" : [ {
      "heading" : null,
      "text" : "ar X\niv :1\n70 3.\n01 83\n0v 1\n[ cs\n.L G\n] 6\nM ar\nThis paper investigates connections between discrete and continuous approaches for decomposable submodular function minimization. We provide improved running time estimates for the state-of-the-art continuous algorithms for the problem using combinatorial arguments. We also provide a systematic experimental comparison of the two types of methods, based on a clear distinction between level-0 and level-1 algorithms."
    }, {
      "heading" : "1 Introduction",
      "text" : "Submodular functions arise in a wide range of applications: graph theory, optimization, economics, game theory, to name a few. A function f : 2V → R on a ground set V is submodular if f(X) + f(Y ) ≥ f(X ∩Y )+f(X ∪Y ) for all sets X,Y ⊆ V . Submodularity can also be interpreted as a decreasing marginals property.\nThere has been significant interest in submodular optimization in the machine learning and computer vision communities. The submodular function minimization (SFM) problem arises in problems in image segmentation or MAP inference tasks in Markov Random Fields. Landmark results in combinatorial optimization give polynomial-time exact algorithms for SFM. However, the high-degree polynomial dependence in the running time is prohibitive for large-scale problem instances. The main objective in this context is to develop fast and scalable SFM algorithms.\nInstead of minimizing arbitrary submodular functions, several recent papers aim to exploit special structural properties of submodular functions arising in practical applications. A popular model is decomposable submodular functions: these can be written as sums of several “simple” submodular functions defined on small supports.\nSome definitions are in order. Let f : 2V → R be a submodular function, and let n := |V |. We can assume w.l.o.g. that f(∅) = 0. We are interested in solving the submodular function minimization problem\nmin S⊆V f(S). (SFM)\nThe base polytope of a submodular function is defined as\nB(f) := {x ∈ RV : x(S) ≤ f(S) ∀S ⊆ V, x(V ) = f(V )}. ∗Department of Computer Science, Boston University, aene@bu.edu †College of Computer and Information Science, Northeastern University, hu.nguyen@northeastern.edu ‡Department of Mathematics, London School of Economics, L.Vegh@lse.ac.uk\nOne can optimize linear functions over B(f) using the greedy algorithm. The problem (SFM) can be reduced to finding the minimum norm point of the base polytope B(f) [Fuj80].\nmin\n{ 1\n2 ‖y‖22 : y ∈ B(f)\n}\n. (Min-Norm)\nThis reduction is the starting point of convex optimization approaches for (SFM). We refer the reader to Sections 44–45 in [Sch03] for concepts and results in submodular optimization, and to [Bac11] on machine learning applications.\nWe assume that f is given in the decomposition\nf(S) =\nr∑\ni=1\nfi(S),\nwhere each fi : 2 V → R is a submodular function. Such functions are called decomposable or Sum-ofSubmodular (SoS) in the literature. In this paper, we will use the abbreviation DSFM.\nFor each i ∈ [r], the function fi has an effective support Ci such that fi(S) = fi(S ∩ Ci) for every S ⊆ V . For each i ∈ [r], we assume that two oracles are provided: (i) a value oracle that returns fi(S) for any set S ⊆ V in time EOi; and (ii) a quadratic minimization oracle Oi(w). For any input vector w ∈ Rn, this oracle returns an optimal solution to (Min-Norm) for the function fi + w, or equivalently, an optimal solution to miny∈B(fi) ‖y+w‖22. We let Θi denote the running time of a single call to the oracle Oi, Θmax := maxi∈[r] Θi denote the maximum time of an oracle call, Θavg := 1 r ∑ i∈[r] Θi denote the average time of an oracle call. 1 We let Fi,max := maxS⊆V |fi(S)|, Fmax := maxS⊆V |f(S)| denote the maximum function values. Decomposable SFM thus requires algorithms on two levels. The level-0 algorithms are the subroutines used to evaluate the oracles Oi for every i ∈ [r]. The level-1 algorithm minimizes the function f using the level-0 algorithms as black boxes."
    }, {
      "heading" : "1.1 Prior work",
      "text" : "SFM has had a long history in combinatorial optimization since the early 1970s, following the influential work of Edmonds [Edm70]. The first polynomial-time algorithm was obtained via the ellipsoid method [GLS81]; recent work presented substantial improvements using this approach [LSW15]. Substantial work focused on designing strongly polynomial combinatorial algorithms [Sch00, IFF01, FI03, Iwa03, Orl09, IO09]. Still, designing practical algorithms for SFM that can be applied to large-scale problem instances remains an open problem.\nLet us now turn to decomposable SFM. Previous work mainly focused on level-1 algorithms. These can be classified as discrete and continuous optimization methods. The discrete approach builds on techniques of classical discrete algorithms for network flows and for submodular flows. Kolmogorov [Kol12] showed that the problem can be reduced to submodular flow maximization, and also presented a more efficient augmenting path algorithm. Subsequent discrete approaches were given in [ABKM12, FJMPZ13, FWZ14]. Continuous approaches start with convex programming formulation (Min-Norm). Gradient methods were applied for the decomposable setting in [SK10, NJJ14, EN15].\nLess attention has been given to the level-0 algorithms. Some papers mainly focus on theoretical guarantees on the running time of level-1 algorithms, and treat the level-0 subroutines as black-boxes (e.g. [Kol12, NJJ14, EN15]). In other papers (e.g. [SK10, JBS13]), the model is restricted to functions fi of a simple specific type that are easy to minimize. An alternative assumption is that all Ci’s are small, of size at most k; and thus these oracles can be evaluated by exhaustive search, in 2k value oracle calls (e.g. [ABKM12, FJMPZ13]).\n1For flow-type algorithms for DSFM, a slightly weaker oracle assumption suffices, returning a minimizer of minS⊆Ci fi(S)+ w(S) for any given w ∈ RCi . This oracle and the quadratic minimization oracle are reducible to each other: the former reduces to a single call to the latter, and one can implement the latter using O(|Ci|) calls to the former (see e.g. [Bac11]).\nShanu et al. [SAS16] use a block coordinate descent method for level-1, and allow arbitrary functions fi. The oracles are evaluated via the Fujishige-Wolfe minimum norm point algorithm [FI11, Wol76] for level-0."
    }, {
      "heading" : "1.2 Our contributions",
      "text" : "Our paper establishes connections between discrete and continuous methods for decomposable SFM, as well as provides a systematic experimental comparison of these approaches. Our main theoretical contribution improves the worst-case complexity bound of the most recent continuous optimization methods [NJJ14, EN15] by a factor of r, the number of functions in the decomposition. This is achieved by improving the bounds on the relevant condition numbers. Our proof exploits ideas from the discrete optimization approach. This provides not only better, but also considerably simpler arguments than the algebraic proof in [NJJ14].\nThe guiding principle of our experimental work is the clean conceptual distinction between the level-0 and level-1 algorithms. Previous experimental studies considered the level-0 and level-1 algorithms as a single “package”. For example, Shanu et al. [SAS16] compare the performance of their SoS Min-Norm algorithm to the continuous approach of Jegelka et al. [JBS13] and the combinatorial approach of Arora et al. [ABKM12]. However, these implementations are difficult to compare since they use three different level-0 algorithms: Fujishige-Wolfe in SoS Min-Norm, a general QP solver for the algorithm of [JBS13], and exhaustive search for [ABKM12]. For potentials of large support, Fujishige-Wolfe outperforms these other level-0 subroutines, hence the algorithms in [JBS13, ABKM12] could have compared more favorably using the same FujishigeWolfe subroutine.\nIn our experimental setup, we compare level-1 algorithms by using the same level-0 subroutines. We compare the state-of-the-art continuous and discrete algorithms: RCDM and ACDM from [EN15] with Submodular IBFS from [FJMPZ13]. We consider multiple options for the level-0 subroutines. For certain potential types, we use tailored subroutines exploiting the specific form of the problem. We also consider a variant of the Fujishige-Wolfe algorithm as a subroutine applicable for arbitrary potentials. Our experimental results reveal the following tradeoff. Discrete algorithms on level-1 require more calls to the level-0 oracle, but less overhead computation. Hence using algorithms such as IBFS on level-1 can be significantly faster than gradient descent as long as the potentials have fairly small supports. However, as the size of the potentials grow, or we do need to work with a generic level-0 algorithm, the better choice is using gradient methods. Gradient methods can perform better for larger potentials also due to weaker requirements on the level-0 subroutines: approximate level-0 subroutines suffice for them, whereas discrete algorithms require exact optimal solutions on level-0.\nPaper outline. The rest of the paper is structured as follows. Section 2 describes the level-1 algorithmic framework for DSFM that is based on network flows, and outlines the IBFS algorithm. Section 3 describes the level-1 algorithmic framework for DSFM that is based on convex optimization, and outlines the gradient descent algorithms. Section 4 gives improved convergence guarantees for the gradient descent algorithms outlined in Section 3. Section 5 discusses the different types of level-0 algorithms and how they can be used together with the level-1 frameworks. Section 6 presents our experimental results."
    }, {
      "heading" : "2 Level-1 algorithms based on network flow",
      "text" : "In this section, we outline a level-1 algorithmic framework for DSFM that is based on a combinatorial framework first studied in [FZ92].2 For a decomposable function f , every x ∈ B(f) can be written as x = ∑ri=1 xi, where supp(xi) ⊆ Ci and xi ∈ B(fi) (see e.g. Theorem 44.6 in [Sch03]). A natural algorithmic approach is to maintain an x ∈ B(f) in such a representation, and iteratively update it using the combinatorial framework described below. DSFM\n2The framework was introduced in a slightly different context, for the submodular intersection problem. The dual of this problem is minimizing a submodular function of the form f = f1 + f2, with access to oracles minimizing f1 and f2.\ncan be casted as a maximum network flow instance in a network that is suitably defined based on the current point x. This can be viewed as an analogue of the residual graph in the maxflow/mincut setting, and it is precisely the residual graph if the DSFM instance was a mincut instance. The auxiliary graph. For an x ∈ B(f) of the form x = ∑ri=1 xi, we construct the following directed auxiliary graph G = (V,E), with E =\n⋃r i=1 Ei and capacities c : E → R+. The arc sets Ei are complete\ndirected graphs (cliques) on Ci, and for an arc (u, v) ∈ Ei, we define c(u, v) := min{fi(S)−xi(S) : S ⊆ Ci, u ∈ S, v /∈ S}. This is the maximum value ε such that x′i ∈ B(fi), where x′i(u) = xi(u) + ε, x′i(v) = xi(v) − ε, x′i(z) = xi(z) for z /∈ {u, v}. Let N := {v ∈ V : x(v) < 0} and P := {v ∈ V : x(v) > 0}. The algorithm aims to improve the current x by updating along shortest directed paths from N to P with positive capacity; there are several ways to update the solution, and we discuss specific approaches later in the section. If there exists no such directed path, then we let S denote the set reachable from N on directed paths with positive capacity; thus, S ∩ P = ∅. It is easy to show that S is a minimizer of the function f .\nUpdating along a shortest path Q fromN to P amounts to the following. Let ε denote the minimum capacity of an arc on Q. If (u, v) ∈ Q∩Ei, then we increase xi(u) by ε and decrease xi(v) by ε. The crucial technical claim [FZ92] is the following. Let d(u) denote the shortest path distance of positive capacity arcs from u to the set P . Then, an update along a shortest directed path from N to P results in a feasible x ∈ B(f), and further, all distance labels d(u) are non-decreasing.\nLevel-1 algorithms based on the network flow approach. Using this auxiliary graph, and updating on shortest augmenting paths, one can generalize several maximum flow algorithms to a level-1 algorithm of DSFM. These algorithms include: the Edmonds-Karp-Dinitz maximum flow algorithm, the preflow-push algorithm [GT88], the incremental breadth first search algorithm (IBFS) [GHK+11], and the excesses incremental breadth first search algorithm [GHK+15]. Our experiments will use an implementation of IBFS, following [FJMPZ13].\nSubmodular incremental breadth first search (IBFS). Fix et al. [FJMPZ13] adapt the IBFS algorithm to the above described submodular framework using the above mentioned claims by Fujishige & Zhang [FZ92]. IBFS is an augmenting path algorithm for the maximum flow problem. It identifies a shortest path from the source set N to the sink set P via growing shortest path trees simultaneously forwards from N and backwards from P .\nThe submodular IBFS algorithm provides us with a level-1 algorithm for DSFM. Each step of the algorithm involves determining the capacity of an arc in the auxiliary graph; as we explain in Section 5, each of these capacities can be computed using a single call to a level-0 subroutine Oi. By combining the level-1 IBFS algorithm with appropriate level-0 subroutines, we obtain an algorithm for DSFM whose running time can be upper bounded as follows. On a directed graph with n nodes and m arcs, IBFS runs in time O(n2m). In the DSFM setting, we have m = O( ∑\ni∈[r] |Ci|2). Every step involves determining an auxiliary capacity, which can be implemented using a single call to a level-0 subroutine Oi (see Section 5); the maximum time of such an oracle call is Θmax. Hence, the running time bound for submodular IBFS can be given as O(n2Θmax ∑ i∈[r] |Ci|2). If all Ci’s are small, O(1), then this gives O(n2rΘmax)."
    }, {
      "heading" : "3 Level-1 algorithms based on convex optimization",
      "text" : "In this section, we outline the level-1 algorithms for DSFM that are based on gradient descent. Recall the convex quadratic program (Min-Norm) from the Introduction. This program has a unique optimal solution s∗; the set S = {v ∈ V : s∗(v) < 0} is the unique smallest minimizer to (SFM). We will refer to this optimal solution s∗ throughout the section.\nIn the DSFM setting, one can write (Min-Norm) in multiple equivalent forms [JBS13]. For the first formu-\nlation, we let P := ∏ri=1 B(fi) ⊆ Rrn, and let A ∈ Rn×(rn) denote the following matrix:\nA := [InIn . . . In] ︸ ︷︷ ︸\nr times\n.\nNote that, for every y ∈ P , Ay = ∑ri=1 yi, where yi is the i-th block of y, and thus Ay ∈ B(f). The problem (Min-Norm) can be reformulated for DSFM as follow.\nmin\n{ 1\n2 ‖Ay‖22 : y ∈ P\n}\n. (Prox-DSFM)\nThe second formulation is the following. Let us define the subspace A := {a ∈ Rnr : Aa = 0}, and minimize its distance from P :\nmin { ‖a− y‖22 : a ∈ A, y ∈ P } . (Best-Approx)\nThe set of optimal solutions for both formulations (Prox-DSFM) and (Best-Approx) is the set E := {y ∈ P : Ay = s∗}, where s∗ is the optimum of (Min-Norm). We note that, even though the set of solutions to (Best-Approx) are pairs of points (a, y) ∈ A × P , the optimal solutions are uniquely determined by y ∈ P , since the corresponding a is the projection of y to A.\nLemma 3.1 ([JBS13], Lemma 2). The set E is non-empty and it coincides with the set of optimal solutions of (Prox-DSFM) and (Best-Approx).\nGradient methods. The gradient descent algorithms of [NJJ14, EN15] provide level-1 algorithms for DSFM. In the following, we provide a brief overview of these algorithms and we refer the reader to the respective papers for more details.\nThe alternating projections algorithm. Nishihara et al. minimize (Best-Approx) using alternating projections [NJJ14]. The algorithm starts with a point a0 ∈ A and it iteratively constructs a sequence{ (a(k), x(k)) }\nk≥0 by projecting onto A and P : x(k) = argminx∈P‖a(k) −x‖2, a(k+1) = argmina∈A‖a−x(k)‖2. Random coordinate descent algorithms. Ene and Nguyen minimize (Prox-DSFM) using random coordinate descent [EN15]. The RCDM algorithm adapts the random coordinate descent algorithm of Nesterov [Nes12] to (Prox-DSFM). In each iteration, the algorithm samples a block i ∈ [r] uniformly at random and it updates xi via a standard gradient descent step for smooth functions. ACDM, the accelerated version of the algorithm, presents a further enhancement using techniques from [FR15].\nRate of convergence. The algorithms mentioned above enjoy a linear convergence rate despite the fact that the objective functions of (Best-Approx) and (Prox-DSFM) are not strongly convex. Instead, these works show that there are certain parameters that one can associate with the objective functions such that the convergence is at the rate (1 − α)k, where α ∈ (0, 1) is a quantity that depends on the appropriate parameter. Let us now precisely define these parameters and state the convergence guarantees as a function of these parameters. Let A′ be the affine subspace A′ := {a ∈ Rnr : Aa = s∗}. Note that E = P ∩ A′. For y ∈ Rnr and a closed set K ⊆ Rnr, we let d(y,K) = min {‖y − z‖2 : z ∈ K} denote the distance between y and K. The relevant parameter for the Alternating Projections algorithm is defined as follows.\nDefinition 3.2 ([NJJ14]). For every y ∈ (P ∪ A′) \\ E , let\nκ(y) := d(y, E)\nmax {d(y,P), d(y,A′)} , and\nκ∗ := sup {κ(y) : y ∈ (P ∪ A′) \\ E} .\nThe relevant parameter for the random coordinate descent algorithms is the following.\nDefinition 3.3 ([EN15]). For every y ∈ P , let y∗ := argminp{‖p− y‖2 : Ap = s∗} be the optimal solution to (Prox-DSFM) that is closest to y. We say that the objective function 12‖Ay‖22 of (Prox-DSFM) is restricted ℓ-strongly convex if, for all y ∈ P , we have\n‖A(y − y∗)‖22 ≥ ℓ‖y − y∗‖22, and\nℓ∗ := sup\n{\nℓ : 1\n2 ‖Ay‖22 is restricted ℓ-strongly convex\n}\n.\nThe running time dependence of the algorithms on these parameters is given in the following theorems.\nTheorem 3.4 ([NJJ14]). Let (a(0), x(0) = argminx∈P‖a(0) − x‖2) be the initial solution and let (a∗, x∗) be an optimal solution to (Best-Approx). The alternating projection algorithm produces in\nk = Θ\n(\nκ2∗ ln (‖x(0) − x∗‖2 ǫ ))\niterations a pair of points a(k) ∈ A and x(k) ∈ P that is ǫ-optimal, i.e., ‖a(k) − x(k)‖22 ≤ ‖a∗ − x∗‖22 + ε. Theorem 3.5 ([EN15]). Let x(0) ∈ P be the initial solution and let x∗ be an optimal solution to (Prox-DSFM) that minimizes ‖x(0) − x∗‖2. The random coordinate descent algorithm produces in\nk = Θ\n( r\nℓ∗ ln (‖x(0) − x∗‖2 ǫ ))\niterations a solution x(k) that is ǫ-optimal in expectation, i.e., E [\n1 2‖Ax(k)‖22 ] ≤ 12‖Ax∗‖22 + ǫ.\nThe accelerated coordinate descent algorithm produces in\nk = Θ\n(\nr\n√ 1\nℓ∗ ln (‖x(0) − x∗‖2 ǫ ))\niterations (specifically, Θ ( ln (\n‖x(0)−x∗‖2 ǫ\n)) epochs with Θ ( r √\n1 ℓ∗\n)\niterations in each epoch) a solution x(k)\nthat is ǫ-optimal in expectation, i.e., E [\n1 2‖Ax(k)‖22 ] ≤ 12‖Ax∗‖22 + ǫ.\nNishihara et al. show that κ∗ ≤ nr, and a family of instances (in fact, minimum cut instances) is given for which κ∗ ≥ Ω(n √ r). Ene and Nguyen show that ℓ∗ ≥ r/κ2∗. In Theorem 4.2, we close the remaining gap\nand show that κ∗ = Θ(n √ r) and ℓ∗ = Θ(1/n2), and thus we obtain tight analyses for the running times of the above mentioned algorithms.\nBy combining the level-1 gradient descent algorithms with appropriate level-0 subroutines, we obtain algorithms for DSFM whose running times can be upper bounded as follows. Using our improved convergence guarantees, it follows that RCDM obtains in time O ( n2rΘavg ln ( ‖x(0)−x∗‖2 ǫ )) a solution that is ε-approximate in expectation. For ACDM, the improved time bound is O ( nrΘavg ln ( ‖x(0)−x∗‖2 ǫ )) . We can upper bound the diameter of the base polytope by O( √ nFmax) [JB11]. For integer-valued functions, a ε-approximate solution can be converted to an exact optimum if ε = O(1/n) [Bac11]."
    }, {
      "heading" : "4 Tight convergence bounds for the continuous algorithms",
      "text" : "In this section, we show that the combinatorial approach introduced in Section 2 can be applied to obtain better bounds on the parameters κ∗ and ℓ∗ defined in Section 3. Besides giving a stronger bound, our proof is considerably simpler than the algebraic one using Cheeger’s inequality in [NJJ14]. The key is the following lemma.\nLemma 4.1. Let y ∈ P and s∗ ∈ B(f). Then there exists a point x ∈ P such that Ax = s∗ and ‖x− y‖2 ≤√ n\n2 ‖Ay − s∗‖1.\nBefore proving this lemma, we show how it can be used to derive the bounds. Theorem 4.2. We have κ∗ ≤ n √ r/2 + 1 and ℓ∗ ≥ 4/n2.\nProof: We start with the bound on κ∗. In order to bound κ∗, we need to upper bound κ(y) for any y ∈ (P ∪ A′) \\ E . We distinguish between two cases: y ∈ P \\ E and y ∈ A′ \\ E . Case I: y ∈ P \\ E. The denominator in the definition of κ(y) is equal to d(y,A′) = ‖Ay − s∗‖2/ √ r. This follows since the closest point a = (a1, . . . , ar) to y in A′ is to set ai = yi + (s∗ − Ay)/r for each i ∈ [r]. Lemma 4.1 gives an x ∈ P such that Ax = s∗ and ‖x− y‖2 ≤ √ n\n2 ‖Ay− s∗‖1 ≤ n2 ‖Ay− s∗‖2. Since Ax = s∗, we have x ∈ E and thus the numerator of κ(y) is at most ‖x−y‖2. Thus κ(y) ≤ ‖x− y‖2/(‖Ay − s∗‖2/ √ r) ≤\nn √ r/2. Case II: y ∈ A′ \\E. This means that Ay = s∗. The denominator of κ(y) is equal to d(y,P). For each i ∈ [r], let qi ∈ B(fi) be the point that minimizes ‖yi − qi‖2. Let q = (q1, . . . , qr) ∈ P . Then d(y,P) = ‖y − q‖2. Lemma 4.1 with q in place of y gives a point x ∈ E such that ‖q − x‖2 ≤ √ n\n2 ‖Aq − s∗‖1. We have ‖Aq − s∗‖1 = ‖Aq − Ay‖1 ≤ ∑r i=1 ‖qi − yi‖1 = ‖q − y‖1 ≤ √ nr‖q − y‖2. Thus ‖q − x‖2 ≤ n √ r\n2 ‖q − y‖2. Since x ∈ E , we have d(y, E) ≤ ‖x− y‖2 ≤ ‖x− q‖2 + ‖q − y‖2 ≤ ( 1 + n √ r\n2\n) ‖q − y‖2 = ( 1 + n √ r\n2\n)\nd(y,P). Therefore κ(p) ≤ 1 + n √ r\n2 , as desired.\nLet us now prove the bound on ℓ∗. Let y ∈ P and let y∗ := argminp{‖p− y‖2 : Ap = s∗}. We need to verify that ‖A(y−y∗)‖22 ≥ 4n2 ‖y−y∗‖22. Again, we apply Lemma 4.1 to obtain a point x ∈ P such that Ax = s∗ and ‖x− y‖22 ≤ n4 ‖Ax−Ay‖21 ≤ n 2\n4 ‖Ax−Ay‖22. Since Ax = s∗, the definition of y∗ gives ‖y − y∗‖22 ≤ ‖x− y‖22. Using that Ax = Ay∗ = s∗, we have ‖Ax−Ay‖2 = ‖Ay −Ay∗‖2. The same calculation as in Case II above implies the required ‖y − y∗‖22 ≤ n 2\n4 ‖A(y − y∗)‖22. Proof of Lemma 4.1: We give an algorithm that transforms y to a vector x ∈ P as in the statement through a sequence of path augmentations in the auxiliary graph defined in Section 2. We initialize x = y and maintain x ∈ P (and thus Ax ∈ B(f)) throughout. We now define the set of source and sink nodes as N := {v ∈ V : (Ax)(v) < s∗(v)} and P := {v ∈ V : (Ax)(v) > s∗(v)}. Once N = P = ∅, we have Ax = s∗ and terminate. Note that since Ax, s∗ ∈ B(f), we have ∑v(Ax)(v) = ∑ v s ∗(v) = f(V ), and therefore N = ∅ is equivalent to P = ∅. The blocks of x are denoted as x = (x1, x2, . . . , xr), with xi ∈ B(fi).\nClaim 4.3. If N 6= ∅, then there exists a directed path of positive capacity in the auxiliary graph between the sets N and P .\nProof: We say that a set T is i-tight, if xi(T ) = fi(T ). It is a simple consequence of submodularity that the intersection and union of two i-tight sets are also i-tight sets. For every i ∈ [r] and every u ∈ V , we define Ti(u) as the unique minimal i-tight set containing u. It is easy to see that for an arc (u, v) ∈ Ei, c(u, v) > 0 if and only if v ∈ Ti(u). We note that if u /∈ Ci, then x(u) = fi({u}) = 0 and thus Ti(u) = {u}. Let S be the set of vertices reachable from N on a directed path of positive capacity in the auxiliary graph. For a contradiction, assume S ∩ P = ∅. By the definition of S, we must have Ti(u) ⊆ S for every u ∈ S and every i ∈ [r]. Since the union of i-tight sets is also i-tight, we see that S is i-tight for every i ∈ [r], and consequently, x(S) = f(S). On the other hand, since N ⊆ S, S ∩ P = ∅, and N 6= ∅, we have x(S) < s∗(S). Since s∗ ∈ B(f), we have x(S) < s∗(S) ≤ f(S), which is a contradiction. We conclude that S ∩ P 6= ∅. In every step of the algorithm, we take a shortest directed path Q of positive capacity from N to P , and update x along this path. That is, if (u, v) ∈ Q ∩ Ei, then we increase xi(u) by ε and decrease xi(v) by ε, where ε is the minimum capacity of an arc on Q. Note that this is the same as running the Edmonds-KarpDinitz algorithm in the submodular auxiliary graph. Using the analysis in [FZ92], one can show that this change maintains x ∈ P , and that the algorithm terminates in finite (in fact, strongly polynomial) time.\nIt remains to bound ‖x−y‖2. At every path update, the change in ℓ∞-norm of x is at most ε, and the change in ℓ1-norm is at most nε, since the length of the path is ≤ n. At the same time, ∑ v∈N (s ∗(v) − (Ax)(v)) decreases by ε. Thus, ‖x − y‖∞ ≤ ‖Ay − s∗‖1/2 and ‖x − y‖1 ≤ n‖Ay − s∗‖1/2. Using the inequality ‖p‖2 ≤ √ ‖p‖1‖p‖∞, we obtain ‖x− y‖2 ≤ √ n 2 ‖Ay − s∗‖1, completing the proof."
    }, {
      "heading" : "5 The level-0 algorithms",
      "text" : "In this section, we briefly discuss the level-0 algorithms and the interface between the level-1 and level-0 algorithms.\nTwo-level frameworks via quadratic minimization oracles. Recall from the Introduction the assumption on the subroutines Oi(w) that finds the minimum norm point in B(fi+w) for the input vector w ∈ Rn. The continuous methods in Section 3 directly use the subroutines Oi(w) for the alternating projection or coordinate descent steps. For the flow-based algorithms in Section 2, the main oracle query is to find the auxiliary graph capacity c(u, v) of an arc (u, v) ∈ Ei for some i ∈ [r]. This can be easily formulated as minimizing the function fi+w for an appropriate w with supp(w) ⊆ Ci; the details are given in Lemma 5.1. As explained at the beginning of Section 3, an optimal solution to (Min-Norm) immediately gives an optimal solution to (SFM) for the same submodular function. Hence, the auxiliary graph capacity queries can be implemented via the subroutines Oi(w). Let us also remark that, while the functions fi are formally defined on the entire ground set V , their effective support is Ci, and thus it suffices to solve the quadratic minimization problems on the ground set Ci.\nLemma 5.1. The capacity c(u, v) := min{fi(S) − xi(S) : S ⊆ Ci, u ∈ S, v /∈ S} can be computed as the minimum value of minS⊆Ci fi(S) + w(S) for an appropriately chosen vector w ∈ Rn, supp(w) ⊆ Ci. Proof: We define a weight vector w ∈ Rn as follows: w(u) = −(fi({u}) + 1); w(v) = −(fi(Ci) − fi(Ci \\ {v}) − 1); w(a) = −x(a) for all a ∈ Ci \\ {u, v}, and w(a) = 0 for all a /∈ Ci. Let A ⊆ Ci be a minimizer of minS⊆Ci fi(S) + w(S). It suffices to show that u ∈ A and v /∈ A. Note that fi({u}) = fi({u})− f(∅) is the maximum marginal value of u, i.e., maxS(fi(S ∪ {u}) − fi(S)). Moreover, fi(Ci) − fi(Ci \\ {v}) is the minimum marginal value of v. To show u ∈ A, let us assume for a contradiction that u /∈ A.\nfi(A ∪ {u}) + w(A ∪ {u}) = (fi(A) + w(A)) + (fi(A ∪ {u})− fi(A)) + w(u) = (fi(A) + w(A)) + (fi(A ∪ {u})− fi(A))− fi({u}) + 1 ≤ fi(A) + w(A) − 1.\nSimilarly, to show that v /∈ A, suppose for a contradiction that v ∈ A, and consider the set A \\ {v}. Since fi(Ci)− fi(Ci \\ {v}) ≤ fi(A)− fi(A \\ {v}), we have\nfi(A \\ {v}) + w(A \\ {v}) = (fi(A) + w(A)) − (fi(A)− fi(A \\ {v}))− w(v) = (fi(A) + w(A)) − (fi(A)− fi(A \\ {v})) + (fi(Ci)− fi(Ci \\ {v}))− 1 ≤ fi(A) + w(A) − 1.\nTherefore u ∈ A and v /∈ A, and hence A ∈ argmin{fi(S)− xi(S) : u ∈ S, v /∈ S}. Whereas discrete and continuous algorithms require the same type of oracles, there is an important difference between the two algorithms in terms of exactness for the oracle solutions. The discrete algorithms require exact values of the auxiliary graph capacities c(u, v), as they must maintain xi ∈ B(fi) throughout. Thus, the oracle must always return an optimal solution. The continuous algorithms are more robust, and return a solution with the required accuracy even if the oracle only returns an approximate solution. As discussed in Section 6, this difference leads to the continuous methods being applicable in settings where the combinatorial algorithms are prohibitively slow.\nLevel-0 algorithms. We now discuss specific algorithms for quadratic minimization over the base polytopes of the functions fi. Several functions that arise in applications are “simple”, meaning that there is a"
    }, {
      "heading" : "UCDM time (sec)",
      "text" : ""
    }, {
      "heading" : "ACDM time (sec)",
      "text" : "function-specific quadratic minimization subroutine that is very efficient. If a function-specific subroutine is not available, one can use a general-purpose submodular minimization algorithm. The works [ABKM12, FJMPZ13] use a brute force search as the subroutine for each each fi, whose running time is 2\n|Ci|EOi. However, this is applicable only for small Ci’s and is not suitable for our experiments where the maximum clique size is quite large. As a general-purpose algorithm, we used the Fujishige-Wolfe minimum norm point algorithm [FI11, Wol76]. This provides an ε-approximate solution in O(|Ci|F 2i,max/ε) iterations, with overall running time bound O((|Ci|4 + |Ci|2EOi)F 2i,max/ε). [CJK14]. The experimental running time of the Fujishige-Wolfe algorithm can be prohibitively large [JLB11]. As we discuss in Section 6, by warmstarting the algorithm and performing only a small number of iterations, we were able to use the algorithm in conjunction with the gradient descent level-1 algorithms."
    }, {
      "heading" : "6 Experiments",
      "text" : "We evaluate the algorithms on energy minimization problems that arise in image segmentation problems. We follow the standard approach and model the image segmentation task of segmenting an object from the background as finding a minimum cost 0/1 labeling of the pixels. The total labeling cost is the sum of labeling costs corresponding to cliques, where a clique is a set of pixels. We refer to the labeling cost"
    }, {
      "heading" : "ACDM time (sec)",
      "text" : ""
    }, {
      "heading" : "RCDM time (sec)",
      "text" : ""
    }, {
      "heading" : "ACDM time (sec)",
      "text" : ""
    }, {
      "heading" : "RCDM time (sec)",
      "text" : ""
    }, {
      "heading" : "RCDM time (sec)",
      "text" : ""
    }, {
      "heading" : "ACDM time (sec)",
      "text" : "functions as clique potentials.\nThe main focus of our experimental analysis is to compare the running times of the decomposable submodular minimization algorithms. Therefore we have chosen to use the simple hand-tuned potentials that were used in previous work [SAS16, ABKM12, SK10]: the edge-based costs defined by [ABKM12] and the count-based costs defined by [SK10]. Specifically, we used the following clique potentials in our experiments, all of which are submodular:\n• Unary potentials for each pixel. The unary potentials are derived from Gaussian Mixture Models of color features [RKB04]. • Pairwise potentials for each edge of the 8-neighbor grid graph. Each graph edge (i, j) between pixels i and j is assigned a weight that is a function of exp(−‖vi− vj‖2), where vi is the RGB color vector of pixel i. The clique potential for the edge is the cut function of the edge: the cost of a labeling is equal to zero if the two pixels have the same label and it is equal to the weight of the edge otherwise. • Square potentials for each 2 × 2 square of pixels. We view a 2 × 2 square as a graph on 4 nodes connected with 4 edges (two horizontal and two vertical edges). The cost of a labeling is the square root of the number of edges of the square that have different labels. This is the basic edge-based potential defined by [ABKM12]. • Region potentials for a set of regions of the image. We compute a set of regions of the image using the region growing algorithm suggested by [SK10]. For each region Ci, we define a count-based clique potential as in [SK10, SAS16]: for each set S ⊆ Ci of pixels, fi(S) = |S||Ci \\ S|. We used five image segmentation instances to evaluate the algorithms3. Table 1 provides the sizes of the resulting instances. The experiments were carried out on a single computer with a 3.3 GHz Intel Core i5 processor and 8 GB of memory. The reported times are averaged over 10 trials.\nNumber of iterations for the coordinate methods. We have run the coordinate descent algorithms for 1000r iterations, where r is the number of functions in the decomposition. Our choice is based on the empirical results of Jegelka et al. [JBS13] that showed that this number of iterations suffices to obtain good results.\nMinimum cut experiments. We evaluated the algorithms on instances containing only the unary poten-\n3The data is available at http://melodi.ee.washington.edu/~jegelka/cc/index.html and http://research.microsoft.com/en-us/um/cambridge/projects/visionimagevideoediting/segmentation/grabcut.htm\ntials and the pairwise potentials. Table 2 gives the running times in seconds.\nSmall cliques experiments. We evaluated the algorithms on instances containing the unary potentials, the pairwise potentials, and the square potentials. Table 3 gives the running times in seconds.\nLarge cliques experiments. We evaluated the algorithms on instances containing all of the potentials: the unary potentials, the pairwise potentials, the square potentials, and the region potentials. For the region potentials, we used a potential-specific level-0 algorithm that performs quadratic minimization over the base polytope in time O(|Ci| log(|Ci|) + |Ci|EOi). Additionally, due to the slow running time of IBFS, we used smaller regions: 50 regions with an average size between 45 and 50.\nLarge cliques experiments with Fujishige-Wolfe algorithm. We also ran a version of the large cliques experiments with the Fujishige-Wolfe algorithm as the level-0 algorithm for the region potentials. The Fujishige-Wolfe algorithm was significantly slower than the potential-specific quadratic minimization algorithm and in our experiments it was prohibitive to run the Fujishige-Wolfe algorithm to near-convergence. Since the IBFS algorithm requires almost exact quadratic minimization in order to compute exchange capacities, it was prohibitive to run the IBFS algorithm with the Fujishige-Wolfe algorithm. In contrast, the coordinate descent methods can potentially make progress even if the level-0 solution is far from being converged.\nIn order to empirically evaluate this hypothesis, we made a simple but crucial change to the Fujishige-Wolfe algorithm: we warm-started the algorithm with the current solution. Recall that the coordinate descent algorithms maintain a solution xi ∈ B(fi) for each function fi in the decomposition. We warm-started the Fujishige-Wolfe algorithm with the current solution xi, and we ran the algorithm for a small number of iterations. In our experiments, we ran the Fujishige-Wolfe algorithm for 10 iterations. These changes made the level-0 running time considerably smaller, which made it possible to run the level-1 coordinate descent algorithms for as many as 1000r iterations. At the same time, performing 10 iterations starting from the current solution seemed enough to provide an improvement over the current solution. Table 5 gives the running times.\nConclusions. The combinatorial level-1 algorithms such as IBFS are exact and can be significantly faster than the gradient descent algorithms provided that the sizes of the cliques are fairly small. For instances with larger cliques, the combinatorial algorithms are no longer suitable if the only choice for the level-0 algorithms are generic methods such as the Fujishige-Wolfe algorithm. The experimental results suggest that in such cases, the coordinate descent methods together with a suitably modified Fujishige-Wolfe algorithm provides an approach for obtaining an approximate solution."
    } ],
    "references" : [ {
      "title" : "Generic cuts: An efficient algorithm for optimal inference in higher order mrf-map",
      "author" : [ "Chetan Arora", "Subhashis Banerjee", "Prem Kalra", "SN Maheshwari" ],
      "venue" : "In European Conference on Computer Vision,",
      "citeRegEx" : "Arora et al\\.,? \\Q2012\\E",
      "shortCiteRegEx" : "Arora et al\\.",
      "year" : 2012
    }, {
      "title" : "Learning with submodular functions: A convex optimization perspective",
      "author" : [ "Francis Bach" ],
      "venue" : "ArXiv preprint arXiv:1111.6453,",
      "citeRegEx" : "Bach.,? \\Q2011\\E",
      "shortCiteRegEx" : "Bach.",
      "year" : 2011
    }, {
      "title" : "Provable submodular minimization using Wolfe’s algorithm",
      "author" : [ "Deeparnab Chakrabarty", "Prateek Jain", "Pravesh Kothari" ],
      "venue" : "In Advances in Neural Information Processing Systems,",
      "citeRegEx" : "Chakrabarty et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Chakrabarty et al\\.",
      "year" : 2014
    }, {
      "title" : "Submodular functions, matroids, and certain polyhedra",
      "author" : [ "Jack Edmonds" ],
      "venue" : "Combinatorial structures and their applications,",
      "citeRegEx" : "Edmonds.,? \\Q1970\\E",
      "shortCiteRegEx" : "Edmonds.",
      "year" : 1970
    }, {
      "title" : "Random coordinate descent methods for minimizing decomposable submodular functions",
      "author" : [ "A.R. Ene", "H.L. Nguyen" ],
      "venue" : "In Proceedings of the 32nd International Conference on Machine Learning (ICML),",
      "citeRegEx" : "Ene and Nguyen.,? \\Q2015\\E",
      "shortCiteRegEx" : "Ene and Nguyen.",
      "year" : 2015
    }, {
      "title" : "A push-relabel framework for submodular function minimization and applications to parametric optimization",
      "author" : [ "Lisa Fleischer", "Satoru Iwata" ],
      "venue" : "Discrete Applied Mathematics,",
      "citeRegEx" : "Fleischer and Iwata.,? \\Q2003\\E",
      "shortCiteRegEx" : "Fleischer and Iwata.",
      "year" : 2003
    }, {
      "title" : "A submodular function minimization algorithm based on the minimum-norm base",
      "author" : [ "Satoru Fujishige", "Shigueo Isotani" ],
      "venue" : "Pacific Journal of Optimization,",
      "citeRegEx" : "Fujishige and Isotani.,? \\Q2011\\E",
      "shortCiteRegEx" : "Fujishige and Isotani.",
      "year" : 2011
    }, {
      "title" : "Structured learning of sum-of-submodular higher order energy functions",
      "author" : [ "Alexander Fix", "Thorsten Joachims", "Sung Min Park", "Ramin Zabih" ],
      "venue" : "In Proceedings of the IEEE International Conference on Computer Vision,",
      "citeRegEx" : "Fix et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Fix et al\\.",
      "year" : 2013
    }, {
      "title" : "Accelerated, parallel, and proximal coordinate descent",
      "author" : [ "Olivier Fercoq", "Peter Richtárik" ],
      "venue" : "SIAM Journal on Optimization,",
      "citeRegEx" : "Fercoq and Richtárik.,? \\Q2015\\E",
      "shortCiteRegEx" : "Fercoq and Richtárik.",
      "year" : 2015
    }, {
      "title" : "Lexicographically optimal base of a polymatroid with respect to a weight vector",
      "author" : [ "Satoru Fujishige" ],
      "venue" : "Mathematics of Operations Research,",
      "citeRegEx" : "Fujishige.,? \\Q1980\\E",
      "shortCiteRegEx" : "Fujishige.",
      "year" : 1980
    }, {
      "title" : "A primal-dual algorithm for higher-order multilabel markov random fields",
      "author" : [ "Alexander Fix", "Chen Wang", "Ramin Zabih" ],
      "venue" : "In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition,",
      "citeRegEx" : "Fix et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Fix et al\\.",
      "year" : 2014
    }, {
      "title" : "New algorithms for the intersection problem of submodular systems",
      "author" : [ "Satoru Fujishige", "Xiaodong Zhang" ],
      "venue" : "Japan Journal of Industrial and Applied Mathematics,",
      "citeRegEx" : "Fujishige and Zhang.,? \\Q1992\\E",
      "shortCiteRegEx" : "Fujishige and Zhang.",
      "year" : 1992
    }, {
      "title" : "Maximum flows by incremental breadth-first search",
      "author" : [ "Andrew V Goldberg", "Sagi Hed", "Haim Kaplan", "Robert E Tarjan", "Renato F Werneck" ],
      "venue" : "In European Symposium on Algorithms,",
      "citeRegEx" : "Goldberg et al\\.,? \\Q2011\\E",
      "shortCiteRegEx" : "Goldberg et al\\.",
      "year" : 2011
    }, {
      "title" : "Faster and more dynamic maximum flow by incremental breadth-first search",
      "author" : [ "Andrew V Goldberg", "Sagi Hed", "Haim Kaplan", "Pushmeet Kohli", "Robert E Tarjan", "Renato F Werneck" ],
      "venue" : "Algorithms-ESA",
      "citeRegEx" : "Goldberg et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Goldberg et al\\.",
      "year" : 2015
    }, {
      "title" : "The ellipsoid method and its consequences in combinatorial optimization",
      "author" : [ "Martin Grötschel", "László Lovász", "Alexander Schrijver" ],
      "venue" : null,
      "citeRegEx" : "Grötschel et al\\.,? \\Q1981\\E",
      "shortCiteRegEx" : "Grötschel et al\\.",
      "year" : 1981
    }, {
      "title" : "A new approach to the maximum-flow problem",
      "author" : [ "Andrew V Goldberg", "Robert E Tarjan" ],
      "venue" : "Journal of the ACM (JACM),",
      "citeRegEx" : "Goldberg and Tarjan.,? \\Q1988\\E",
      "shortCiteRegEx" : "Goldberg and Tarjan.",
      "year" : 1988
    }, {
      "title" : "A combinatorial strongly polynomial algorithm for minimizing submodular functions",
      "author" : [ "Satoru Iwata", "Lisa Fleischer", "Satoru Fujishige" ],
      "venue" : "Journal of the ACM (JACM),",
      "citeRegEx" : "Iwata et al\\.,? \\Q2001\\E",
      "shortCiteRegEx" : "Iwata et al\\.",
      "year" : 2001
    }, {
      "title" : "A simple combinatorial algorithm for submodular function minimization",
      "author" : [ "Satoru Iwata", "James B Orlin" ],
      "venue" : "In ACM-SIAM Symposium on Discrete Algorithms (SODA),",
      "citeRegEx" : "Iwata and Orlin.,? \\Q2009\\E",
      "shortCiteRegEx" : "Iwata and Orlin.",
      "year" : 2009
    }, {
      "title" : "A faster scaling algorithm for minimizing submodular functions",
      "author" : [ "Satoru Iwata" ],
      "venue" : "SIAM Journal on Computing,",
      "citeRegEx" : "Iwata.,? \\Q2003\\E",
      "shortCiteRegEx" : "Iwata.",
      "year" : 2003
    }, {
      "title" : "Online submodular minimization for combinatorial structures",
      "author" : [ "Stefanie Jegelka", "Jeff A Bilmes" ],
      "venue" : "In Proceedings of the 28th International Conference on Machine Learning",
      "citeRegEx" : "Jegelka and Bilmes.,? \\Q2011\\E",
      "shortCiteRegEx" : "Jegelka and Bilmes.",
      "year" : 2011
    }, {
      "title" : "Reflection methods for user-friendly submodular optimization",
      "author" : [ "Stefanie Jegelka", "Francis Bach", "Suvrit Sra" ],
      "venue" : "In Advances in Neural Information Processing Systems (NIPS),",
      "citeRegEx" : "Jegelka et al\\.,? \\Q2013\\E",
      "shortCiteRegEx" : "Jegelka et al\\.",
      "year" : 2013
    }, {
      "title" : "On fast approximate submodular minimization",
      "author" : [ "Stefanie Jegelka", "Hui Lin", "Jeff A Bilmes" ],
      "venue" : "In Advances in Neural Information Processing Systems,",
      "citeRegEx" : "Jegelka et al\\.,? \\Q2011\\E",
      "shortCiteRegEx" : "Jegelka et al\\.",
      "year" : 2011
    }, {
      "title" : "Minimizing a sum of submodular functions",
      "author" : [ "Vladimir Kolmogorov" ],
      "venue" : "Discrete Applied Mathematics,",
      "citeRegEx" : "Kolmogorov.,? \\Q2012\\E",
      "shortCiteRegEx" : "Kolmogorov.",
      "year" : 2012
    }, {
      "title" : "A faster cutting plane method and its implications for combinatorial and convex optimization",
      "author" : [ "Yin Tat Lee", "Aaron Sidford", "Sam Chiu-wai Wong" ],
      "venue" : "In IEEE Foundations of Computer Science (FOCS),",
      "citeRegEx" : "Lee et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Lee et al\\.",
      "year" : 2015
    }, {
      "title" : "Efficiency of coordinate descent methods on huge-scale optimization problems",
      "author" : [ "Yurii Nesterov" ],
      "venue" : "SIAM Journal on Optimization,",
      "citeRegEx" : "Nesterov.,? \\Q2012\\E",
      "shortCiteRegEx" : "Nesterov.",
      "year" : 2012
    }, {
      "title" : "On the convergence rate of decomposable submodular function minimization",
      "author" : [ "Robert Nishihara", "Stefanie Jegelka", "Michael I Jordan" ],
      "venue" : "In Advances in Neural Information Processing Systems (NIPS),",
      "citeRegEx" : "Nishihara et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Nishihara et al\\.",
      "year" : 2014
    }, {
      "title" : "A faster strongly polynomial time algorithm for submodular function minimization",
      "author" : [ "James B Orlin" ],
      "venue" : "Mathematical Programming,",
      "citeRegEx" : "Orlin.,? \\Q2009\\E",
      "shortCiteRegEx" : "Orlin.",
      "year" : 2009
    }, {
      "title" : "Grabcut: Interactive foreground extraction using iterated graph cuts",
      "author" : [ "Carsten Rother", "Vladimir Kolmogorov", "Andrew Blake" ],
      "venue" : "ACM Transactions on Graphics (TOG),",
      "citeRegEx" : "Rother et al\\.,? \\Q2004\\E",
      "shortCiteRegEx" : "Rother et al\\.",
      "year" : 2004
    }, {
      "title" : "Min norm point algorithm for higher order mrf-map inference",
      "author" : [ "Ishant Shanu", "Chetan Arora", "Parag Singla" ],
      "venue" : "In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition,",
      "citeRegEx" : "Shanu et al\\.,? \\Q2016\\E",
      "shortCiteRegEx" : "Shanu et al\\.",
      "year" : 2016
    }, {
      "title" : "A combinatorial algorithm minimizing submodular functions in strongly polynomial time",
      "author" : [ "Alexander Schrijver" ],
      "venue" : "Journal of Combinatorial Theory, Series B,",
      "citeRegEx" : "Schrijver.,? \\Q2000\\E",
      "shortCiteRegEx" : "Schrijver.",
      "year" : 2000
    }, {
      "title" : "Combinatorial optimization - Polyhedra and Efficiency",
      "author" : [ "A. Schrijver" ],
      "venue" : null,
      "citeRegEx" : "Schrijver.,? \\Q2003\\E",
      "shortCiteRegEx" : "Schrijver.",
      "year" : 2003
    }, {
      "title" : "Efficient minimization of decomposable submodular functions",
      "author" : [ "Peter Stobbe", "Andreas Krause" ],
      "venue" : "In Advances in Neural Information Processing Systems (NIPS),",
      "citeRegEx" : "Stobbe and Krause.,? \\Q2010\\E",
      "shortCiteRegEx" : "Stobbe and Krause.",
      "year" : 2010
    }, {
      "title" : "Finding the nearest point in a polytope",
      "author" : [ "Philip Wolfe" ],
      "venue" : "Mathematical Programming,",
      "citeRegEx" : "Wolfe.,? \\Q1976\\E",
      "shortCiteRegEx" : "Wolfe.",
      "year" : 1976
    } ],
    "referenceMentions" : [ ],
    "year" : 2017,
    "abstractText" : "This paper investigates connections between discrete and continuous approaches for decomposable submodular function minimization. We provide improved running time estimates for the state-of-the-art continuous algorithms for the problem using combinatorial arguments. We also provide a systematic experimental comparison of the two types of methods, based on a clear distinction between level-0 and level-1 algorithms.",
    "creator" : "LaTeX with hyperref package"
  }
}